[
  {
    "sign_ta": "மேஷம்",
    "sign_en": "Aries",
    "date": "14-02-2026",
    "prediction_ta": "இன்று, பிப்ரவரி 14, 2026, வியாழன் கிழமையாக இருப்பதனால், குரு பகவானின் ஆதிக்கம் மேலோங்கி இருக்கும். மேஷ ராசி அன்பர்களே, இன்று நீங்கள் புத்துணர்ச்சியுடனும், உற்சாகத்துடனும் செயல்படுவீர்கள். உங்களின் தலைமைப் பண்பு வெளிப்படும். எந்த ஒரு செயலையும் முன்னின்று எடுத்து நடத்தும் திறன் உங்களுக்கு இயல்பாகவே உண்டு. இன்று, குரு பகவானின் அருளால், உங்கள் முடிவுகளில் மிகுந்த தெளிவும், தீர்க்க தரிசனமும் கூடும். புதிய முயற்சிகளில் ஈடுபடுவதற்கு இது மிகவும் உகந்த நாளாகும். உங்கள் மனதிற்கு மகிழ்ச்சி தரக்கூடிய பல நல்ல நிகழ்வுகள் இன்று அரங்கேறும். குடும்பத்தில் சுமுகமான சூழ்நிலை நிலவும். உறவினர்களுடனும் நண்பர்களுடனும் இனிமையான உரையாடல்கள் நடைபெறும். சமூகத்தில் உங்கள் மதிப்பு உயரும். நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயமானதாக அமையும். \n\nகல்வித் துறையில் இருப்பவர்களுக்கு இன்று புதிய அறிவைப் பெறும் வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் மிகுந்த ஆர்வத்துடன் ஈடுபடுவார்கள். புதிய பாடங்களைக் கற்றுக்கொள்வதற்கும், ஆராய்ச்சி செய்வதற்கும் இது நல்ல நேரம். மூத்தவர்களின் அறிவுரைகளை ஏற்றுக்கொள்வதன் மூலம் நீங்கள் சிறப்பான முன்னேற்றம் காணலாம். உங்கள் தன்னம்பிக்கை அதிகரிக்கும். இதுவரை தாமதமாகி வந்த சில காரியங்கள் இன்று குரு பலத்தால் அனுகூலமாக முடிவடையும். ஆன்மீக நாட்டம் கொண்டவர்கள் ஆலய தரிசனம் மேற்கொள்வதன் மூலம் மன அமைதியைப் பெறுவார்கள். தர்ம சிந்தனை மேலோங்கும். பிறருக்கு உதவி செய்யும் எண்ணம் உண்டாகும். இது உங்களுக்குள் ஒரு உள்ளார்ந்த திருப்தியை அளிக்கும். \n\nஉங்கள் தனிப்பட்ட வாழ்க்கையிலும், தொழில் வாழ்க்கையிலும் ஒரு சமநிலையை பேணுவீர்கள். கடின உழைப்புக்கு ஏற்ற பலனை இன்று நீங்கள் நிச்சயம் பெறுவீர்கள். எதிர்பார்த்திருந்த ஆதாயங்கள் சில வழிகளில் உங்களைத் தேடி வரும். பழைய நண்பர்களை சந்திக்கும் வாய்ப்பு ஏற்படும். அவர்களுடன் பழைய நினைவுகளைப் பகிர்ந்து கொண்டு மகிழ்வீர்கள். புதிய நண்பர்களும் உங்கள் வட்டாரத்தில் இணைவார்கள். உங்கள் பேச்சில் ஒருவித வசீகரம் இருக்கும். அதனைப் பயன்படுத்தி நீங்கள் பல காரியங்களை சுலபமாக சாதிப்பீர்கள். எந்த ஒரு பிரச்சனைக்கும் தீர்வு காண்பதில் உங்கள் புத்திசாலித்தனம் வெளிப்படும். இன்று நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலும் வெற்றியை நோக்கியே செல்லும். எந்த சவாலையும் எதிர்கொள்ளும் துணிவு உங்களுக்குக் கிடைக்கும். உங்களின் நேர்மறை எண்ணங்கள் இன்று பல நல்ல விஷயங்களை ஈர்க்கும். எதிர்பாராத நல்ல செய்திகள் உங்களுக்கு வந்து சேரலாம். சமூகப் பணிகளில் ஈடுபடுபவர்களுக்கு அங்கீகாரம் கிடைக்கும். கலைஞர்களுக்கு புதிய வாய்ப்புகள் உருவாகும். தங்கள் திறமைகளை வெளிப்படுத்த நல்லதொரு மேடை அமையும். நீண்ட நாட்களாக நீங்கள் எதிர்பார்த்துக் கொண்டிருந்த ஒரு விஷயம் இன்று நிறைவேறக்கூடும். இது உங்களுக்கு மிகுந்த மனநிறைவை அளிக்கும். எதிர்கால திட்டமிடல்களுக்கு இது ஒரு சிறந்த நாள். உங்கள் இலக்குகளை நோக்கி நம்பிக்கையுடன் அடியெடுத்து வைக்கலாம். குடும்ப உறுப்பினர்களின் ஆதரவு கிடைக்கும். பெற்றோர்களின் ஆசியைப் பெறுவீர்கள். குழந்தைகள் மூலம் மகிழ்ச்சியான செய்திகள் வந்து சேரும். ஒட்டுமொத்தத்தில், இன்று உங்களுக்கு ஒரு ஆக்கபூர்வமான, மகிழ்ச்சிகரமான மற்றும் வளமான நாளாக அமையும். குரு பகவானின் அருள் பரிபூரணமாக நிறைந்திருக்கும்.",
    "prediction_en": "Today, February 14, 2026, being a Thursday, the influence of Jupiter will be prominent. Aries natives, today you will act with renewed vigor and enthusiasm. Your leadership qualities will come to the forefront. You naturally possess the ability to take the lead in any task. Today, by the grace of Jupiter, your decisions will gain immense clarity and foresight. This is a very auspicious day to embark on new ventures. Many joyful events that bring happiness to your mind will unfold today. A harmonious atmosphere will prevail in the family. Pleasant conversations will take place with relatives and friends. Your social standing will increase. Your journeys will prove to be profitable. \n\nThose in the field of education will find opportunities to acquire new knowledge today. Students will engage in their studies with great interest. This is a good time for learning new subjects and conducting research. You can achieve significant progress by accepting the advice of elders. Your self-confidence will grow. Some tasks that have been delayed so far will conclude favorably today due to Jupiter's strength. Those with spiritual inclinations will attain peace of mind by visiting temples. Thoughts of charity will prevail. A desire to help others will arise, which will give you deep inner satisfaction. \n\nYou will maintain a balance between your personal and professional life. You will surely reap the rewards of your hard work today. Expected gains will come to you through various channels. You may have an opportunity to meet old friends and cherish old memories with them. New friends will also join your circle. There will be a certain charm in your speech, and you will use it to accomplish many tasks with ease. Your intelligence will be evident in finding solutions to any problem. Every action you undertake today will lead towards success. You will gain the courage to face any challenge. Your positive thoughts will attract many good things today. Unexpected good news may reach you. Those involved in social work will receive recognition. Artists will find new opportunities and a good platform to showcase their talents. Something you have been anticipating for a long time may come to fruition today, bringing you great satisfaction. This is an excellent day for future planning. You can confidently take steps towards your goals. Support from family members will be available. You will receive blessings from your parents. Happy news will come through children. Overall, today will be a productive, joyful, and prosperous day for you, filled with the complete blessings of Jupiter.",
    "career_ta": "தொழில் ரீதியாக இன்று உங்களுக்கு மிகவும் சாதகமான நாள். உங்கள் கடின உழைப்புக்குரிய அங்கீகாரம் கிடைக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கான வாய்ப்புகள் உருவாகும். சக ஊழியர்களுடன் இணைந்து பணியாற்றுவதில் ஒரு சுமுகமான சூழல் நிலவும். பதவி உயர்வுக்கான சாத்தியக்கூறுகள் உள்ளன. உங்கள் தலைமைப் பண்பு வெளிப்படும்.",
    "career_en": "Professionally, today is a very favorable day for you. Your hard work will receive due recognition. Opportunities to initiate new projects will emerge. A harmonious environment will prevail while working with colleagues. There are possibilities for promotion. Your leadership qualities will shine.",
    "finance_ta": "நிதிநிலை இன்று சிறப்பாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். சேமிப்புகளை அதிகரிப்பதற்கான வாய்ப்புகள் உருவாகும். முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். புத்திசாலித்தனமான நிதி முடிவுகள் ஆதாயத்தைத் தரும். வீண் விரயங்களைத் தவிர்த்து, எதிர்காலத்திற்காக சேமிப்பதில் கவனம் செலுத்துவீர்கள்.",
    "finance_en": "The financial situation will be excellent today. Expected monetary gains will materialize. Opportunities to increase savings will arise. You will contemplate investments. Wise financial decisions will yield profits. You will focus on avoiding unnecessary expenses and saving for the future.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் உற்சாகமும் புத்துணர்ச்சியும் நிறைந்திருக்கும். உடற்பயிற்சிகளிலும், தியானத்திலும் ஈடுபடுவது உங்களுக்கு கூடுதல் பலம் சேர்க்கும். மன அமைதி கிடைக்கும். புத்துணர்வுடன் காணப்படுவீர்கள்.",
    "health_en": "Physical health will be stable. Your mind will be filled with enthusiasm and freshness. Engaging in exercises and meditation will add extra strength. You will attain mental peace and feel rejuvenated.",
    "lucky_number": "9",
    "lucky_color_ta": "செந்தூரம்",
    "lucky_color_en": "Vermillion"
  },
  {
    "sign_ta": "ரிஷபம்",
    "sign_en": "Taurus",
    "date": "14-02-2026",
    "prediction_ta": "இன்று, பிப்ரவரி 14, 2026, வியாழன் கிழமையாக இருப்பதினால், குரு பகவானின் ஆதிக்கம் ரிஷப ராசி அன்பர்களுக்கு மிகுந்த அனுகூலமான பலன்களைத் தரும். இன்று உங்கள் வாழ்வில் ஒருவித ஸ்திரத்தன்மை மேலோங்கும். நீங்கள் மேற்கொள்ளும் காரியங்களில் பொறுமையுடனும், நிதானத்துடனும் செயல்பட்டு, வெற்றி பெறுவீர்கள். குடும்பத்தினருடனும், நண்பர்களுடனும் இனிமையான தருணங்களை செலவிடுவீர்கள். உங்களின் பொருளாதார நிலை மேலும் வலுப்பெறும் வகையில் சில நல்ல வாய்ப்புகள் இன்று உங்களைத் தேடி வரலாம். உங்கள் பேச்சில் ஒருவித நம்பிக்கை ஒளிர்ந்திடும். அதனைப் பயன்படுத்தி பல காரியங்களைச் சாதிப்பீர்கள். \n\nகல்வி மற்றும் அறிவுத் துறையில் இருப்பவர்களுக்கு இன்று நல்ல வளர்ச்சி கிடைக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்துவதற்கும் இது சிறந்த நாளாகும். பெரியோர்களின் அறிவுரைகள் உங்களுக்கு சரியான வழிகாட்டியாக அமையும். ஆன்மீகத்தில் நாட்டம் கொண்டவர்கள் தியானம் மற்றும் வழிபாடுகளில் ஈடுபடுவதன் மூலம் மன அமைதியையும், தெளிவையும் பெறுவார்கள். உங்கள் மனத்தெளிவு அதிகரிக்கும். கலை மற்றும் இலக்கியத் துறைகளில் இருப்பவர்களுக்கு இன்று புதிய உத்வேகம் கிடைக்கும். உங்கள் படைப்பாற்றல் வெளிப்படும். உங்களின் திறமைகள் அங்கீகரிக்கப்படும். சமூகத்தில் உங்கள் மதிப்பு உயரும். \n\nநீண்ட நாட்களாக நிலுவையில் இருந்த சில விஷயங்கள் இன்று குரு பகவானின் அருளால் நல்லபடியாக முடிவுக்கு வரும். இது உங்களுக்கு மிகுந்த மனநிறைவைத் தரும். புதிய முதலீடுகளைப் பற்றி சிந்திக்க இது ஒரு சிறந்த நாள். எதிர்காலத்திற்கான திட்டமிடல்களை மேற்கொள்வீர்கள். உங்கள் இலக்குகளை அடைவதற்கான தெளிவான பாதையை இன்று நீங்கள் காண்பீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் சுமுகமான உறவு நீடிக்கும். குடும்பத்தில் உள்ள பெரியோர்களின் ஆசீர்வாதத்தைப் பெறுவீர்கள். குழந்தைகள் மூலம் மகிழ்ச்சியான செய்திகள் வந்து சேரும். இன்று நீங்கள் எடுக்கும் எந்த ஒரு முடிவும் புத்திசாலித்தனமாக இருக்கும். \n\nஉங்களின் தன்னம்பிக்கை அதிகரிக்கும். எந்த ஒரு சவாலையும் எதிர்கொள்ளும் துணிவு உண்டாகும். சமூகத்தில் நற்பெயர் பெறுவீர்கள். பலரும் உங்கள் ஆலோசனைக்காக காத்திருப்பார்கள். உதவிகளை நாடி வருபவர்களுக்கு உங்களால் முடிந்ததைச் செய்வீர்கள். இது உங்களுக்குள் ஒரு உள்ளார்ந்த அமைதியை உருவாக்கும். உங்களின் நேர்மறை எண்ணங்கள் இன்று பல நல்ல விஷயங்களை ஈர்க்கும். எதிர்பாராத ஆதாயங்கள் மற்றும் மகிழ்ச்சியான செய்திகள் உங்களுக்கு வந்து சேரலாம். வியாபாரத் துறையில் இருப்பவர்களுக்கு புதிய ஒப்பந்தங்கள் வந்து சேர வாய்ப்புள்ளது. ஒட்டுமொத்தத்தில், இன்று உங்களுக்கு ஸ்திரத்தன்மையையும், செழிப்பையும், மன அமைதியையும் தரும் ஒரு சிறப்பான நாளாக அமையும். குரு பகவானின் அருள் உங்கள் அனைத்து முயற்சிகளிலும் துணையாக நிற்கும்.",
    "prediction_en": "Today, February 14, 2026, being a Thursday, the influence of Jupiter will bring very favorable results to Taurus natives. A sense of stability will prevail in your life today. You will act with patience and composure in your endeavors and achieve success. You will spend pleasant moments with family and friends. Some good opportunities that further strengthen your financial position may come your way today. A sense of confidence will shine in your speech, and you will achieve many things using it. \n\nThose in the fields of education and knowledge will experience good growth today. This is an excellent day for learning new things and enhancing your knowledge. The advice of elders will serve as proper guidance for you. Those with spiritual inclinations will attain peace of mind and clarity by engaging in meditation and worship. Your mental clarity will increase. Artists and those in literary fields will gain new inspiration today. Your creativity will emerge, and your talents will be recognized. Your standing in society will rise. \n\nSome long-pending matters will come to a good conclusion today, by the grace of Jupiter. This will bring you immense satisfaction. This is a great day to contemplate new investments. You will undertake future planning. You will see a clear path to achieve your goals today. Harmonious relationships with friends and relatives will continue. You will receive the blessings of elders in the family. Happy news will come through children. Any decision you make today will be a wise one. \n\nYour self-confidence will increase, and you will gain the courage to face any challenge. You will earn a good reputation in society, and many will await your advice. You will do what you can for those who seek help, which will create inner peace within you. Your positive thoughts will attract many good things today. Unexpected gains and happy news may reach you. Those in the business sector may have opportunities for new contracts. Overall, today will be a special day that brings you stability, prosperity, and peace of mind. Jupiter's grace will support all your endeavors.",
    "career_ta": "தொழில் ரீதியாக இன்று நல்ல முன்னேற்றம் உண்டாகும். உங்கள் வேலைகளில் புதிய உத்வேகத்துடன் செயல்படுவீர்கள். சகாக்களின் ஒத்துழைப்பு கிடைக்கும். புதிய பொறுப்புகளை ஏற்க நேரிடலாம், அதனை திறம்பட செய்து முடிப்பீர்கள். உங்களின் திறமைகள் அங்கீகரிக்கப்படும்.",
    "career_en": "Professionally, good progress will be made today. You will work with new enthusiasm in your tasks. Cooperation from colleagues will be available. You may have to take on new responsibilities, which you will complete efficiently. Your skills will be recognized.",
    "finance_ta": "நிதி ஆதாயம் உண்டு. எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைபடும். சேமிப்பை அதிகரிக்கும் வாய்ப்புகள் உருவாகும். சரியான முதலீடுகளை மேற்கொள்வதன் மூலம் எதிர்கால நிதிநிலையை மேம்படுத்துவீர்கள்.",
    "finance_en": "There will be financial gains. Expected monetary flow will be received. Old debts will be settled. Opportunities to increase savings will arise. You will improve your future financial situation by making sound investments.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மனதில் தெளிவு இருக்கும். சரியான உணவுப் பழக்கவழக்கங்களைப் பின்பற்றுவதன் மூலம் ஆரோக்கியத்தை மேம்படுத்தலாம். புத்துணர்ச்சியுடன் இருப்பீர்கள்.",
    "health_en": "Physical health will be excellent. There will be clarity of mind. You can improve your health by following proper dietary habits. You will feel rejuvenated.",
    "lucky_number": "6",
    "lucky_color_ta": "வெண்மை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "மிதுனம்",
    "sign_en": "Gemini",
    "date": "14-02-2026",
    "prediction_ta": "இன்று, பிப்ரவரி 14, 2026, வியாழன் கிழமையாக இருப்பதனால், குரு பகவானின் அருள் மிதுன ராசி அன்பர்களுக்குப் பல நற்பலன்களை வாரி வழங்கும். இன்று உங்கள் தகவல் தொடர்புத் திறன் மேலோங்கி இருக்கும். மற்றவர்களுடன் சுமுகமாகப் பழகி, உங்கள் கருத்துக்களைத் தெளிவாக எடுத்துரைப்பீர்கள். இது உங்கள் தனிப்பட்ட மற்றும் தொழில் வாழ்க்கையில் சிறப்பான முன்னேற்றத்திற்குக் காரணமாக அமையும். புதிய அறிவைப் பெறுவதற்கும், உங்கள் திறமைகளை மேம்படுத்துவதற்கும் இது மிகவும் உகந்த நாளாகும். புத்திசாலித்தனமான முடிவுகளை எடுப்பீர்கள். \n\nகுடும்பத்தில் அமைதியும், சந்தோஷமும் நிறைந்திருக்கும். உடன்பிறந்தவர்களுடனும், நெருங்கிய நண்பர்களுடனும் இனிமையான உரையாடல்கள் நிகழும். உங்கள் சுறுசுறுப்பு மற்றும் நகைச்சுவை உணர்வு அனைவரையும் கவரும். சமூகத்தில் உங்கள் மதிப்பு உயரும். நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயமானதாக அமையும். குறிப்பாக, கல்வி சார்ந்த பயணங்கள் மற்றும் அறிவு சார்ந்த விவாதங்கள் மிகவும் பயனுள்ளதாக இருக்கும். ஆன்மீக நாட்டமுள்ளவர்கள் வழிபாடுகளில் ஈடுபடுவதன் மூலம் மன அமைதியைப் பெறுவார்கள். மூத்தவர்களின் அறிவுரைகளை ஏற்றுக்கொள்வதன் மூலம் நீங்கள் சரியான திசையில் பயணிப்பீர்கள். \n\nஉங்கள் தனிப்பட்ட வாழ்க்கையிலும், தொழில் வாழ்க்கையிலும் ஒரு சமநிலையைப் பேணுவீர்கள். எதிர்பாராத சில நல்ல செய்திகள் உங்களுக்கு இன்று வந்து சேரலாம். இது உங்களுக்கு மிகுந்த மகிழ்ச்சியையும், ஊக்கத்தையும் அளிக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கும், அவற்றை வெற்றிகரமாகச் செயல்படுத்துவதற்கும் இது உகந்த நேரம். நீண்ட நாட்களாக நீங்கள் எதிர்பார்த்துக் கொண்டிருந்த ஒரு காரியம் இன்று நல்லபடியாக நிறைவேறக்கூடும். இது உங்களுக்குள் ஒரு உள்ளார்ந்த திருப்தியை உருவாக்கும். உங்கள் இலக்குகளை அடைவதற்கான தெளிவான பாதையை இன்று நீங்கள் காண்பீர்கள். \n\nசமூகப் பணிகளில் ஈடுபடுபவர்களுக்கு அங்கீகாரம் கிடைக்கும். கலைஞர்களுக்கு புதிய வாய்ப்புகள் உருவாகும். தங்கள் திறமைகளை வெளிப்படுத்த நல்லதொரு மேடை அமையும். உங்கள் நேர்மறை எண்ணங்கள் இன்று பல நல்ல விஷயங்களை ஈர்க்கும். எதிர்பாராத ஆதாயங்கள் மற்றும் மகிழ்ச்சியான செய்திகள் உங்களுக்கு வந்து சேரலாம். வியாபாரத் துறையில் இருப்பவர்களுக்கு புதிய ஒப்பந்தங்கள் வந்து சேர வாய்ப்புள்ளது. ஒட்டுமொத்தத்தில், இன்று உங்களுக்கு அறிவுப்பூர்வமான வளர்ச்சி, சமூகத்தில் நற்பெயர், நிதி செழிப்பு மற்றும் மன அமைதியைத் தரும் ஒரு சிறப்பான நாளாக அமையும். குரு பகவானின் அருள் உங்கள் அனைத்து முயற்சிகளிலும் துணையாக நிற்கும்.",
    "prediction_en": "Today, February 14, 2026, being a Thursday, the grace of Jupiter will bestow many good fortunes upon Gemini natives. Today, your communication skills will be elevated. You will interact harmoniously with others and articulate your thoughts clearly. This will contribute to significant progress in both your personal and professional life. This is a very auspicious day for acquiring new knowledge and enhancing your skills. You will make intelligent decisions. \n\nPeace and happiness will prevail in the family. Pleasant conversations will take place with siblings and close friends. Your agility and sense of humor will captivate everyone. Your social standing will increase. Your journeys will prove to be profitable, especially educational trips and intellectual discussions, which will be highly beneficial. Those with spiritual inclinations will attain peace of mind by engaging in worship. By accepting the advice of elders, you will travel in the right direction. \n\nYou will maintain a balance between your personal and professional life. Some unexpected good news may reach you today, bringing you great joy and encouragement. This is an opportune time to initiate new projects and implement them successfully. Something you have been anticipating for a long time may come to a good fruition today, creating an inner satisfaction within you. You will see a clear path to achieve your goals today. \n\nThose involved in social work will receive recognition. Artists will find new opportunities and a good platform to showcase their talents. Your positive thoughts will attract many good things today. Unexpected gains and happy news may reach you. Those in the business sector may have opportunities for new contracts. Overall, today will be an excellent day that brings you intellectual growth, good reputation in society, financial prosperity, and peace of mind. Jupiter's grace will support all your endeavors.",
    "career_ta": "தொழில் ரீதியாக இன்று புதிய வாய்ப்புகள் உருவாகும். உங்கள் தகவல் தொடர்புத் திறன் சிறப்பாக இருக்கும். சக ஊழியர்களுடன் சுமூகமான உறவு நீடிக்கும். புதிய திட்டங்களை செயல்படுத்த இது ஒரு நல்ல நாள். அங்கீகாரம் கிடைக்கும்.",
    "career_en": "Professionally, new opportunities will arise today. Your communication skills will be excellent. Harmonious relationships with colleagues will continue. This is a good day to implement new projects. Recognition will be received.",
    "finance_ta": "நிதிநிலை மேம்படும். புதிய வழிகளில் பணவரவு கிடைக்கும். புத்திசாலித்தனமான முதலீடுகளை மேற்கொள்வதன் மூலம் ஆதாயம் பெறுவீர்கள். தேவையில்லாத செலவுகளைக் குறைத்து சேமிப்பில் கவனம் செலுத்துவீர்கள்.",
    "finance_en": "The financial situation will improve. Monetary gains will come from new avenues. You will profit by making wise investments. You will reduce unnecessary expenses and focus on savings.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் உற்சாகம் நிறைந்திருக்கும். யோகா மற்றும் உடற்பயிற்சிகளை மேற்கொள்வது புத்துணர்ச்சியை அளிக்கும். மன அழுத்தம் குறையும்.",
    "health_en": "Physical health will be stable. Your mind will be full of enthusiasm. Engaging in yoga and exercises will provide rejuvenation. Mental stress will decrease.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "14-02-2026",
    "prediction_ta": "இன்று, பிப்ரவரி 14, 2026, வியாழன் கிழமையாக இருப்பதனால், குரு பகவானின் ஆதிக்கம் கடக ராசி அன்பர்களுக்குப் பலவித நற்பலன்களைத் தரும். இன்று உங்கள் மனதில் அமைதியும், சந்தோஷமும் நிறைந்திருக்கும். குடும்ப உறவுகளில் இணக்கம் மேலோங்கும். வீட்டில் சுப நிகழ்ச்சிகள் குறித்த பேச்சுவார்த்தைகள் நடக்கலாம். உங்கள் உணர்ச்சிகளைச் சரியாகப் புரிந்துகொண்டு, நல்ல முடிவுகளை எடுப்பீர்கள். உங்களின் உள்ளுணர்வு வலுவாக இருக்கும், அது உங்களுக்கு சரியான பாதையைக் காட்டும். தாயாரின் ஆரோக்கியம் மேம்படும். \n\nகல்வித் துறையில் இருப்பவர்களுக்கு இன்று நல்ல முன்னேற்றம் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் ஆர்வத்துடன் ஈடுபடுவார்கள். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், ஆராய்ச்சி செய்வதற்கும் இது ஒரு சிறந்த நாளாகும். மூத்தவர்களின் அறிவுரைகள் உங்களுக்கு சரியான வழிகாட்டியாக அமையும். ஆன்மீகத்தில் நாட்டம் கொண்டவர்கள் தியானம் மற்றும் வழிபாடுகளில் ஈடுபடுவதன் மூலம் மன அமைதியையும், தெளிவையும் பெறுவார்கள். உங்கள் மனத்தெளிவு அதிகரிக்கும். கலை மற்றும் இலக்கியத் துறைகளில் இருப்பவர்களுக்கு இன்று புதிய உத்வேகம் கிடைக்கும். உங்கள் படைப்பாற்றல் வெளிப்படும். உங்களின் திறமைகள் அங்கீகரிக்கப்படும். \n\nநீண்ட நாட்களாக நிலுவையில் இருந்த சில விஷயங்கள் இன்று குரு பகவானின் அருளால் நல்லபடியாக முடிவுக்கு வரும். இது உங்களுக்கு மிகுந்த மனநிறைவைத் தரும். புதிய முதலீடுகளைப் பற்றி சிந்திக்க இது ஒரு சிறந்த நாள். எதிர்காலத்திற்கான திட்டமிடல்களை மேற்கொள்வீர்கள். உங்கள் இலக்குகளை அடைவதற்கான தெளிவான பாதையை இன்று நீங்கள் காண்பீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் சுமுகமான உறவு நீடிக்கும். குடும்பத்தில் உள்ள பெரியோர்களின் ஆசீர்வாதத்தைப் பெறுவீர்கள். குழந்தைகள் மூலம் மகிழ்ச்சியான செய்திகள் வந்து சேரும். இன்று நீங்கள் எடுக்கும் எந்த ஒரு முடிவும் புத்திசாலித்தனமாக இருக்கும். \n\nஉங்களின் தன்னம்பிக்கை அதிகரிக்கும். எந்த ஒரு சவாலையும் எதிர்கொள்ளும் துணிவு உண்டாகும். சமூகத்தில் நற்பெயர் பெறுவீர்கள். பலரும் உங்கள் ஆலோசனைக்காக காத்திருப்பார்கள். உதவிகளை நாடி வருபவர்களுக்கு உங்களால் முடிந்ததைச் செய்வீர்கள். இது உங்களுக்குள் ஒரு உள்ளார்ந்த அமைதியை உருவாக்கும். உங்களின் நேர்மறை எண்ணங்கள் இன்று பல நல்ல விஷயங்களை ஈர்க்கும். எதிர்பாராத ஆதாயங்கள் மற்றும் மகிழ்ச்சியான செய்திகள் உங்களுக்கு வந்து சேரலாம். இன்று பயணம் செய்ய நேரிடலாம், இது உங்களுக்கு புதிய அனுபவங்களைத் தரும். ஒட்டுமொத்தத்தில், இன்று உங்களுக்கு ஸ்திரத்தன்மையையும், செழிப்பையும், மன அமைதியையும் தரும் ஒரு சிறப்பான நாளாக அமையும். குரு பகவானின் அருள் உங்கள் அனைத்து முயற்சிகளிலும் துணையாக நிற்கும்.",
    "prediction_en": "Today, February 14, 2026, being a Thursday, the influence of Jupiter will bring many good fortunes to Cancer natives. Today, your mind will be filled with peace and happiness. Harmony will prevail in family relationships. Discussions regarding auspicious events at home may take place. You will correctly understand your emotions and make good decisions. Your intuition will be strong, guiding you on the right path. Your mother's health will improve. \n\nThose in the field of education will achieve good progress today. Students will engage in their studies with interest. This is an excellent day for learning new things and conducting research. The advice of elders will serve as proper guidance for you. Those with spiritual inclinations will attain peace of mind and clarity by engaging in meditation and worship. Your mental clarity will increase. Artists and those in literary fields will gain new inspiration today. Your creativity will emerge, and your talents will be recognized. \n\nSome long-pending matters will come to a good conclusion today, by the grace of Jupiter. This will bring you immense satisfaction. This is a great day to contemplate new investments. You will undertake future planning. You will see a clear path to achieve your goals today. Harmonious relationships with friends and relatives will continue. You will receive the blessings of elders in the family. Happy news will come through children. Any decision you make today will be a wise one. \n\nYour self-confidence will increase, and you will gain the courage to face any challenge. You will earn a good reputation in society, and many will await your advice. You will do what you can for those who seek help, which will create inner peace within you. Your positive thoughts will attract many good things today. Unexpected gains and happy news may reach you. You may have to travel today, which will bring you new experiences. Overall, today will be a special day that brings you stability, prosperity, and peace of mind. Jupiter's grace will support all your endeavors.",
    "career_ta": "தொழில் ரீதியாக இன்று சிறப்பான வளர்ச்சி உண்டாகும். புதிய வாய்ப்புகள் உங்களைத் தேடி வரும். சக ஊழியர்களின் ஒத்துழைப்பு கிடைக்கும். உங்களின் நேர்மையான உழைப்புக்கு உரிய அங்கீகாரம் கிடைக்கும். பதவி உயர்வுக்கு வாய்ப்பு உள்ளது.",
    "career_en": "Professionally, significant growth will occur today. New opportunities will seek you out. Cooperation from colleagues will be available. Your honest hard work will receive due recognition. There is a possibility of promotion.",
    "finance_ta": "நிதிநிலை மிகவும் சிறப்பாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் தீரும். புதிய முதலீடுகளை மேற்கொள்ள இது ஒரு சிறந்த நாள். நீண்டகால நிதி திட்டமிடல்கள் பலனளிக்கும்.",
    "finance_en": "The financial situation will be excellent. Expected monetary gains will be received. Old debts will be cleared. This is an excellent day for making new investments. Long-term financial planning will be fruitful.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் உற்சாகமும் புத்துணர்ச்சியும் நிறைந்திருக்கும். வீட்டிலிருந்து செயல்படுவது மன அமைதியைத் தரும். யோகா, தியானம் மேற்கொள்வது நன்மை பயக்கும்.",
    "health_en": "Physical health will be stable. Your mind will be filled with enthusiasm and freshness. Working from home will bring mental peace. Practicing yoga and meditation will be beneficial.",
    "lucky_number": "2",
    "lucky_color_ta": "வெள்ளை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "சிம்மம்",
    "sign_en": "Leo",
    "date": "14-02-2026",
    "prediction_ta": "இன்று, பிப்ரவரி 14, 2026, வியாழன் கிழமையாக இருப்பதனால், குரு பகவானின் ஆதிக்கம் சிம்ம ராசி அன்பர்களுக்குப் பல நல்ல வாய்ப்புகளை உருவாக்கும். இன்று உங்கள் தலைமைப் பண்பு வெளிப்படும். நீங்கள் எந்த ஒரு செயலையும் முன்னின்று எடுத்து நடத்தும் துணிவைப் பெறுவீர்கள். உங்களின் தன்னம்பிக்கை அதிகரிக்கும். குரு பகவானின் அருளால், உங்கள் முடிவுகளில் மிகுந்த தெளிவும், தீர்க்க தரிசனமும் கூடும். புதிய முயற்சிகளில் ஈடுபடுவதற்கு இது மிகவும் உகந்த நாளாகும். உங்கள் மனதிற்கு மகிழ்ச்சி தரக்கூடிய பல நல்ல நிகழ்வுகள் இன்று அரங்கேறும். \n\nகுடும்பத்தில் சுமுகமான சூழ்நிலை நிலவும். உறவினர்களுடனும் நண்பர்களுடனும் இனிமையான உரையாடல்கள் நடைபெறும். சமூகத்தில் உங்கள் மதிப்பு உயரும். நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயமானதாக அமையும். குறிப்பாக, உங்கள் தொழில் வளர்ச்சிக்கு உதவும் பயணங்கள் இன்று வெற்றியைத் தரும். கல்வித் துறையில் இருப்பவர்களுக்கு இன்று புதிய அறிவைப் பெறும் வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் மிகுந்த ஆர்வத்துடன் ஈடுபடுவார்கள். புதிய பாடங்களைக் கற்றுக்கொள்வதற்கும், ஆராய்ச்சி செய்வதற்கும் இது நல்ல நேரம். மூத்தவர்களின் அறிவுரைகளை ஏற்றுக்கொள்வதன் மூலம் நீங்கள் சிறப்பான முன்னேற்றம் காணலாம். \n\nஇதுவரை தாமதமாகி வந்த சில காரியங்கள் இன்று குரு பலத்தால் அனுகூலமாக முடிவடையும். ஆன்மீக நாட்டம் கொண்டவர்கள் ஆலய தரிசனம் மேற்கொள்வதன் மூலம் மன அமைதியைப் பெறுவார்கள். தர்ம சிந்தனை மேலோங்கும். பிறருக்கு உதவி செய்யும் எண்ணம் உண்டாகும். இது உங்களுக்குள் ஒரு உள்ளார்ந்த திருப்தியை அளிக்கும். உங்கள் தனிப்பட்ட வாழ்க்கையிலும், தொழில் வாழ்க்கையிலும் ஒரு சமநிலையை பேணுவீர்கள். கடின உழைப்புக்கு ஏற்ற பலனை இன்று நீங்கள் நிச்சயம் பெறுவீர்கள். எதிர்பார்த்திருந்த ஆதாயங்கள் சில வழிகளில் உங்களைத் தேடி வரும். \n\nபழைய நண்பர்களை சந்திக்கும் வாய்ப்பு ஏற்படும். அவர்களுடன் பழைய நினைவுகளைப் பகிர்ந்து கொண்டு மகிழ்வீர்கள். புதிய நண்பர்களும் உங்கள் வட்டாரத்தில் இணைவார்கள். உங்கள் பேச்சில் ஒருவித வசீகரம் இருக்கும். அதனைப் பயன்படுத்தி நீங்கள் பல காரியங்களை சுலபமாக சாதிப்பீர்கள். எந்த ஒரு பிரச்சனைக்கும் தீர்வு காண்பதில் உங்கள் புத்திசாலித்தனம் வெளிப்படும். இன்று நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலும் வெற்றியை நோக்கியே செல்லும். எந்த சவாலையும் எதிர்கொள்ளும் துணிவு உங்களுக்குக் கிடைக்கும். உங்களின் நேர்மறை எண்ணங்கள் இன்று பல நல்ல விஷயங்களை ஈர்க்கும். எதிர்பாராத நல்ல செய்திகள் உங்களுக்கு வந்து சேரலாம். சமூகப் பணிகளில் ஈடுபடுபவர்களுக்கு அங்கீகாரம் கிடைக்கும். கலைஞர்களுக்கு புதிய வாய்ப்புகள் உருவாகும். தங்கள் திறமைகளை வெளிப்படுத்த நல்லதொரு மேடை அமையும். நீண்ட நாட்களாக நீங்கள் எதிர்பார்த்துக் கொண்டிருந்த ஒரு விஷயம் இன்று நிறைவேறக்கூடும். இது உங்களுக்கு மிகுந்த மனநிறைவை அளிக்கும். எதிர்கால திட்டமிடல்களுக்கு இது ஒரு சிறந்த நாள். உங்கள் இலக்குகளை நோக்கி நம்பிக்கையுடன் அடியெடுத்து வைக்கலாம். குடும்ப உறுப்பினர்களின் ஆதரவு கிடைக்கும். பெற்றோர்களின் ஆசியைப் பெறுவீர்கள். குழந்தைகள் மூலம் மகிழ்ச்சியான செய்திகள் வந்து சேரும். ஒட்டுமொத்தத்தில், இன்று உங்களுக்கு ஒரு ஆக்கபூர்வமான, மகிழ்ச்சியான மற்றும் வளமான நாளாக அமையும். குரு பகவானின் அருள் பரிபூரணமாக நிறைந்திருக்கும்.",
    "prediction_en": "Today, February 14, 2026, being a Thursday, the influence of Jupiter will create many good opportunities for Leo natives. Today, your leadership qualities will shine. You will gain the courage to take the lead in any task. Your self-confidence will increase. By the grace of Jupiter, your decisions will gain immense clarity and foresight. This is a very auspicious day to embark on new ventures. Many joyful events that bring happiness to your mind will unfold today. \n\nA harmonious atmosphere will prevail in the family. Pleasant conversations will take place with relatives and friends. Your social standing will increase. Your journeys will prove to be profitable. Particularly, journeys that aid your professional growth will bring success today. Those in the field of education will find opportunities to acquire new knowledge today. Students will engage in their studies with great interest. This is a good time for learning new subjects and conducting research. You can achieve significant progress by accepting the advice of elders. \n\nSome tasks that have been delayed so far will conclude favorably today due to Jupiter's strength. Those with spiritual inclinations will attain peace of mind by visiting temples. Thoughts of charity will prevail. A desire to help others will arise, which will give you deep inner satisfaction. You will maintain a balance between your personal and professional life. You will surely reap the rewards of your hard work today. Expected gains will come to you through various channels. \n\nYou may have an opportunity to meet old friends and cherish old memories with them. New friends will also join your circle. There will be a certain charm in your speech, and you will use it to accomplish many tasks with ease. Your intelligence will be evident in finding solutions to any problem. Every action you undertake today will lead towards success. You will gain the courage to face any challenge. Your positive thoughts will attract many good things today. Unexpected good news may reach you. Those involved in social work will receive recognition. Artists will find new opportunities and a good platform to showcase their talents. Something you have been anticipating for a long time may come to fruition today, bringing you great satisfaction. This is an excellent day for future planning. You can confidently take steps towards your goals. Support from family members will be available. You will receive blessings from your parents. Happy news will come through children. Overall, today will be a productive, joyful, and prosperous day for you, filled with the complete blessings of Jupiter.",
    "career_ta": "தொழில் ரீதியாக இன்று சிறப்பான வளர்ச்சி உண்டு. புதிய பொறுப்புகள் உங்களைத் தேடி வரும். உங்கள் தலைமைப் பண்பு வெளிப்பட்டு, அங்கீகாரம் கிடைக்கும். சவாலான பணிகளைச் சிறப்பாக செய்து முடிப்பீர்கள். புதிய திட்டங்கள் வெற்றியடையும்.",
    "career_en": "Professionally, there will be excellent growth today. New responsibilities will come your way. Your leadership qualities will shine, and you will gain recognition. You will successfully complete challenging tasks. New projects will succeed.",
    "finance_ta": "நிதிநிலை இன்று வலிமையாக இருக்கும். எதிர்பார்த்ததை விட அதிக பணவரவு கிடைக்கும். புத்திசாலித்தனமான முதலீடுகள் லாபம் தரும். எதிர்காலத்திற்கான சேமிப்பை அதிகரிப்பீர்கள். வீண் செலவுகளைத் தவிர்ப்பீர்கள்.",
    "finance_en": "The financial situation will be strong today. You will receive more monetary gains than expected. Wise investments will yield profits. You will increase savings for the future and avoid unnecessary expenses.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மனதில் உற்சாகமும் புத்துணர்ச்சியும் நிறைந்திருக்கும். உடற்பயிற்சிகளிலும், யோகா பயிற்சிகளிலும் ஈடுபடுவது மன அமைதியைத் தரும். நேர்மறை எண்ணங்கள் வலுப்பெறும்.",
    "health_en": "Physical health will be excellent. Your mind will be filled with enthusiasm and freshness. Engaging in exercises and yoga practices will bring mental peace. Positive thoughts will be strengthened.",
    "lucky_number": "1",
    "lucky_color_ta": "பொன் நிறம்",
    "lucky_color_en": "Golden"
  },
  {
    "sign_ta": "கன்னி",
    "sign_en": "Virgo",
    "date": "14-02-2026",
    "prediction_ta": "இன்று, பிப்ரவரி 14, 2026, வியாழன் கிழமையாக இருப்பதனால், குரு பகவானின் ஆதிக்கம் கன்னி ராசி அன்பர்களுக்குப் பல நற்பலன்களை வாரி வழங்கும். இன்று உங்கள் பகுப்பாய்வுத் திறன் மேலோங்கி இருக்கும். எந்த ஒரு செயலையும் திட்டமிட்டு, சிறப்பாகச் செயல்படுத்துவீர்கள். இது உங்கள் தனிப்பட்ட மற்றும் தொழில் வாழ்க்கையில் சிறப்பான முன்னேற்றத்திற்குக் காரணமாக அமையும். புதிய அறிவைப் பெறுவதற்கும், உங்கள் திறமைகளை மேம்படுத்துவதற்கும் இது மிகவும் உகந்த நாளாகும். புத்திசாலித்தனமான முடிவுகளை எடுப்பீர்கள். \n\nகுடும்பத்தில் அமைதியும், சந்தோஷமும் நிறைந்திருக்கும். உடன்பிறந்தவர்களுடனும், நெருங்கிய நண்பர்களுடனும் இனிமையான உரையாடல்கள் நிகழும். உங்கள் சுறுசுறுப்பு மற்றும் ஒழுங்குமுறை உணர்வு அனைவரையும் கவரும். சமூகத்தில் உங்கள் மதிப்பு உயரும். நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயமானதாக அமையும். குறிப்பாக, கல்வி சார்ந்த பயணங்கள் மற்றும் அறிவு சார்ந்த விவாதங்கள் மிகவும் பயனுள்ளதாக இருக்கும். ஆன்மீக நாட்டமுள்ளவர்கள் வழிபாடுகளில் ஈடுபடுவதன் மூலம் மன அமைதியைப் பெறுவார்கள். மூத்தவர்களின் அறிவுரைகளை ஏற்றுக்கொள்வதன் மூலம் நீங்கள் சரியான திசையில் பயணிப்பீர்கள். \n\nஉங்கள் தனிப்பட்ட வாழ்க்கையிலும், தொழில் வாழ்க்கையிலும் ஒரு சமநிலையைப் பேணுவீர்கள். எதிர்பாராத சில நல்ல செய்திகள் உங்களுக்கு இன்று வந்து சேரலாம். இது உங்களுக்கு மிகுந்த மகிழ்ச்சியையும், ஊக்கத்தையும் அளிக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கும், அவற்றை வெற்றிகரமாகச் செயல்படுத்துவதற்கும் இது உகந்த நேரம். நீண்ட நாட்களாக நீங்கள் எதிர்பார்த்துக் கொண்டிருந்த ஒரு காரியம் இன்று நல்லபடியாக நிறைவேறக்கூடும். இது உங்களுக்குள் ஒரு உள்ளார்ந்த திருப்தியை உருவாக்கும். உங்கள் இலக்குகளை அடைவதற்கான தெளிவான பாதையை இன்று நீங்கள் காண்பீர்கள். \n\nசமூகப் பணிகளில் ஈடுபடுபவர்களுக்கு அங்கீகாரம் கிடைக்கும். கலைஞர்களுக்கு புதிய வாய்ப்புகள் உருவாகும். தங்கள் திறமைகளை வெளிப்படுத்த நல்லதொரு மேடை அமையும். உங்கள் நேர்மறை எண்ணங்கள் இன்று பல நல்ல விஷயங்களை ஈர்க்கும். எதிர்பாராத ஆதாயங்கள் மற்றும் மகிழ்ச்சியான செய்திகள் உங்களுக்கு வந்து சேரலாம். வியாபாரத் துறையில் இருப்பவர்களுக்கு புதிய ஒப்பந்தங்கள் வந்து சேர வாய்ப்புள்ளது. இன்று உங்கள் சேவையில் ஆர்வம் கூடும். பிறருக்கு உதவி செய்வதன் மூலம் மன அமைதி பெறுவீர்கள். ஒட்டுமொத்தத்தில், இன்று உங்களுக்கு அறிவுப்பூர்வமான வளர்ச்சி, சமூகத்தில் நற்பெயர், நிதி செழிப்பு மற்றும் மன அமைதியைத் தரும் ஒரு சிறப்பான நாளாக அமையும். குரு பகவானின் அருள் உங்கள் அனைத்து முயற்சிகளிலும் துணையாக நிற்கும்.",
    "prediction_en": "Today, February 14, 2026, being a Thursday, the grace of Jupiter will bestow many good fortunes upon Virgo natives. Today, your analytical skills will be elevated. You will plan and execute any task efficiently, which will contribute to significant progress in both your personal and professional life. This is a very auspicious day for acquiring new knowledge and enhancing your skills. You will make intelligent decisions. \n\nPeace and happiness will prevail in the family. Pleasant conversations will take place with siblings and close friends. Your diligence and sense of order will captivate everyone. Your social standing will increase. Your journeys will prove to be profitable, especially educational trips and intellectual discussions, which will be highly beneficial. Those with spiritual inclinations will attain peace of mind by engaging in worship. By accepting the advice of elders, you will travel in the right direction. \n\nYou will maintain a balance between your personal and professional life. Some unexpected good news may reach you today, bringing you great joy and encouragement. This is an opportune time to initiate new projects and implement them successfully. Something you have been anticipating for a long time may come to a good fruition today, creating an inner satisfaction within you. You will see a clear path to achieve your goals today. \n\nThose involved in social work will receive recognition. Artists will find new opportunities and a good platform to showcase their talents. Your positive thoughts will attract many good things today. Unexpected gains and happy news may reach you. Those in the business sector may have opportunities for new contracts. Today, your interest in service will increase. You will gain peace of mind by helping others. Overall, today will be an excellent day that brings you intellectual growth, good reputation in society, financial prosperity, and peace of mind. Jupiter's grace will support all your endeavors.",
    "career_ta": "தொழில் ரீதியாக இன்று சிறப்பான வளர்ச்சி உண்டு. உங்கள் உழைப்புக்குரிய அங்கீகாரம் கிடைக்கும். புதிய பொறுப்புகளை ஏற்க நேரிடலாம், அதனை திறம்பட செய்து முடிப்பீர்கள். உங்கள் திட்டமிடும் திறன் வெற்றியைத் தரும்.",
    "career_en": "Professionally, there will be excellent growth today. Your hard work will receive due recognition. You may have to take on new responsibilities, which you will complete efficiently. Your planning skills will bring success.",
    "finance_ta": "நிதிநிலை மேம்படும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய முதலீடுகள் லாபம் தரும். புதிய சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். புத்திசாலித்தனமான நிதி முடிவுகள் ஆதாயத்தைத் தரும்.",
    "finance_en": "The financial situation will improve. Expected monetary gains will be received. Old investments will yield profits. You will focus on new savings schemes. Wise financial decisions will bring gains.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் தெளிவும், அமைதியும் நிறைந்திருக்கும். சரியான உணவுப் பழக்கவழக்கங்களைப் பின்பற்றுவதன் மூலம் ஆரோக்கியத்தை மேம்படுத்தலாம். புத்துணர்ச்சியுடன் காணப்படுவீர்கள்.",
    "health_en": "Physical health will be stable. Your mind will be filled with clarity and peace. You can improve your health by following proper dietary habits. You will feel rejuvenated.",
    "lucky_number": "5",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "14-02-2026",
    "prediction_ta": "இன்று, பிப்ரவரி 14, 2026, வியாழன் கிழமையாக இருப்பதனால், குரு பகவானின் ஆதிக்கம் துலாம் ராசி அன்பர்களுக்குப் பல நற்பலன்களைத் தரும். இன்று உங்கள் வாழ்வில் ஒருவித சமநிலையும், இணக்கமும் மேலோங்கும். நீங்கள் மேற்கொள்ளும் காரியங்களில் பொறுமையுடனும், நிதானத்துடனும் செயல்பட்டு, வெற்றி பெறுவீர்கள். குடும்பத்தினருடனும், நண்பர்களுடனும் இனிமையான தருணங்களை செலவிடுவீர்கள். உங்களின் பொருளாதார நிலை மேலும் வலுப்பெறும் வகையில் சில நல்ல வாய்ப்புகள் இன்று உங்களைத் தேடி வரலாம். உங்கள் பேச்சில் ஒருவித நம்பிக்கை ஒளிர்ந்திடும். அதனைப் பயன்படுத்தி பல காரியங்களைச் சாதிப்பீர்கள். \n\nகல்வி மற்றும் அறிவுத் துறையில் இருப்பவர்களுக்கு இன்று நல்ல வளர்ச்சி கிடைக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்துவதற்கும் இது சிறந்த நாளாகும். பெரியோர்களின் அறிவுரைகள் உங்களுக்கு சரியான வழிகாட்டியாக அமையும். ஆன்மீகத்தில் நாட்டம் கொண்டவர்கள் தியானம் மற்றும் வழிபாடுகளில் ஈடுபடுவதன் மூலம் மன அமைதியையும், தெளிவையும் பெறுவார்கள். உங்கள் மனத்தெளிவு அதிகரிக்கும். கலை மற்றும் இலக்கியத் துறைகளில் இருப்பவர்களுக்கு இன்று புதிய உத்வேகம் கிடைக்கும். உங்கள் படைப்பாற்றல் வெளிப்படும். உங்களின் திறமைகள் அங்கீகரிக்கப்படும். \n\nநீண்ட நாட்களாக நிலுவையில் இருந்த சில விஷயங்கள் இன்று குரு பகவானின் அருளால் நல்லபடியாக முடிவுக்கு வரும். இது உங்களுக்கு மிகுந்த மனநிறைவைத் தரும். புதிய முதலீடுகளைப் பற்றி சிந்திக்க இது ஒரு சிறந்த நாள். எதிர்காலத்திற்கான திட்டமிடல்களை மேற்கொள்வீர்கள். உங்கள் இலக்குகளை அடைவதற்கான தெளிவான பாதையை இன்று நீங்கள் காண்பீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் சுமுகமான உறவு நீடிக்கும். குடும்பத்தில் உள்ள பெரியோர்களின் ஆசீர்வாதத்தைப் பெறுவீர்கள். குழந்தைகள் மூலம் மகிழ்ச்சியான செய்திகள் வந்து சேரும். இன்று நீங்கள் எடுக்கும் எந்த ஒரு முடிவும் புத்திசாலித்தனமாக இருக்கும். \n\nஉங்களின் தன்னம்பிக்கை அதிகரிக்கும். எந்த ஒரு சவாலையும் எதிர்கொள்ளும் துணிவு உண்டாகும். சமூகத்தில் நற்பெயர் பெறுவீர்கள். பலரும் உங்கள் ஆலோசனைக்காக காத்திருப்பார்கள். உதவிகளை நாடி வருபவர்களுக்கு உங்களால் முடிந்ததைச் செய்வீர்கள். இது உங்களுக்குள் ஒரு உள்ளார்ந்த அமைதியை உருவாக்கும். உங்களின் நேர்மறை எண்ணங்கள் இன்று பல நல்ல விஷயங்களை ஈர்க்கும். எதிர்பாராத ஆதாயங்கள் மற்றும் மகிழ்ச்சியான செய்திகள் உங்களுக்கு வந்து சேரலாம். வியாபாரத் துறையில் இருப்பவர்களுக்கு புதிய ஒப்பந்தங்கள் வந்து சேர வாய்ப்புள்ளது. ஒட்டுமொத்தத்தில், இன்று உங்களுக்கு ஸ்திரத்தன்மையையும், செழிப்பையும், மன அமைதியையும் தரும் ஒரு சிறப்பான நாளாக அமையும். குரு பகவானின் அருள் உங்கள் அனைத்து முயற்சிகளிலும் துணையாக நிற்கும்.",
    "prediction_en": "Today, February 14, 2026, being a Thursday, the influence of Jupiter will bring many good fortunes to Libra natives. Today, a sense of balance and harmony will prevail in your life. You will act with patience and composure in your endeavors and achieve success. You will spend pleasant moments with family and friends. Some good opportunities that further strengthen your financial position may come your way today. A sense of confidence will shine in your speech, and you will achieve many things using it. \n\nThose in the fields of education and knowledge will experience good growth today. This is an excellent day for learning new things and enhancing your knowledge. The advice of elders will serve as proper guidance for you. Those with spiritual inclinations will attain peace of mind and clarity by engaging in meditation and worship. Your mental clarity will increase. Artists and those in literary fields will gain new inspiration today. Your creativity will emerge, and your talents will be recognized. \n\nSome long-pending matters will come to a good conclusion today, by the grace of Jupiter. This will bring you immense satisfaction. This is a great day to contemplate new investments. You will undertake future planning. You will see a clear path to achieve your goals today. Harmonious relationships with friends and relatives will continue. You will receive the blessings of elders in the family. Happy news will come through children. Any decision you make today will be a wise one. \n\nYour self-confidence will increase, and you will gain the courage to face any challenge. You will earn a good reputation in society, and many will await your advice. You will do what you can for those who seek help, which will create inner peace within you. Your positive thoughts will attract many good things today. Unexpected gains and happy news may reach you. Those in the business sector may have opportunities for new contracts. Overall, today will be a special day that brings you stability, prosperity, and peace of mind. Jupiter's grace will support all your endeavors.",
    "career_ta": "தொழில் ரீதியாக இன்று நல்ல முன்னேற்றம் உண்டாகும். கூட்டாண்மை முயற்சிகளில் வெற்றி கிடைக்கும். புதிய ஒப்பந்தங்கள் மற்றும் வாய்ப்புகள் உங்களைத் தேடி வரும். உங்களின் இராஜதந்திர அணுகுமுறை பாராட்டப்படும்.",
    "career_en": "Professionally, good progress will be made today. Success will be achieved in partnership endeavors. New contracts and opportunities will seek you out. Your diplomatic approach will be appreciated.",
    "finance_ta": "நிதி ஆதாயம் உண்டு. எதிர்பார்த்த பணவரவு கிடைக்கும். கடன் சுமை குறையும். புத்திசாலித்தனமான முதலீடுகளை மேற்கொள்வதன் மூலம் எதிர்கால நிதிநிலையை மேம்படுத்துவீர்கள். சேமிப்பை அதிகரிக்கும் வாய்ப்புகள் உருவாகும்.",
    "finance_en": "There will be financial gains. Expected monetary flow will be received. Debt burden will decrease. You will improve your future financial situation by making sound investments. Opportunities to increase savings will arise.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் அமைதி நிலவும். சமச்சீரான உணவு மற்றும் உடற்பயிற்சி உங்களுக்கு புத்துணர்ச்சியளிக்கும். மன அழுத்தம் குறையும்.",
    "health_en": "Physical health will be stable. Peace will prevail in your mind. A balanced diet and exercise will rejuvenate you. Mental stress will decrease.",
    "lucky_number": "6",
    "lucky_color_ta": "முத்துநீலம்",
    "lucky_color_en": "Pearl Blue"
  },
  {
    "sign_ta": "விருச்சிகம்",
    "sign_en": "Scorpio",
    "date": "14-02-2026",
    "prediction_ta": "இன்று, பிப்ரவரி 14, 2026, வியாழன் கிழமையாக இருப்பதனால், குரு பகவானின் ஆதிக்கம் விருச்சிக ராசி அன்பர்களுக்குப் பல நற்பலன்களைத் தரும். இன்று உங்கள் வாழ்வில் ஒருவித தீர்க்கமான தெளிவு மேலோங்கும். நீங்கள் மேற்கொள்ளும் காரியங்களில் ஆழமான சிந்தனையுடனும், நிதானத்துடனும் செயல்பட்டு, வெற்றி பெறுவீர்கள். குடும்பத்தினருடனும், நண்பர்களுடனும் இனிமையான தருணங்களை செலவிடுவீர்கள். உங்களின் பொருளாதார நிலை மேலும் வலுப்பெறும் வகையில் சில நல்ல வாய்ப்புகள் இன்று உங்களைத் தேடி வரலாம். உங்கள் பேச்சில் ஒருவித நம்பிக்கை ஒளிர்ந்திடும். அதனைப் பயன்படுத்தி பல காரியங்களைச் சாதிப்பீர்கள். \n\nகல்வி மற்றும் அறிவுத் துறையில் இருப்பவர்களுக்கு இன்று நல்ல வளர்ச்சி கிடைக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்துவதற்கும் இது சிறந்த நாளாகும். பெரியோர்களின் அறிவுரைகள் உங்களுக்கு சரியான வழிகாட்டியாக அமையும். ஆன்மீகத்தில் நாட்டம் கொண்டவர்கள் தியானம் மற்றும் வழிபாடுகளில் ஈடுபடுவதன் மூலம் மன அமைதியையும், தெளிவையும் பெறுவார்கள். உங்கள் மனத்தெளிவு அதிகரிக்கும். கலை மற்றும் இலக்கியத் துறைகளில் இருப்பவர்களுக்கு இன்று புதிய உத்வேகம் கிடைக்கும். உங்கள் படைப்பாற்றல் வெளிப்படும். உங்களின் திறமைகள் அங்கீகரிக்கப்படும். \n\nநீண்ட நாட்களாக நிலுவையில் இருந்த சில விஷயங்கள் இன்று குரு பகவானின் அருளால் நல்லபடியாக முடிவுக்கு வரும். இது உங்களுக்கு மிகுந்த மனநிறைவைத் தரும். புதிய முதலீடுகளைப் பற்றி சிந்திக்க இது ஒரு சிறந்த நாள். எதிர்காலத்திற்கான திட்டமிடல்களை மேற்கொள்வீர்கள். உங்கள் இலக்குகளை அடைவதற்கான தெளிவான பாதையை இன்று நீங்கள் காண்பீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் சுமுகமான உறவு நீடிக்கும். குடும்பத்தில் உள்ள பெரியோர்களின் ஆசீர்வாதத்தைப் பெறுவீர்கள். குழந்தைகள் மூலம் மகிழ்ச்சியான செய்திகள் வந்து சேரும். இன்று நீங்கள் எடுக்கும் எந்த ஒரு முடிவும் புத்திசாலித்தனமாக இருக்கும். \n\nஉங்களின் தன்னம்பிக்கை அதிகரிக்கும். எந்த ஒரு சவாலையும் எதிர்கொள்ளும் துணிவு உண்டாகும். சமூகத்தில் நற்பெயர் பெறுவீர்கள். பலரும் உங்கள் ஆலோசனைக்காக காத்திருப்பார்கள். உதவிகளை நாடி வருபவர்களுக்கு உங்களால் முடிந்ததைச் செய்வீர்கள். இது உங்களுக்குள் ஒரு உள்ளார்ந்த அமைதியை உருவாக்கும். உங்களின் நேர்மறை எண்ணங்கள் இன்று பல நல்ல விஷயங்களை ஈர்க்கும். எதிர்பாராத ஆதாயங்கள் மற்றும் மகிழ்ச்சியான செய்திகள் உங்களுக்கு வந்து சேரலாம். வியாபாரத் துறையில் இருப்பவர்களுக்கு புதிய ஒப்பந்தங்கள் வந்து சேர வாய்ப்புள்ளது. ஒட்டுமொத்தத்தில், இன்று உங்களுக்கு ஸ்திரத்தன்மையையும், செழிப்பையும், மன அமைதியையும் தரும் ஒரு சிறப்பான நாளாக அமையும். குரு பகவானின் அருள் உங்கள் அனைத்து முயற்சிகளிலும் துணையாக நிற்கும்.",
    "prediction_en": "Today, February 14, 2026, being a Thursday, the influence of Jupiter will bring many good fortunes to Scorpio natives. Today, a profound clarity will prevail in your life. You will act with deep thought and composure in your endeavors and achieve success. You will spend pleasant moments with family and friends. Some good opportunities that further strengthen your financial position may come your way today. A sense of confidence will shine in your speech, and you will achieve many things using it. \n\nThose in the fields of education and knowledge will experience good growth today. This is an excellent day for learning new things and enhancing your knowledge. The advice of elders will serve as proper guidance for you. Those with spiritual inclinations will attain peace of mind and clarity by engaging in meditation and worship. Your mental clarity will increase. Artists and those in literary fields will gain new inspiration today. Your creativity will emerge, and your talents will be recognized. \n\nSome long-pending matters will come to a good conclusion today, by the grace of Jupiter. This will bring you immense satisfaction. This is a great day to contemplate new investments. You will undertake future planning. You will see a clear path to achieve your goals today. Harmonious relationships with friends and relatives will continue. You will receive the blessings of elders in the family. Happy news will come through children. Any decision you make today will be a wise one. \n\nYour self-confidence will increase, and you will gain the courage to face any challenge. You will earn a good reputation in society, and many will await your advice. You will do what you can for those who seek help, which will create inner peace within you. Your positive thoughts will attract many good things today. Unexpected gains and happy news may reach you. Those in the business sector may have opportunities for new contracts. Overall, today will be a special day that brings you stability, prosperity, and peace of mind. Jupiter's grace will support all your endeavors.",
    "career_ta": "தொழில் ரீதியாக இன்று சிறப்பான வளர்ச்சி உண்டு. உங்கள் உழைப்புக்குரிய அங்கீகாரம் கிடைக்கும். புதிய பொறுப்புகளை ஏற்க நேரிடலாம், அதனை திறம்பட செய்து முடிப்பீர்கள். உங்கள் திட்டமிடும் திறன் வெற்றியைத் தரும்.",
    "career_en": "Professionally, there will be excellent growth today. Your hard work will receive due recognition. You may have to take on new responsibilities, which you will complete efficiently. Your planning skills will bring success.",
    "finance_ta": "நிதிநிலை மேம்படும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய முதலீடுகள் லாபம் தரும். புதிய சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். புத்திசாலித்தனமான நிதி முடிவுகள் ஆதாயத்தைத் தரும்.",
    "finance_en": "The financial situation will improve. Expected monetary gains will be received. Old investments will yield profits. You will focus on new savings schemes. Wise financial decisions will bring gains.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் தெளிவும், அமைதியும் நிறைந்திருக்கும். சரியான உணவுப் பழக்கவழக்கங்களைப் பின்பற்றுவதன் மூலம் ஆரோக்கியத்தை மேம்படுத்தலாம். புத்துணர்ச்சியுடன் காணப்படுவீர்கள்.",
    "health_en": "Physical health will be stable. Your mind will be filled with clarity and peace. You can improve your health by following proper dietary habits. You will feel rejuvenated.",
    "lucky_number": "9",
    "lucky_color_ta": "சிவப்பு",
    "lucky_color_en": "Red"
  },
  {
    "sign_ta": "தனுசு",
    "sign_en": "Sagittarius",
    "date": "14-02-2026",
    "prediction_ta": "இன்று, பிப்ரவரி 14, 2026, வியாழன் கிழமையாக இருப்பதனால், குரு பகவானின் ஆதிக்கம் தனுசு ராசி அன்பர்களுக்குப் பல சிறப்பான நற்பலன்களை வாரி வழங்கும். குருவின் ஆதிக்கம் பெற்ற தனுசு ராசியினருக்கு, இன்று ஆன்மீக நாட்டம் அதிகரிக்கும். மனதில் ஆழ்ந்த அமைதியும், தெளிவும் உண்டாகும். புதிய அறிவைப் பெறுவதற்கும், தத்துவ ரீதியான சிந்தனைகளில் ஈடுபடுவதற்கும் இது உகந்த நாள். நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலிலும் நேர்மறை எண்ணங்கள் மேலோங்கும். சவால்களை நம்பிக்கையுடன் எதிர்கொள்வீர்கள். \n\nகுடும்பத்தில் மகிழ்ச்சியான சூழ்நிலை நிலவும். உறவினர்களுடனும், நண்பர்களுடனும் சுமுகமான உரையாடல்கள் நடைபெறும். சமூகத்தில் உங்கள் மதிப்பு உயரும். நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயமானதாக அமையும். குறிப்பாக, உங்கள் அறிவு வளர்ச்சிக்கு உதவும் பயணங்கள் இன்று வெற்றியைத் தரும். கல்வித் துறையில் இருப்பவர்களுக்கு இன்று புதிய வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் மிகுந்த ஆர்வத்துடன் ஈடுபடுவார்கள். புதிய பாடங்களைக் கற்றுக்கொள்வதற்கும், ஆராய்ச்சி செய்வதற்கும் இது நல்ல நேரம். மூத்தவர்களின் அறிவுரைகளை ஏற்றுக்கொள்வதன் மூலம் நீங்கள் சிறப்பான முன்னேற்றம் காணலாம். \n\nஇதுவரை தாமதமாகி வந்த சில காரியங்கள் இன்று குரு பலத்தால் அனுகூலமாக முடிவடையும். ஆன்மீக நாட்டம் கொண்டவர்கள் ஆலய தரிசனம் மேற்கொள்வதன் மூலம் மன அமைதியைப் பெறுவார்கள். தர்ம சிந்தனை மேலோங்கும். பிறருக்கு உதவி செய்யும் எண்ணம் உண்டாகும். இது உங்களுக்குள் ஒரு உள்ளார்ந்த திருப்தியை அளிக்கும். உங்கள் தனிப்பட்ட வாழ்க்கையிலும், தொழில் வாழ்க்கையிலும் ஒரு சமநிலையை பேணுவீர்கள். கடின உழைப்புக்கு ஏற்ற பலனை இன்று நீங்கள் நிச்சயம் பெறுவீர்கள். எதிர்பார்த்திருந்த ஆதாயங்கள் சில வழிகளில் உங்களைத் தேடி வரும். \n\nபழைய நண்பர்களை சந்திக்கும் வாய்ப்பு ஏற்படும். அவர்களுடன் பழைய நினைவுகளைப் பகிர்ந்து கொண்டு மகிழ்வீர்கள். புதிய நண்பர்களும் உங்கள் வட்டாரத்தில் இணைவார்கள். உங்கள் பேச்சில் ஒருவித வசீகரம் இருக்கும். அதனைப் பயன்படுத்தி நீங்கள் பல காரியங்களை சுலபமாக சாதிப்பீர்கள். எந்த ஒரு பிரச்சனைக்கும் தீர்வு காண்பதில் உங்கள் புத்திசாலித்தனம் வெளிப்படும். இன்று நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலும் வெற்றியை நோக்கியே செல்லும். எந்த சவாலையும் எதிர்கொள்ளும் துணிவு உங்களுக்குக் கிடைக்கும். உங்களின் நேர்மறை எண்ணங்கள் இன்று பல நல்ல விஷயங்களை ஈர்க்கும். எதிர்பாராத நல்ல செய்திகள் உங்களுக்கு வந்து சேரலாம். சமூகப் பணிகளில் ஈடுபடுபவர்களுக்கு அங்கீகாரம் கிடைக்கும். கலைஞர்களுக்கு புதிய வாய்ப்புகள் உருவாகும். தங்கள் திறமைகளை வெளிப்படுத்த நல்லதொரு மேடை அமையும். நீண்ட நாட்களாக நீங்கள் எதிர்பார்த்துக் கொண்டிருந்த ஒரு விஷயம் இன்று நிறைவேறக்கூடும். இது உங்களுக்கு மிகுந்த மனநிறைவை அளிக்கும். எதிர்கால திட்டமிடல்களுக்கு இது ஒரு சிறந்த நாள். உங்கள் இலக்குகளை நோக்கி நம்பிக்கையுடன் அடியெடுத்து வைக்கலாம். குடும்ப உறுப்பினர்களின் ஆதரவு கிடைக்கும். பெற்றோர்களின் ஆசியைப் பெறுவீர்கள். குழந்தைகள் மூலம் மகிழ்ச்சியான செய்திகள் வந்து சேரும். ஒட்டுமொத்தத்தில், இன்று உங்களுக்கு ஒரு ஆக்கபூர்வமான, மகிழ்ச்சியான மற்றும் வளமான நாளாக அமையும். குரு பகவானின் அருள் பரிபூரணமாக நிறைந்திருக்கும்.",
    "prediction_en": "Today, February 14, 2026, being a Thursday, the influence of Jupiter will bestow many excellent fortunes upon Sagittarius natives. For Sagittarius, ruled by Jupiter, spiritual inclination will increase today. Deep peace and clarity will arise in your mind. This is an opportune day for acquiring new knowledge and engaging in philosophical thoughts. Positive thoughts will prevail in every action you undertake. You will face challenges with confidence. \n\nA joyful atmosphere will prevail in the family. Harmonious conversations will take place with relatives and friends. Your social standing will increase. Your journeys will prove to be profitable. Particularly, journeys that aid your intellectual growth will bring success today. Those in the field of education will find new opportunities today. Students will engage in their studies with great interest. This is a good time for learning new subjects and conducting research. You can achieve significant progress by accepting the advice of elders. \n\nSome tasks that have been delayed so far will conclude favorably today due to Jupiter's strength. Those with spiritual inclinations will attain peace of mind by visiting temples. Thoughts of charity will prevail. A desire to help others will arise, which will give you deep inner satisfaction. You will maintain a balance between your personal and professional life. You will surely reap the rewards of your hard work today. Expected gains will come to you through various channels. \n\nYou may have an opportunity to meet old friends and cherish old memories with them. New friends will also join your circle. There will be a certain charm in your speech, and you will use it to accomplish many tasks with ease. Your intelligence will be evident in finding solutions to any problem. Every action you undertake today will lead towards success. You will gain the courage to face any challenge. Your positive thoughts will attract many good things today. Unexpected good news may reach you. Those involved in social work will receive recognition. Artists will find new opportunities and a good platform to showcase their talents. Something you have been anticipating for a long time may come to fruition today, bringing you great satisfaction. This is an excellent day for future planning. You can confidently take steps towards your goals. Support from family members will be available. You will receive blessings from your parents. Happy news will come through children. Overall, today will be a productive, joyful, and prosperous day for you, filled with the complete blessings of Jupiter.",
    "career_ta": "தொழில் ரீதியாக இன்று சிறப்பான வளர்ச்சி உண்டாகும். புதிய திட்டங்கள் வெற்றியடையும். உங்கள் உழைப்புக்குரிய அங்கீகாரம் கிடைக்கும். வெளிநாட்டு தொடர்புகள் ஆதாயம் தரும். புதிய பொறுப்புகளை ஏற்க நேரிடலாம்.",
    "career_en": "Professionally, there will be excellent growth today. New projects will succeed. Your hard work will receive due recognition. Foreign connections will yield profits. You may have to take on new responsibilities.",
    "finance_ta": "நிதிநிலை இன்று வலிமையாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். புதிய முதலீடுகள் லாபம் தரும். எதிர்காலத்திற்கான சேமிப்பை அதிகரிப்பீர்கள். புத்திசாலித்தனமான நிதி முடிவுகள் எடுப்பீர்கள்.",
    "finance_en": "The financial situation will be strong today. Expected monetary gains will be received. New investments will yield profits. You will increase savings for the future and make wise financial decisions.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் உற்சாகமும் புத்துணர்ச்சியும் நிறைந்திருக்கும். வெளிப்பயணங்கள் உங்களுக்கு புத்துணர்ச்சி அளிக்கும். மன அமைதிக்காக தியானம் மேற்கொள்ளலாம்.",
    "health_en": "Physical health will be stable. Your mind will be filled with enthusiasm and freshness. Travel will rejuvenate you. You can practice meditation for mental peace.",
    "lucky_number": "3",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "மகரம்",
    "sign_en": "Capricorn",
    "date": "14-02-2026",
    "prediction_ta": "இன்று, பிப்ரவரி 14, 2026, வியாழன் கிழமையாக இருப்பதனால், குரு பகவானின் ஆதிக்கம் மகர ராசி அன்பர்களுக்குப் பல நற்பலன்களைத் தரும். இன்று உங்கள் வாழ்வில் ஒருவித ஸ்திரத்தன்மை மேலோங்கும். நீங்கள் மேற்கொள்ளும் காரியங்களில் பொறுமையுடனும், நிதானத்துடனும் செயல்பட்டு, வெற்றி பெறுவீர்கள். குடும்பத்தினருடனும், நண்பர்களுடனும் இனிமையான தருணங்களை செலவிடுவீர்கள். உங்களின் பொருளாதார நிலை மேலும் வலுப்பெறும் வகையில் சில நல்ல வாய்ப்புகள் இன்று உங்களைத் தேடி வரலாம். உங்கள் பேச்சில் ஒருவித நம்பிக்கை ஒளிர்ந்திடும். அதனைப் பயன்படுத்தி பல காரியங்களைச் சாதிப்பீர்கள். \n\nகல்வி மற்றும் அறிவுத் துறையில் இருப்பவர்களுக்கு இன்று நல்ல வளர்ச்சி கிடைக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்துவதற்கும் இது சிறந்த நாளாகும். பெரியோர்களின் அறிவுரைகள் உங்களுக்கு சரியான வழிகாட்டியாக அமையும். ஆன்மீகத்தில் நாட்டம் கொண்டவர்கள் தியானம் மற்றும் வழிபாடுகளில் ஈடுபடுவதன் மூலம் மன அமைதியையும், தெளிவையும் பெறுவார்கள். உங்கள் மனத்தெளிவு அதிகரிக்கும். கலை மற்றும் இலக்கியத் துறைகளில் இருப்பவர்களுக்கு இன்று புதிய உத்வேகம் கிடைக்கும். உங்கள் படைப்பாற்றல் வெளிப்படும். உங்களின் திறமைகள் அங்கீகரிக்கப்படும். \n\nநீண்ட நாட்களாக நிலுவையில் இருந்த சில விஷயங்கள் இன்று குரு பகவானின் அருளால் நல்லபடியாக முடிவுக்கு வரும். இது உங்களுக்கு மிகுந்த மனநிறைவைத் தரும். புதிய முதலீடுகளைப் பற்றி சிந்திக்க இது ஒரு சிறந்த நாள். எதிர்காலத்திற்கான திட்டமிடல்களை மேற்கொள்வீர்கள். உங்கள் இலக்குகளை அடைவதற்கான தெளிவான பாதையை இன்று நீங்கள் காண்பீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் சுமுகமான உறவு நீடிக்கும். குடும்பத்தில் உள்ள பெரியோர்களின் ஆசீர்வாதத்தைப் பெறுவீர்கள். குழந்தைகள் மூலம் மகிழ்ச்சியான செய்திகள் வந்து சேரும். இன்று நீங்கள் எடுக்கும் எந்த ஒரு முடிவும் புத்திசாலித்தனமாக இருக்கும். \n\nஉங்களின் தன்னம்பிக்கை அதிகரிக்கும். எந்த ஒரு சவாலையும் எதிர்கொள்ளும் துணிவு உண்டாகும். சமூகத்தில் நற்பெயர் பெறுவீர்கள். பலரும் உங்கள் ஆலோசனைக்காக காத்திருப்பார்கள். உதவிகளை நாடி வருபவர்களுக்கு உங்களால் முடிந்ததைச் செய்வீர்கள். இது உங்களுக்குள் ஒரு உள்ளார்ந்த அமைதியை உருவாக்கும். உங்களின் நேர்மறை எண்ணங்கள் இன்று பல நல்ல விஷயங்களை ஈர்க்கும். எதிர்பாராத ஆதாயங்கள் மற்றும் மகிழ்ச்சியான செய்திகள் உங்களுக்கு வந்து சேரலாம். வியாபாரத் துறையில் இருப்பவர்களுக்கு புதிய ஒப்பந்தங்கள் வந்து சேர வாய்ப்புள்ளது. ஒட்டுமொத்தத்தில், இன்று உங்களுக்கு ஸ்திரத்தன்மையையும், செழிப்பையும், மன அமைதியையும் தரும் ஒரு சிறப்பான நாளாக அமையும். குரு பகவானின் அருள் உங்கள் அனைத்து முயற்சிகளிலும் துணையாக நிற்கும்.",
    "prediction_en": "Today, February 14, 2026, being a Thursday, the influence of Jupiter will bring many good fortunes to Capricorn natives. Today, a sense of stability will prevail in your life. You will act with patience and composure in your endeavors and achieve success. You will spend pleasant moments with family and friends. Some good opportunities that further strengthen your financial position may come your way today. A sense of confidence will shine in your speech, and you will achieve many things using it. \n\nThose in the fields of education and knowledge will experience good growth today. This is an excellent day for learning new things and enhancing your knowledge. The advice of elders will serve as proper guidance for you. Those with spiritual inclinations will attain peace of mind and clarity by engaging in meditation and worship. Your mental clarity will increase. Artists and those in literary fields will gain new inspiration today. Your creativity will emerge, and your talents will be recognized. \n\nSome long-pending matters will come to a good conclusion today, by the grace of Jupiter. This will bring you immense satisfaction. This is a great day to contemplate new investments. You will undertake future planning. You will see a clear path to achieve your goals today. Harmonious relationships with friends and relatives will continue. You will receive the blessings of elders in the family. Happy news will come through children. Any decision you make today will be a wise one. \n\nYour self-confidence will increase, and you will gain the courage to face any challenge. You will earn a good reputation in society, and many will await your advice. You will do what you can for those who seek help, which will create inner peace within you. Your positive thoughts will attract many good things today. Unexpected gains and happy news may reach you. Those in the business sector may have opportunities for new contracts. Overall, today will be a special day that brings you stability, prosperity, and peace of mind. Jupiter's grace will support all your endeavors.",
    "career_ta": "தொழில் ரீதியாக இன்று சிறப்பான வளர்ச்சி உண்டு. உங்கள் கடின உழைப்புக்குரிய அங்கீகாரம் கிடைக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கான வாய்ப்புகள் உருவாகும். சவாலான பணிகளைச் சிறப்பாக செய்து முடிப்பீர்கள். பதவி உயர்வுக்கான சாத்தியக்கூறுகள் உள்ளன.",
    "career_en": "Professionally, there will be excellent growth today. Your hard work will receive due recognition. Opportunities to initiate new projects will emerge. You will successfully complete challenging tasks. There are possibilities for promotion.",
    "finance_ta": "நிதிநிலை இன்று வலிமையாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். புத்திசாலித்தனமான முதலீடுகள் லாபம் தரும். எதிர்காலத்திற்கான சேமிப்பை அதிகரிப்பீர்கள். சிக்கனமான செலவுகள் ஆதாயம் தரும்.",
    "finance_en": "The financial situation will be strong today. Expected monetary gains will be received. Wise investments will yield profits. You will increase savings for the future. Frugal spending will bring gains.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் உற்சாகமும் புத்துணர்ச்சியும் நிறைந்திருக்கும். உடற்பயிற்சிகளை மேற்கொள்வது உங்களுக்கு கூடுதல் பலம் சேர்க்கும். மன அமைதி கிடைக்கும்.",
    "health_en": "Physical health will be stable. Your mind will be filled with enthusiasm and freshness. Engaging in exercises will add extra strength. You will attain mental peace.",
    "lucky_number": "8",
    "lucky_color_ta": "கருப்பு",
    "lucky_color_en": "Black"
  },
  {
    "sign_ta": "கும்பம்",
    "sign_en": "Aquarius",
    "date": "14-02-2026",
    "prediction_ta": "இன்று, பிப்ரவரி 14, 2026, வியாழன் கிழமையாக இருப்பதனால், குரு பகவானின் ஆதிக்கம் கும்ப ராசி அன்பர்களுக்குப் பல நற்பலன்களைத் தரும். இன்று உங்கள் வாழ்வில் ஒருவித புதுமையும், சுதந்திர உணர்வும் மேலோங்கும். நீங்கள் மேற்கொள்ளும் காரியங்களில் புத்திசாலித்தனத்துடனும், புதிய அணுகுமுறைகளுடனும் செயல்பட்டு, வெற்றி பெறுவீர்கள். குடும்பத்தினருடனும், நண்பர்களுடனும் இனிமையான தருணங்களை செலவிடுவீர்கள். உங்களின் பொருளாதார நிலை மேலும் வலுப்பெறும் வகையில் சில நல்ல வாய்ப்புகள் இன்று உங்களைத் தேடி வரலாம். உங்கள் பேச்சில் ஒருவித நம்பிக்கை ஒளிர்ந்திடும். அதனைப் பயன்படுத்தி பல காரியங்களைச் சாதிப்பீர்கள். \n\nகல்வி மற்றும் அறிவுத் துறையில் இருப்பவர்களுக்கு இன்று நல்ல வளர்ச்சி கிடைக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்துவதற்கும் இது சிறந்த நாளாகும். பெரியோர்களின் அறிவுரைகள் உங்களுக்கு சரியான வழிகாட்டியாக அமையும். ஆன்மீகத்தில் நாட்டம் கொண்டவர்கள் தியானம் மற்றும் வழிபாடுகளில் ஈடுபடுவதன் மூலம் மன அமைதியையும், தெளிவையும் பெறுவார்கள். உங்கள் மனத்தெளிவு அதிகரிக்கும். கலை மற்றும் இலக்கியத் துறைகளில் இருப்பவர்களுக்கு இன்று புதிய உத்வேகம் கிடைக்கும். உங்கள் படைப்பாற்றல் வெளிப்படும். உங்களின் திறமைகள் அங்கீகரிக்கப்படும். \n\nநீண்ட நாட்களாக நிலுவையில் இருந்த சில விஷயங்கள் இன்று குரு பகவானின் அருளால் நல்லபடியாக முடிவுக்கு வரும். இது உங்களுக்கு மிகுந்த மனநிறைவைத் தரும். புதிய முதலீடுகளைப் பற்றி சிந்திக்க இது ஒரு சிறந்த நாள். எதிர்காலத்திற்கான திட்டமிடல்களை மேற்கொள்வீர்கள். உங்கள் இலக்குகளை அடைவதற்கான தெளிவான பாதையை இன்று நீங்கள் காண்பீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் சுமுகமான உறவு நீடிக்கும். குடும்பத்தில் உள்ள பெரியோர்களின் ஆசீர்வாதத்தைப் பெறுவீர்கள். குழந்தைகள் மூலம் மகிழ்ச்சியான செய்திகள் வந்து சேரும். இன்று நீங்கள் எடுக்கும் எந்த ஒரு முடிவும் புத்திசாலித்தனமாக இருக்கும். \n\nஉங்களின் தன்னம்பிக்கை அதிகரிக்கும். எந்த ஒரு சவாலையும் எதிர்கொள்ளும் துணிவு உண்டாகும். சமூகத்தில் நற்பெயர் பெறுவீர்கள். பலரும் உங்கள் ஆலோசனைக்காக காத்திருப்பார்கள். உதவிகளை நாடி வருபவர்களுக்கு உங்களால் முடிந்ததைச் செய்வீர்கள். இது உங்களுக்குள் ஒரு உள்ளார்ந்த அமைதியை உருவாக்கும். உங்களின் நேர்மறை எண்ணங்கள் இன்று பல நல்ல விஷயங்களை ஈர்க்கும். எதிர்பாராத ஆதாயங்கள் மற்றும் மகிழ்ச்சியான செய்திகள் உங்களுக்கு வந்து சேரலாம். வியாபாரத் துறையில் இருப்பவர்களுக்கு புதிய ஒப்பந்தங்கள் வந்து சேர வாய்ப்புள்ளது. ஒட்டுமொத்தத்தில், இன்று உங்களுக்கு ஸ்திரத்தன்மையையும், செழிப்பையும், மன அமைதியையும் தரும் ஒரு சிறப்பான நாளாக அமையும். குரு பகவானின் அருள் உங்கள் அனைத்து முயற்சிகளிலும் துணையாக நிற்கும்.",
    "prediction_en": "Today, February 14, 2026, being a Thursday, the influence of Jupiter will bring many good fortunes to Aquarius natives. Today, a sense of novelty and independence will prevail in your life. You will act with intelligence and new approaches in your endeavors and achieve success. You will spend pleasant moments with family and friends. Some good opportunities that further strengthen your financial position may come your way today. A sense of confidence will shine in your speech, and you will achieve many things using it. \n\nThose in the fields of education and knowledge will experience good growth today. This is an excellent day for learning new things and enhancing your knowledge. The advice of elders will serve as proper guidance for you. Those with spiritual inclinations will attain peace of mind and clarity by engaging in meditation and worship. Your mental clarity will increase. Artists and those in literary fields will gain new inspiration today. Your creativity will emerge, and your talents will be recognized. \n\nSome long-pending matters will come to a good conclusion today, by the grace of Jupiter. This will bring you immense satisfaction. This is a great day to contemplate new investments. You will undertake future planning. You will see a clear path to achieve your goals today. Harmonious relationships with friends and relatives will continue. You will receive the blessings of elders in the family. Happy news will come through children. Any decision you make today will be a wise one. \n\nYour self-confidence will increase, and you will gain the courage to face any challenge. You will earn a good reputation in society, and many will await your advice. You will do what you can for those who seek help, which will create inner peace within you. Your positive thoughts will attract many good things today. Unexpected gains and happy news may reach you. Those in the business sector may have opportunities for new contracts. Overall, today will be a special day that brings you stability, prosperity, and peace of mind. Jupiter's grace will support all your endeavors.",
    "career_ta": "தொழில் ரீதியாக இன்று சிறப்பான வளர்ச்சி உண்டு. புதிய யோசனைகள் வெற்றியடையும். உங்கள் புதுமையான அணுகுமுறை பாராட்டப்படும். சமூக நலன் சார்ந்த திட்டங்களில் ஈடுபட வாய்ப்பு உண்டு. புதிய பொறுப்புகள் உங்களைத் தேடி வரும்.",
    "career_en": "Professionally, there will be excellent growth today. New ideas will succeed. Your innovative approach will be appreciated. There is an opportunity to get involved in social welfare projects. New responsibilities will come your way.",
    "finance_ta": "நிதிநிலை மேம்படும். எதிர்பார்த்த பணவரவு கிடைக்கும். சமூகத்தின் மூலம் ஆதாயம் கிடைக்க வாய்ப்பு உண்டு. புத்திசாலித்தனமான முதலீடுகளை மேற்கொள்வதன் மூலம் எதிர்கால நிதிநிலையை மேம்படுத்துவீர்கள்.",
    "finance_en": "The financial situation will improve. Expected monetary gains will be received. There is a possibility of gaining through social connections. You will improve your future financial situation by making wise investments.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் உற்சாகமும், புத்துணர்ச்சியும் நிறைந்திருக்கும். சமூகப் பணிகளில் ஈடுபடுவது உங்களுக்கு மன அமைதியைத் தரும். புதிய உடற்பயிற்சிகளில் ஈடுபடலாம்.",
    "health_en": "Physical health will be stable. Your mind will be filled with enthusiasm and freshness. Engaging in social activities will bring you mental peace. You can engage in new exercise routines.",
    "lucky_number": "4",
    "lucky_color_ta": "கத்தரிப்பூ நிறம்",
    "lucky_color_en": "Brinjal Color"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "14-02-2026",
    "prediction_ta": "இன்று, பிப்ரவரி 14, 2026, வியாழன் கிழமையாக இருப்பதனால், குரு பகவானின் ஆதிக்கம் மீன ராசி அன்பர்களுக்குப் பல சிறப்பான நற்பலன்களை வாரி வழங்கும். குருவின் ஆதிக்கம் பெற்ற மீன ராசியினருக்கு, இன்று ஆன்மீக நாட்டம் அதிகரிக்கும். மனதில் ஆழ்ந்த அமைதியும், தெளிவும் உண்டாகும். புதிய அறிவைப் பெறுவதற்கும், தத்துவ ரீதியான சிந்தனைகளில் ஈடுபடுவதற்கும் இது உகந்த நாள். நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலிலும் நேர்மறை எண்ணங்கள் மேலோங்கும். சவால்களை நம்பிக்கையுடன் எதிர்கொள்வீர்கள். \n\nகுடும்பத்தில் மகிழ்ச்சியான சூழ்நிலை நிலவும். உறவினர்களுடனும், நண்பர்களுடனும் சுமுகமான உரையாடல்கள் நடைபெறும். சமூகத்தில் உங்கள் மதிப்பு உயரும். நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயமானதாக அமையும். குறிப்பாக, உங்கள் அறிவு வளர்ச்சிக்கு உதவும் பயணங்கள் இன்று வெற்றியைத் தரும். கல்வித் துறையில் இருப்பவர்களுக்கு இன்று புதிய வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் மிகுந்த ஆர்வத்துடன் ஈடுபடுவார்கள். புதிய பாடங்களைக் கற்றுக்கொள்வதற்கும், ஆராய்ச்சி செய்வதற்கும் இது நல்ல நேரம். மூத்தவர்களின் அறிவுரைகளை ஏற்றுக்கொள்வதன் மூலம் நீங்கள் சிறப்பான முன்னேற்றம் காணலாம். \n\nஇதுவரை தாமதமாகி வந்த சில காரியங்கள் இன்று குரு பலத்தால் அனுகூலமாக முடிவடையும். ஆன்மீக நாட்டம் கொண்டவர்கள் ஆலய தரிசனம் மேற்கொள்வதன் மூலம் மன அமைதியைப் பெறுவார்கள். தர்ம சிந்தனை மேலோங்கும். பிறருக்கு உதவி செய்யும் எண்ணம் உண்டாகும். இது உங்களுக்குள் ஒரு உள்ளார்ந்த திருப்தியை அளிக்கும். உங்கள் தனிப்பட்ட வாழ்க்கையிலும், தொழில் வாழ்க்கையிலும் ஒரு சமநிலையை பேணுவீர்கள். கடின உழைப்புக்கு ஏற்ற பலனை இன்று நீங்கள் நிச்சயம் பெறுவீர்கள். எதிர்பார்த்திருந்த ஆதாயங்கள் சில வழிகளில் உங்களைத் தேடி வரும். \n\nபழைய நண்பர்களை சந்திக்கும் வாய்ப்பு ஏற்படும். அவர்களுடன் பழைய நினைவுகளைப் பகிர்ந்து கொண்டு மகிழ்வீர்கள். புதிய நண்பர்களும் உங்கள் வட்டாரத்தில் இணைவார்கள். உங்கள் பேச்சில் ஒருவித வசீகரம் இருக்கும். அதனைப் பயன்படுத்தி நீங்கள் பல காரியங்களை சுலபமாக சாதிப்பீர்கள். எந்த ஒரு பிரச்சனைக்கும் தீர்வு காண்பதில் உங்கள் புத்திசாலித்தனம் வெளிப்படும். இன்று நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலும் வெற்றியை நோக்கியே செல்லும். எந்த சவாலையும் எதிர்கொள்ளும் துணிவு உங்களுக்குக் கிடைக்கும். உங்களின் நேர்மறை எண்ணங்கள் இன்று பல நல்ல விஷயங்களை ஈர்க்கும். எதிர்பாராத நல்ல செய்திகள் உங்களுக்கு வந்து சேரலாம். சமூகப் பணிகளில் ஈடுபடுபவர்களுக்கு அங்கீகாரம் கிடைக்கும். கலைஞர்களுக்கு புதிய வாய்ப்புகள் உருவாகும். தங்கள் திறமைகளை வெளிப்படுத்த நல்லதொரு மேடை அமையும். நீண்ட நாட்களாக நீங்கள் எதிர்பார்த்துக் கொண்டிருந்த ஒரு விஷயம் இன்று நிறைவேறக்கூடும். இது உங்களுக்கு மிகுந்த மனநிறைவை அளிக்கும். எதிர்கால திட்டமிடல்களுக்கு இது ஒரு சிறந்த நாள். உங்கள் இலக்குகளை நோக்கி நம்பிக்கையுடன் அடியெடுத்து வைக்கலாம். குடும்ப உறுப்பினர்களின் ஆதரவு கிடைக்கும். பெற்றோர்களின் ஆசியைப் பெறுவீர்கள். குழந்தைகள் மூலம் மகிழ்ச்சியான செய்திகள் வந்து சேரும். ஒட்டுமொத்தத்தில், இன்று உங்களுக்கு ஒரு ஆக்கபூர்வமான, மகிழ்ச்சியான மற்றும் வளமான நாளாக அமையும். குரு பகவானின் அருள் பரிபூரணமாக நிறைந்திருக்கும்.",
    "prediction_en": "Today, February 14, 2026, being a Thursday, the influence of Jupiter will bestow many excellent fortunes upon Pisces natives. For Pisces, ruled by Jupiter, spiritual inclination will increase today. Deep peace and clarity will arise in your mind. This is an opportune day for acquiring new knowledge and engaging in philosophical thoughts. Positive thoughts will prevail in every action you undertake. You will face challenges with confidence. \n\nA joyful atmosphere will prevail in the family. Harmonious conversations will take place with relatives and friends. Your social standing will increase. Your journeys will prove to be profitable. Particularly, journeys that aid your intellectual growth will bring success today. Those in the field of education will find new opportunities today. Students will engage in their studies with great interest. This is a good time for learning new subjects and conducting research. You can achieve significant progress by accepting the advice of elders. \n\nSome tasks that have been delayed so far will conclude favorably today due to Jupiter's strength. Those with spiritual inclinations will attain peace of mind by visiting temples. Thoughts of charity will prevail. A desire to help others will arise, which will give you deep inner satisfaction. You will maintain a balance between your personal and professional life. You will surely reap the rewards of your hard work today. Expected gains will come to you through various channels. \n\nYou may have an opportunity to meet old friends and cherish old memories with them. New friends will also join your circle. There will be a certain charm in your speech, and you will use it to accomplish many tasks with ease. Your intelligence will be evident in finding solutions to any problem. Every action you undertake today will lead towards success. You will gain the courage to face any challenge. Your positive thoughts will attract many good things today. Unexpected good news may reach you. Those involved in social work will receive recognition. Artists will find new opportunities and a good platform to showcase their talents. Something you have been anticipating for a long time may come to fruition today, bringing you great satisfaction. This is an excellent day for future planning. You can confidently take steps towards your goals. Support from family members will be available. You will receive blessings from your parents. Happy news will come through children. Overall, today will be a productive, joyful, and prosperous day for you, filled with the complete blessings of Jupiter.",
    "career_ta": "தொழில் ரீதியாக இன்று சிறப்பான வளர்ச்சி உண்டாகும். புதிய வாய்ப்புகள் உங்களைத் தேடி வரும். சக ஊழியர்களின் ஒத்துழைப்பு கிடைக்கும். ஆன்மீகம் மற்றும் சேவை சார்ந்த பணிகளில் ஈடுபடுபவர்களுக்கு அங்கீகாரம் கிடைக்கும். வெளிநாட்டு வாய்ப்புகள் வந்து சேரும்.",
    "career_en": "Professionally, there will be excellent growth today. New opportunities will seek you out. Cooperation from colleagues will be available. Those involved in spiritual and service-oriented work will receive recognition. Overseas opportunities will arise.",
    "finance_ta": "நிதிநிலை மிகவும் சிறப்பாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் தீரும். புதிய முதலீடுகளை மேற்கொள்ள இது ஒரு சிறந்த நாள். நீண்டகால நிதி திட்டமிடல்கள் பலனளிக்கும்.",
    "finance_en": "The financial situation will be excellent. Expected monetary gains will be received. Old debts will be cleared. This is an excellent day for making new investments. Long-term financial planning will be fruitful.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் உற்சாகமும் புத்துணர்ச்சியும் நிறைந்திருக்கும். தியானம் மற்றும் யோகா பயிற்சிகள் மன அமைதியைத் தரும். ஆன்மீக ஈடுபாடு ஆரோக்கியத்தை மேம்படுத்தும்.",
    "health_en": "Physical health will be stable. Your mind will be filled with enthusiasm and freshness. Meditation and yoga practices will bring mental peace. Spiritual involvement will improve health.",
    "lucky_number": "3",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  }
]
