[
  {
    "sign_ta": "மேஷம்",
    "sign_en": "Aries",
    "date": "01-03-2026",
    "prediction_ta": "இன்று சூரியனின் ஆதிக்க நாளான ஞாயிற்றுக்கிழமை என்பதால், உங்கள் தன்னம்பிக்கையும் தலைமைப் பண்பும் மிளிரும் நாளாக அமையும். எந்த ஒரு செயலையும் முன்னின்று நடத்திச் செல்வதற்குரிய ஆற்றல் உங்களுக்குள் நிறைந்திருக்கும். உங்கள் உள்ளுணர்வு வழிகாட்டுதலைப் பின்பற்றி முக்கியமான முடிவுகளை எடுப்பதற்கு இது ஒரு மிகச்சிறந்த தருணம். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தந்தை அல்லது தந்தைக்கு சமமானவர்களுடன் சுமூகமான உறவு நீடிக்கும். அவர்களின் அனுபவபூர்வமான ஆலோசனைகள் உங்களுக்கு பலன் தரும். உங்கள் தனிப்பட்ட திறமைகளை வெளிப்படுத்தவும், உங்கள் கருத்துக்களை தைரியமாக முன்வைக்கவும் உகந்த நாள். சமூகத்தில் உங்கள் நிலை உயரும் வாய்ப்புகள் அதிகம். உங்கள் உற்சாகமான மனநிலை மற்றவர்களுக்கும் பரவி நேர்மறையான சூழலை உருவாக்கும். புதிய முயற்சிகளை மேற்கொள்ளவும், நீண்டகால திட்டங்களுக்கு அடிக்கல் நாட்டவும் இன்றைய தினம் மிகவும் பொருத்தமானது. உங்கள் மனம் அமைதியாகவும், எண்ணங்கள் தெளிவாகவும் இருக்கும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் போன்ற செயல்களில் ஈடுபடுவது மனதிற்கு மேலும் புத்துணர்ச்சி அளிக்கும். சமூக சேவைகளில் ஈடுபடுவதன் மூலம் மனநிறைவு பெறுவீர்கள். உங்களுக்குள் இருக்கும் படைப்புத்திறனை வெளிக்கொண்டுவர இது ஒரு பொன்னான வாய்ப்பு. கலை சார்ந்த துறைகளில் உள்ளவர்களுக்கு சிறப்பான அங்கீகாரம் கிடைக்கும். உங்கள் நண்பர்கள் மற்றும் உறவினர்களின் ஆதரவு உங்களுக்கு பலமாக அமையும். எதிர்காலத்திற்கான திட்டங்களை வகுத்து செயல்பட இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்துவது மிகவும் முக்கியம். உடற்பயிற்சி மற்றும் சத்தான உணவு பழக்கம் உங்களுக்கு மேலும் புத்துணர்ச்சி அளிக்கும். வீண் விவாதங்களைத் தவிர்த்து அமைதியான முறையில் உங்கள் கருத்துக்களை எடுத்துரைப்பது நல்ல பலனைத் தரும். உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணித்து வெற்றி பெறுவீர்கள். தன்னம்பிக்கையுடன் செயல்பட்டு, எந்த தடைகளையும் தகர்த்தெறிந்து முன்னேறுவீர்கள். உங்கள் உள்ளுணர்வு கூறுவதைக் கேட்டு செயல்பட்டால், இன்று பல நன்மைகள் உண்டாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு, உங்கள் திறமைகளை முழுமையாகப் பயன்படுத்துங்கள். இன்றைய நாள் உங்களுக்கு வெற்றியையும் மனமகிழ்ச்சியையும் தரும்.",
    "prediction_en": "Today, being Sunday, a day ruled by the Sun, your self-confidence and leadership qualities will shine brightly. You will be filled with the energy required to lead any endeavor. This is an excellent time to make important decisions by following your intuition. A harmonious relationship will prevail with family members, especially with your father or father figures. Their experienced advice will benefit you. It is an opportune day to express your individual talents and bravely put forth your views. There are high chances for your social status to rise. Your enthusiastic state of mind will spread to others, creating a positive atmosphere. Today is highly suitable for undertaking new ventures and laying foundations for long-term plans. Your mind will be peaceful, and thoughts will be clear. Spiritual inclination will increase. Engaging in activities like temple visits or meditation will provide further rejuvenation to the mind. You will gain contentment by involving yourself in social services. This is a golden opportunity to bring forth your inherent creativity. Those in artistic fields will receive special recognition. The support of your friends and relatives will be a strength for you. This is an excellent day to formulate and implement plans for the future. Paying attention to your health is crucial. Exercise and a nutritious diet will provide you with further vitality. Avoiding futile arguments and expressing your views calmly will yield good results. You will travel determinedly towards your goals and achieve success. You will act with self-confidence, overcoming any obstacles to progress. If you act by listening to your intuition, many benefits will arise today. Act with positive thoughts and fully utilize your talents. Today will bring you success and joy.",
    "career_ta": "உங்கள் தலைமைப் பண்பு பணியிடத்தில் நன்கு வெளிப்படும். புதிய பொறுப்புகளை ஏற்று திறம்பட செயல்படுவீர்கள். மேலதிகாரிகளின் பாராட்டைப் பெறுவீர்கள். புதிய திட்டங்களை முன்னெடுத்துச் செல்லும் வாய்ப்புகள் அமையும். உங்கள் சக ஊழியர்களின் ஒத்துழைப்பு சிறப்பாக இருக்கும். பணிச்சுமை இருந்தாலும், அதை திறமையுடன் கையாள்வீர்கள். உங்கள் யோசனைகள் ஏற்றுக்கொள்ளப்பட்டு செயல்படுத்தப்படும். நீண்டகாலமாக நிலுவையில் உள்ள பணிகளை இன்று சிறப்பாக முடிப்பீர்கள்.",
    "career_en": "Your leadership qualities will be well-expressed in the workplace. You will accept new responsibilities and perform them efficiently. You will receive praise from superiors. Opportunities to initiate new projects will arise. The cooperation from your colleagues will be excellent. Despite workload, you will manage it skillfully. Your ideas will be accepted and implemented. You will successfully complete long-pending tasks today.",
    "finance_ta": "நிதிநிலை சீராக இருக்கும். வருமானம் அதிகரிக்கும் வழிகள் உருவாகும். சேமிப்புக்கான புதிய திட்டங்களை ஆராய்வீர்கள். அனுபவம் வாய்ந்தவர்களிடம் நிதி ஆலோசனை பெற்று, நல்ல முதலீடுகளை மேற்கொள்வீர்கள். குடும்பத்திற்கான செலவுகளை திறம்பட நிர்வகிப்பீர்கள். பணப்பற்றாக்குறை இன்றி, அனைத்து தேவைகளையும் பூர்த்தி செய்வீர்கள். வீண் செலவுகளைத் தவிர்த்து, எதிர்காலத்திற்கான சேமிப்பில் கவனம் செலுத்துவீர்கள்.",
    "finance_en": "Financial stability will prevail. Avenues for increased income will emerge. You will explore new savings plans. By seeking financial advice from experienced individuals, you will make sound investments. Family expenses will be managed efficiently. You will meet all needs without any financial shortage. You will avoid unnecessary expenses and focus on savings for the future.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். புத்துணர்ச்சியுடன் இருப்பீர்கள். வழக்கமான உடற்பயிற்சிகளை மேற்கொள்வது நல்லது. சத்தான உணவுப் பழக்கத்தை கடைப்பிடித்து, நோயெதிர்ப்பு சக்தியை மேம்படுத்துவீர்கள். மன அமைதிக்கான தியானம் அல்லது யோகா செய்வது நன்மை பயக்கும். போதிய ஓய்வு எடுத்துக்கொண்டு, ஆரோக்கியமான வாழ்க்கை முறையை பின்பற்றுவீர்கள். சிறிய உடல்நலக் குறைபாடுகளும் எளிதில் குணமாகும்.",
    "health_en": "Your physical health will be excellent. You will feel rejuvenated. It is good to engage in regular exercises. By following a nutritious diet, you will improve your immunity. Practicing meditation or yoga for mental peace will be beneficial. You will take adequate rest and follow a healthy lifestyle. Minor health issues will also heal easily.",
    "lucky_number": "1",
    "lucky_color_ta": "பொன் நிறம்",
    "lucky_color_en": "Golden"
  },
  {
    "sign_ta": "ரிஷபம்",
    "sign_en": "Taurus",
    "date": "01-03-2026",
    "prediction_ta": "இன்று ஞாயிற்றுக்கிழமை, சூரியனின் ஆட்சி செய்யும் நாள் என்பதால், ரிஷப ராசிக்காரர்களுக்கு மன உறுதி மற்றும் நிலைத்தன்மை அதிகரிக்கும். உங்கள் இலக்குகளை அடைய விடாமுயற்சியுடன் செயல்படுவீர்கள். இன்று நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலிலும் நேர்மறை ஆற்றல் நிறைந்திருக்கும். குடும்ப உறவுகளில் இணக்கம் கூடும். குறிப்பாக பெற்றோர்களுடனும், வயதில் மூத்தவர்களுடனும் நல்லுறவு பேணுவது உங்களுக்கு நன்மைகளைத் தரும். அவர்களின் ஆசிர்வாதங்களும் வழிகாட்டுதல்களும் உங்கள் முன்னேற்றத்திற்கு துணை நிற்கும். உங்கள் பேச்சு மற்றும் செயல்களில் தெளிவும், உறுதியும் இருக்கும். இது மற்றவர்களுக்கு உங்களின் மீதான நம்பிக்கையை அதிகரிக்கும். கலை மற்றும் அழகு சார்ந்த விஷயங்களில் ஆர்வம் கூடும். மனதிற்கு பிடித்த கலைச் செயல்களில் ஈடுபடுவது நிம்மதியையும் மகிழ்ச்சியையும் தரும். புதிய நண்பர்களை உருவாக்குவதற்கும், சமூக வட்டாரத்தை விரிவுபடுத்துவதற்கும் இது ஒரு நல்ல நாள். பழைய நண்பர்களுடன் சந்திப்புகள் நிகழ்ந்து மகிழ்வீர்கள். உங்கள் உள்மனதில் உதிக்கும் ஆக்கப்பூர்வமான எண்ணங்களுக்கு செயல்வடிவம் கொடுப்பதற்கான வாய்ப்புகள் இன்று அமையும். சவால்களை தைரியமாக எதிர்கொண்டு, அவற்றை சாதகமாக மாற்றும் ஆற்றல் உங்களுக்கு இருக்கும். இன்று எடுக்கும் முடிவுகள் நீண்ட காலத்திற்கு நற்பலன்களைத் தரும். பொருளாதார ரீதியாக ஸ்திரமான நிலை காணப்படும். முதலீடுகள் தொடர்பான விஷயங்களில் நிதானமாகச் செயல்பட்டு நல்ல முடிவுகளை எடுப்பீர்கள். உடல் ஆரோக்கியத்தில் கவனம் செலுத்தி, மனதை ஒருமுகப்படுத்தும் பயிற்சிகளில் ஈடுபடுவது நல்லது. ஆன்மீகச் சிந்தனைகள் அதிகரிக்கும். தர்ம காரியங்களில் ஈடுபடுவதன் மூலம் மன அமைதி கிடைக்கும். உங்கள் விடாமுயற்சிக்கு ஏற்ப பலன்கள் நிச்சயம் கிடைக்கும். சமூகத்தில் உங்கள் மதிப்பு உயரும். நேர்மறையான கண்ணோட்டத்துடன் செயல்பட்டு, இன்றைய நாளை பயனுள்ளதாக்குவீர்கள். உங்கள் செயல்களுக்கு உரிய அங்கீகாரம் கிடைக்கும். தன்னம்பிக்கையுடன் செயல்பட்டு, தடைகளை தாண்டி முன்னேறுவீர்கள். இன்று குடும்பத்தில் மகிழ்ச்சியும், அமைதியும் நிலவும். உங்கள் தனிப்பட்ட திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்புகள் அமையும்.",
    "prediction_en": "Today, being Sunday, a day ruled by the Sun, your mental resolve and stability will increase. You will work with perseverance to achieve your goals. Every action you undertake today will be filled with positive energy. Harmony in family relationships will grow. Especially, maintaining good relationships with parents and elders will bring you benefits. Their blessings and guidance will support your progress. There will be clarity and firmness in your speech and actions, which will increase others' trust in you. Interest in arts and aesthetics will increase. Engaging in creative activities you enjoy will bring peace and happiness. This is a good day to make new friends and expand your social circle. You will enjoy meeting old friends. Opportunities will arise today to give form to the creative thoughts that emerge within you. You will have the ability to bravely face challenges and turn them into advantages. Decisions made today will yield good results in the long run. A stable financial situation will be observed. You will act carefully in investment-related matters and make good decisions. It is good to focus on physical health and engage in mind-focusing exercises. Spiritual thoughts will increase. Engaging in charitable deeds will bring mental peace. You will surely receive rewards according to your perseverance. Your reputation in society will increase. You will make today productive by acting with a positive outlook. Your actions will receive due recognition. You will act with self-confidence, overcoming obstacles and progressing. Today, happiness and peace will prevail in the family. Good opportunities will arise to showcase your individual talents.",
    "career_ta": "பணியிடத்தில் உங்கள் உழைப்புக்கு உரிய அங்கீகாரம் கிடைக்கும். உங்கள் திட்டங்கள் மேலதிகாரிகளால் ஏற்றுக்கொள்ளப்படும். புதிய பொறுப்புகள் உங்களைத் தேடி வரும். சக ஊழியர்களுடன் இணக்கமான சூழல் நிலவும். பொறுமையுடன் செயல்பட்டு சவால்களைச் சமாளிப்பீர்கள். இன்று முக்கியமான முடிவுகளை எடுப்பதற்கு உகந்த நாள். உங்கள் நேர்மையான அணுகுமுறை பாராட்டைப் பெறும். வேலையில் திருப்தி ஏற்படும்.",
    "career_en": "Your hard work in the workplace will receive due recognition. Your plans will be accepted by superiors. New responsibilities will come your way. A harmonious environment will prevail with colleagues. You will deal with challenges patiently. Today is an opportune day to make important decisions. Your honest approach will receive praise. Satisfaction in work will arise.",
    "finance_ta": "பொருளாதார நிலை ஸ்திரமாக இருக்கும். சேமிப்பு அதிகரிக்கும் வாய்ப்புகள் உண்டு. நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். புத்திசாலித்தனமாக நிதி திட்டமிடலை மேற்கொள்வீர்கள். தேவையற்ற செலவுகளைத் தவிர்த்து, குடும்பத்தின் நிதி பாதுகாப்பை உறுதி செய்வீர்கள். அசையா சொத்துக்கள் தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். நிதி ஆதாயம் தரும் வாய்ப்புகள் இன்று உருவாகும்.",
    "finance_en": "The financial situation will be stable. There are chances for savings to increase. You will think about long-term investments. You will engage in smart financial planning. By avoiding unnecessary expenses, you will ensure the financial security of your family. Good progress will be seen in matters related to immovable property. Opportunities for financial gains will arise today.",
    "health_ta": "ஆரோக்கியம் சிறப்பாக இருக்கும். உடல் சோர்வு நீங்கி புத்துணர்ச்சி பெறுவீர்கள். தினசரி உடற்பயிற்சி மற்றும் யோகா செய்வது உங்கள் உடலை உறுதிப்படுத்தும். மன அழுத்தத்தை குறைப்பதற்கான வழிமுறைகளைக் கையாள்வீர்கள். புதிய உணவுப் பழக்கவழக்கங்களை மேற்கொள்வதன் மூலம் மேலும் ஆரோக்கியம் மேம்படும். போதுமான ஓய்வு எடுத்துக்கொள்வது மனதையும் உடலையும் சீராக வைக்கும்.",
    "health_en": "Health will be excellent. Physical fatigue will disappear, and you will feel refreshed. Regular exercise and yoga will strengthen your body. You will adopt methods to reduce stress. By adopting new dietary habits, health will further improve. Taking adequate rest will keep your mind and body balanced.",
    "lucky_number": "6",
    "lucky_color_ta": "வெளிர் நீலம்",
    "lucky_color_en": "Light Blue"
  },
  {
    "sign_ta": "மிதுனம்",
    "sign_en": "Gemini",
    "date": "01-03-2026",
    "prediction_ta": "இன்று சூரியனின் ஆதிக்க நாளான ஞாயிற்றுக்கிழமை, மிதுன ராசிக்காரர்களுக்கு புத்துணர்ச்சியையும், புதிய சிந்தனைகளையும் வழங்கும். உங்கள் தகவல்தொடர்பு திறன் மேலோங்கும். நீங்கள் பேசும் ஒவ்வொரு வார்த்தையிலும் தெளிவும், நேர்மறையும் நிறைந்திருக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்துவதற்கும் இது ஒரு சிறந்த நாள். உங்கள் படைப்புத்திறன் வெளிப்படும் வாய்ப்புகள் உருவாகும். சமூக வலைத்தளங்கள் அல்லது ஊடகங்கள் மூலம் உங்கள் கருத்துக்களைப் பகிர்ந்துகொள்வது பாராட்டைப் பெறும். குடும்ப உறுப்பினர்களுடன் கலகலப்பான உரையாடல்களில் ஈடுபடுவீர்கள். குறிப்பாக மூத்தவர்களின் ஆலோசனைகள் உங்களுக்கு பயனுள்ளதாக இருக்கும். உங்கள் தந்தை அல்லது வழிகாட்டியின் ஆதரவு உங்களுக்கு மன பலத்தை அளிக்கும். நீண்ட நாட்களாக நீங்கள் மனதில் வைத்திருந்த ஒரு விஷயத்தை இன்று செயல்படுத்துவதற்கான உத்வேகம் கிடைக்கும். புதிய நண்பர்களை சந்திப்பதற்கும், உங்கள் சமூக வட்டாரத்தை விரிவுபடுத்துவதற்கும் இது ஒரு நல்ல நாள். மனதிற்கு அமைதி தரும் ஆன்மீகப் புத்தகங்களைப் படிப்பது அல்லது தியானத்தில் ஈடுபடுவது நல்லது. உங்கள் மனதை ஒருமுகப்படுத்தி, தெளிவாகச் சிந்திக்க இது உதவும். பயணங்களுக்கான திட்டங்களை வகுப்பதற்கும், புதிய இடங்களை ஆராய்வதற்கும் ஆர்வம் காட்டுவீர்கள். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் எதிர்காலத்திற்கு சாதகமாக அமையும். சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். உங்கள் திறமைகளை வெளிப்படுத்தவும், உங்கள் தனிப்பட்ட அடையாளத்தை நிலைநிறுத்தவும் இந்த நாள் உங்களுக்கு வாய்ப்பளிக்கும். உங்கள் நம்பிக்கையும், துணிச்சலும் மற்றவர்களுக்கு முன்மாதிரியாக அமையும். எந்த ஒரு தடங்கலையும் எளிதாகக் கடந்து முன்னேறுவீர்கள். உங்கள் உள்ளுணர்வு வழிகாட்டுதலைப் பின்பற்றுவது பல நன்மைகளைத் தரும். நேர்மறையான அணுகுமுறையுடன் செயல்பட்டு, இன்றைய நாளை முழுமையாகப் பயன்படுத்துங்கள். உங்கள் இலக்குகளை அடைய விடாமுயற்சியுடன் செயல்பட்டால், வெற்றி நிச்சயம். உங்களுடைய புதிய முயற்சிகளுக்கு நல்ல ஆதரவு கிடைக்கும்.",
    "prediction_en": "Today, being Sunday, a day ruled by the Sun, will bring rejuvenation and new thoughts to Gemini natives. Your communication skills will excel. Every word you speak will be filled with clarity and positivity. This is an excellent day to learn new things and enhance your knowledge. Opportunities to express your creativity will arise. Sharing your thoughts through social media or other platforms will be praised. You will engage in lively conversations with family members. Especially, the advice of elders will be beneficial to you. The support of your father or mentor will give you mental strength. You will gain the inspiration today to implement something you have had in mind for a long time. This is a good day to meet new friends and expand your social circle. It is good to read spiritual books that bring peace of mind or engage in meditation. This will help you focus your mind and think clearly. You will show interest in planning trips and exploring new places. All decisions you make today will be favorable for your future. You will be ready to face challenges. This day will provide you with opportunities to express your talents and establish your unique identity. Your confidence and courage will serve as an example to others. You will easily overcome any hindrance and progress. Following your intuition will bring many benefits. Act with a positive approach and make the most of today. If you work diligently to achieve your goals, success is certain. You will receive good support for your new endeavors.",
    "career_ta": "பணியிடத்தில் உங்கள் தகவல்தொடர்பு திறன் சிறப்பான பலனைத் தரும். புதிய திட்டங்களை முன்னின்று நடத்தும் வாய்ப்புகள் கிடைக்கும். உங்கள் கருத்துக்கள் மேலதிகாரிகளால் ஏற்றுக்கொள்ளப்படும். குழுப்பணிகளில் சிறப்பாக செயல்படுவீர்கள். புதிய திறமைகளை கற்றுக்கொண்டு, உங்கள் வேலையில் முன்னேற்றம் காண்பீர்கள். சக ஊழியர்களுடன் இணக்கமான உறவு நீடிக்கும். உங்கள் புத்திசாலித்தனம் பாராட்டைப் பெறும். இன்று பல புதிய யோசனைகள் உதிக்கும்.",
    "career_en": "Your communication skills will yield excellent results in the workplace. You will get opportunities to lead new projects. Your ideas will be accepted by superiors. You will perform well in team projects. You will learn new skills and see progress in your work. A harmonious relationship with colleagues will continue. Your intelligence will be praised. Many new ideas will emerge today.",
    "finance_ta": "நிதிநிலை சீராக இருக்கும். வருமானத்தை அதிகரிக்கும் புதிய வழிகளை ஆராய்வீர்கள். சிறு சேமிப்புகள் பெரிய பலன்களைத் தரும். செலவுகளைக் கட்டுப்படுத்தி, எதிர்காலத்திற்கான நிதி திட்டமிடலை மேற்கொள்வீர்கள். குடும்பத்தின் நிதி பாதுகாப்புக்கு முன்னுரிமை அளிப்பீர்கள். புதிய முதலீடுகளுக்கான வாய்ப்புகளை இன்று கண்டறிவீர்கள். சிக்கனமான அணுகுமுறை பலனளிக்கும்.",
    "finance_en": "The financial situation will be stable. You will explore new ways to increase income. Small savings will yield big benefits. You will control expenses and undertake financial planning for the future. You will prioritize the financial security of your family. You will identify opportunities for new investments today. A frugal approach will be beneficial.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். மனதை அமைதியாக வைத்துக்கொள்வதன் மூலம் உடல் சோர்வு நீங்கும். யோகா மற்றும் தியானம் செய்வது மனதிற்கும் உடலிற்கும் புத்துணர்ச்சி அளிக்கும். சத்தான உணவுகளை உட்கொண்டு, உடலை சுறுசுறுப்பாக வைத்துக்கொள்வீர்கள். போதிய ஓய்வு எடுத்துக்கொள்வது அவசியம். புதிய உடற்பயிற்சிகளை மேற்கொள்வது நல்லது. நேர்மறை எண்ணங்கள் ஆரோக்கியத்தை மேம்படுத்தும்.",
    "health_en": "Physical health will improve. By keeping the mind peaceful, physical fatigue will disappear. Practicing yoga and meditation will rejuvenate both mind and body. You will consume nutritious foods and keep your body active. Adequate rest is essential. It is good to undertake new exercises. Positive thoughts will enhance health.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "01-03-2026",
    "prediction_ta": "இன்று ஞாயிற்றுக்கிழமை, சூரியனின் ஆதிக்கம் நிறைந்த நாள் என்பதால், கடக ராசிக்காரர்களுக்கு உணர்ச்சிபூர்வமான சமநிலையும், குடும்பத்தில் மகிழ்ச்சியும் பெருகும். உங்கள் உள்மன சக்தி அதிகரிக்கும். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தாய் அல்லது தாய்வழி உறவுகளுடன் நல்லிணக்கம் மேலோங்கும். உங்கள் இல்லத்தில் அமைதியும், நேர்மறை ஆற்றலும் நிறைந்திருக்கும். தந்தையின் அல்லது வழிகாட்டியின் ஆலோசனைகள் உங்களுக்கு மிகுந்த பலனளிக்கும். அவர்களின் வழிகாட்டுதல்களைப் பின்பற்றுவதன் மூலம் நீங்கள் சரியான பாதையில் பயணிப்பீர்கள். உங்கள் உணர்வுகளை வெளிப்படுத்துவதற்கும், அன்பானவர்களுடன் நெருக்கமான தருணங்களைப் பகிர்ந்து கொள்வதற்கும் இது ஒரு சிறந்த நாள். சமூகத்தில் உங்கள் மதிப்பு உயரும். புதிய பொறுப்புகளை ஏற்றுக்கொள்வதற்குரிய மன தைரியம் உங்களுக்குள் உருவாகும். மற்றவர்களுக்கு உதவுவதில் மனநிறைவு பெறுவீர்கள். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது வீட்டில் விளக்கேற்றி வழிபடுவது மன அமைதியைத் தரும். நீண்டகாலமாக நிலுவையில் உள்ள குடும்ப விவகாரங்களுக்கு இன்று ஒரு தீர்வு காணலாம். உங்கள் உள்மனதில் உதிக்கும் ஆக்கப்பூர்வமான எண்ணங்களுக்கு செயல்வடிவம் கொடுப்பதற்கான வாய்ப்புகள் அமையும். சவால்களை தைரியமாக எதிர்கொண்டு, அவற்றை வெற்றியாக மாற்றும் ஆற்றல் உங்களுக்கு இருக்கும். இன்று எடுக்கும் முடிவுகள் உங்கள் எதிர்காலத்திற்கு நன்மை பயக்கும். நிதிநிலையில் ஸ்திரமான நிலை காணப்படும். சேமிப்புக்கான புதிய வழிகளை ஆராய்வீர்கள். புதிய முதலீடுகளை மேற்கொள்வதற்குரிய வாய்ப்புகள் கிடைக்கும். உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம். சத்தான உணவு மற்றும் போதுமான ஓய்வு உங்களுக்கு புத்துணர்ச்சி அளிக்கும். மனதை அமைதியாக வைத்துக்கொள்ள தியானம் அல்லது யோகா செய்வது நல்லது. வீண் விவாதங்களைத் தவிர்த்து அமைதியான முறையில் உங்கள் கருத்துக்களை எடுத்துரைப்பது நல்ல பலனைத் தரும். உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணித்து வெற்றி பெறுவீர்கள். தன்னம்பிக்கையுடன் செயல்பட்டு, எந்த தடைகளையும் தகர்த்தெறிந்து முன்னேறுவீர்கள். உங்கள் உள்ளுணர்வு கூறுவதைக் கேட்டு செயல்பட்டால், இன்று பல நன்மைகள் உண்டாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு, உங்கள் திறமைகளை முழுமையாகப் பயன்படுத்துங்கள். இன்றைய நாள் உங்களுக்கு வெற்றியையும் மனமகிழ்ச்சியையும் தரும்.",
    "prediction_en": "Today, being Sunday, a day full of Sun's influence, Cancer natives will experience emotional balance and increased happiness in the family. Your inner strength will grow. Harmony will prevail with family members, especially with your mother or maternal relatives. Your home will be filled with peace and positive energy. The advice of your father or mentor will be highly beneficial to you. By following their guidance, you will travel on the right path. This is an excellent day to express your feelings and share intimate moments with loved ones. Your social standing will increase. The courage to take on new responsibilities will emerge within you. You will find contentment in helping others. Spiritual inclination will increase. Visiting temples or lighting lamps at home and worshipping will bring mental peace. A solution for long-pending family matters may be found today. Opportunities will arise to give form to the creative thoughts that emerge within you. You will have the ability to bravely face challenges and turn them into victories. Decisions made today will be beneficial for your future. A stable financial situation will be observed. You will explore new avenues for savings. Opportunities for new investments will arise. It is important to pay attention to physical health. Nutritious food and adequate rest will rejuvenate you. It is good to practice meditation or yoga to keep the mind peaceful. Avoiding futile arguments and expressing your views calmly will yield good results. You will travel determinedly towards your goals and achieve success. You will act with self-confidence, overcoming any obstacles to progress. If you act by listening to your intuition, many benefits will arise today. Act with positive thoughts and fully utilize your talents. Today will bring you success and joy.",
    "career_ta": "பணியிடத்தில் உங்கள் மனசாட்சிக்கு மதிப்பளித்து செயல்படுவீர்கள். உங்கள் பொறுப்புணர்ச்சி மேலதிகாரிகளால் பாராட்டப்படும். புதிய பொறுப்புகளை திறம்பட கையாள்வீர்கள். சக ஊழியர்களுடன் இணக்கமான உறவு நீடிக்கும். உங்கள் உள்ளுணர்வு வழிகாட்டுதல் மூலம் சிறந்த முடிவுகளை எடுப்பீர்கள். உங்கள் படைப்புத்திறன் வெளிப்படும் வாய்ப்புகள் உருவாகும். இன்று உங்கள் முயற்சிகளுக்கு நல்ல பலன் கிடைக்கும்.",
    "career_en": "In the workplace, you will act by valuing your conscience. Your sense of responsibility will be appreciated by superiors. You will handle new responsibilities efficiently. A harmonious relationship with colleagues will continue. You will make excellent decisions through your intuitive guidance. Opportunities for your creativity to emerge will arise. Today, your efforts will yield good results.",
    "finance_ta": "நிதிநிலை சீராக இருக்கும். குடும்பத்திற்கான நிதி திட்டமிடலை சிறப்பாக மேற்கொள்வீர்கள். சேமிப்பு அதிகரிக்கும் வாய்ப்புகள் உண்டு. அசையா சொத்துக்கள் தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். தேவையற்ற செலவுகளைக் கட்டுப்படுத்துவீர்கள். புதிய முதலீடுகளுக்கான வாய்ப்புகள் இன்று உருவாகும். வருமானம் ஈட்டும் வழிகள் அதிகரிக்கும்.",
    "finance_en": "The financial situation will be stable. You will undertake excellent financial planning for the family. There are chances for savings to increase. Good progress will be seen in matters related to immovable property. You will control unnecessary expenses. Opportunities for new investments will arise today. Avenues for earning income will increase.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மன அமைதிக்கு முக்கியத்துவம் அளிப்பீர்கள். சத்தான உணவுப் பழக்கத்தை கடைப்பிடிப்பது நல்லது. யோகா மற்றும் தியானம் செய்வது மனதையும் உடலையும் புத்துணர்ச்சியுடன் வைக்கும். போதுமான ஓய்வு எடுத்துக்கொள்வது அவசியம். நேர்மறையான எண்ணங்கள் உடல்நலத்தை மேம்படுத்தும். பழைய வியாதிகளில் இருந்து நிவாரணம் கிடைக்கும்.",
    "health_en": "Physical health will be stable. You will prioritize mental peace. It is good to follow a nutritious diet. Practicing yoga and meditation will keep both mind and body refreshed. Adequate rest is essential. Positive thoughts will improve health. Relief from old ailments will be found.",
    "lucky_number": "2",
    "lucky_color_ta": "வெள்ளை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "சிம்மம்",
    "sign_en": "Leo",
    "date": "01-03-2026",
    "prediction_ta": "இன்று சிம்ம ராசிக்காரர்களுக்கு சூரியனின் ஆதிக்க நாளான ஞாயிற்றுக்கிழமை என்பதால், அவர்களின் இயல்பான தலைமைப் பண்பும், ஆளுமைத் திறனும் உச்சத்தை அடையும். தன்னம்பிக்கையும், துணிச்சலும் உங்கள் ஒவ்வொரு செயலிலும் வெளிப்படும். நீங்கள் முன்னின்று மேற்கொள்ளும் அனைத்து முயற்சிகளிலும் வெற்றி கிடைக்கும். உங்கள் வார்த்தைகளுக்கு மதிப்பும், உங்கள் கருத்துக்களுக்கு அங்கீகாரமும் கிடைக்கும். தந்தை அல்லது தந்தை போன்றவர்களுடன் இணக்கமான உறவு நிலவும். அவர்களின் ஆதரவும், வழிகாட்டுதலும் உங்கள் முன்னேற்றத்திற்கு மிகவும் பயனுள்ளதாக இருக்கும். உங்களின் நேர்மறையான அணுகுமுறை மற்றவர்களுக்கு உத்வேகம் அளிக்கும். உங்கள் படைப்புத்திறனை வெளிப்படுத்துவதற்கும், புதிய கலைப் படைப்புகளில் ஈடுபடுவதற்கும் இது ஒரு நல்ல நாள். சமூகத்தில் உங்கள் மதிப்பு உயரும். புதிய பொறுப்புகளை ஏற்றுக்கொண்டு, அவற்றை திறம்பட நிறைவேற்றுவீர்கள். சமூக சேவைகளில் ஈடுபடுவதன் மூலம் மனநிறைவு பெறுவீர்கள். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானத்தில் ஈடுபடுவது மன அமைதியைத் தரும். நீண்ட நாட்களாக நீங்கள் மனதில் வைத்திருந்த ஒரு விஷயத்தை இன்று செயல்படுத்துவதற்கான உத்வேகம் கிடைக்கும். சவால்களை தைரியமாக எதிர்கொண்டு, அவற்றை சாதகமாக மாற்றும் ஆற்றல் உங்களுக்கு இருக்கும். இன்று எடுக்கும் முடிவுகள் நீண்ட காலத்திற்கு நற்பலன்களைத் தரும். பொருளாதார ரீதியாக ஸ்திரமான நிலை காணப்படும். முதலீடுகள் தொடர்பான விஷயங்களில் நிதானமாகச் செயல்பட்டு நல்ல முடிவுகளை எடுப்பீர்கள். உடல் ஆரோக்கியத்தில் கவனம் செலுத்தி, மனதை ஒருமுகப்படுத்தும் பயிற்சிகளில் ஈடுபடுவது நல்லது. வீண் விவாதங்களைத் தவிர்த்து அமைதியான முறையில் உங்கள் கருத்துக்களை எடுத்துரைப்பது நல்ல பலனைத் தரும். உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணித்து வெற்றி பெறுவீர்கள். தன்னம்பிக்கையுடன் செயல்பட்டு, எந்த தடைகளையும் தகர்த்தெறிந்து முன்னேறுவீர்கள். உங்கள் உள்ளுணர்வு கூறுவதைக் கேட்டு செயல்பட்டால், இன்று பல நன்மைகள் உண்டாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு, உங்கள் திறமைகளை முழுமையாகப் பயன்படுத்துங்கள். இன்றைய நாள் உங்களுக்கு வெற்றியையும் மனமகிழ்ச்சியையும் தரும்.",
    "prediction_en": "Today, for Leo natives, being Sunday, a day ruled by the Sun, their inherent leadership qualities and charisma will reach their peak. Self-confidence and courage will be evident in every action you take. You will achieve success in all endeavors you undertake. Your words will be valued, and your opinions will be recognized. A harmonious relationship will prevail with your father or father figures. Their support and guidance will be highly beneficial for your progress. Your positive approach will inspire others. This is a good day to express your creativity and engage in new artistic pursuits. Your social standing will increase. You will take on new responsibilities and fulfill them efficiently. You will find contentment by engaging in social services. Spiritual inclination will increase. Visiting temples or engaging in meditation will bring mental peace. You will gain the inspiration today to implement something you have had in mind for a long time. You will have the ability to bravely face challenges and turn them into advantages. Decisions made today will yield good results in the long run. A stable financial situation will be observed. You will act carefully in investment-related matters and make good decisions. It is good to focus on physical health and engage in mind-focusing exercises. Avoiding futile arguments and expressing your views calmly will yield good results. You will travel determinedly towards your goals and achieve success. You will act with self-confidence, overcoming any obstacles to progress. If you act by listening to your intuition, many benefits will arise today. Act with positive thoughts and fully utilize your talents. Today will bring you success and joy.",
    "career_ta": "உங்கள் தலைமைப் பண்பு பணியிடத்தில் சிறப்பாக வெளிப்படும். மேலதிகாரிகளின் முழு ஆதரவையும் பெறுவீர்கள். புதிய திட்டங்களை முன்னின்று நடத்தும் வாய்ப்புகள் கிடைக்கும். உங்கள் கருத்துக்கள் ஏற்றுக்கொள்ளப்பட்டு செயல்படுத்தப்படும். சக ஊழியர்களுடன் இணக்கமான சூழல் நிலவும். உங்கள் கடின உழைப்புக்குரிய அங்கீகாரம் கிடைக்கும். புதிய பொறுப்புகளை திறம்பட கையாள்வீர்கள். உங்கள் திறமை வெளிப்படும் நாள்.",
    "career_en": "Your leadership qualities will be well-expressed in the workplace. You will receive full support from superiors. Opportunities to lead new projects will arise. Your ideas will be accepted and implemented. A harmonious environment will prevail with colleagues. Your hard work will receive due recognition. You will handle new responsibilities efficiently. A day for your talents to shine.",
    "finance_ta": "நிதிநிலை மிகவும் சிறப்பாக இருக்கும். வருமானம் அதிகரிக்கும் வழிகள் உருவாகும். புதிய முதலீடுகளை மேற்கொள்வதற்குரிய வாய்ப்புகள் கிடைக்கும். சேமிப்பு திட்டங்களை செயல்படுத்துவீர்கள். குடும்பத்திற்கான நிதி பாதுகாப்பை உறுதி செய்வீர்கள். அசையா சொத்துக்கள் தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். உங்கள் நிதி நிர்வாகத் திறன் பாராட்டைப் பெறும்.",
    "finance_en": "The financial situation will be very excellent. Avenues for increased income will emerge. Opportunities for new investments will arise. You will implement savings plans. You will ensure the financial security of your family. Good progress will be seen in matters related to immovable property. Your financial management skills will be praised.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். புத்துணர்ச்சியுடன் இருப்பீர்கள். வழக்கமான உடற்பயிற்சிகளை மேற்கொள்வது நல்லது. சத்தான உணவுப் பழக்கத்தை கடைப்பிடித்து, நோயெதிர்ப்பு சக்தியை மேம்படுத்துவீர்கள். மன அழுத்தத்தை குறைப்பதற்கான வழிமுறைகளைக் கையாள்வீர்கள். போதுமான ஓய்வு எடுத்துக்கொண்டு, ஆரோக்கியமான வாழ்க்கை முறையை பின்பற்றுவீர்கள். சூரிய ஒளி உடலில் படுவது நல்லது.",
    "health_en": "Physical health will be excellent. You will feel rejuvenated. It is good to engage in regular exercises. By following a nutritious diet, you will improve your immunity. You will adopt methods to reduce stress. You will take adequate rest and follow a healthy lifestyle. Sun exposure will be beneficial for the body.",
    "lucky_number": "1",
    "lucky_color_ta": "தங்க நிறம்",
    "lucky_color_en": "Gold"
  },
  {
    "sign_ta": "கன்னி",
    "sign_en": "Virgo",
    "date": "01-03-2026",
    "prediction_ta": "இன்று சூரியனின் ஆதிக்க நாளான ஞாயிற்றுக்கிழமை, கன்னி ராசிக்காரர்களுக்கு திட்டமிடுதல் மற்றும் பகுப்பாய்வு திறன்கள் அதிகரிக்கும். நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலிலும் துல்லியமும், நேர்மையும் நிறைந்திருக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்துவதற்கும் இது ஒரு சிறந்த நாள். உங்கள் தகவல்தொடர்பு திறன் மேலோங்கும். மற்றவர்களுக்கு பயனுள்ள ஆலோசனைகளை வழங்குவீர்கள். குடும்ப உறுப்பினர்களுடன், குறிப்பாக மூத்தவர்களுடன் நல்லுறவு பேணுவது உங்களுக்கு நன்மைகளைத் தரும். உங்கள் தந்தை அல்லது வழிகாட்டியின் ஆதரவும், வழிகாட்டுதலும் உங்கள் முன்னேற்றத்திற்கு துணை நிற்கும். உங்கள் தனிப்பட்ட திறமைகளை வெளிப்படுத்தவும், உங்கள் கருத்துக்களை தைரியமாக முன்வைக்கவும் உகந்த நாள். சமூகத்தில் உங்கள் மதிப்பு உயரும் வாய்ப்புகள் அதிகம். உங்கள் உற்சாகமான மனநிலை மற்றவர்களுக்கும் பரவி நேர்மறையான சூழலை உருவாக்கும். புதிய முயற்சிகளை மேற்கொள்ளவும், நீண்டகால திட்டங்களுக்கு அடிக்கல் நாட்டவும் இன்றைய தினம் மிகவும் பொருத்தமானது. உங்கள் மனம் அமைதியாகவும், எண்ணங்கள் தெளிவாகவும் இருக்கும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் போன்ற செயல்களில் ஈடுபடுவது மனதிற்கு மேலும் புத்துணர்ச்சி அளிக்கும். சமூக சேவைகளில் ஈடுபடுவதன் மூலம் மனநிறைவு பெறுவீர்கள். உங்களுக்குள் இருக்கும் படைப்புத்திறனை வெளிக்கொண்டுவர இது ஒரு பொன்னான வாய்ப்பு. கலை சார்ந்த துறைகளில் உள்ளவர்களுக்கு சிறப்பான அங்கீகாரம் கிடைக்கும். உங்கள் நண்பர்கள் மற்றும் உறவினர்களின் ஆதரவு உங்களுக்கு பலமாக அமையும். எதிர்காலத்திற்கான திட்டங்களை வகுத்து செயல்பட இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்துவது மிகவும் முக்கியம். உடற்பயிற்சி மற்றும் சத்தான உணவுப் பழக்கம் உங்களுக்கு மேலும் புத்துணர்ச்சி அளிக்கும். வீண் விவாதங்களைத் தவிர்த்து அமைதியான முறையில் உங்கள் கருத்துக்களை எடுத்துரைப்பது நல்ல பலனைத் தரும். உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணித்து வெற்றி பெறுவீர்கள். தன்னம்பிக்கையுடன் செயல்பட்டு, எந்த தடைகளையும் தகர்த்தெறிந்து முன்னேறுவீர்கள். உங்கள் உள்ளுணர்வு கூறுவதைக் கேட்டு செயல்பட்டால், இன்று பல நன்மைகள் உண்டாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு, உங்கள் திறமைகளை முழுமையாகப் பயன்படுத்துங்கள். இன்றைய நாள் உங்களுக்கு வெற்றியையும் மனமகிழ்ச்சியையும் தரும்.",
    "prediction_en": "Today, being Sunday, a day ruled by the Sun, Virgo natives will experience an increase in planning and analytical skills. Precision and integrity will be evident in every action you undertake. This is an excellent day to learn new things and enhance your knowledge. Your communication skills will excel. You will provide useful advice to others. Maintaining good relationships with family members, especially elders, will bring you benefits. The support and guidance of your father or mentor will aid your progress. It is an opportune day to express your individual talents and bravely put forth your views. There are high chances for your social status to rise. Your enthusiastic state of mind will spread to others, creating a positive atmosphere. Today is highly suitable for undertaking new ventures and laying foundations for long-term plans. Your mind will be peaceful, and thoughts will be clear. Spiritual inclination will increase. Engaging in activities like temple visits or meditation will provide further rejuvenation to the mind. You will gain contentment by involving yourself in social services. This is a golden opportunity to bring forth your inherent creativity. Those in artistic fields will receive special recognition. The support of your friends and relatives will be a strength for you. This is an excellent day to formulate and implement plans for the future. Paying attention to your health is crucial. Exercise and a nutritious diet will provide you with further vitality. Avoiding futile arguments and expressing your views calmly will yield good results. You will travel determinedly towards your goals and achieve success. You will act with self-confidence, overcoming any obstacles to progress. If you act by listening to your intuition, many benefits will arise today. Act with positive thoughts and fully utilize your talents. Today will bring you success and joy.",
    "career_ta": "பணியிடத்தில் உங்கள் திட்டமிடுதல் திறன் மற்றும் கடின உழைப்பு அங்கீகரிக்கப்படும். புதிய பொறுப்புகளை திறம்பட கையாள்வீர்கள். மேலதிகாரிகளின் பாராட்டைப் பெறுவீர்கள். உங்கள் துல்லியமான அணுகுமுறைக்கு நல்ல பலன் கிடைக்கும். சக ஊழியர்களுடன் இணக்கமான சூழல் நிலவும். புதிய விஷயங்களைக் கற்றுக்கொள்ள ஆர்வத்துடன் இருப்பீர்கள். உங்களின் அறிவு கூர்மை பல பிரச்சினைகளைத் தீர்க்க உதவும். வேலையில் திருப்தி ஏற்படும்.",
    "career_en": "Your planning skills and hard work will be recognized in the workplace. You will handle new responsibilities efficiently. You will receive praise from superiors. Your precise approach will yield good results. A harmonious environment will prevail with colleagues. You will be eager to learn new things. Your sharp intellect will help solve many problems. Satisfaction in work will arise.",
    "finance_ta": "நிதிநிலை சீராக இருக்கும். சேமிப்பு அதிகரிக்கும் வழிகள் உருவாகும். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். புத்திசாலித்தனமாக நிதி திட்டமிடலை மேற்கொள்வீர்கள். தேவையற்ற செலவுகளைத் தவிர்த்து, குடும்பத்தின் நிதி பாதுகாப்பை உறுதி செய்வீர்கள். அசையா சொத்துக்கள் தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். நிதி ஆதாயம் தரும் வாய்ப்புகள் இன்று உருவாகும்.",
    "finance_en": "The financial situation will be stable. Avenues for increased income will emerge. You will think about new investments. You will engage in smart financial planning. By avoiding unnecessary expenses, you will ensure the financial security of your family. Good progress will be seen in matters related to immovable property. Opportunities for financial gains will arise today.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். மன அமைதிக்கு முக்கியத்துவம் அளிப்பீர்கள். சத்தான உணவுப் பழக்கத்தை கடைப்பிடிப்பது நல்லது. யோகா மற்றும் தியானம் செய்வது மனதையும் உடலையும் புத்துணர்ச்சியுடன் வைக்கும். போதுமான ஓய்வு எடுத்துக்கொள்வது அவசியம். புதிய உடற்பயிற்சிகளை மேற்கொள்வது நல்லது. நேர்மறை எண்ணங்கள் ஆரோக்கியத்தை மேம்படுத்தும்.",
    "health_en": "Physical health will improve. You will prioritize mental peace. It is good to follow a nutritious diet. Practicing yoga and meditation will keep both mind and body refreshed. Adequate rest is essential. It is good to undertake new exercises. Positive thoughts will enhance health.",
    "lucky_number": "5",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "01-03-2026",
    "prediction_ta": "இன்று சூரியனின் ஆதிக்க நாளான ஞாயிற்றுக்கிழமை என்பதால், துலாம் ராசிக்காரர்களுக்கு நல்லிணக்கமும், சமநிலையும் மேலோங்கும். உங்கள் உறவுகளில் தெளிவு பிறக்கும். பிறருடன் இணக்கமான முறையில் பழகி, நல்லுறவுகளை மேம்படுத்துவீர்கள். புதிய நண்பர்களை உருவாக்குவதற்கும், சமூக வட்டாரத்தை விரிவுபடுத்துவதற்கும் இது ஒரு நல்ல நாள். உங்கள் பேச்சு மற்றும் செயல்களில் நேர்மையும், நீதியும் நிறைந்திருக்கும். இது மற்றவர்களுக்கு உங்களின் மீதான நம்பிக்கையை அதிகரிக்கும். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தந்தை அல்லது மூத்தவர்களுடன் சுமூகமான உறவு நீடிக்கும். அவர்களின் வழிகாட்டுதல்கள் உங்கள் முன்னேற்றத்திற்கு துணை நிற்கும். உங்கள் தனிப்பட்ட திறமைகளை வெளிப்படுத்தவும், உங்கள் கருத்துக்களை தைரியமாக முன்வைக்கவும் உகந்த நாள். சமூகத்தில் உங்கள் மதிப்பு உயரும் வாய்ப்புகள் அதிகம். உங்கள் உற்சாகமான மனநிலை மற்றவர்களுக்கும் பரவி நேர்மறையான சூழலை உருவாக்கும். புதிய முயற்சிகளை மேற்கொள்ளவும், நீண்டகால திட்டங்களுக்கு அடிக்கல் நாட்டவும் இன்றைய தினம் மிகவும் பொருத்தமானது. உங்கள் மனம் அமைதியாகவும், எண்ணங்கள் தெளிவாகவும் இருக்கும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் போன்ற செயல்களில் ஈடுபடுவது மனதிற்கு மேலும் புத்துணர்ச்சி அளிக்கும். சமூக சேவைகளில் ஈடுபடுவதன் மூலம் மனநிறைவு பெறுவீர்கள். உங்களுக்குள் இருக்கும் படைப்புத்திறனை வெளிக்கொண்டுவர இது ஒரு பொன்னான வாய்ப்பு. கலை சார்ந்த துறைகளில் உள்ளவர்களுக்கு சிறப்பான அங்கீகாரம் கிடைக்கும். உங்கள் நண்பர்கள் மற்றும் உறவினர்களின் ஆதரவு உங்களுக்கு பலமாக அமையும். எதிர்காலத்திற்கான திட்டங்களை வகுத்து செயல்பட இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்துவது மிகவும் முக்கியம். உடற்பயிற்சி மற்றும் சத்தான உணவுப் பழக்கம் உங்களுக்கு மேலும் புத்துணர்ச்சி அளிக்கும். வீண் விவாதங்களைத் தவிர்த்து அமைதியான முறையில் உங்கள் கருத்துக்களை எடுத்துரைப்பது நல்ல பலனைத் தரும். உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணித்து வெற்றி பெறுவீர்கள். தன்னம்பிக்கையுடன் செயல்பட்டு, எந்த தடைகளையும் தகர்த்தெறிந்து முன்னேறுவீர்கள். உங்கள் உள்ளுணர்வு கூறுவதைக் கேட்டு செயல்பட்டால், இன்று பல நன்மைகள் உண்டாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு, உங்கள் திறமைகளை முழுமையாகப் பயன்படுத்துங்கள். இன்றைய நாள் உங்களுக்கு வெற்றியையும் மனமகிழ்ச்சியையும் தரும்.",
    "prediction_en": "Today, being Sunday, a day ruled by the Sun, Libra natives will experience increased harmony and balance. Clarity will emerge in your relationships. You will interact harmoniously with others and improve good relationships. This is a good day to make new friends and expand your social circle. Your speech and actions will be filled with integrity and justice, which will increase others' trust in you. A harmonious relationship will prevail with family members, especially with your father or elders. Their guidance will support your progress. It is an opportune day to express your individual talents and bravely put forth your views. There are high chances for your social status to rise. Your enthusiastic state of mind will spread to others, creating a positive atmosphere. Today is highly suitable for undertaking new ventures and laying foundations for long-term plans. Your mind will be peaceful, and thoughts will be clear. Spiritual inclination will increase. Engaging in activities like temple visits or meditation will provide further rejuvenation to the mind. You will gain contentment by involving yourself in social services. This is a golden opportunity to bring forth your inherent creativity. Those in artistic fields will receive special recognition. The support of your friends and relatives will be a strength for you. This is an excellent day to formulate and implement plans for the future. Paying attention to your health is crucial. Exercise and a nutritious diet will provide you with further vitality. Avoiding futile arguments and expressing your views calmly will yield good results. You will travel determinedly towards your goals and achieve success. You will act with self-confidence, overcoming any obstacles to progress. If you act by listening to your intuition, many benefits will arise today. Act with positive thoughts and fully utilize your talents. Today will bring you success and joy.",
    "career_ta": "பணியிடத்தில் நல்லிணக்கமான சூழல் நிலவும். சக ஊழியர்களுடன் இணைந்து பணியாற்றுவீர்கள். உங்கள் கருத்துக்கள் ஏற்கப்பட்டு, திட்டங்களில் நல்ல முன்னேற்றம் காண்பீர்கள். புதிய பொறுப்புகள் உங்களைத் தேடி வரும். மேலதிகாரிகளின் ஆதரவைப் பெறுவீர்கள். உங்கள் பேச்சுத்திறன் பணியிடத்தில் பாராட்டைப் பெறும். இன்று எடுக்கும் முடிவுகள் எதிர்காலத்திற்கு நன்மை பயக்கும்.",
    "career_en": "A harmonious environment will prevail in the workplace. You will work collaboratively with colleagues. Your ideas will be accepted, and you will see good progress in projects. New responsibilities will come your way. You will receive support from superiors. Your communication skills will be praised in the workplace. Decisions made today will be beneficial for the future.",
    "finance_ta": "நிதிநிலை சீராக இருக்கும். சேமிப்பு அதிகரிக்கும் வாய்ப்புகள் உண்டு. புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். புத்திசாலித்தனமாக நிதி திட்டமிடலை மேற்கொள்வீர்கள். குடும்பத்தின் நிதி பாதுகாப்பை உறுதி செய்வீர்கள். தேவையற்ற செலவுகளைக் கட்டுப்படுத்துவீர்கள். இன்று நிதி ஆதாயம் தரும் புதிய வழிகள் உருவாகும். நீண்டகால முதலீடுகள் பற்றி ஆலோசிப்பீர்கள்.",
    "finance_en": "The financial situation will be stable. There are chances for savings to increase. You will think about new investments. You will engage in smart financial planning. You will ensure the financial security of your family. You will control unnecessary expenses. New avenues for financial gain will emerge today. You will consider long-term investments.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மன அமைதிக்கு முக்கியத்துவம் அளிப்பீர்கள். சத்தான உணவுப் பழக்கத்தை கடைப்பிடிப்பது நல்லது. யோகா மற்றும் தியானம் செய்வது மனதையும் உடலையும் புத்துணர்ச்சியுடன் வைக்கும். போதுமான ஓய்வு எடுத்துக்கொள்வது அவசியம். நேர்மறை எண்ணங்கள் ஆரோக்கியத்தை மேம்படுத்தும். பழைய வியாதிகளில் இருந்து நிவாரணம் கிடைக்கும்.",
    "health_en": "Physical health will be stable. You will prioritize mental peace. It is good to follow a nutritious diet. Practicing yoga and meditation will keep both mind and body refreshed. Adequate rest is essential. Positive thoughts will enhance health. Relief from old ailments will be found.",
    "lucky_number": "6",
    "lucky_color_ta": "வெள்ளை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "விருச்சிகம்",
    "sign_en": "Scorpio",
    "date": "01-03-2026",
    "prediction_ta": "இன்று சூரியனின் ஆதிக்க நாளான ஞாயிற்றுக்கிழமை என்பதால், விருச்சிக ராசிக்காரர்களுக்கு மன உறுதி மற்றும் தைரியம் அதிகரிக்கும். உங்கள் ஆழ்ந்த சிந்தனைகள் பல சவால்களைத் தீர்க்க உதவும். நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலிலும் நேர்மறை ஆற்றல் நிறைந்திருக்கும். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தந்தை அல்லது மூத்தவர்களுடன் சுமூகமான உறவு நீடிக்கும். அவர்களின் அனுபவபூர்வமான ஆலோசனைகள் உங்களுக்கு பலன் தரும். உங்கள் தனிப்பட்ட திறமைகளை வெளிப்படுத்தவும், உங்கள் கருத்துக்களை தைரியமாக முன்வைக்கவும் உகந்த நாள். சமூகத்தில் உங்கள் மதிப்பு உயரும் வாய்ப்புகள் அதிகம். உங்கள் உற்சாகமான மனநிலை மற்றவர்களுக்கும் பரவி நேர்மறையான சூழலை உருவாக்கும். புதிய முயற்சிகளை மேற்கொள்ளவும், நீண்டகால திட்டங்களுக்கு அடிக்கல் நாட்டவும் இன்றைய தினம் மிகவும் பொருத்தமானது. உங்கள் மனம் அமைதியாகவும், எண்ணங்கள் தெளிவாகவும் இருக்கும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் போன்ற செயல்களில் ஈடுபடுவது மனதிற்கு மேலும் புத்துணர்ச்சி அளிக்கும். சமூக சேவைகளில் ஈடுபடுவதன் மூலம் மனநிறைவு பெறுவீர்கள். உங்களுக்குள் இருக்கும் படைப்புத்திறனை வெளிக்கொண்டுவர இது ஒரு பொன்னான வாய்ப்பு. கலை சார்ந்த துறைகளில் உள்ளவர்களுக்கு சிறப்பான அங்கீகாரம் கிடைக்கும். உங்கள் நண்பர்கள் மற்றும் உறவினர்களின் ஆதரவு உங்களுக்கு பலமாக அமையும். எதிர்காலத்திற்கான திட்டங்களை வகுத்து செயல்பட இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்துவது மிகவும் முக்கியம். உடற்பயிற்சி மற்றும் சத்தான உணவுப் பழக்கம் உங்களுக்கு மேலும் புத்துணர்ச்சி அளிக்கும். வீண் விவாதங்களைத் தவிர்த்து அமைதியான முறையில் உங்கள் கருத்துக்களை எடுத்துரைப்பது நல்ல பலனைத் தரும். உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணித்து வெற்றி பெறுவீர்கள். தன்னம்பிக்கையுடன் செயல்பட்டு, எந்த தடைகளையும் தகர்த்தெறிந்து முன்னேறுவீர்கள். உங்கள் உள்ளுணர்வு கூறுவதைக் கேட்டு செயல்பட்டால், இன்று பல நன்மைகள் உண்டாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு, உங்கள் திறமைகளை முழுமையாகப் பயன்படுத்துங்கள். இன்றைய நாள் உங்களுக்கு வெற்றியையும் மனமகிழ்ச்சியையும் தரும்.",
    "prediction_en": "Today, being Sunday, a day ruled by the Sun, Scorpio natives will experience increased mental resolve and courage. Your deep thoughts will help solve many challenges. Every action you undertake will be filled with positive energy. A harmonious relationship will prevail with family members, especially with your father or elders. Their experienced advice will benefit you. It is an opportune day to express your individual talents and bravely put forth your views. There are high chances for your social status to rise. Your enthusiastic state of mind will spread to others, creating a positive atmosphere. Today is highly suitable for undertaking new ventures and laying foundations for long-term plans. Your mind will be peaceful, and thoughts will be clear. Spiritual inclination will increase. Engaging in activities like temple visits or meditation will provide further rejuvenation to the mind. You will gain contentment by involving yourself in social services. This is a golden opportunity to bring forth your inherent creativity. Those in artistic fields will receive special recognition. The support of your friends and relatives will be a strength for you. This is an excellent day to formulate and implement plans for the future. Paying attention to your health is crucial. Exercise and a nutritious diet will provide you with further vitality. Avoiding futile arguments and expressing your views calmly will yield good results. You will travel determinedly towards your goals and achieve success. You will act with self-confidence, overcoming any obstacles to progress. If you act by listening to your intuition, many benefits will arise today. Act with positive thoughts and fully utilize your talents. Today will bring you success and joy.",
    "career_ta": "பணியிடத்தில் உங்கள் மன உறுதி மற்றும் உழைப்பு பாராட்டைப் பெறும். புதிய சவால்களை தைரியமாக எதிர்கொண்டு வெற்றி பெறுவீர்கள். மேலதிகாரிகளின் ஆதரவைப் பெறுவீர்கள். உங்கள் திட்டங்கள் சிறப்பாக செயல்படும். சக ஊழியர்களுடன் இணக்கமான சூழல் நிலவும். உங்கள் தனிப்பட்ட திறமைகள் அங்கீகரிக்கப்படும். தலைமைப் பொறுப்பை ஏற்று சிறப்பாகச் செயல்படுவீர்கள். வேலையில் திருப்தி ஏற்படும்.",
    "career_en": "Your mental resolve and hard work will be praised in the workplace. You will bravely face new challenges and achieve success. You will receive support from superiors. Your projects will perform excellently. A harmonious environment will prevail with colleagues. Your individual talents will be recognized. You will take on leadership roles and perform well. Satisfaction in work will arise.",
    "finance_ta": "நிதிநிலை சீராக இருக்கும். சேமிப்பு அதிகரிக்கும் வழிகள் உருவாகும். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். புத்திசாலித்தனமாக நிதி திட்டமிடலை மேற்கொள்வீர்கள். குடும்பத்தின் நிதி பாதுகாப்பை உறுதி செய்வீர்கள். தேவையற்ற செலவுகளைக் கட்டுப்படுத்துவீர்கள். இன்று நிதி ஆதாயம் தரும் வாய்ப்புகள் உருவாகும். அசையா சொத்துக்கள் தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும்.",
    "finance_en": "The financial situation will be stable. Avenues for increased income will emerge. You will think about new investments. You will engage in smart financial planning. You will ensure the financial security of your family. You will control unnecessary expenses. Opportunities for financial gains will arise today. Good progress will be seen in matters related to immovable property.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். மன வலிமை அதிகரிக்கும். சத்தான உணவுப் பழக்கத்தை கடைப்பிடிப்பது நல்லது. யோகா மற்றும் தியானம் செய்வது மனதையும் உடலையும் புத்துணர்ச்சியுடன் வைக்கும். போதுமான ஓய்வு எடுத்துக்கொள்வது அவசியம். நேர்மறை எண்ணங்கள் ஆரோக்கியத்தை மேம்படுத்தும். பழைய வியாதிகளில் இருந்து நிவாரணம் கிடைக்கும்.",
    "health_en": "Physical health will improve. Mental strength will increase. It is good to follow a nutritious diet. Practicing yoga and meditation will keep both mind and body refreshed. Adequate rest is essential. Positive thoughts will enhance health. Relief from old ailments will be found.",
    "lucky_number": "9",
    "lucky_color_ta": "செம்மை நிறம்",
    "lucky_color_en": "Crimson"
  },
  {
    "sign_ta": "தனுசு",
    "sign_en": "Sagittarius",
    "date": "01-03-2026",
    "prediction_ta": "இன்று சூரியனின் ஆதிக்க நாளான ஞாயிற்றுக்கிழமை என்பதால், தனுசு ராசிக்காரர்களுக்கு ஞானமும், விரிவாக்கமும் நிறைந்த நாளாக அமையும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்துவதற்கும் இது ஒரு சிறந்த நாள். உங்கள் நேர்மறையான அணுகுமுறை மற்றவர்களுக்கு உத்வேகம் அளிக்கும். உங்கள் தந்தை அல்லது வழிகாட்டியின் ஆதரவும், வழிகாட்டுதலும் உங்கள் முன்னேற்றத்திற்கு துணை நிற்கும். தொலைதூரப் பயணங்களுக்கான திட்டங்களை வகுப்பீர்கள். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானத்தில் ஈடுபடுவது மன அமைதியைத் தரும். சமூகத்தில் உங்கள் மதிப்பு உயரும் வாய்ப்புகள் அதிகம். உங்கள் உற்சாகமான மனநிலை மற்றவர்களுக்கும் பரவி நேர்மறையான சூழலை உருவாக்கும். புதிய முயற்சிகளை மேற்கொள்ளவும், நீண்டகால திட்டங்களுக்கு அடிக்கல் நாட்டவும் இன்றைய தினம் மிகவும் பொருத்தமானது. உங்கள் மனம் அமைதியாகவும், எண்ணங்கள் தெளிவாகவும் இருக்கும். சமூக சேவைகளில் ஈடுபடுவதன் மூலம் மனநிறைவு பெறுவீர்கள். உங்களுக்குள் இருக்கும் படைப்புத்திறனை வெளிக்கொண்டுவர இது ஒரு பொன்னான வாய்ப்பு. கலை சார்ந்த துறைகளில் உள்ளவர்களுக்கு சிறப்பான அங்கீகாரம் கிடைக்கும். உங்கள் நண்பர்கள் மற்றும் உறவினர்களின் ஆதரவு உங்களுக்கு பலமாக அமையும். எதிர்காலத்திற்கான திட்டங்களை வகுத்து செயல்பட இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்துவது மிகவும் முக்கியம். உடற்பயிற்சி மற்றும் சத்தான உணவுப் பழக்கம் உங்களுக்கு மேலும் புத்துணர்ச்சி அளிக்கும். வீண் விவாதங்களைத் தவிர்த்து அமைதியான முறையில் உங்கள் கருத்துக்களை எடுத்துரைப்பது நல்ல பலனைத் தரும். உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணித்து வெற்றி பெறுவீர்கள். தன்னம்பிக்கையுடன் செயல்பட்டு, எந்த தடைகளையும் தகர்த்தெறிந்து முன்னேறுவீர்கள். உங்கள் உள்ளுணர்வு கூறுவதைக் கேட்டு செயல்பட்டால், இன்று பல நன்மைகள் உண்டாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு, உங்கள் திறமைகளை முழுமையாகப் பயன்படுத்துங்கள். இன்றைய நாள் உங்களுக்கு வெற்றியையும் மனமகிழ்ச்சியையும் தரும்.",
    "prediction_en": "Today, being Sunday, a day ruled by the Sun, will be a day of wisdom and expansion for Sagittarius natives. This is an excellent day to learn new things and enhance your knowledge. Your positive approach will inspire others. The support and guidance of your father or mentor will aid your progress. You will plan for long-distance travels. Spiritual inclination will increase. Visiting temples or engaging in meditation will bring mental peace. There are high chances for your social status to rise. Your enthusiastic state of mind will spread to others, creating a positive atmosphere. Today is highly suitable for undertaking new ventures and laying foundations for long-term plans. Your mind will be peaceful, and thoughts will be clear. You will gain contentment by involving yourself in social services. This is a golden opportunity to bring forth your inherent creativity. Those in artistic fields will receive special recognition. The support of your friends and relatives will be a strength for you. This is an excellent day to formulate and implement plans for the future. Paying attention to your health is crucial. Exercise and a nutritious diet will provide you with further vitality. Avoiding futile arguments and expressing your views calmly will yield good results. You will travel determinedly towards your goals and achieve success. You will act with self-confidence, overcoming any obstacles to progress. If you act by listening to your intuition, many benefits will arise today. Act with positive thoughts and fully utilize your talents. Today will bring you success and joy.",
    "career_ta": "பணியிடத்தில் உங்கள் ஞானமும், வழிகாட்டும் திறனும் பாராட்டைப் பெறும். புதிய திட்டங்களை முன்னின்று நடத்தும் வாய்ப்புகள் கிடைக்கும். மேலதிகாரிகளின் முழு ஆதரவைப் பெறுவீர்கள். வெளிநாடு தொடர்பான பணிகளில் முன்னேற்றம் ஏற்படும். உங்கள் யோசனைகள் ஏற்றுக்கொள்ளப்பட்டு செயல்படுத்தப்படும். சக ஊழியர்களுடன் இணக்கமான உறவு நிலவும். புதிய விஷயங்களைக் கற்றுக்கொண்டு முன்னேறுவீர்கள். உங்கள் கடின உழைப்புக்குரிய அங்கீகாரம் கிடைக்கும்.",
    "career_en": "Your wisdom and guiding ability will be praised in the workplace. You will get opportunities to lead new projects. You will receive full support from superiors. Progress will be seen in foreign-related tasks. Your ideas will be accepted and implemented. A harmonious relationship with colleagues will prevail. You will learn new things and progress. Your hard work will receive due recognition.",
    "finance_ta": "நிதிநிலை சிறப்பாக இருக்கும். புதிய முதலீடுகளை மேற்கொள்வதற்குரிய வாய்ப்புகள் கிடைக்கும். சேமிப்பு அதிகரிக்கும் வழிகள் உருவாகும். நீண்டகால நிதி திட்டமிடலை மேற்கொள்வீர்கள். குடும்பத்தின் நிதி பாதுகாப்பை உறுதி செய்வீர்கள். தேவையற்ற செலவுகளைக் கட்டுப்படுத்துவீர்கள். இன்று நிதி ஆதாயம் தரும் வாய்ப்புகள் உருவாகும். அசையா சொத்துக்கள் தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும்.",
    "finance_en": "The financial situation will be excellent. Opportunities for new investments will arise. Avenues for increased income will emerge. You will undertake long-term financial planning. You will ensure the financial security of your family. You will control unnecessary expenses. Opportunities for financial gains will arise today. Good progress will be seen in matters related to immovable property.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். புத்துணர்ச்சியுடன் இருப்பீர்கள். சத்தான உணவுப் பழக்கத்தை கடைப்பிடிப்பது நல்லது. யோகா மற்றும் தியானம் செய்வது மனதையும் உடலையும் புத்துணர்ச்சியுடன் வைக்கும். போதுமான ஓய்வு எடுத்துக்கொள்வது அவசியம். நேர்மறை எண்ணங்கள் ஆரோக்கியத்தை மேம்படுத்தும். நீண்ட பயணங்கள் உடலுக்கு புத்துணர்ச்சி அளிக்கும்.",
    "health_en": "Physical health will improve. You will feel rejuvenated. It is good to follow a nutritious diet. Practicing yoga and meditation will keep both mind and body refreshed. Adequate rest is essential. Positive thoughts will enhance health. Long journeys will rejuvenate the body.",
    "lucky_number": "3",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "மகரம்",
    "sign_en": "Capricorn",
    "date": "01-03-2026",
    "prediction_ta": "இன்று சூரியனின் ஆதிக்க நாளான ஞாயிற்றுக்கிழமை என்பதால், மகர ராசிக்காரர்களுக்கு பொறுப்புணர்ச்சியும், ஒழுக்கமும் மேலோங்கும். உங்கள் இலக்குகளை அடைய விடாமுயற்சியுடன் செயல்படுவீர்கள். நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலிலும் நேர்மறை ஆற்றல் நிறைந்திருக்கும். குடும்ப உறவுகளில் இணக்கம் கூடும். குறிப்பாக தந்தையுடனும், வயதில் மூத்தவர்களுடனும் நல்லுறவு பேணுவது உங்களுக்கு நன்மைகளைத் தரும். அவர்களின் ஆசிர்வாதங்களும் வழிகாட்டுதல்களும் உங்கள் முன்னேற்றத்திற்கு துணை நிற்கும். உங்கள் பேச்சு மற்றும் செயல்களில் தெளிவும், உறுதியும் இருக்கும். இது மற்றவர்களுக்கு உங்களின் மீதான நம்பிக்கையை அதிகரிக்கும். புதிய திட்டங்களை வகுப்பதற்கும், அவற்றை செயல்படுத்தவும் இது ஒரு நல்ல நாள். மனதிற்கு பிடித்த கலைச் செயல்களில் ஈடுபடுவது நிம்மதியையும் மகிழ்ச்சியையும் தரும். புதிய நண்பர்களை உருவாக்குவதற்கும், சமூக வட்டாரத்தை விரிவுபடுத்துவதற்கும் இது ஒரு நல்ல நாள். பழைய நண்பர்களுடன் சந்திப்புகள் நிகழ்ந்து மகிழ்வீர்கள். உங்கள் உள்மனதில் உதிக்கும் ஆக்கப்பூர்வமான எண்ணங்களுக்கு செயல்வடிவம் கொடுப்பதற்கான வாய்ப்புகள் இன்று அமையும். சவால்களை தைரியமாக எதிர்கொண்டு, அவற்றை சாதகமாக மாற்றும் ஆற்றல் உங்களுக்கு இருக்கும். இன்று எடுக்கும் முடிவுகள் நீண்ட காலத்திற்கு நற்பலன்களைத் தரும். பொருளாதார ரீதியாக ஸ்திரமான நிலை காணப்படும். முதலீடுகள் தொடர்பான விஷயங்களில் நிதானமாகச் செயல்பட்டு நல்ல முடிவுகளை எடுப்பீர்கள். உடல் ஆரோக்கியத்தில் கவனம் செலுத்தி, மனதை ஒருமுகப்படுத்தும் பயிற்சிகளில் ஈடுபடுவது நல்லது. ஆன்மீகச் சிந்தனைகள் அதிகரிக்கும். தர்ம காரியங்களில் ஈடுபடுவதன் மூலம் மன அமைதி கிடைக்கும். உங்கள் விடாமுயற்சிக்கு ஏற்ப பலன்கள் நிச்சயம் கிடைக்கும். சமூகத்தில் உங்கள் மதிப்பு உயரும். நேர்மறையான கண்ணோட்டத்துடன் செயல்பட்டு, இன்றைய நாளை பயனுள்ளதாக்குவீர்கள். உங்கள் செயல்களுக்கு உரிய அங்கீகாரம் கிடைக்கும். தன்னம்பிக்கையுடன் செயல்பட்டு, தடைகளை தாண்டி முன்னேறுவீர்கள். இன்று குடும்பத்தில் மகிழ்ச்சியும், அமைதியும் நிலவும். உங்கள் தனிப்பட்ட திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்புகள் அமையும்.",
    "prediction_en": "Today, being Sunday, a day ruled by the Sun, Capricorn natives will experience heightened responsibility and discipline. You will work with perseverance to achieve your goals. Every action you undertake will be filled with positive energy. Harmony in family relationships will grow. Especially, maintaining good relationships with your father and elders will bring you benefits. Their blessings and guidance will support your progress. There will be clarity and firmness in your speech and actions, which will increase others' trust in you. This is a good day to formulate new plans and implement them. Engaging in creative activities you enjoy will bring peace and happiness. This is a good day to make new friends and expand your social circle. You will enjoy meeting old friends. Opportunities will arise today to give form to the creative thoughts that emerge within you. You will have the ability to bravely face challenges and turn them into advantages. Decisions made today will yield good results in the long run. A stable financial situation will be observed. You will act carefully in investment-related matters and make good decisions. It is good to focus on physical health and engage in mind-focusing exercises. Spiritual thoughts will increase. Engaging in charitable deeds will bring mental peace. You will surely receive rewards according to your perseverance. Your reputation in society will increase. You will make today productive by acting with a positive outlook. Your actions will receive due recognition. You will act with self-confidence, overcoming obstacles and progressing. Today, happiness and peace will prevail in the family. Good opportunities will arise to showcase your individual talents.",
    "career_ta": "பணியிடத்தில் உங்கள் கடின உழைப்புக்கும், பொறுப்புணர்வுக்கும் அங்கீகாரம் கிடைக்கும். புதிய திட்டங்களை திறம்பட செயல்படுத்துவீர்கள். மேலதிகாரிகளின் பாராட்டைப் பெறுவீர்கள். சக ஊழியர்களுடன் இணக்கமான சூழல் நிலவும். உங்கள் ஒழுங்குமுறை பணிச்சுமையை எளிதாக்கும். முக்கியமான முடிவுகளை எடுப்பதற்கு உகந்த நாள். உங்கள் நேர்மையான அணுகுமுறை பாராட்டைப் பெறும். வேலையில் திருப்தி ஏற்படும்.",
    "career_en": "Your hard work and sense of responsibility will be recognized in the workplace. You will implement new projects efficiently. You will receive praise from superiors. A harmonious environment will prevail with colleagues. Your discipline will ease your workload. Today is an opportune day to make important decisions. Your honest approach will receive praise. Satisfaction in work will arise.",
    "finance_ta": "நிதிநிலை ஸ்திரமாக இருக்கும். சேமிப்பு அதிகரிக்கும் வாய்ப்புகள் உண்டு. நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். புத்திசாலித்தனமாக நிதி திட்டமிடலை மேற்கொள்வீர்கள். தேவையற்ற செலவுகளைத் தவிர்த்து, குடும்பத்தின் நிதி பாதுகாப்பை உறுதி செய்வீர்கள். அசையா சொத்துக்கள் தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். நிதி ஆதாயம் தரும் வாய்ப்புகள் இன்று உருவாகும்.",
    "finance_en": "The financial situation will be stable. There are chances for savings to increase. You will think about long-term investments. You will engage in smart financial planning. By avoiding unnecessary expenses, you will ensure the financial security of your family. Good progress will be seen in matters related to immovable property. Opportunities for financial gains will arise today.",
    "health_ta": "ஆரோக்கியம் சிறப்பாக இருக்கும். உடல் சோர்வு நீங்கி புத்துணர்ச்சி பெறுவீர்கள். தினசரி உடற்பயிற்சி மற்றும் யோகா செய்வது உங்கள் உடலை உறுதிப்படுத்தும். மன அழுத்தத்தை குறைப்பதற்கான வழிமுறைகளைக் கையாள்வீர்கள். புதிய உணவுப் பழக்கவழக்கங்களை மேற்கொள்வதன் மூலம் மேலும் ஆரோக்கியம் மேம்படும். போதுமான ஓய்வு எடுத்துக்கொள்வது மனதையும் உடலையும் சீராக வைக்கும்.",
    "health_en": "Health will be excellent. Physical fatigue will disappear, and you will feel refreshed. Regular exercise and yoga will strengthen your body. You will adopt methods to reduce stress. By adopting new dietary habits, health will further improve. Taking adequate rest will keep your mind and body balanced.",
    "lucky_number": "8",
    "lucky_color_ta": "கருநீலம்",
    "lucky_color_en": "Dark Blue"
  },
  {
    "sign_ta": "கும்பம்",
    "sign_en": "Aquarius",
    "date": "01-03-2026",
    "prediction_ta": "இன்று சூரியனின் ஆதிக்க நாளான ஞாயிற்றுக்கிழமை என்பதால், கும்ப ராசிக்காரர்களுக்கு புதிய சிந்தனைகளும், சமூக ஈடுபாடும் அதிகரிக்கும். உங்கள் தனிப்பட்ட திறமைகளை வெளிப்படுத்தவும், புதிய கண்டுபிடிப்புகளில் ஈடுபடவும் இது ஒரு சிறந்த நாள். உங்கள் தந்தை அல்லது வழிகாட்டியின் ஆதரவு உங்களுக்கு மன பலத்தை அளிக்கும். நீண்ட நாட்களாக நீங்கள் மனதில் வைத்திருந்த ஒரு விஷயத்தை இன்று செயல்படுத்துவதற்கான உத்வேகம் கிடைக்கும். புதிய நண்பர்களை சந்திப்பதற்கும், உங்கள் சமூக வட்டாரத்தை விரிவுபடுத்துவதற்கும் இது ஒரு நல்ல நாள். மனதிற்கு அமைதி தரும் ஆன்மீகப் புத்தகங்களைப் படிப்பது அல்லது தியானத்தில் ஈடுபடுவது நல்லது. உங்கள் மனதை ஒருமுகப்படுத்தி, தெளிவாகச் சிந்திக்க இது உதவும். பயணங்களுக்கான திட்டங்களை வகுப்பதற்கும், புதிய இடங்களை ஆராய்வதற்கும் ஆர்வம் காட்டுவீர்கள். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் எதிர்காலத்திற்கு சாதகமாக அமையும். சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். உங்கள் திறமைகளை வெளிப்படுத்தவும், உங்கள் தனிப்பட்ட அடையாளத்தை நிலைநிறுத்தவும் இந்த நாள் உங்களுக்கு வாய்ப்பளிக்கும். உங்கள் நம்பிக்கையும், துணிச்சலும் மற்றவர்களுக்கு முன்மாதிரியாக அமையும். எந்த ஒரு தடங்கலையும் எளிதாகக் கடந்து முன்னேறுவீர்கள். உங்கள் உள்ளுணர்வு வழிகாட்டுதலைப் பின்பற்றுவது பல நன்மைகளைத் தரும். நேர்மறையான அணுகுமுறையுடன் செயல்பட்டு, இன்றைய நாளை முழுமையாகப் பயன்படுத்துங்கள். உங்கள் இலக்குகளை அடைய விடாமுயற்சியுடன் செயல்பட்டால், வெற்றி நிச்சயம். உங்களுடைய புதிய முயற்சிகளுக்கு நல்ல ஆதரவு கிடைக்கும். சமூகத்தில் உங்கள் நிலை உயரும் வாய்ப்புகள் அதிகம். உங்கள் உற்சாகமான மனநிலை மற்றவர்களுக்கும் பரவி நேர்மறையான சூழலை உருவாக்கும். குடும்ப உறுப்பினர்களுடன் கலகலப்பான உரையாடல்களில் ஈடுபடுவீர்கள். குறிப்பாக மூத்தவர்களின் ஆலோசனைகள் உங்களுக்கு பயனுள்ளதாக இருக்கும். உங்கள் கருத்துக்களை தைரியமாக முன்வைக்க இது ஒரு உகந்த நாள்.",
    "prediction_en": "Today, being Sunday, a day ruled by the Sun, will bring new thoughts and increased social involvement to Aquarius natives. This is an excellent day to express your individual talents and engage in new discoveries. The support of your father or mentor will give you mental strength. You will gain the inspiration today to implement something you have had in mind for a long time. This is a good day to meet new friends and expand your social circle. It is good to read spiritual books that bring peace of mind or engage in meditation. This will help you focus your mind and think clearly. You will show interest in planning trips and exploring new places. All decisions you make today will be favorable for your future. You will be ready to face challenges. This day will provide you with opportunities to express your talents and establish your unique identity. Your confidence and courage will serve as an example to others. You will easily overcome any hindrance and progress. Following your intuition will bring many benefits. Act with a positive approach and make the most of today. If you work diligently to achieve your goals, success is certain. You will receive good support for your new endeavors. There are high chances for your social status to rise. Your enthusiastic state of mind will spread to others, creating a positive atmosphere. You will engage in lively conversations with family members. Especially, the advice of elders will be beneficial to you. It is an opportune day to bravely put forth your views.",
    "career_ta": "பணியிடத்தில் புதிய சிந்தனைகள் மற்றும் கண்டுபிடிப்புகள் மூலம் பாராட்டைப் பெறுவீர்கள். குழுப்பணிகளில் சிறப்பாக செயல்படுவீர்கள். மேலதிகாரிகளின் முழு ஆதரவைப் பெறுவீர்கள். புதிய பொறுப்புகளை திறம்பட கையாள்வீர்கள். உங்கள் தனிப்பட்ட திறமைகள் அங்கீகரிக்கப்படும். சமூக சார்ந்த பணிகளில் ஈடுபட்டு நல்ல பெயர் எடுப்பீர்கள். இன்று உங்கள் முயற்சிகளுக்கு நல்ல பலன் கிடைக்கும்.",
    "career_en": "In the workplace, you will receive praise for new ideas and innovations. You will perform well in team projects. You will receive full support from superiors. You will handle new responsibilities efficiently. Your individual talents will be recognized. You will earn a good name by engaging in social service. Today, your efforts will yield good results.",
    "finance_ta": "நிதிநிலை சீராக இருக்கும். புதிய முதலீடுகளை மேற்கொள்வதற்குரிய வாய்ப்புகள் கிடைக்கும். சேமிப்பு அதிகரிக்கும் வழிகள் உருவாகும். சமூக சார்ந்த முதலீடுகளில் ஆர்வம் காட்டுவீர்கள். குடும்பத்தின் நிதி பாதுகாப்பை உறுதி செய்வீர்கள். தேவையற்ற செலவுகளைக் கட்டுப்படுத்துவீர்கள். இன்று நிதி ஆதாயம் தரும் வாய்ப்புகள் உருவாகும். எதிர்காலத்திற்கான நிதி திட்டமிடலை மேற்கொள்வீர்கள்.",
    "finance_en": "The financial situation will be stable. Opportunities for new investments will arise. Avenues for increased income will emerge. You will show interest in socially responsible investments. You will ensure the financial security of your family. You will control unnecessary expenses. Opportunities for financial gains will arise today. You will undertake financial planning for the future.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். மன அமைதிக்கு முக்கியத்துவம் அளிப்பீர்கள். சத்தான உணவுப் பழக்கத்தை கடைப்பிடிப்பது நல்லது. யோகா மற்றும் தியானம் செய்வது மனதையும் உடலையும் புத்துணர்ச்சியுடன் வைக்கும். போதுமான ஓய்வு எடுத்துக்கொள்வது அவசியம். நேர்மறை எண்ணங்கள் ஆரோக்கியத்தை மேம்படுத்தும். சமூக சேவைகள் மனதிற்கு திருப்தி அளிக்கும்.",
    "health_en": "Physical health will improve. You will prioritize mental peace. It is good to follow a nutritious diet. Practicing yoga and meditation will keep both mind and body refreshed. Adequate rest is essential. Positive thoughts will enhance health. Social services will bring contentment to the mind.",
    "lucky_number": "4",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "01-03-2026",
    "prediction_ta": "இன்று சூரியனின் ஆதிக்க நாளான ஞாயிற்றுக்கிழமை என்பதால், மீன ராசிக்காரர்களுக்கு உள்ளுணர்வு மற்றும் ஆன்மீக நாட்டம் அதிகரிக்கும். உங்கள் மனம் அமைதியாகவும், எண்ணங்கள் தெளிவாகவும் இருக்கும். உங்கள் படைப்புத்திறனை வெளிப்படுத்துவதற்கும், கலை சார்ந்த துறைகளில் ஈடுபடுவதற்கும் இது ஒரு நல்ல நாள். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தந்தை அல்லது வழிகாட்டியுடன் சுமூகமான உறவு நீடிக்கும். அவர்களின் ஆலோசனைகள் உங்களுக்கு மிகுந்த பலன் தரும். உங்கள் தனிப்பட்ட திறமைகளை வெளிப்படுத்தவும், உங்கள் கருத்துக்களை தைரியமாக முன்வைக்கவும் உகந்த நாள். சமூகத்தில் உங்கள் மதிப்பு உயரும் வாய்ப்புகள் அதிகம். உங்கள் உற்சாகமான மனநிலை மற்றவர்களுக்கும் பரவி நேர்மறையான சூழலை உருவாக்கும். புதிய முயற்சிகளை மேற்கொள்ளவும், நீண்டகால திட்டங்களுக்கு அடிக்கல் நாட்டவும் இன்றைய தினம் மிகவும் பொருத்தமானது. ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் போன்ற செயல்களில் ஈடுபடுவது மனதிற்கு மேலும் புத்துணர்ச்சி அளிக்கும். சமூக சேவைகளில் ஈடுபடுவதன் மூலம் மனநிறைவு பெறுவீர்கள். உங்களுக்குள் இருக்கும் படைப்புத்திறனை வெளிக்கொண்டுவர இது ஒரு பொன்னான வாய்ப்பு. கலை சார்ந்த துறைகளில் உள்ளவர்களுக்கு சிறப்பான அங்கீகாரம் கிடைக்கும். உங்கள் நண்பர்கள் மற்றும் உறவினர்களின் ஆதரவு உங்களுக்கு பலமாக அமையும். எதிர்காலத்திற்கான திட்டங்களை வகுத்து செயல்பட இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்துவது மிகவும் முக்கியம். உடற்பயிற்சி மற்றும் சத்தான உணவுப் பழக்கம் உங்களுக்கு மேலும் புத்துணர்ச்சி அளிக்கும். வீண் விவாதங்களைத் தவிர்த்து அமைதியான முறையில் உங்கள் கருத்துக்களை எடுத்துரைப்பது நல்ல பலனைத் தரும். உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணித்து வெற்றி பெறுவீர்கள். தன்னம்பிக்கையுடன் செயல்பட்டு, எந்த தடைகளையும் தகர்த்தெறிந்து முன்னேறுவீர்கள். உங்கள் உள்ளுணர்வு கூறுவதைக் கேட்டு செயல்பட்டால், இன்று பல நன்மைகள் உண்டாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு, உங்கள் திறமைகளை முழுமையாகப் பயன்படுத்துங்கள். இன்றைய நாள் உங்களுக்கு வெற்றியையும் மனமகிழ்ச்சியையும் தரும்.",
    "prediction_en": "Today, being Sunday, a day ruled by the Sun, Pisces natives will experience increased intuition and spiritual inclination. Your mind will be peaceful, and thoughts will be clear. This is an excellent day to express your creativity and engage in artistic fields. A harmonious relationship will prevail with family members, especially with your father or mentor. Their advice will be highly beneficial to you. It is an opportune day to express your individual talents and bravely put forth your views. There are high chances for your social status to rise. Your enthusiastic state of mind will spread to others, creating a positive atmosphere. Today is highly suitable for undertaking new ventures and laying foundations for long-term plans. Spiritual inclination will increase. Engaging in activities like temple visits or meditation will provide further rejuvenation to the mind. You will gain contentment by involving yourself in social services. This is a golden opportunity to bring forth your inherent creativity. Those in artistic fields will receive special recognition. The support of your friends and relatives will be a strength for you. This is an excellent day to formulate and implement plans for the future. Paying attention to your health is crucial. Exercise and a nutritious diet will provide you with further vitality. Avoiding futile arguments and expressing your views calmly will yield good results. You will travel determinedly towards your goals and achieve success. You will act with self-confidence, overcoming any obstacles to progress. If you act by listening to your intuition, many benefits will arise today. Act with positive thoughts and fully utilize your talents. Today will bring you success and joy.",
    "career_ta": "பணியிடத்தில் உங்கள் படைப்புத்திறன் வெளிப்படும். புதிய திட்டங்களை முன்னின்று நடத்தும் வாய்ப்புகள் கிடைக்கும். மேலதிகாரிகளின் ஆதரவைப் பெறுவீர்கள். உங்கள் உள்ளுணர்வு வழிகாட்டுதல் மூலம் சிறந்த முடிவுகளை எடுப்பீர்கள். சக ஊழியர்களுடன் இணக்கமான சூழல் நிலவும். உங்கள் கடின உழைப்புக்குரிய அங்கீகாரம் கிடைக்கும். புதிய பொறுப்புகளை திறம்பட கையாள்வீர்கள். வேலையில் திருப்தி ஏற்படும்.",
    "career_en": "Your creativity will emerge in the workplace. You will get opportunities to lead new projects. You will receive support from superiors. You will make excellent decisions through your intuitive guidance. A harmonious environment will prevail with colleagues. Your hard work will receive due recognition. You will handle new responsibilities efficiently. Satisfaction in work will arise.",
    "finance_ta": "நிதிநிலை சீராக இருக்கும். சேமிப்பு அதிகரிக்கும் வழிகள் உருவாகும். ஆன்மீகம் சார்ந்த முதலீடுகளில் ஆர்வம் காட்டுவீர்கள். புத்திசாலித்தனமாக நிதி திட்டமிடலை மேற்கொள்வீர்கள். குடும்பத்தின் நிதி பாதுகாப்பை உறுதி செய்வீர்கள். தேவையற்ற செலவுகளைக் கட்டுப்படுத்துவீர்கள். இன்று நிதி ஆதாயம் தரும் வாய்ப்புகள் உருவாகும். அசையா சொத்துக்கள் தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும்.",
    "finance_en": "The financial situation will be stable. Avenues for increased income will emerge. You will show interest in spiritual-related investments. You will engage in smart financial planning. You will ensure the financial security of your family. You will control unnecessary expenses. Opportunities for financial gains will arise today. Good progress will be seen in matters related to immovable property.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். மன அமைதிக்கு முக்கியத்துவம் அளிப்பீர்கள். சத்தான உணவுப் பழக்கத்தை கடைப்பிடிப்பது நல்லது. யோகா மற்றும் தியானம் செய்வது மனதையும் உடலையும் புத்துணர்ச்சியுடன் வைக்கும். போதுமான ஓய்வு எடுத்துக்கொள்வது அவசியம். நேர்மறை எண்ணங்கள் ஆரோக்கியத்தை மேம்படுத்தும். பழைய வியாதிகளில் இருந்து நிவாரணம் கிடைக்கும்.",
    "health_en": "Physical health will improve. You will prioritize mental peace. It is good to follow a nutritious diet. Practicing yoga and meditation will keep both mind and body refreshed. Adequate rest is essential. Positive thoughts will enhance health. Relief from old ailments will be found.",
    "lucky_number": "7",
    "lucky_color_ta": "பொன் நிறம்",
    "lucky_color_en": "Golden"
  }
]
