[
  {
    "sign_ta": "மேஷம்",
    "sign_en": "Aries",
    "date": "27-02-2026",
    "prediction_ta": "இன்றைய நாள் மேஷ ராசிக்காரர்களுக்கு மனநிறைவும், உற்சாகமும் நிறைந்த ஒரு அற்புதமான வெள்ளிக்கிழமையாக அமையும். சுக்கிரனின் ஆதிக்கத்தில், உங்கள் தனிப்பட்ட உறவுகள் வலுப்பெறுவதற்கும், புதிய நண்பர்களைச் சந்திப்பதற்கும் வாய்ப்புகள் ஏற்படும். வீட்டில் மகிழ்ச்சியான சூழல் நிலவும். கலை மற்றும் அழகியல் சார்ந்த விஷயங்களில் உங்கள் ஆர்வம் அதிகரிக்கும். உங்கள் படைப்பாற்றல் வெளிப்படும் தருணமிது. சமூக நிகழ்வுகளில் கலந்துகொள்வதன் மூலம் புதிய தொடர்புகளை ஏற்படுத்திக்கொள்வீர்கள். மனதிற்கு இன்பம் தரும் நிகழ்வுகள் நாள் முழுவதும் அரங்கேறும். குடும்ப உறுப்பினர்களுடன் சிநேகமான பேச்சுவார்த்தைகள் நடைபெறும். குறிப்பாக, வாழ்க்கைத்துணையுடனான பிணைப்பு மேலும் வலுப்பெறும். உங்கள் எண்ணங்களை வெளிப்படையாகப் பகிர்ந்து கொள்வதன் மூலம் புரிதலின்மை தவிர்க்கப்படும்.\nஇந்த நன்னாளில், உங்கள் உணர்ச்சிபூர்வமான தேவைகளை நீங்கள் தெளிவாகப் புரிந்துகொள்வீர்கள். அவற்றை நிவர்த்தி செய்வதற்கான ஆக்கப்பூர்வமான வழிகளைக் கண்டறிவீர்கள். நண்பர்கள் மற்றும் உறவினர்களுடன் சேர்ந்து சிறிய அளவிலான கொண்டாட்டங்களில் ஈடுபடலாம். இது உங்கள் மனதிற்கு புத்துணர்ச்சியூட்டும். நீண்ட நாட்களாக நீங்கள் பார்க்காத பழைய நண்பர்களை மீண்டும் சந்திப்பதற்கான வாய்ப்புகளும் உண்டு. இந்த சந்திப்புகள் உங்கள் வாழ்க்கையில் புதிய நம்பிக்கையையும், நேர்மறை எண்ணங்களையும் விதைக்கும். உங்கள் சமூக வட்டம் விரிவடைவதால், புதிய கருத்துக்களையும், எண்ணங்களையும் நீங்கள் அறிந்து கொள்வீர்கள். இது உங்கள் மனதை மேலும் பக்குவப்படுத்தும்.\nகாதல் உறவுகளில் இருப்பவர்களுக்கு இன்றைய நாள் மிகவும் இனிமையான அனுபவங்களைத் தரும். உங்கள் துணையுடன் நீங்கள் எதிர்பார்க்கும் ஆதரவையும், அன்பையும் பெறுவீர்கள். ஒருவருக்கொருவர் புரிதலுடன் செயல்படுவதன் மூலம் உறவில் ஒரு புதிய அத்தியாயம் தொடங்கும். திருமணமானவர்கள் தங்கள் துணையுடன் மனம் விட்டுப் பேசவும், ஒருவரை ஒருவர் பாராட்டி மகிழவும் இது ஒரு சிறந்த நாள். உங்கள் இல்லற வாழ்க்கை மேலும் இனிமையாகும். குழந்தைகளின் எதிர்காலம் குறித்த ஆரோக்கியமான விவாதங்கள் குடும்பத்தில் நடைபெறும். இது உங்கள் குடும்பத்தின் வளர்ச்சிக்கு உதவும்.\nஉங்கள் கலை ஆர்வத்தை மேம்படுத்திக்கொள்ள இதுவே சரியான தருணம். ஓவியம், இசை, நடனம் அல்லது வேறு ஏதேனும் படைப்பு சார்ந்த விஷயங்களில் ஈடுபடலாம். புதியதொரு பொழுதுபோக்கைத் தொடங்குவதற்கு இன்றைய நாள் உகந்தது. இது உங்கள் மனதிற்கு அமைதியையும், ஆனந்தத்தையும் தரும். இயற்கையுடன் இணைந்திருப்பதன் மூலம் மனதிற்கு புத்துணர்ச்சி கிடைக்கும். பூங்காக்களுக்குச் செல்வது அல்லது இயற்கைக் காட்சிகளைக் காண்பது போன்ற செயல்களில் ஈடுபடலாம். இது உங்கள் மன அழுத்தத்தைக் குறைத்து, உற்சாகத்தை அதிகரிக்கும்.\nஆன்மீக ரீதியாகவும் நீங்கள் முன்னேற்றம் காண்பீர்கள். தியானம் அல்லது பிரார்த்தனைகளில் ஈடுபடுவதன் மூலம் மன அமைதி கிடைக்கும். உங்கள் அக உணர்வுகள் மேலும் தெளிவு பெறும். வாழ்க்கையின் நோக்கங்கள் குறித்து ஆழமாக சிந்திக்க இது ஒரு நல்ல வாய்ப்பு. பிறருக்கு உதவி செய்வதன் மூலம் நீங்கள் மனநிறைவைப் பெறுவீர்கள். சிறிய அளவில் தொண்டு காரியங்களில் ஈடுபடலாம். இது உங்கள் புண்ணிய கணக்கை அதிகரிக்கும்.\nபொதுவாக, இன்று நீங்கள் சூழ்நிலைகளை மிக நேர்மறையாக அணுகுவீர்கள். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொண்டு, அதிலிருந்து கற்றுக்கொள்வதற்கான வாய்ப்புகளைப் பெறுவீர்கள். தன்னம்பிக்கையுடன் செயல்படுவதன் மூலம் பல நல்ல காரியங்களை சாதிக்க முடியும். உங்கள் ஆளுமைத்திறன் அதிகரிக்கும். பிறரைக் கவர்ந்து, அவர்களை உங்கள் வழிக்குக் கொண்டு வரும் சக்தி உங்களுக்கு உண்டு. இதனால், உங்கள் சமூக மற்றும் தனிப்பட்ட உறவுகளில் பல சாதகமான மாற்றங்கள் ஏற்படும். எந்தவொரு விஷயத்திலும் அவசரப்படாமல், நிதானத்துடன் செயல்படுவது வெற்றியைப் பெற்றுத்தரும். இன்றைய நாள் உங்கள் வாழ்க்கையில் புதிய பொலிவையும், மகிழ்ச்சியையும் கொண்டு வரும்.",
    "prediction_en": "Today will be a wonderful Friday filled with satisfaction and enthusiasm for Aries natives. Under the influence of Venus, opportunities will arise to strengthen your personal relationships and meet new friends. A joyful atmosphere will prevail at home. Your interest in arts and aesthetics will increase. This is a time for your creativity to manifest. You will establish new connections by participating in social events. Pleasurable incidents will unfold throughout the day. Amicable discussions will take place with family members. Particularly, the bond with your spouse will strengthen further. Misunderstandings will be avoided by openly sharing your thoughts.\nOn this auspicious day, you will clearly understand your emotional needs and find constructive ways to fulfill them. You may engage in small celebrations with friends and relatives, which will rejuvenate your mind. There are also chances to reconnect with old friends whom you haven't seen in a long time. These encounters will sow new hope and positive thoughts in your life. As your social circle expands, you will gain new perspectives and ideas, further enriching your mind.\nFor those in romantic relationships, today will bring very sweet experiences. You will receive the support and love you expect from your partner. A new chapter in your relationship will begin through mutual understanding. For married individuals, this is an excellent day to have heart-to-heart conversations with your spouse and appreciate each other. Your marital life will become even sweeter. Healthy discussions about the children's future will take place within the family, which will aid in your family's growth.\nThis is the right time to enhance your artistic interests. You can engage in painting, music, dance, or any other creative pursuit. Today is suitable for starting a new hobby, which will bring peace and joy to your mind. Connecting with nature will rejuvenate your spirit. You may visit parks or enjoy natural scenery, which will reduce your stress and increase your enthusiasm.\nSpiritually, you will also see progress. Engaging in meditation or prayers will bring mental peace. Your inner consciousness will become clearer. This is a good opportunity to reflect deeply on the purposes of life. You will gain satisfaction by helping others and may engage in small acts of charity, which will increase your merits.\nGenerally, today you will approach situations very positively. You will face any challenge with confidence and find opportunities to learn from it. By acting with self-confidence, you can achieve many good things. Your personality will shine. You have the power to charm others and bring them to your way. This will lead to many favorable changes in your social and personal relationships. Acting calmly without haste in any matter will bring success. Today will bring new splendor and happiness into your life.",
    "career_ta": "உங்கள் பணியிடத்தில் சுமுகமான சூழல் நிலவும். புதிய திட்டங்கள் மற்றும் ஒத்துழைப்புகள் உருவாக வாய்ப்புகள் உண்டு. சக ஊழியர்களுடன் நல்லுறவு பேணுவீர்கள். உங்கள் யோசனைகள் ஏற்றுக்கொள்ளப்பட்டு பாராட்டப்படும். கலை மற்றும் வடிவமைப்பு சார்ந்த துறைகளில் உள்ளவர்களுக்கு புதிய வாய்ப்புகள் கிடைக்கும். உங்கள் கடின உழைப்புக்கு அங்கீகாரம் கிடைக்கும் நாள் இது. நிர்வாகத்திடம் நல்ல பெயர் பெறுவீர்கள். மேலதிகாரிகளுடன் இணக்கமான உறவு உருவாகும்.",
    "career_en": "A harmonious atmosphere will prevail in your workplace. Opportunities may arise for new projects and collaborations. You will maintain good relationships with colleagues. Your ideas will be accepted and appreciated. Those in creative and design fields will find new opportunities. This is a day when your hard work will be recognized. You will earn a good reputation with management, and a harmonious relationship will develop with superiors.",
    "finance_ta": "நிதிநிலையில் ஒரு ஸ்திரத்தன்மை காணப்படும். எதிர்பாராத வகையில் சிறிய வருமான ஆதாயங்கள் கிடைக்கலாம். நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பதற்கு இது ஒரு நல்ல நேரம். செலவுகளைக் கட்டுப்படுத்தி, எதிர்காலத்திற்கான சேமிப்பை அதிகரிக்கலாம். ஆடம்பரச் செலவுகளைத் தவிர்த்து, அத்தியாவசியத் தேவைகளுக்கு முக்கியத்துவம் கொடுப்பது நல்லது. குடும்பச் செலவுகள் சீராக இருக்கும். பணவரவு திருப்திகரமாக இருக்கும்.",
    "finance_en": "Financial stability will be observed. Unexpected small income gains may occur. This is a good time to think about long-term investments. You can control expenses and increase savings for the future. It's advisable to avoid luxury spending and prioritize essential needs. Family expenses will be stable, and cash flow will be satisfactory.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதி அதிகரிப்பதால் உடல்நிலையும் மேம்படும். புதிய உடற்பயிற்சிகளைத் தொடங்க இது ஒரு சிறந்த நாள். சமச்சீர் உணவு எடுத்துக்கொள்வதில் கவனம் செலுத்துங்கள். யோகா அல்லது தியானம் செய்வதன் மூலம் மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சி பெறலாம். உடல்நலனில் சிறிய பாதிப்புகள் இருந்தாலும் அவை விரைவில் சீராகும். போதுமான ஓய்வு எடுப்பது முக்கியம்.",
    "health_en": "Your physical health will be excellent. As mental peace increases, your physical condition will also improve. This is a great day to start new exercise routines. Focus on maintaining a balanced diet. You can reduce stress and rejuvenate through yoga or meditation. Even if there are minor health issues, they will soon stabilize. Getting adequate rest is important.",
    "lucky_number": "9",
    "lucky_color_ta": "சிவப்பு",
    "lucky_color_en": "Red"
  },
  {
    "sign_ta": "ரிஷபம்",
    "sign_en": "Taurus",
    "date": "27-02-2026",
    "prediction_ta": "இன்றைய வெள்ளிக்கிழமை ரிஷப ராசிக்காரர்களுக்கு மகிழ்ச்சியும், அமைதியும் நிறைந்த ஒரு நாளாக அமையும். சுக்கிரனின் ஆதிக்கத்தால், உங்கள் தனிப்பட்ட உறவுகளிலும், நிதி விஷயங்களிலும் நல்ல முன்னேற்றங்களைக் காண்பீர்கள். குடும்ப உறுப்பினர்களுடன் இணக்கமான சூழல் நிலவும். வீட்டில் அழகுபடுத்தும் பணிகளில் ஈடுபடலாம் அல்லது புதிய பொருட்கள் வாங்குவதற்கு இது ஒரு சிறந்த நாள். உங்கள் ரசனையும், கலை ஆர்வமும் அதிகரிக்கும். சமூக நிகழ்வுகளில் கலந்துகொள்வதன் மூலம் புதிய நண்பர்களைச் சந்திக்கவும், பழைய தொடர்புகளைப் புதுப்பிக்கவும் வாய்ப்புகள் கிடைக்கும்.\nஉங்கள் மனதிற்கு அமைதியையும், சந்தோஷத்தையும் தரக்கூடிய விஷயங்களில் ஈடுபடுவீர்கள். குறிப்பாக, நீண்ட நாட்களாக நீங்கள் விரும்பிய ஒரு காரியத்தைச் செய்து முடிக்க இது சரியான தருணம். உங்கள் எண்ணங்கள் தெளிவுற்று, எதிலும் ஒரு நேர்மறையான அணுகுமுறையுடன் செயல்படுவீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் மனம்விட்டுப் பேசும் வாய்ப்பு கிடைக்கும். இது உங்கள் உறவுகளை மேலும் வலுப்படுத்தும். பிறருக்கு உதவி செய்வதன் மூலம் மனநிறைவைப் பெறுவீர்கள். சமூக சேவைகளில் ஈடுபட இது ஒரு சிறந்த நாள்.\nகாதல் உறவுகளில் இருப்பவர்களுக்கு இன்று மிகவும் இனிமையான நாளாகும். உங்கள் துணையுடன் ஆழமான புரிதலை ஏற்படுத்திக்கொள்வீர்கள். ஒருவருக்கொருவர் ஆதரவாக இருந்து, வருங்காலத் திட்டங்கள் குறித்து ஆரோக்கியமான விவாதங்களை மேற்கொள்ளலாம். திருமணமான தம்பதிகள் தங்கள் இல்லற வாழ்க்கையில் புதிய மகிழ்ச்சியையும், நெருக்கத்தையும் உணர்வார்கள். ஒரு ரொமான்டிக் சூழல் நிலவும். குழந்தைகளின் திறமைகளை ஊக்குவிக்க இது ஒரு நல்ல நாள்.\nஉங்கள் படைப்பாற்றல் உச்சத்தில் இருக்கும். கலை, இசை, இலக்கியம் போன்ற துறைகளில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். புதிய முயற்சிகளில் ஈடுபட இது உகந்தது. உங்கள் பொழுதுபோக்குகளில் அதிக கவனம் செலுத்தலாம். இது உங்கள் மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சி அளிக்கும். இயற்கையுடன் இணைந்திருப்பதன் மூலம் மனதிற்கு அமைதி கிடைக்கும். தோட்டம் அமைப்பது அல்லது பூச்செடிகளைப் பராமரிப்பது போன்ற செயல்களில் ஈடுபடலாம். இது உங்கள் மனதிற்கு மகிழ்ச்சியைத் தரும்.\nஆன்மீக ரீதியாகவும் நீங்கள் முன்னேற்றம் காண்பீர்கள். இறைவழிபாடு மற்றும் தியானத்தில் ஈடுபடுவதன் மூலம் மன அமைதி கிடைக்கும். உங்கள் அக உணர்வுகள் மேலும் தெளிவு பெறும். பிறருக்கு நன்மை செய்வதன் மூலம் நீங்கள் மனநிறைவை அடைவீர்கள். சமூகத்தில் உங்கள் மதிப்பும் மரியாதையும் உயரும். உங்கள் தன்னம்பிக்கை அதிகரிக்கும். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொண்டு, அதிலிருந்து கற்றுக்கொள்வதற்கான வாய்ப்புகள் உருவாகும். பொறுமையுடனும், நிதானத்துடனும் செயல்படுவது உங்களுக்கு வெற்றியைத் தேடித்தரும். இன்றைய நாள் உங்கள் வாழ்க்கையில் புதிய நல்லிணக்கத்தையும், சந்தோஷத்தையும் கொண்டு வரும்.",
    "prediction_en": "Today, Friday, will be a day filled with joy and peace for Taurus natives. Under the influence of Venus, you will see good progress in your personal relationships and financial matters. A harmonious atmosphere will prevail with family members. You may engage in home decorating tasks, or it's a great day to purchase new items. Your taste and artistic interests will increase. Participating in social events will provide opportunities to meet new friends and renew old connections.\nYou will engage in activities that bring peace and happiness to your mind. Specifically, this is the right time to complete a task you have long desired. Your thoughts will become clear, and you will act with a positive approach in everything. Opportunities will arise to have heartfelt conversations with friends and relatives, which will further strengthen your relationships. You will gain satisfaction by helping others. This is an excellent day to engage in social service.\nFor those in romantic relationships, today is a very sweet day. You will establish a deep understanding with your partner. You can support each other and have healthy discussions about future plans. Married couples will feel new joy and intimacy in their marital life. A romantic atmosphere will prevail. This is a good day to encourage your children's talents.\nYour creativity will be at its peak. Good opportunities will arise for those in fields like art, music, and literature. This is suitable for engaging in new ventures. You can focus more on your hobbies, which will reduce your stress and rejuvenate you. Connecting with nature will bring peace of mind. You may engage in activities like gardening or maintaining flowering plants, which will bring joy to your mind.\nSpiritually, you will also see progress. Engaging in prayer and meditation will bring mental peace. Your inner consciousness will become clearer. You will achieve satisfaction by doing good for others. Your respect and standing in society will increase. Your self-confidence will grow. Opportunities will arise to face any challenge with confidence and learn from it. Acting with patience and calmness will bring you success. Today will bring new harmony and happiness into your life.",
    "career_ta": "உங்கள் பணியிடத்தில் சுமூகமான மற்றும் ஒத்துழைப்பான சூழல் நிலவும். புதிய திட்டங்களில் ஈடுபடவும், உங்கள் திறமைகளை வெளிப்படுத்தவும் வாய்ப்புகள் கிடைக்கும். குழுப்பணிகளில் சிறப்பாக செயல்படுவீர்கள். உங்கள் கருத்துக்களுக்கு நல்ல வரவேற்பு கிடைக்கும். கலை மற்றும் ஆக்கப்பூர்வமான துறைகளில் உள்ளவர்களுக்கு இது ஒரு பொன்னான நாள். உங்கள் முயற்சிகளுக்கு நல்ல பலன் கிடைக்கும். மேலதிகாரிகளின் பாராட்டைப் பெறுவீர்கள்.",
    "career_en": "A smooth and cooperative environment will prevail in your workplace. Opportunities will arise to engage in new projects and showcase your talents. You will perform well in team tasks. Your ideas will be well-received. This is a golden day for those in artistic and creative fields. Your efforts will yield good results, and you will receive appreciation from superiors.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். எதிர்பாராத வகையில் நிதி வரவுகள் கிடைக்க வாய்ப்புகள் உண்டு. சேமிப்பு மற்றும் முதலீடுகளை அதிகரிக்க இது ஒரு நல்ல நேரம். வீட்டை அழகுபடுத்துவதற்கோ அல்லது குடும்பத்திற்காக அத்தியாவசிய பொருட்களை வாங்குவதற்கோ செலவு செய்யலாம். வரவு செலவுக் கணக்கை சரியாக நிர்வகிப்பதன் மூலம் நிதி நிலைமை மேம்படும். நீண்டகால திட்டங்களுக்கு இப்போது அடித்தளம் இடலாம்.",
    "finance_en": "Your financial situation will be stable. There are chances for unexpected financial inflows. This is a good time to increase savings and investments. You may spend on home decoration or purchasing essential items for the family. By managing income and expenses properly, your financial situation will improve. You can lay the foundation for long-term plans now.",
    "health_ta": "ஆரோக்கியத்தில் நல்ல முன்னேற்றம் காணப்படும். மன அழுத்தம் குறைந்து, உற்சாகமாக உணர்வீர்கள். புதிய உணவுப் பழக்கவழக்கங்களை மேற்கொள்ள இது உகந்தது. உடற்பயிற்சிகளைத் தவறாமல் செய்வது உடல் வலிமையை அதிகரிக்கும். யோகா மற்றும் தியானம் மன அமைதிக்கு உதவும். நல்ல ஓய்வு எடுத்துக்கொள்வதன் மூலம் உடல் புத்துணர்ச்சி பெறும். சிறிய உடல்நலக் கோளாறுகள் விரைவில் நீங்கும்.",
    "health_en": "Good progress will be seen in health. Stress will reduce, and you will feel energetic. This is suitable for adopting new dietary habits. Regular exercise will increase physical strength. Yoga and meditation will aid in mental peace. Getting good rest will rejuvenate the body. Minor health issues will soon resolve.",
    "lucky_number": "6",
    "lucky_color_ta": "வெண்மை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "மிதுனம்",
    "sign_en": "Gemini",
    "date": "27-02-2026",
    "prediction_ta": "இன்றைய வெள்ளிக்கிழமை மிதுன ராசிக்காரர்களுக்கு சமூகத் தொடர்புகளும், புதிய அனுபவங்களும் நிறைந்த ஒரு நாளாக அமையும். சுக்கிரனின் ஆதிக்கத்தால், உங்கள் நண்பர்கள் மற்றும் உறவினர்களுடனான உறவுகள் வலுப்பெறும். சமூக நிகழ்வுகளில் கலந்துகொள்வதன் மூலம் புதிய நபர்களைச் சந்திக்கவும், சுவாரஸ்யமான உரையாடல்களில் ஈடுபடவும் வாய்ப்புகள் கிடைக்கும். உங்கள் கருத்துக்களை தெளிவாகவும், இனிமையாகவும் வெளிப்படுத்துவதன் மூலம் பிறரைக் கவர்வீர்கள்.\nமனதிற்கு மகிழ்ச்சியூட்டும் செய்திகள் வந்து சேரும். தொலைதூர நண்பர்களுடனான தொடர்பு புதுப்பிக்கப்படலாம். குறுகிய பயணங்கள் மேற்கொள்ள வாய்ப்புகள் உண்டு. இது உங்கள் மனதிற்கு புத்துணர்ச்சி அளிக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்திக்கொள்வதற்கும் இது ஒரு சிறந்த நாள். உங்கள் படைப்பாற்றல் வெளிப்படும். எழுத்து, பேச்சு, மற்றும் ஊடகத் துறைகளில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். குழுப்பணிகளில் சிறப்பாக செயல்படுவீர்கள்.\nகாதல் உறவுகளில் உள்ளவர்கள் தங்கள் துணையுடன் மனம்விட்டுப் பேசவும், ஒருவரை ஒருவர் புரிந்துகொள்ளவும் இது ஒரு நல்ல நாள். உறவில் அன்பு அதிகரிக்கும். திருமணமானவர்கள் தங்கள் இல்லற வாழ்க்கையில் மகிழ்ச்சியையும், இணக்கத்தையும் காண்பார்கள். குழந்தைகளின் கல்வி மற்றும் எதிர்காலம் குறித்த ஆரோக்கியமான விவாதங்கள் குடும்பத்தில் நடைபெறும். குடும்ப உறுப்பினர்களுடன் சிநேகமான சூழல் நிலவும். வீட்டில் மகிழ்ச்சியான தருணங்கள் அரங்கேறும்.\nஉங்கள் பொழுதுபோக்குகளில் அதிக கவனம் செலுத்தலாம். இசை கேட்பது, புத்தகம் படிப்பது அல்லது புதிய விளையாட்டுகளில் ஈடுபடுவது போன்ற செயல்கள் உங்களுக்கு மன அமைதியையும், சந்தோஷத்தையும் தரும். உங்கள் தனிப்பட்ட வளர்ச்சிக்கு இது ஒரு நல்ல நாள். புதிய திறமைகளைக் கற்றுக்கொள்வதற்கு ஆர்வம் காட்டுவீர்கள். இயற்கையுடன் இணைந்திருப்பதன் மூலம் மனதிற்கு புத்துணர்ச்சி கிடைக்கும். குறுகிய பயணங்கள் அல்லது பொழுதுபோக்கு நடவடிக்கைகளில் ஈடுபடலாம். இது உங்கள் மன அழுத்தத்தைக் குறைத்து, உற்சாகத்தை அதிகரிக்கும்.\nஆன்மீக ரீதியாகவும் நீங்கள் முன்னேற்றம் காண்பீர்கள். தியானம் மற்றும் பிரார்த்தனைகளில் ஈடுபடுவதன் மூலம் மன அமைதி கிடைக்கும். உங்கள் அக உணர்வுகள் மேலும் தெளிவு பெறும். வாழ்க்கையின் நோக்கங்கள் குறித்து ஆழமாக சிந்திக்க இது ஒரு நல்ல வாய்ப்பு. பிறருக்கு உதவி செய்வதன் மூலம் நீங்கள் மனநிறைவைப் பெறுவீர்கள். சிறிய அளவில் தொண்டு காரியங்களில் ஈடுபடலாம். இது உங்கள் புண்ணிய கணக்கை அதிகரிக்கும்.\nபொதுவாக, இன்று நீங்கள் சூழ்நிலைகளை மிக நேர்மறையாக அணுகுவீர்கள். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொண்டு, அதிலிருந்து கற்றுக்கொள்வதற்கான வாய்ப்புகளைப் பெறுவீர்கள். தன்னம்பிக்கையுடன் செயல்படுவதன் மூலம் பல நல்ல காரியங்களை சாதிக்க முடியும். உங்கள் ஆளுமைத்திறன் அதிகரிக்கும். பிறரைக் கவர்ந்து, அவர்களை உங்கள் வழிக்குக் கொண்டு வரும் சக்தி உங்களுக்கு உண்டு. இதனால், உங்கள் சமூக மற்றும் தனிப்பட்ட உறவுகளில் பல சாதகமான மாற்றங்கள் ஏற்படும். எந்தவொரு விஷயத்திலும் அவசரப்படாமல், நிதானத்துடன் செயல்படுவது வெற்றியைப் பெற்றுத்தரும். இன்றைய நாள் உங்கள் வாழ்க்கையில் புதிய பொலிவையும், மகிழ்ச்சியையும் கொண்டு வரும்.",
    "prediction_en": "Today, Friday, will be a day filled with social connections and new experiences for Gemini natives. Under the influence of Venus, your relationships with friends and relatives will strengthen. Participating in social events will provide opportunities to meet new people and engage in interesting conversations. You will impress others by expressing your views clearly and pleasantly.\nJoyful news will arrive. Contact with distant friends may be renewed. There are chances for short trips, which will rejuvenate your mind. This is an excellent day to learn new things and enhance your knowledge. Your creativity will manifest. Good opportunities will arise for those in writing, speaking, and media fields. You will perform well in team tasks.\nThose in romantic relationships will find this a good day to have heartfelt conversations with their partners and understand each other. Love in the relationship will increase. Married couples will experience happiness and harmony in their marital life. Healthy discussions about children's education and future will take place within the family. A friendly atmosphere will prevail among family members, and joyful moments will unfold at home.\nYou can focus more on your hobbies. Activities like listening to music, reading books, or engaging in new games will bring peace and happiness to your mind. This is a good day for your personal growth. You will show interest in learning new skills. Connecting with nature will bring mental rejuvenation. You can engage in short trips or recreational activities, which will reduce your stress and increase your enthusiasm.\nSpiritually, you will also see progress. Engaging in meditation and prayers will bring mental peace. Your inner consciousness will become clearer. This is a good opportunity to reflect deeply on the purposes of life. You will gain satisfaction by helping others. You may engage in small acts of charity, which will increase your merits.\nGenerally, today you will approach situations very positively. You will face any challenge with confidence and find opportunities to learn from it. By acting with self-confidence, you can achieve many good things. Your personality will shine. You have the power to charm others and bring them to your way. This will lead to many favorable changes in your social and personal relationships. Acting calmly without haste in any matter will bring success. Today will bring new splendor and happiness into your life.",
    "career_ta": "உங்கள் தகவல் தொடர்புத் திறன்கள் இன்று சிறப்பாக இருக்கும். புதிய யோசனைகளை முன்வைத்து, சக ஊழியர்கள் மற்றும் மேலதிகாரிகளை கவர இது ஒரு நல்ல நாள். குழுப்பணிகளில் உங்கள் பங்களிப்பு பாராட்டப்படும். புதிய தொடர்புகள் உங்கள் தொழில் வளர்ச்சிக்கு உதவும். எழுத்து, ஊடகம், கல்வி போன்ற துறைகளில் உள்ளவர்களுக்கு சிறப்பான வாய்ப்புகள் அமையும். உங்கள் கடின உழைப்புக்கு அங்கீகாரம் கிடைக்கும்.",
    "career_en": "Your communication skills will be excellent today. This is a good day to present new ideas and impress colleagues and superiors. Your contribution in team tasks will be appreciated. New connections will aid in your career growth. Excellent opportunities will arise for those in writing, media, and education fields. Your hard work will be recognized.",
    "finance_ta": "நிதிநிலைமை சீராக இருக்கும். சிறுசிறு முதலீடுகளைப் பற்றி சிந்திப்பதற்கு இது ஒரு நல்ல நேரம். வரவுக்கும் செலவுக்கும் இடையே சமநிலை பேணுவீர்கள். ஆடம்பரச் செலவுகளைத் தவிர்த்து, அத்தியாவசிய தேவைகளுக்கு முக்கியத்துவம் கொடுப்பது நல்லது. எதிர்பாராத வகையில் ஒரு சிறிய நிதி ஆதாயம் கிடைக்கலாம். பட்ஜெட்டை முறையாக நிர்வகிப்பதன் மூலம் எதிர்காலத்திற்கான சேமிப்பை அதிகரிக்கலாம்.",
    "finance_en": "Your financial situation will be stable. This is a good time to think about small investments. You will maintain a balance between income and expenditure. It's advisable to avoid luxury spending and prioritize essential needs. An unexpected small financial gain may occur. By managing your budget properly, you can increase savings for the future.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். மன அமைதியுடன் இருப்பதால், உடல்நிலையும் சீராக இருக்கும். புதிய உணவு முறைகளை முயற்சிக்கலாம். குறிப்பாக, நீர்ச்சத்து நிறைந்த உணவுகளை எடுத்துக்கொள்வது நல்லது. சுவாசப் பயிற்சிகள் மற்றும் லேசான உடற்பயிற்சிகள் மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சி தரும். போதுமான தூக்கம் உடல் ஆரோக்கியத்திற்கு மிகவும் அவசியம்.",
    "health_en": "Physical health will improve. As you maintain mental peace, your physical condition will also be stable. You can try new dietary patterns, especially consuming water-rich foods. Breathing exercises and light workouts will reduce stress and rejuvenate you. Adequate sleep is very essential for physical health.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "27-02-2026",
    "prediction_ta": "இன்றைய வெள்ளிக்கிழமை கடக ராசிக்காரர்களுக்கு குடும்பத்திலும், தனிப்பட்ட வாழ்க்கையிலும் நல்லிணக்கம் நிறைந்த ஒரு நாளாக அமையும். சுக்கிரனின் ஆதிக்கத்தால், உங்கள் குடும்ப உறவுகள் வலுப்பெறும். வீட்டில் அமைதியும், மகிழ்ச்சியும் நிலவும். வீட்டு அலங்காரப் பணிகளில் ஈடுபடலாம் அல்லது குடும்பத்திற்காக புதிய பொருட்களை வாங்குவதற்கு இது ஒரு சிறந்த நாள். உங்கள் உணர்வுகள் மதிக்கப்பட்டு, உங்கள் அன்புக்குரியவர்களுடன் ஆழமான பிணைப்பை உணர்வீர்கள்.\nஉங்கள் மனதிற்கு அமைதியைத் தரக்கூடிய விஷயங்களில் ஈடுபடுவீர்கள். குறிப்பாக, நீண்ட நாட்களாக நீங்கள் விரும்பிய ஒரு காரியத்தைச் செய்து முடிக்க இது சரியான தருணம். உங்கள் எண்ணங்கள் தெளிவுற்று, எதிலும் ஒரு நேர்மறையான அணுகுமுறையுடன் செயல்படுவீர்கள். குடும்ப உறுப்பினர்களுடனும், நண்பர்களுடனும் மனம்விட்டுப் பேசும் வாய்ப்பு கிடைக்கும். இது உங்கள் உறவுகளை மேலும் வலுப்படுத்தும். பிறருக்கு உதவி செய்வதன் மூலம் மனநிறைவைப் பெறுவீர்கள். சமூக சேவைகளில் ஈடுபட இது ஒரு சிறந்த நாள். உங்கள் சமூக வட்டாரம் விரிவடைவதால், புதிய கருத்துக்களையும், எண்ணங்களையும் நீங்கள் அறிந்து கொள்வீர்கள். இது உங்கள் மனதை மேலும் பக்குவப்படுத்தும்.\nகாதல் உறவுகளில் இருப்பவர்களுக்கு இன்று மிகவும் இனிமையான நாளாகும். உங்கள் துணையுடன் ஆழமான புரிதலை ஏற்படுத்திக்கொள்வீர்கள். ஒருவருக்கொருவர் ஆதரவாக இருந்து, வருங்காலத் திட்டங்கள் குறித்து ஆரோக்கியமான விவாதங்களை மேற்கொள்ளலாம். திருமணமான தம்பதிகள் தங்கள் இல்லற வாழ்க்கையில் புதிய மகிழ்ச்சியையும், நெருக்கத்தையும் உணர்வார்கள். ஒரு ரொமான்டிக் சூழல் நிலவும். குழந்தைகளின் திறமைகளை ஊக்குவிக்க இது ஒரு நல்ல நாள். அவர்களின் எதிர்காலம் குறித்த நல்ல திட்டங்களை வகுப்பீர்கள்.\nஉங்கள் படைப்பாற்றல் உச்சத்தில் இருக்கும். கலை, இசை, இலக்கியம் போன்ற துறைகளில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். புதிய முயற்சிகளில் ஈடுபட இது உகந்தது. உங்கள் பொழுதுபோக்குகளில் அதிக கவனம் செலுத்தலாம். இது உங்கள் மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சி அளிக்கும். இயற்கையுடன் இணைந்திருப்பதன் மூலம் மனதிற்கு அமைதி கிடைக்கும். தோட்டம் அமைப்பது அல்லது பூச்செடிகளைப் பராமரிப்பது போன்ற செயல்களில் ஈடுபடலாம். இது உங்கள் மனதிற்கு மகிழ்ச்சியைத் தரும்.\nஆன்மீக ரீதியாகவும் நீங்கள் முன்னேற்றம் காண்பீர்கள். இறைவழிபாடு மற்றும் தியானத்தில் ஈடுபடுவதன் மூலம் மன அமைதி கிடைக்கும். உங்கள் அக உணர்வுகள் மேலும் தெளிவு பெறும். பிறருக்கு நன்மை செய்வதன் மூலம் நீங்கள் மனநிறைவை அடைவீர்கள். சமூகத்தில் உங்கள் மதிப்பும் மரியாதையும் உயரும். உங்கள் தன்னம்பிக்கை அதிகரிக்கும். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொண்டு, அதிலிருந்து கற்றுக்கொள்வதற்கான வாய்ப்புகள் உருவாகும். பொறுமையுடனும், நிதானத்துடனும் செயல்படுவது உங்களுக்கு வெற்றியைத் தேடித்தரும். இன்றைய நாள் உங்கள் வாழ்க்கையில் புதிய நல்லிணக்கத்தையும், சந்தோஷத்தையும் கொண்டு வரும்.",
    "prediction_en": "Today, Friday, will be a day filled with harmony for Cancer natives in both family and personal life. Under the influence of Venus, your family relationships will strengthen. Peace and happiness will prevail at home. You may engage in home decorating tasks or it's an excellent day to purchase new items for the family. Your feelings will be respected, and you will feel a deep bond with your loved ones.\nYou will engage in activities that bring peace to your mind. Specifically, this is the right time to complete a task you have long desired. Your thoughts will become clear, and you will act with a positive approach in everything. Opportunities will arise to have heartfelt conversations with family members and friends, which will further strengthen your relationships. You will gain satisfaction by helping others. This is an excellent day to engage in social service. As your social circle expands, you will gain new perspectives and ideas, further enriching your mind.\nFor those in romantic relationships, today is a very sweet day. You will establish a deep understanding with your partner. You can support each other and have healthy discussions about future plans. Married couples will feel new joy and intimacy in their marital life. A romantic atmosphere will prevail. This is a good day to encourage your children's talents. You will formulate good plans regarding their future.\nYour creativity will be at its peak. Good opportunities will arise for those in fields like art, music, and literature. This is suitable for engaging in new ventures. You can focus more on your hobbies, which will reduce your stress and rejuvenate you. Connecting with nature will bring peace of mind. You may engage in activities like gardening or maintaining flowering plants, which will bring joy to your mind.\nSpiritually, you will also see progress. Engaging in prayer and meditation will bring mental peace. Your inner consciousness will become clearer. You will achieve satisfaction by doing good for others. Your respect and standing in society will increase. Your self-confidence will grow. Opportunities will arise to face any challenge with confidence and learn from it. Acting with patience and calmness will bring you success. Today will bring new harmony and happiness into your life.",
    "career_ta": "பணியிடத்தில் உங்கள் மனசாட்சிக்கு மதிப்பளித்து செயல்படுவீர்கள். உங்கள் உணர்ச்சிபூர்வமான அணுகுமுறை சக ஊழியர்களுடன் நல்ல உறவை ஏற்படுத்த உதவும். புதிய திட்டங்களில் உங்கள் பங்களிப்பு பாராட்டப்படும். குறிப்பாக, சமூக நலன் சார்ந்த பணிகளில் ஈடுபடுபவர்களுக்கு நல்ல அங்கீகாரம் கிடைக்கும். மேலதிகாரிகளின் ஆதரவு கிடைக்கும். உங்கள் கடமைகளை செம்மையாக செய்வீர்கள். அலுவலக சூழல் இணக்கமாக இருக்கும்.",
    "career_en": "In the workplace, you will act by valuing your conscience. Your emotional approach will help establish good relationships with colleagues. Your contribution to new projects will be appreciated. Particularly, those involved in social welfare activities will receive good recognition. Support from superiors will be available. You will perform your duties diligently, and the office environment will be harmonious.",
    "finance_ta": "நிதிநிலைமை திருப்திகரமாக இருக்கும். குடும்பத்திற்காக செலவு செய்வதில் மகிழ்ச்சி அடைவீர்கள். நீண்டகால சேமிப்புத் திட்டங்களில் முதலீடு செய்ய இது ஒரு நல்ல நேரம். வரவு செலவுக் கணக்கை கவனமாக நிர்வகிப்பீர்கள். வீட்டு உபயோகப் பொருட்களை வாங்குவதற்கு செலவு செய்யலாம். நிதி ஆதாயங்களுக்கான புதிய வழிகள் பற்றி சிந்திக்கலாம். எதிர்காலத்திற்கான நிதி பாதுகாப்பு உறுதி செய்யப்படும்.",
    "finance_en": "Your financial situation will be satisfactory. You will find joy in spending for your family. This is a good time to invest in long-term savings plans. You will carefully manage your income and expenses. You may spend on household appliances. You can think about new avenues for financial gains, and financial security for the future will be ensured.",
    "health_ta": "உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது நல்லது. மன அமைதி உடல் நலத்திற்கு முக்கியம். தியானம் மற்றும் யோகா செய்வதன் மூலம் மன அழுத்தத்தைக் குறைக்கலாம். சீரான உணவு முறையும், போதுமான ஓய்வும் உடல் நலனை மேம்படுத்தும். குடும்பத்தினருடன் நேரம் செலவிடுவது மனதிற்கு மகிழ்ச்சியூட்டும். சிறிய உடல் உபாதைகள் இருந்தாலும் அவை விரைவில் சரியாகிவிடும். புதிய உடற்பயிற்சிகளை தொடங்க இது ஒரு நல்ல நாள்.",
    "health_en": "It is good to focus on physical health. Mental peace is important for well-being. You can reduce stress through meditation and yoga. A balanced diet and adequate rest will improve health. Spending time with family will bring joy to the mind. Even if there are minor health ailments, they will soon resolve. This is a good day to start new exercises.",
    "lucky_number": "2",
    "lucky_color_ta": "இளஞ்சிவப்பு",
    "lucky_color_en": "Pink"
  },
  {
    "sign_ta": "சிம்மம்",
    "sign_en": "Leo",
    "date": "27-02-2026",
    "prediction_ta": "இன்றைய வெள்ளிக்கிழமை சிம்ம ராசிக்காரர்களுக்கு படைப்பாற்றலும், சமூக அங்கீகாரமும் நிறைந்த ஒரு நாளாக அமையும். சுக்கிரனின் ஆதிக்கத்தால், உங்கள் சமூக உறவுகள் வலுப்பெறும். உங்கள் ஆளுமைத் திறன் வெளிப்படும். பிறரைக் கவர்ந்து, அவர்களின் ஆதரவைப் பெறுவீர்கள். புதிய நண்பர்களைச் சந்திப்பதற்கும், சுவாரஸ்யமான உரையாடல்களில் ஈடுபடுவதற்கும் வாய்ப்புகள் கிடைக்கும். சமூக நிகழ்வுகளில் நீங்கள் முன்னிலை வகிப்பீர்கள். உங்கள் தலைமைத்துவப் பண்புகள் பாராட்டப்படும்.\nஉங்கள் மனதிற்கு மகிழ்ச்சியூட்டும் செய்திகள் வந்து சேரும். நீண்ட நாட்களாக நீங்கள் எதிர்பார்த்த ஒரு நல்ல காரியம் நடக்கும். உங்கள் எண்ணங்கள் தெளிவுற்று, எதிலும் ஒரு நேர்மறையான அணுகுமுறையுடன் செயல்படுவீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் மனம்விட்டுப் பேசும் வாய்ப்பு கிடைக்கும். இது உங்கள் உறவுகளை மேலும் வலுப்படுத்தும். பிறருக்கு உதவி செய்வதன் மூலம் மனநிறைவைப் பெறுவீர்கள். சமூக சேவைகளில் ஈடுபட இது ஒரு சிறந்த நாள்.\nகாதல் உறவுகளில் இருப்பவர்களுக்கு இன்று மிகவும் இனிமையான நாளாகும். உங்கள் துணையுடன் ஆழமான புரிதலை ஏற்படுத்திக்கொள்வீர்கள். ஒருவருக்கொருவர் ஆதரவாக இருந்து, வருங்காலத் திட்டங்கள் குறித்து ஆரோக்கியமான விவாதங்களை மேற்கொள்ளலாம். திருமணமான தம்பதிகள் தங்கள் இல்லற வாழ்க்கையில் புதிய மகிழ்ச்சியையும், நெருக்கத்தையும் உணர்வார்கள். ஒரு ரொமான்டிக் சூழல் நிலவும். குழந்தைகளின் திறமைகளை ஊக்குவிக்க இது ஒரு நல்ல நாள். அவர்களின் எதிர்காலம் குறித்த நல்ல திட்டங்களை வகுப்பீர்கள்.\nஉங்கள் படைப்பாற்றல் உச்சத்தில் இருக்கும். கலை, இசை, இலக்கியம் போன்ற துறைகளில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். புதிய முயற்சிகளில் ஈடுபட இது உகந்தது. உங்கள் பொழுதுபோக்குகளில் அதிக கவனம் செலுத்தலாம். இது உங்கள் மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சி அளிக்கும். இயற்கையுடன் இணைந்திருப்பதன் மூலம் மனதிற்கு அமைதி கிடைக்கும். தோட்டம் அமைப்பது அல்லது பூச்செடிகளைப் பராமரிப்பது போன்ற செயல்களில் ஈடுபடலாம். இது உங்கள் மனதிற்கு மகிழ்ச்சியைத் தரும்.\nஆன்மீக ரீதியாகவும் நீங்கள் முன்னேற்றம் காண்பீர்கள். இறைவழிபாடு மற்றும் தியானத்தில் ஈடுபடுவதன் மூலம் மன அமைதி கிடைக்கும். உங்கள் அக உணர்வுகள் மேலும் தெளிவு பெறும். பிறருக்கு நன்மை செய்வதன் மூலம் நீங்கள் மனநிறைவை அடைவீர்கள். சமூகத்தில் உங்கள் மதிப்பும் மரியாதையும் உயரும். உங்கள் தன்னம்பிக்கை அதிகரிக்கும். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொண்டு, அதிலிருந்து கற்றுக்கொள்வதற்கான வாய்ப்புகள் உருவாகும். பொறுமையுடனும், நிதானத்துடனும் செயல்படுவது உங்களுக்கு வெற்றியைத் தேடித்தரும். இன்றைய நாள் உங்கள் வாழ்க்கையில் புதிய நல்லிணக்கத்தையும், சந்தோஷத்தையும் கொண்டு வரும்.",
    "prediction_en": "Today, Friday, will be a day filled with creativity and social recognition for Leo natives. Under the influence of Venus, your social relationships will strengthen. Your personality will shine. You will charm others and gain their support. Opportunities will arise to meet new friends and engage in interesting conversations. You will take the lead in social events, and your leadership qualities will be appreciated.\nJoyful news will arrive. A good event you have long anticipated will occur. Your thoughts will become clear, and you will act with a positive approach in everything. Opportunities will arise to have heartfelt conversations with friends and relatives, which will further strengthen your relationships. You will gain satisfaction by helping others. This is an excellent day to engage in social service.\nFor those in romantic relationships, today is a very sweet day. You will establish a deep understanding with your partner. You can support each other and have healthy discussions about future plans. Married couples will feel new joy and intimacy in their marital life. A romantic atmosphere will prevail. This is a good day to encourage your children's talents. You will formulate good plans regarding their future.\nYour creativity will be at its peak. Good opportunities will arise for those in fields like art, music, and literature. This is suitable for engaging in new ventures. You can focus more on your hobbies, which will reduce your stress and rejuvenate you. Connecting with nature will bring peace of mind. You may engage in activities like gardening or maintaining flowering plants, which will bring joy to your mind.\nSpiritually, you will also see progress. Engaging in prayer and meditation will bring mental peace. Your inner consciousness will become clearer. You will achieve satisfaction by doing good for others. Your respect and standing in society will increase. Your self-confidence will grow. Opportunities will arise to face any challenge with confidence and learn from it. Acting with patience and calmness will bring you success. Today will bring new harmony and happiness into your life.",
    "career_ta": "உங்கள் தலைமைத்துவப் பண்புகள் பணியிடத்தில் வெளிப்படும். புதிய திட்டங்களை முன்னெடுத்துச் சென்று, அவற்றை வெற்றிகரமாக முடிப்பீர்கள். சக ஊழியர்கள் உங்கள் வழிகாட்டுதலைப் பின்பற்றுவார்கள். உங்கள் படைப்பாற்றல் மற்றும் புதிய யோசனைகள் பாராட்டைப் பெறும். கலை மற்றும் நிர்வாகத் துறைகளில் உள்ளவர்களுக்கு இது ஒரு சிறந்த நாள். உங்கள் செல்வாக்கு அதிகரிக்கும். மேலதிகாரிகளிடம் நல்ல பெயர் பெறுவீர்கள்.",
    "career_en": "Your leadership qualities will shine in the workplace. You will initiate new projects and complete them successfully. Colleagues will follow your guidance. Your creativity and new ideas will receive appreciation. This is an excellent day for those in artistic and managerial fields. Your influence will increase, and you will earn a good reputation with superiors.",
    "finance_ta": "நிதிநிலைமை சிறப்பாக இருக்கும். எதிர்பாராத வகையில் வருமான ஆதாயங்கள் கிடைக்கலாம். சேமிப்பு மற்றும் முதலீடுகளை அதிகரிக்க இது ஒரு நல்ல நேரம். குடும்பத்திற்கான ஆடம்பரமான பொருட்களை வாங்குவதற்கு செலவு செய்யலாம். உங்கள் நிதித் திட்டங்கள் வெற்றிகரமாக அமையும். நீண்டகால நிதிப் பாதுகாப்புக்கு அடித்தளம் இடுவீர்கள். நிதி சம்பந்தமான முடிவுகளில் தெளிவு காணப்படும்.",
    "finance_en": "Your financial situation will be excellent. Unexpected income gains may occur. This is a good time to increase savings and investments. You may spend on luxury items for the family. Your financial plans will be successful, and you will lay the foundation for long-term financial security. Clarity will be seen in financial decisions.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். உற்சாகமாக உணர்வீர்கள். புதிய உடற்பயிற்சிகளைத் தொடங்க இது ஒரு சிறந்த நாள். சமச்சீர் உணவு எடுத்துக்கொள்வதில் கவனம் செலுத்துங்கள். சூரிய ஒளியில் நேரம் செலவிடுவது உடல் நலனுக்கு நல்லது. யோகா மற்றும் தியானம் செய்வதன் மூலம் மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சி பெறலாம். மனமகிழ்ச்சி உடல் ஆரோக்கியத்தை மேம்படுத்தும்.",
    "health_en": "Physical health will be stable. You will feel energetic. This is a great day to start new exercise routines. Focus on maintaining a balanced diet. Spending time in sunlight is good for health. You can reduce stress and rejuvenate through yoga or meditation. Mental happiness will improve physical health.",
    "lucky_number": "1",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "கன்னி",
    "sign_en": "Virgo",
    "date": "27-02-2026",
    "prediction_ta": "இன்றைய வெள்ளிக்கிழமை கன்னி ராசிக்காரர்களுக்கு தனிப்பட்ட வளர்ச்சிக்கும், சமூக உறவுகளை மேம்படுத்துவதற்கும் உகந்த நாளாக அமையும். சுக்கிரனின் ஆதிக்கத்தால், உங்கள் உறவுகளில் நல்லிணக்கமும், புரிதலும் அதிகரிக்கும். பிறருடன் இணைந்து செயல்படுவதன் மூலம் நல்ல பலன்களைப் பெறுவீர்கள். புதிய நண்பர்களைச் சந்திக்கவும், சுவாரஸ்யமான உரையாடல்களில் ஈடுபடவும் வாய்ப்புகள் கிடைக்கும். உங்கள் கருத்துக்கள் தெளிவாகவும், ஆழமாகவும் வெளிப்படுத்தப்படும்.\nஉங்கள் மனதிற்கு மகிழ்ச்சியூட்டும் செய்திகள் வந்து சேரும். நீண்ட நாட்களாக நீங்கள் எதிர்பார்த்த ஒரு நல்ல காரியம் நடக்கும். உங்கள் எண்ணங்கள் தெளிவுற்று, எதிலும் ஒரு நேர்மறையான அணுகுமுறையுடன் செயல்படுவீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் மனம்விட்டுப் பேசும் வாய்ப்பு கிடைக்கும். இது உங்கள் உறவுகளை மேலும் வலுப்படுத்தும். பிறருக்கு உதவி செய்வதன் மூலம் மனநிறைவைப் பெறுவீர்கள். சமூக சேவைகளில் ஈடுபட இது ஒரு சிறந்த நாள்.\nகாதல் உறவுகளில் இருப்பவர்களுக்கு இன்று மிகவும் இனிமையான நாளாகும். உங்கள் துணையுடன் ஆழமான புரிதலை ஏற்படுத்திக்கொள்வீர்கள். ஒருவருக்கொருவர் ஆதரவாக இருந்து, வருங்காலத் திட்டங்கள் குறித்து ஆரோக்கியமான விவாதங்களை மேற்கொள்ளலாம். திருமணமான தம்பதிகள் தங்கள் இல்லற வாழ்க்கையில் புதிய மகிழ்ச்சியையும், நெருக்கத்தையும் உணர்வார்கள். ஒரு ரொமான்டிக் சூழல் நிலவும். குழந்தைகளின் திறமைகளை ஊக்குவிக்க இது ஒரு நல்ல நாள். அவர்களின் எதிர்காலம் குறித்த நல்ல திட்டங்களை வகுப்பீர்கள்.\nஉங்கள் படைப்பாற்றல் உச்சத்தில் இருக்கும். கலை, இசை, இலக்கியம் போன்ற துறைகளில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். புதிய முயற்சிகளில் ஈடுபட இது உகந்தது. உங்கள் பொழுதுபோக்குகளில் அதிக கவனம் செலுத்தலாம். இது உங்கள் மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சி அளிக்கும். இயற்கையுடன் இணைந்திருப்பதன் மூலம் மனதிற்கு அமைதி கிடைக்கும். தோட்டம் அமைப்பது அல்லது பூச்செடிகளைப் பராமரிப்பது போன்ற செயல்களில் ஈடுபடலாம். இது உங்கள் மனதிற்கு மகிழ்ச்சியைத் தரும்.\nஆன்மீக ரீதியாகவும் நீங்கள் முன்னேற்றம் காண்பீர்கள். இறைவழிபாடு மற்றும் தியானத்தில் ஈடுபடுவதன் மூலம் மன அமைதி கிடைக்கும். உங்கள் அக உணர்வுகள் மேலும் தெளிவு பெறும். பிறருக்கு நன்மை செய்வதன் மூலம் நீங்கள் மனநிறைவை அடைவீர்கள். சமூகத்தில் உங்கள் மதிப்பும் மரியாதையும் உயரும். உங்கள் தன்னம்பிக்கை அதிகரிக்கும். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொண்டு, அதிலிருந்து கற்றுக்கொள்வதற்கான வாய்ப்புகள் உருவாகும். பொறுமையுடனும், நிதானத்துடனும் செயல்படுவது உங்களுக்கு வெற்றியைத் தேடித்தரும். இன்றைய நாள் உங்கள் வாழ்க்கையில் புதிய நல்லிணக்கத்தையும், சந்தோஷத்தையும் கொண்டு வரும்.",
    "prediction_en": "Today, Friday, will be a day conducive to personal growth and improving social relationships for Virgo natives. Under the influence of Venus, harmony and understanding in your relationships will increase. You will achieve good results by working collaboratively with others. Opportunities will arise to meet new friends and engage in interesting conversations. Your thoughts will be expressed clearly and profoundly.\nJoyful news will arrive. A good event you have long anticipated will occur. Your thoughts will become clear, and you will act with a positive approach in everything. Opportunities will arise to have heartfelt conversations with friends and relatives, which will further strengthen your relationships. You will gain satisfaction by helping others. This is an excellent day to engage in social service.\nFor those in romantic relationships, today is a very sweet day. You will establish a deep understanding with your partner. You can support each other and have healthy discussions about future plans. Married couples will feel new joy and intimacy in their marital life. A romantic atmosphere will prevail. This is a good day to encourage your children's talents. You will formulate good plans regarding their future.\nYour creativity will be at its peak. Good opportunities will arise for those in fields like art, music, and literature. This is suitable for engaging in new ventures. You can focus more on your hobbies, which will reduce your stress and rejuvenate you. Connecting with nature will bring peace of mind. You may engage in activities like gardening or maintaining flowering plants, which will bring joy to your mind.\nSpiritually, you will also see progress. Engaging in prayer and meditation will bring mental peace. Your inner consciousness will become clearer. You will achieve satisfaction by doing good for others. Your respect and standing in society will increase. Your self-confidence will grow. Opportunities will arise to face any challenge with confidence and learn from it. Acting with patience and calmness will bring you success. Today will bring new harmony and happiness into your life.",
    "career_ta": "பணியிடத்தில் உங்கள் நுண்ணறிவும், பகுப்பாய்வுத் திறனும் பாராட்டப்படும். குழுப்பணிகளில் உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதிய திட்டங்களை ஒழுங்குபடுத்தவும், அவற்றை திறம்பட நிர்வகிக்கவும் இது ஒரு நல்ல நாள். சக ஊழியர்களுடன் நல்லுறவு பேணுவீர்கள். உங்கள் கடின உழைப்புக்கு அங்கீகாரம் கிடைக்கும். சேவை சார்ந்த துறைகளில் உள்ளவர்களுக்கு இது ஒரு சிறந்த நாள். உங்கள் நேர்மை பாராட்டப்படும்.",
    "career_en": "In the workplace, your insight and analytical skills will be appreciated. Your contribution to team projects will be significant. This is a good day to organize new projects and manage them efficiently. You will maintain good relationships with colleagues. Your hard work will be recognized. This is an excellent day for those in service-oriented fields, and your integrity will be praised.",
    "finance_ta": "நிதிநிலைமை சீராக இருக்கும். சேமிப்பை அதிகரிக்க புதிய வழிகளை ஆராய்வீர்கள். சிறுசிறு முதலீடுகள் எதிர்காலத்தில் நல்ல லாபம் தரும். வரவு செலவுக் கணக்கை சரியாக நிர்வகிப்பதன் மூலம் நிதி நிலைமை மேம்படும். வீட்டைப் பழுதுபார்ப்பது அல்லது அழகுபடுத்துவது போன்ற செலவுகள் ஏற்படலாம். நிதி ஆலோசனை பெறுவதற்கு இது ஒரு நல்ல நாள். நீண்டகால நிதித் திட்டங்களை வகுக்கலாம்.",
    "finance_en": "Your financial situation will be stable. You will explore new ways to increase savings. Small investments will yield good profits in the future. By properly managing income and expenses, your financial situation will improve. Expenses such as home repairs or decoration may arise. This is a good day to seek financial advice and formulate long-term financial plans.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். மன அழுத்தம் குறைந்து, உற்சாகமாக உணர்வீர்கள். புதிய உணவுப் பழக்கவழக்கங்களை மேற்கொள்ள இது உகந்தது. உடற்பயிற்சிகளைத் தவறாமல் செய்வது உடல் வலிமையை அதிகரிக்கும். யோகா மற்றும் தியானம் மன அமைதிக்கு உதவும். நல்ல ஓய்வு எடுத்துக்கொள்வதன் மூலம் உடல் புத்துணர்ச்சி பெறும். சிறிய உடல்நலக் கோளாறுகள் இருந்தாலும் அவை விரைவில் சரியாகும்.",
    "health_en": "Good progress will be seen in health. Stress will reduce, and you will feel energetic. This is suitable for adopting new dietary habits. Regular exercise will increase physical strength. Yoga and meditation will aid in mental peace. Getting good rest will rejuvenate the body. Minor health issues will soon resolve.",
    "lucky_number": "5",
    "lucky_color_ta": "பழுப்பு",
    "lucky_color_en": "Brown"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "27-02-2026",
    "prediction_ta": "இன்றைய வெள்ளிக்கிழமை துலாம் ராசிக்காரர்களுக்கு காதல், உறவுகள் மற்றும் சமூக நல்லிணக்கம் நிறைந்த ஒரு நாளாக அமையும். சுக்கிரனின் ஆதிக்கத்தால், உங்கள் தனிப்பட்ட உறவுகள் வலுப்பெறும். புதிய நண்பர்களைச் சந்திப்பதற்கும், சுவாரஸ்யமான உரையாடல்களில் ஈடுபடுவதற்கும் வாய்ப்புகள் கிடைக்கும். உங்கள் ஆளுமைத் திறன் வெளிப்படும். பிறரைக் கவர்ந்து, அவர்களின் ஆதரவைப் பெறுவீர்கள். சமூக நிகழ்வுகளில் நீங்கள் முன்னிலை வகிப்பீர்கள். உங்கள் நல்லிணக்கப் பண்புகள் பாராட்டப்படும்.\nஉங்கள் மனதிற்கு மகிழ்ச்சியூட்டும் செய்திகள் வந்து சேரும். நீண்ட நாட்களாக நீங்கள் எதிர்பார்த்த ஒரு நல்ல காரியம் நடக்கும். உங்கள் எண்ணங்கள் தெளிவுற்று, எதிலும் ஒரு நேர்மறையான அணுகுமுறையுடன் செயல்படுவீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் மனம்விட்டுப் பேசும் வாய்ப்பு கிடைக்கும். இது உங்கள் உறவுகளை மேலும் வலுப்படுத்தும். பிறருக்கு உதவி செய்வதன் மூலம் மனநிறைவைப் பெறுவீர்கள். சமூக சேவைகளில் ஈடுபட இது ஒரு சிறந்த நாள்.\nகாதல் உறவுகளில் இருப்பவர்களுக்கு இன்று மிகவும் இனிமையான நாளாகும். உங்கள் துணையுடன் ஆழமான புரிதலை ஏற்படுத்திக்கொள்வீர்கள். ஒருவருக்கொருவர் ஆதரவாக இருந்து, வருங்காலத் திட்டங்கள் குறித்து ஆரோக்கியமான விவாதங்களை மேற்கொள்ளலாம். திருமணமான தம்பதிகள் தங்கள் இல்லற வாழ்க்கையில் புதிய மகிழ்ச்சியையும், நெருக்கத்தையும் உணர்வார்கள். ஒரு ரொமான்டிக் சூழல் நிலவும். குழந்தைகளின் திறமைகளை ஊக்குவிக்க இது ஒரு நல்ல நாள். அவர்களின் எதிர்காலம் குறித்த நல்ல திட்டங்களை வகுப்பீர்கள்.\nஉங்கள் படைப்பாற்றல் உச்சத்தில் இருக்கும். கலை, இசை, இலக்கியம் போன்ற துறைகளில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். புதிய முயற்சிகளில் ஈடுபட இது உகந்தது. உங்கள் பொழுதுபோக்குகளில் அதிக கவனம் செலுத்தலாம். இது உங்கள் மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சி அளிக்கும். இயற்கையுடன் இணைந்திருப்பதன் மூலம் மனதிற்கு அமைதி கிடைக்கும். தோட்டம் அமைப்பது அல்லது பூச்செடிகளைப் பராமரிப்பது போன்ற செயல்களில் ஈடுபடலாம். இது உங்கள் மனதிற்கு மகிழ்ச்சியைத் தரும்.\nஆன்மீக ரீதியாகவும் நீங்கள் முன்னேற்றம் காண்பீர்கள். இறைவழிபாடு மற்றும் தியானத்தில் ஈடுபடுவதன் மூலம் மன அமைதி கிடைக்கும். உங்கள் அக உணர்வுகள் மேலும் தெளிவு பெறும். பிறருக்கு நன்மை செய்வதன் மூலம் நீங்கள் மனநிறைவை அடைவீர்கள். சமூகத்தில் உங்கள் மதிப்பும் மரியாதையும் உயரும். உங்கள் தன்னம்பிக்கை அதிகரிக்கும். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொண்டு, அதிலிருந்து கற்றுக்கொள்வதற்கான வாய்ப்புகள் உருவாகும். பொறுமையுடனும், நிதானத்துடனும் செயல்படுவது உங்களுக்கு வெற்றியைத் தேடித்தரும். இன்றைய நாள் உங்கள் வாழ்க்கையில் புதிய நல்லிணக்கத்தையும், சந்தோஷத்தையும் கொண்டு வரும்.",
    "prediction_en": "Today, Friday, will be a day filled with love, relationships, and social harmony for Libra natives. Under the influence of Venus, your personal relationships will strengthen. Opportunities will arise to meet new friends and engage in interesting conversations. Your personality will shine. You will charm others and gain their support. You will take the lead in social events, and your harmonious qualities will be appreciated.\nJoyful news will arrive. A good event you have long anticipated will occur. Your thoughts will become clear, and you will act with a positive approach in everything. Opportunities will arise to have heartfelt conversations with friends and relatives, which will further strengthen your relationships. You will gain satisfaction by helping others. This is an excellent day to engage in social service.\nFor those in romantic relationships, today is a very sweet day. You will establish a deep understanding with your partner. You can support each other and have healthy discussions about future plans. Married couples will feel new joy and intimacy in their marital life. A romantic atmosphere will prevail. This is a good day to encourage your children's talents. You will formulate good plans regarding their future.\nYour creativity will be at its peak. Good opportunities will arise for those in fields like art, music, and literature. This is suitable for engaging in new ventures. You can focus more on your hobbies, which will reduce your stress and rejuvenate you. Connecting with nature will bring peace of mind. You may engage in activities like gardening or maintaining flowering plants, which will bring joy to your mind.\nSpiritually, you will also see progress. Engaging in prayer and meditation will bring mental peace. Your inner consciousness will become clearer. You will achieve satisfaction by doing good for others. Your respect and standing in society will increase. Your self-confidence will grow. Opportunities will arise to face any challenge with confidence and learn from it. Acting with patience and calmness will bring you success. Today will bring new harmony and happiness into your life.",
    "career_ta": "பணியிடத்தில் உங்கள் ஒத்துழைப்பு மற்றும் இணக்கமான அணுகுமுறை பாராட்டப்படும். குழுப்பணிகளில் சிறப்பாக செயல்படுவீர்கள். புதிய கூட்டாண்மைகள் உருவாக வாய்ப்புகள் உண்டு. கலை, வடிவமைப்பு மற்றும் ஆலோசகர் துறைகளில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். உங்கள் பேச்சுத்திறன் மற்றும் சாமர்த்தியம் வெற்றிக்கு வழிவகுக்கும். மேலதிகாரிகளிடம் நல்ல பெயர் பெறுவீர்கள்.",
    "career_en": "In the workplace, your cooperation and harmonious approach will be appreciated. You will perform well in team tasks. Opportunities may arise for new partnerships. Good opportunities will arise for those in artistic, design, and consulting fields. Your eloquence and diplomacy will lead to success, and you will earn a good reputation with superiors.",
    "finance_ta": "நிதிநிலைமை சீராகவும், திருப்திகரமாகவும் இருக்கும். எதிர்பாராத வகையில் ஒரு சிறிய நிதி ஆதாயம் கிடைக்கலாம். புதிய முதலீடுகளைப் பற்றி சிந்திப்பதற்கு இது ஒரு நல்ல நேரம். குடும்பச் செலவுகள் சீராக இருக்கும். ஆடம்பரச் செலவுகளைத் தவிர்த்து, அத்தியாவசிய தேவைகளுக்கு முக்கியத்துவம் கொடுப்பது நல்லது. வரவு செலவு கணக்கை சரியாக நிர்வகிப்பீர்கள். நிதி திட்டங்களில் ஒரு தெளிவு காணப்படும்.",
    "finance_en": "Your financial situation will be stable and satisfactory. An unexpected small financial gain may occur. This is a good time to think about new investments. Family expenses will be stable. It's advisable to avoid luxury spending and prioritize essential needs. You will manage your income and expenses properly, and clarity will be seen in financial plans.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதியுடன் இருப்பதால், உடல்நிலையும் சீராக இருக்கும். புதிய உணவு முறைகளை முயற்சிக்கலாம். குறிப்பாக, நீர்ச்சத்து நிறைந்த உணவுகளை எடுத்துக்கொள்வது நல்லது. சுவாசப் பயிற்சிகள் மற்றும் லேசான உடற்பயிற்சிகள் மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சி தரும். போதுமான தூக்கம் உடல் ஆரோக்கியத்திற்கு மிகவும் அவசியம்.",
    "health_en": "Physical health will be excellent. As you maintain mental peace, your physical condition will also be stable. You can try new dietary patterns, especially consuming water-rich foods. Breathing exercises and light workouts will reduce stress and rejuvenate you. Adequate sleep is very essential for physical health.",
    "lucky_number": "6",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "விருச்சிகம்",
    "sign_en": "Scorpio",
    "date": "27-02-2026",
    "prediction_ta": "இன்றைய வெள்ளிக்கிழமை விருச்சிக ராசிக்காரர்களுக்கு ஆழ்ந்த உணர்வுகளையும், தனிப்பட்ட உறவுகளில் நல்ல முன்னேற்றத்தையும் கொண்டு வரும். சுக்கிரனின் ஆதிக்கத்தால், உங்கள் உணர்ச்சிபூர்வமான உறவுகள் வலுப்பெறும். உங்கள் உள் உணர்வுகள் தெளிவாகும். பிறருடன் ஆழமான அர்த்தமுள்ள உரையாடல்களில் ஈடுபடுவீர்கள். மறைந்திருக்கும் விஷயங்களை வெளிக்கொண்டு வர இது ஒரு நல்ல நாள். உங்கள் குடும்பத்தினருடன் அல்லது அன்புக்குரியவர்களுடன் அதிக நேரம் செலவிடுவீர்கள்.\nஉங்கள் மனதிற்கு அமைதியைத் தரக்கூடிய விஷயங்களில் ஈடுபடுவீர்கள். குறிப்பாக, நீண்ட நாட்களாக நீங்கள் விரும்பிய ஒரு காரியத்தைச் செய்து முடிக்க இது சரியான தருணம். உங்கள் எண்ணங்கள் தெளிவுற்று, எதிலும் ஒரு நேர்மறையான அணுகுமுறையுடன் செயல்படுவீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் மனம்விட்டுப் பேசும் வாய்ப்பு கிடைக்கும். இது உங்கள் உறவுகளை மேலும் வலுப்படுத்தும். பிறருக்கு உதவி செய்வதன் மூலம் மனநிறைவைப் பெறுவீர்கள். சமூக சேவைகளில் ஈடுபட இது ஒரு சிறந்த நாள்.\nகாதல் உறவுகளில் இருப்பவர்களுக்கு இன்று மிகவும் இனிமையான நாளாகும். உங்கள் துணையுடன் ஆழமான புரிதலை ஏற்படுத்திக்கொள்வீர்கள். ஒருவருக்கொருவர் ஆதரவாக இருந்து, வருங்காலத் திட்டங்கள் குறித்து ஆரோக்கியமான விவாதங்களை மேற்கொள்ளலாம். திருமணமான தம்பதிகள் தங்கள் இல்லற வாழ்க்கையில் புதிய மகிழ்ச்சியையும், நெருக்கத்தையும் உணர்வார்கள். ஒரு ரொமான்டிக் சூழல் நிலவும். குழந்தைகளின் திறமைகளை ஊக்குவிக்க இது ஒரு நல்ல நாள். அவர்களின் எதிர்காலம் குறித்த நல்ல திட்டங்களை வகுப்பீர்கள்.\nஉங்கள் படைப்பாற்றல் உச்சத்தில் இருக்கும். கலை, இசை, இலக்கியம் போன்ற துறைகளில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். புதிய முயற்சிகளில் ஈடுபட இது உகந்தது. உங்கள் பொழுதுபோக்குகளில் அதிக கவனம் செலுத்தலாம். இது உங்கள் மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சி அளிக்கும். இயற்கையுடன் இணைந்திருப்பதன் மூலம் மனதிற்கு அமைதி கிடைக்கும். தோட்டம் அமைப்பது அல்லது பூச்செடிகளைப் பராமரிப்பது போன்ற செயல்களில் ஈடுபடலாம். இது உங்கள் மனதிற்கு மகிழ்ச்சியைத் தரும்.\nஆன்மீக ரீதியாகவும் நீங்கள் முன்னேற்றம் காண்பீர்கள். இறைவழிபாடு மற்றும் தியானத்தில் ஈடுபடுவதன் மூலம் மன அமைதி கிடைக்கும். உங்கள் அக உணர்வுகள் மேலும் தெளிவு பெறும். பிறருக்கு நன்மை செய்வதன் மூலம் நீங்கள் மனநிறைவை அடைவீர்கள். சமூகத்தில் உங்கள் மதிப்பும் மரியாதையும் உயரும். உங்கள் தன்னம்பிக்கை அதிகரிக்கும். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொண்டு, அதிலிருந்து கற்றுக்கொள்வதற்கான வாய்ப்புகள் உருவாகும். பொறுமையுடனும், நிதானத்துடனும் செயல்படுவது உங்களுக்கு வெற்றியைத் தேடித்தரும். இன்றைய நாள் உங்கள் வாழ்க்கையில் புதிய நல்லிணக்கத்தையும், சந்தோஷத்தையும் கொண்டு வரும்.",
    "prediction_en": "Today, Friday, will bring deep emotions and good progress in personal relationships for Scorpio natives. Under the influence of Venus, your emotional relationships will strengthen. Your inner feelings will become clear. You will engage in deep, meaningful conversations with others. This is a good day to uncover hidden truths. You will spend more time with your family or loved ones.\nYou will engage in activities that bring peace to your mind. Specifically, this is the right time to complete a task you have long desired. Your thoughts will become clear, and you will act with a positive approach in everything. Opportunities will arise to have heartfelt conversations with friends and relatives, which will further strengthen your relationships. You will gain satisfaction by helping others. This is an excellent day to engage in social service.\nFor those in romantic relationships, today is a very sweet day. You will establish a deep understanding with your partner. You can support each other and have healthy discussions about future plans. Married couples will feel new joy and intimacy in their marital life. A romantic atmosphere will prevail. This is a good day to encourage your children's talents. You will formulate good plans regarding their future.\nYour creativity will be at its peak. Good opportunities will arise for those in fields like art, music, and literature. This is suitable for engaging in new ventures. You can focus more on your hobbies, which will reduce your stress and rejuvenate you. Connecting with nature will bring peace of mind. You may engage in activities like gardening or maintaining flowering plants, which will bring joy to your mind.\nSpiritually, you will also see progress. Engaging in prayer and meditation will bring mental peace. Your inner consciousness will become clearer. You will achieve satisfaction by doing good for others. Your respect and standing in society will increase. Your self-confidence will grow. Opportunities will arise to face any challenge with confidence and learn from it. Acting with patience and calmness will bring you success. Today will bring new harmony and happiness into your life.",
    "career_ta": "பணியிடத்தில் உங்கள் ஆழ்ந்த கவனம் மற்றும் ஆராய்ச்சித் திறன் பாராட்டப்படும். புதிய திட்டங்களை வெற்றிகரமாக முடிப்பீர்கள். உங்கள் சக ஊழியர்களுடன் நல்லுறவு பேணுவீர்கள். நிதி, ஆராய்ச்சி மற்றும் ரகசியப் பணிகள் சார்ந்த துறைகளில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். உங்கள் கடின உழைப்புக்கு அங்கீகாரம் கிடைக்கும். புதிய பொறுப்புகளை ஏற்க இது ஒரு நல்ல நாள்.",
    "career_en": "In the workplace, your deep focus and research skills will be appreciated. You will successfully complete new projects and maintain good relationships with your colleagues. Good opportunities will arise for those in finance, research, and confidential work fields. Your hard work will be recognized, and this is a good day to take on new responsibilities.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். எதிர்பாராத வகையில் சிறிய வருமான ஆதாயங்கள் கிடைக்கலாம். நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பதற்கு இது ஒரு நல்ல நேரம். செலவுகளைக் கட்டுப்படுத்தி, எதிர்காலத்திற்கான சேமிப்பை அதிகரிக்கலாம். குடும்பச் செலவுகள் சீராக இருக்கும். பணவரவு திருப்திகரமாக இருக்கும். கடன் சுமை குறையும் வாய்ப்புகள் உண்டு. நிதித் திட்டங்களில் தெளிவு காணப்படும்.",
    "finance_en": "Financial stability will be observed. Unexpected small income gains may occur. This is a good time to think about long-term investments. You can control expenses and increase savings for the future. Family expenses will be stable, and cash flow will be satisfactory. Opportunities to reduce debt burden may arise. Clarity will be seen in financial plans.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். மன அமைதியுடன் இருப்பதால், உடல்நிலையும் சீராக இருக்கும். மன அழுத்தத்தைக் குறைக்க யோகா மற்றும் தியானத்தில் ஈடுபடலாம். புதிய உணவுப் பழக்கவழக்கங்களை மேற்கொள்ள இது உகந்தது. உடற்பயிற்சிகளைத் தவறாமல் செய்வது உடல் வலிமையை அதிகரிக்கும். போதுமான ஓய்வு எடுப்பது முக்கியம். சிறிய உடல் உபாதைகள் இருந்தாலும் அவை விரைவில் சரியாகிவிடும்.",
    "health_en": "Physical health will improve. As you maintain mental peace, your physical condition will also be stable. You can engage in yoga and meditation to reduce stress. This is suitable for adopting new dietary habits. Regular exercise will increase physical strength. Getting adequate rest is important. Even if there are minor health ailments, they will soon resolve.",
    "lucky_number": "8",
    "lucky_color_ta": "செம்மஞ்சள்",
    "lucky_color_en": "Orange"
  },
  {
    "sign_ta": "தனுசு",
    "sign_en": "Sagittarius",
    "date": "27-02-2026",
    "prediction_ta": "இன்றைய வெள்ளிக்கிழமை தனுசு ராசிக்காரர்களுக்கு புதிய அனுபவங்களையும், சமூகத் தொடர்புகளையும் கொண்டு வரும். சுக்கிரனின் ஆதிக்கத்தால், உங்கள் நண்பர்கள் மற்றும் சமூக வட்டார உறவுகள் வலுப்பெறும். புதிய நபர்களைச் சந்திப்பதற்கும், சுவாரஸ்யமான உரையாடல்களில் ஈடுபடுவதற்கும் வாய்ப்புகள் கிடைக்கும். குறுகிய பயணங்கள் மேற்கொள்ள இது ஒரு சிறந்த நாள். இது உங்கள் மனதிற்கு புத்துணர்ச்சி அளிக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்திக்கொள்வதற்கும் இது ஒரு சிறந்த நாள். உங்கள் படைப்பாற்றல் வெளிப்படும்.\nஉங்கள் மனதிற்கு மகிழ்ச்சியூட்டும் செய்திகள் வந்து சேரும். தொலைதூர நண்பர்களுடனான தொடர்பு புதுப்பிக்கப்படலாம். நீண்ட நாட்களாக நீங்கள் எதிர்பார்த்த ஒரு நல்ல காரியம் நடக்கும். உங்கள் எண்ணங்கள் தெளிவுற்று, எதிலும் ஒரு நேர்மறையான அணுகுமுறையுடன் செயல்படுவீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் மனம்விட்டுப் பேசும் வாய்ப்பு கிடைக்கும். இது உங்கள் உறவுகளை மேலும் வலுப்படுத்தும். பிறருக்கு உதவி செய்வதன் மூலம் மனநிறைவைப் பெறுவீர்கள். சமூக சேவைகளில் ஈடுபட இது ஒரு சிறந்த நாள்.\nகாதல் உறவுகளில் உள்ளவர்கள் தங்கள் துணையுடன் மனம்விட்டுப் பேசவும், ஒருவரை ஒருவர் புரிந்துகொள்ளவும் இது ஒரு நல்ல நாள். உறவில் அன்பு அதிகரிக்கும். திருமணமானவர்கள் தங்கள் இல்லற வாழ்க்கையில் மகிழ்ச்சியையும், இணக்கத்தையும் காண்பார்கள். குழந்தைகளின் கல்வி மற்றும் எதிர்காலம் குறித்த ஆரோக்கியமான விவாதங்கள் குடும்பத்தில் நடைபெறும். குடும்ப உறுப்பினர்களுடன் சிநேகமான சூழல் நிலவும். வீட்டில் மகிழ்ச்சியான தருணங்கள் அரங்கேறும்.\nஉங்கள் பொழுதுபோக்குகளில் அதிக கவனம் செலுத்தலாம். இசை கேட்பது, புத்தகம் படிப்பது அல்லது புதிய விளையாட்டுகளில் ஈடுபடுவது போன்ற செயல்கள் உங்களுக்கு மன அமைதியையும், சந்தோஷத்தையும் தரும். உங்கள் தனிப்பட்ட வளர்ச்சிக்கு இது ஒரு நல்ல நாள். புதிய திறமைகளைக் கற்றுக்கொள்வதற்கு ஆர்வம் காட்டுவீர்கள். இயற்கையுடன் இணைந்திருப்பதன் மூலம் மனதிற்கு புத்துணர்ச்சி கிடைக்கும். குறுகிய பயணங்கள் அல்லது பொழுதுபோக்கு நடவடிக்கைகளில் ஈடுபடலாம். இது உங்கள் மன அழுத்தத்தைக் குறைத்து, உற்சாகத்தை அதிகரிக்கும்.\nஆன்மீக ரீதியாகவும் நீங்கள் முன்னேற்றம் காண்பீர்கள். தியானம் மற்றும் பிரார்த்தனைகளில் ஈடுபடுவதன் மூலம் மன அமைதி கிடைக்கும். உங்கள் அக உணர்வுகள் மேலும் தெளிவு பெறும். வாழ்க்கையின் நோக்கங்கள் குறித்து ஆழமாக சிந்திக்க இது ஒரு நல்ல வாய்ப்பு. பிறருக்கு உதவி செய்வதன் மூலம் நீங்கள் மனநிறைவைப் பெறுவீர்கள். சிறிய அளவில் தொண்டு காரியங்களில் ஈடுபடலாம். இது உங்கள் புண்ணிய கணக்கை அதிகரிக்கும்.\nபொதுவாக, இன்று நீங்கள் சூழ்நிலைகளை மிக நேர்மறையாக அணுகுவீர்கள். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொண்டு, அதிலிருந்து கற்றுக்கொள்வதற்கான வாய்ப்புகளைப் பெறுவீர்கள். தன்னம்பிக்கையுடன் செயல்படுவதன் மூலம் பல நல்ல காரியங்களை சாதிக்க முடியும். உங்கள் ஆளுமைத்திறன் அதிகரிக்கும். பிறரைக் கவர்ந்து, அவர்களை உங்கள் வழிக்குக் கொண்டு வரும் சக்தி உங்களுக்கு உண்டு. இதனால், உங்கள் சமூக மற்றும் தனிப்பட்ட உறவுகளில் பல சாதகமான மாற்றங்கள் ஏற்படும். எந்தவொரு விஷயத்திலும் அவசரப்படாமல், நிதானத்துடன் செயல்படுவது வெற்றியைப் பெற்றுத்தரும். இன்றைய நாள் உங்கள் வாழ்க்கையில் புதிய பொலிவையும், மகிழ்ச்சியையும் கொண்டு வரும்.",
    "prediction_en": "Today, Friday, will bring new experiences and social connections for Sagittarius natives. Under the influence of Venus, your relationships with friends and social circles will strengthen. Opportunities will arise to meet new people and engage in interesting conversations. This is an excellent day for short trips, which will rejuvenate your mind. This is a great day to learn new things and enhance your knowledge. Your creativity will manifest.\nJoyful news will arrive. Contact with distant friends may be renewed. A good event you have long anticipated will occur. Your thoughts will become clear, and you will act with a positive approach in everything. Opportunities will arise to have heartfelt conversations with friends and relatives, which will further strengthen your relationships. You will gain satisfaction by helping others. This is an excellent day to engage in social service.\nFor those in romantic relationships, today is a very sweet day. You will establish a deep understanding with your partner. You can support each other and have healthy discussions about future plans. Married couples will feel new joy and intimacy in their marital life. A romantic atmosphere will prevail. This is a good day to encourage your children's talents. You will formulate good plans regarding their future.\nYou can focus more on your hobbies. Activities like listening to music, reading books, or engaging in new games will bring peace and happiness to your mind. This is a good day for your personal growth. You will show interest in learning new skills. Connecting with nature will bring mental rejuvenation. You can engage in short trips or recreational activities, which will reduce your stress and increase your enthusiasm.\nSpiritually, you will also see progress. Engaging in meditation and prayers will bring mental peace. Your inner consciousness will become clearer. This is a good opportunity to reflect deeply on the purposes of life. You will gain satisfaction by helping others. You may engage in small acts of charity, which will increase your merits.\nGenerally, today you will approach situations very positively. You will face any challenge with confidence and find opportunities to learn from it. By acting with self-confidence, you can achieve many good things. Your personality will shine. You have the power to charm others and bring them to your way. This will lead to many favorable changes in your social and personal relationships. Acting calmly without haste in any matter will bring success. Today will bring new splendor and happiness into your life.",
    "career_ta": "உங்கள் பணியிடத்தில் புதிய யோசனைகளை முன்வைத்து, அவற்றை செயல்படுத்த இது ஒரு நல்ல நாள். உங்கள் துணிச்சலான அணுகுமுறை பாராட்டப்படும். பயணங்கள் தொடர்பான பணிகளில் ஈடுபடுபவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். புதிய திட்டங்களில் உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். வெளிநாட்டுத் தொடர்புகள் மூலம் தொழில் வளர்ச்சி அடையலாம். உங்கள் அறிவுத்திறன் மற்றும் அனுபவம் வெற்றிக்கு வழிவகுக்கும்.",
    "career_en": "In your workplace, this is a good day to present new ideas and implement them. Your bold approach will be appreciated. Good opportunities will arise for those involved in travel-related work. Your contribution to new projects will be significant. Career growth may occur through foreign connections. Your intellect and experience will lead to success.",
    "finance_ta": "நிதிநிலைமை திருப்திகரமாக இருக்கும். புதிய முதலீடுகளைப் பற்றி சிந்திப்பதற்கு இது ஒரு நல்ல நேரம். நீண்டகால நிதித் திட்டங்களை வகுக்கலாம். பயணங்கள் அல்லது பொழுதுபோக்குக்காக செலவு செய்யலாம். வரவு செலவுக் கணக்கை சரியாக நிர்வகிப்பதன் மூலம் நிதி நிலைமை மேம்படும். குடும்பச் செலவுகள் சீராக இருக்கும். எதிர்பாராத வகையில் ஒரு சிறிய நிதி ஆதாயம் கிடைக்கலாம்.",
    "finance_en": "Your financial situation will be satisfactory. This is a good time to think about new investments and formulate long-term financial plans. You may spend on travel or entertainment. By properly managing income and expenses, your financial situation will improve. Family expenses will be stable, and an unexpected small financial gain may occur.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். உற்சாகமாக உணர்வீர்கள். புதிய உடற்பயிற்சிகளைத் தொடங்க இது ஒரு சிறந்த நாள். நீண்ட தூர நடைப்பயிற்சிகள் அல்லது இயற்கை சார்ந்த பயிற்சிகள் மனதிற்கு புத்துணர்ச்சி தரும். சமச்சீர் உணவு எடுத்துக்கொள்வதில் கவனம் செலுத்துங்கள். மன அழுத்தம் குறைந்து, மன அமைதி அதிகரிக்கும். போதுமான ஓய்வு எடுப்பது முக்கியம்.",
    "health_en": "Physical health will improve. You will feel energetic. This is a great day to start new exercise routines. Long walks or nature-based exercises will rejuvenate the mind. Focus on maintaining a balanced diet. Stress will decrease, and mental peace will increase. Getting adequate rest is important.",
    "lucky_number": "3",
    "lucky_color_ta": "தங்கம்",
    "lucky_color_en": "Gold"
  },
  {
    "sign_ta": "மகரம்",
    "sign_en": "Capricorn",
    "date": "27-02-2026",
    "prediction_ta": "இன்றைய வெள்ளிக்கிழமை மகர ராசிக்காரர்களுக்கு தொழில் மற்றும் தனிப்பட்ட வாழ்க்கையில் ஸ்திரத்தன்மையையும், முன்னேற்றத்தையும் கொண்டு வரும். சுக்கிரனின் ஆதிக்கத்தால், உங்கள் கடின உழைப்புக்கு அங்கீகாரம் கிடைக்கும். சமூகத்தில் உங்கள் மதிப்பும், மரியாதையும் உயரும். புதிய பொறுப்புகளை ஏற்கவும், அவற்றை வெற்றிகரமாகச் செயல்படுத்தவும் இது ஒரு நல்ல நாள். குடும்பத்தினருடன் இணக்கமான சூழல் நிலவும். வீட்டில் மகிழ்ச்சியான நிகழ்வுகள் அரங்கேறும்.\nஉங்கள் மனதிற்கு அமைதியைத் தரக்கூடிய விஷயங்களில் ஈடுபடுவீர்கள். குறிப்பாக, நீண்ட நாட்களாக நீங்கள் விரும்பிய ஒரு காரியத்தைச் செய்து முடிக்க இது சரியான தருணம். உங்கள் எண்ணங்கள் தெளிவுற்று, எதிலும் ஒரு நேர்மறையான அணுகுமுறையுடன் செயல்படுவீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் மனம்விட்டுப் பேசும் வாய்ப்பு கிடைக்கும். இது உங்கள் உறவுகளை மேலும் வலுப்படுத்தும். பிறருக்கு உதவி செய்வதன் மூலம் மனநிறைவைப் பெறுவீர்கள். சமூக சேவைகளில் ஈடுபட இது ஒரு சிறந்த நாள். உங்கள் சமூக வட்டாரம் விரிவடைவதால், புதிய கருத்துக்களையும், எண்ணங்களையும் நீங்கள் அறிந்து கொள்வீர்கள். இது உங்கள் மனதை மேலும் பக்குவப்படுத்தும்.\nகாதல் உறவுகளில் இருப்பவர்களுக்கு இன்று மிகவும் இனிமையான நாளாகும். உங்கள் துணையுடன் ஆழமான புரிதலை ஏற்படுத்திக்கொள்வீர்கள். ஒருவருக்கொருவர் ஆதரவாக இருந்து, வருங்காலத் திட்டங்கள் குறித்து ஆரோக்கியமான விவாதங்களை மேற்கொள்ளலாம். திருமணமான தம்பதிகள் தங்கள் இல்லற வாழ்க்கையில் புதிய மகிழ்ச்சியையும், நெருக்கத்தையும் உணர்வார்கள். ஒரு ரொமான்டிக் சூழல் நிலவும். குழந்தைகளின் திறமைகளை ஊக்குவிக்க இது ஒரு நல்ல நாள். அவர்களின் எதிர்காலம் குறித்த நல்ல திட்டங்களை வகுப்பீர்கள்.\nஉங்கள் படைப்பாற்றல் உச்சத்தில் இருக்கும். கலை, இசை, இலக்கியம் போன்ற துறைகளில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். புதிய முயற்சிகளில் ஈடுபட இது உகந்தது. உங்கள் பொழுதுபோக்குகளில் அதிக கவனம் செலுத்தலாம். இது உங்கள் மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சி அளிக்கும். இயற்கையுடன் இணைந்திருப்பதன் மூலம் மனதிற்கு அமைதி கிடைக்கும். தோட்டம் அமைப்பது அல்லது பூச்செடிகளைப் பராமரிப்பது போன்ற செயல்களில் ஈடுபடலாம். இது உங்கள் மனதிற்கு மகிழ்ச்சியைத் தரும்.\nஆன்மீக ரீதியாகவும் நீங்கள் முன்னேற்றம் காண்பீர்கள். இறைவழிபாடு மற்றும் தியானத்தில் ஈடுபடுவதன் மூலம் மன அமைதி கிடைக்கும். உங்கள் அக உணர்வுகள் மேலும் தெளிவு பெறும். பிறருக்கு நன்மை செய்வதன் மூலம் நீங்கள் மனநிறைவை அடைவீர்கள். சமூகத்தில் உங்கள் மதிப்பும் மரியாதையும் உயரும். உங்கள் தன்னம்பிக்கை அதிகரிக்கும். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொண்டு, அதிலிருந்து கற்றுக்கொள்வதற்கான வாய்ப்புகள் உருவாகும். பொறுமையுடனும், நிதானத்துடனும் செயல்படுவது உங்களுக்கு வெற்றியைத் தேடித்தரும். இன்றைய நாள் உங்கள் வாழ்க்கையில் புதிய நல்லிணக்கத்தையும், சந்தோஷத்தையும் கொண்டு வரும்.",
    "prediction_en": "Today, Friday, will bring stability and progress in career and personal life for Capricorn natives. Under the influence of Venus, your hard work will be recognized. Your respect and standing in society will increase. This is a good day to take on new responsibilities and implement them successfully. A harmonious atmosphere will prevail with family members, and joyful events will unfold at home.\nYou will engage in activities that bring peace to your mind. Specifically, this is the right time to complete a task you have long desired. Your thoughts will become clear, and you will act with a positive approach in everything. Opportunities will arise to have heartfelt conversations with friends and relatives, which will further strengthen your relationships. You will gain satisfaction by helping others. This is an excellent day to engage in social service. As your social circle expands, you will gain new perspectives and ideas, further enriching your mind.\nFor those in romantic relationships, today is a very sweet day. You will establish a deep understanding with your partner. You can support each other and have healthy discussions about future plans. Married couples will feel new joy and intimacy in their marital life. A romantic atmosphere will prevail. This is a good day to encourage your children's talents. You will formulate good plans regarding their future.\nYour creativity will be at its peak. Good opportunities will arise for those in fields like art, music, and literature. This is suitable for engaging in new ventures. You can focus more on your hobbies, which will reduce your stress and rejuvenate you. Connecting with nature will bring peace of mind. You may engage in activities like gardening or maintaining flowering plants, which will bring joy to your mind.\nSpiritually, you will also see progress. Engaging in prayer and meditation will bring mental peace. Your inner consciousness will become clearer. You will achieve satisfaction by doing good for others. Your respect and standing in society will increase. Your self-confidence will grow. Opportunities will arise to face any challenge with confidence and learn from it. Acting with patience and calmness will bring you success. Today will bring new harmony and happiness into your life.",
    "career_ta": "உங்கள் பணியிடத்தில் கடின உழைப்புக்கு அங்கீகாரம் கிடைக்கும். புதிய பொறுப்புகளை ஏற்கவும், அவற்றை வெற்றிகரமாகச் செயல்படுத்தவும் இது ஒரு நல்ல நாள். உங்கள் திறமையும், அர்ப்பணிப்பும் பாராட்டப்படும். நிர்வாகத் துறைகளில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். புதிய கூட்டாண்மைகள் அல்லது திட்டங்கள் மூலம் தொழில் வளர்ச்சி அடையலாம். சக ஊழியர்களுடன் நல்லுறவு பேணுவீர்கள்.",
    "career_en": "In your workplace, hard work will be recognized. This is a good day to take on new responsibilities and implement them successfully. Your skills and dedication will be appreciated. Good opportunities will arise for those in managerial fields. Career growth may occur through new partnerships or projects. You will maintain good relationships with colleagues.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பதற்கு இது ஒரு நல்ல நேரம். எதிர்காலத்திற்கான சேமிப்பை அதிகரிக்கலாம். குடும்பச் செலவுகள் சீராக இருக்கும். பணவரவு திருப்திகரமாக இருக்கும். ஆடம்பரச் செலவுகளைத் தவிர்த்து, அத்தியாவசியத் தேவைகளுக்கு முக்கியத்துவம் கொடுப்பது நல்லது. நிதித் திட்டங்களில் ஒரு தெளிவு காணப்படும்.",
    "finance_en": "Financial stability will be observed. This is a good time to think about long-term investments and increase savings for the future. Family expenses will be stable, and cash flow will be satisfactory. It's advisable to avoid luxury spending and prioritize essential needs. Clarity will be seen in financial plans.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதி அதிகரிப்பதால் உடல்நிலையும் மேம்படும். புதிய உடற்பயிற்சிகளைத் தொடங்க இது ஒரு சிறந்த நாள். சமச்சீர் உணவு எடுத்துக்கொள்வதில் கவனம் செலுத்துங்கள். யோகா அல்லது தியானம் செய்வதன் மூலம் மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சி பெறலாம். உடல்நலனில் சிறிய பாதிப்புகள் இருந்தாலும் அவை விரைவில் சீராகும். போதுமான ஓய்வு எடுப்பது முக்கியம்.",
    "health_en": "Your physical health will be excellent. As mental peace increases, your physical condition will also improve. This is a great day to start new exercise routines. Focus on maintaining a balanced diet. You can reduce stress and rejuvenate through yoga or meditation. Even if there are minor health issues, they will soon stabilize. Getting adequate rest is important.",
    "lucky_number": "8",
    "lucky_color_ta": "கருப்பு",
    "lucky_color_en": "Black"
  },
  {
    "sign_ta": "கும்பம்",
    "sign_en": "Aquarius",
    "date": "27-02-2026",
    "prediction_ta": "இன்றைய வெள்ளிக்கிழமை கும்ப ராசிக்காரர்களுக்கு சமூகத் தொடர்புகளும், புதிய கண்டுபிடிப்புகளும் நிறைந்த ஒரு நாளாக அமையும். சுக்கிரனின் ஆதிக்கத்தால், உங்கள் நண்பர்கள் மற்றும் சமூக வட்டார உறவுகள் வலுப்பெறும். புதிய நபர்களைச் சந்திப்பதற்கும், சுவாரஸ்யமான உரையாடல்களில் ஈடுபடுவதற்கும் வாய்ப்புகள் கிடைக்கும். உங்கள் புதுமையான யோசனைகள் பாராட்டப்படும். சமூக நிகழ்வுகளில் நீங்கள் முன்னிலை வகிப்பீர்கள். உங்கள் தனிப்பட்ட ஆளுமைத் திறன் வெளிப்படும்.\nஉங்கள் மனதிற்கு மகிழ்ச்சியூட்டும் செய்திகள் வந்து சேரும். நீண்ட நாட்களாக நீங்கள் எதிர்பார்த்த ஒரு நல்ல காரியம் நடக்கும். உங்கள் எண்ணங்கள் தெளிவுற்று, எதிலும் ஒரு நேர்மறையான அணுகுமுறையுடன் செயல்படுவீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் மனம்விட்டுப் பேசும் வாய்ப்பு கிடைக்கும். இது உங்கள் உறவுகளை மேலும் வலுப்படுத்தும். பிறருக்கு உதவி செய்வதன் மூலம் மனநிறைவைப் பெறுவீர்கள். சமூக சேவைகளில் ஈடுபட இது ஒரு சிறந்த நாள். உங்கள் சமூக வட்டாரம் விரிவடைவதால், புதிய கருத்துக்களையும், எண்ணங்களையும் நீங்கள் அறிந்து கொள்வீர்கள். இது உங்கள் மனதை மேலும் பக்குவப்படுத்தும்.\nகாதல் உறவுகளில் இருப்பவர்களுக்கு இன்று மிகவும் இனிமையான நாளாகும். உங்கள் துணையுடன் ஆழமான புரிதலை ஏற்படுத்திக்கொள்வீர்கள். ஒருவருக்கொருவர் ஆதரவாக இருந்து, வருங்காலத் திட்டங்கள் குறித்து ஆரோக்கியமான விவாதங்களை மேற்கொள்ளலாம். திருமணமான தம்பதிகள் தங்கள் இல்லற வாழ்க்கையில் புதிய மகிழ்ச்சியையும், நெருக்கத்தையும் உணர்வார்கள். ஒரு ரொமான்டிக் சூழல் நிலவும். குழந்தைகளின் திறமைகளை ஊக்குவிக்க இது ஒரு நல்ல நாள். அவர்களின் எதிர்காலம் குறித்த நல்ல திட்டங்களை வகுப்பீர்கள்.\nஉங்கள் படைப்பாற்றல் உச்சத்தில் இருக்கும். கலை, இசை, இலக்கியம் போன்ற துறைகளில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். புதிய முயற்சிகளில் ஈடுபட இது உகந்தது. உங்கள் பொழுதுபோக்குகளில் அதிக கவனம் செலுத்தலாம். இது உங்கள் மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சி அளிக்கும். இயற்கையுடன் இணைந்திருப்பதன் மூலம் மனதிற்கு அமைதி கிடைக்கும். தோட்டம் அமைப்பது அல்லது பூச்செடிகளைப் பராமரிப்பது போன்ற செயல்களில் ஈடுபடலாம். இது உங்கள் மனதிற்கு மகிழ்ச்சியைத் தரும்.\nஆன்மீக ரீதியாகவும் நீங்கள் முன்னேற்றம் காண்பீர்கள். இறைவழிபாடு மற்றும் தியானத்தில் ஈடுபடுவதன் மூலம் மன அமைதி கிடைக்கும். உங்கள் அக உணர்வுகள் மேலும் தெளிவு பெறும். பிறருக்கு நன்மை செய்வதன் மூலம் நீங்கள் மனநிறைவை அடைவீர்கள். சமூகத்தில் உங்கள் மதிப்பும் மரியாதையும் உயரும். உங்கள் தன்னம்பிக்கை அதிகரிக்கும். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொண்டு, அதிலிருந்து கற்றுக்கொள்வதற்கான வாய்ப்புகள் உருவாகும். பொறுமையுடனும், நிதானத்துடனும் செயல்படுவது உங்களுக்கு வெற்றியைத் தேடித்தரும். இன்றைய நாள் உங்கள் வாழ்க்கையில் புதிய நல்லிணக்கத்தையும், சந்தோஷத்தையும் கொண்டு வரும்.",
    "prediction_en": "Today, Friday, will be a day filled with social connections and new discoveries for Aquarius natives. Under the influence of Venus, your relationships with friends and social circles will strengthen. Opportunities will arise to meet new people and engage in interesting conversations. Your innovative ideas will be appreciated. You will take the lead in social events, and your unique personality will shine.\nJoyful news will arrive. A good event you have long anticipated will occur. Your thoughts will become clear, and you will act with a positive approach in everything. Opportunities will arise to have heartfelt conversations with friends and relatives, which will further strengthen your relationships. You will gain satisfaction by helping others. This is an excellent day to engage in social service. As your social circle expands, you will gain new perspectives and ideas, further enriching your mind.\nFor those in romantic relationships, today is a very sweet day. You will establish a deep understanding with your partner. You can support each other and have healthy discussions about future plans. Married couples will feel new joy and intimacy in their marital life. A romantic atmosphere will prevail. This is a good day to encourage your children's talents. You will formulate good plans regarding their future.\nYour creativity will be at its peak. Good opportunities will arise for those in fields like art, music, and literature. This is suitable for engaging in new ventures. You can focus more on your hobbies, which will reduce your stress and rejuvenate you. Connecting with nature will bring peace of mind. You may engage in activities like gardening or maintaining flowering plants, which will bring joy to your mind.\nSpiritually, you will also see progress. Engaging in prayer and meditation will bring mental peace. Your inner consciousness will become clearer. This is a good opportunity to reflect deeply on the purposes of life. You will gain satisfaction by helping others. You may engage in small acts of charity, which will increase your merits.\nGenerally, today you will approach situations very positively. You will face any challenge with confidence and find opportunities to learn from it. By acting with self-confidence, you can achieve many good things. Your personality will shine. You have the power to charm others and bring them to your way. This will lead to many favorable changes in your social and personal relationships. Acting calmly without haste in any matter will bring success. Today will bring new splendor and happiness into your life.",
    "career_ta": "உங்கள் புதுமையான யோசனைகள் பணியிடத்தில் பாராட்டப்படும். புதிய தொழில்நுட்பங்களைப் பயன்படுத்தவும், புதிய திட்டங்களில் ஈடுபடவும் இது ஒரு நல்ல நாள். குழுப்பணிகளில் உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். சமூக நலன் சார்ந்த பணிகளில் ஈடுபடுபவர்களுக்கு நல்ல அங்கீகாரம் கிடைக்கும். உங்கள் தகவல் தொடர்புத் திறன்கள் வெற்றிக்கு வழிவகுக்கும். மேலதிகாரிகளுடன் இணக்கமான உறவு உருவாகும்.",
    "career_en": "Your innovative ideas will be appreciated in the workplace. This is a good day to use new technologies and engage in new projects. Your contribution to team tasks will be significant. Those involved in social welfare activities will receive good recognition. Your communication skills will lead to success, and a harmonious relationship will develop with superiors.",
    "finance_ta": "நிதிநிலைமை சீராக இருக்கும். புதிய முதலீடுகளைப் பற்றி சிந்திப்பதற்கு இது ஒரு நல்ல நேரம். சமூக நலன் சார்ந்த திட்டங்களில் முதலீடு செய்ய ஆர்வம் காட்டுவீர்கள். எதிர்பாராத வகையில் ஒரு சிறிய நிதி ஆதாயம் கிடைக்கலாம். வரவு செலவுக் கணக்கை சரியாக நிர்வகிப்பதன் மூலம் நிதி நிலைமை மேம்படும். எதிர்காலத்திற்கான சேமிப்பை அதிகரிக்கலாம். நிதி ஆலோசனைகள் நல்ல பலன் தரும்.",
    "finance_en": "Your financial situation will be stable. This is a good time to think about new investments, and you will show interest in investing in social welfare projects. An unexpected small financial gain may occur. By properly managing income and expenses, your financial situation will improve. You can increase savings for the future, and financial advice will yield good results.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதி அதிகரிப்பதால் உடல்நிலையும் மேம்படும். புதிய உடற்பயிற்சிகளைத் தொடங்க இது ஒரு சிறந்த நாள். சமச்சீர் உணவு எடுத்துக்கொள்வதில் கவனம் செலுத்துங்கள். யோகா அல்லது தியானம் செய்வதன் மூலம் மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சி பெறலாம். உடல்நலனில் சிறிய பாதிப்புகள் இருந்தாலும் அவை விரைவில் சீராகும். போதுமான ஓய்வு எடுப்பது முக்கியம்.",
    "health_en": "Your physical health will be excellent. As mental peace increases, your physical condition will also improve. This is a great day to start new exercise routines. Focus on maintaining a balanced diet. You can reduce stress and rejuvenate through yoga or meditation. Even if there are minor health issues, they will soon stabilize. Getting adequate rest is important.",
    "lucky_number": "4",
    "lucky_color_ta": "ஊதா",
    "lucky_color_en": "Purple"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "27-02-2026",
    "prediction_ta": "இன்றைய வெள்ளிக்கிழமை மீன ராசிக்காரர்களுக்கு மன அமைதியையும், ஆன்மீக முன்னேற்றத்தையும் கொண்டு வரும். சுக்கிரனின் ஆதிக்கத்தால், உங்கள் உள் உணர்வுகள் தெளிவாகும். பிறருடன் ஆழமான அர்த்தமுள்ள உரையாடல்களில் ஈடுபடுவீர்கள். உங்கள் கலை மற்றும் படைப்பாற்றல் வெளிப்படும். தனிப்பட்ட உறவுகளில் நல்லிணக்கம் காணப்படும். உங்கள் குடும்பத்தினருடன் அல்லது அன்புக்குரியவர்களுடன் அதிக நேரம் செலவிடுவீர்கள். வீட்டில் மகிழ்ச்சியான சூழல் நிலவும்.\nஉங்கள் மனதிற்கு அமைதியைத் தரக்கூடிய விஷயங்களில் ஈடுபடுவீர்கள். குறிப்பாக, நீண்ட நாட்களாக நீங்கள் விரும்பிய ஒரு காரியத்தைச் செய்து முடிக்க இது சரியான தருணம். உங்கள் எண்ணங்கள் தெளிவுற்று, எதிலும் ஒரு நேர்மறையான அணுகுமுறையுடன் செயல்படுவீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் மனம்விட்டுப் பேசும் வாய்ப்பு கிடைக்கும். இது உங்கள் உறவுகளை மேலும் வலுப்படுத்தும். பிறருக்கு உதவி செய்வதன் மூலம் மனநிறைவைப் பெறுவீர்கள். சமூக சேவைகளில் ஈடுபட இது ஒரு சிறந்த நாள். உங்கள் சமூக வட்டாரம் விரிவடைவதால், புதிய கருத்துக்களையும், எண்ணங்களையும் நீங்கள் அறிந்து கொள்வீர்கள். இது உங்கள் மனதை மேலும் பக்குவப்படுத்தும்.\nகாதல் உறவுகளில் இருப்பவர்களுக்கு இன்று மிகவும் இனிமையான நாளாகும். உங்கள் துணையுடன் ஆழமான புரிதலை ஏற்படுத்திக்கொள்வீர்கள். ஒருவருக்கொருவர் ஆதரவாக இருந்து, வருங்காலத் திட்டங்கள் குறித்து ஆரோக்கியமான விவாதங்களை மேற்கொள்ளலாம். திருமணமான தம்பதிகள் தங்கள் இல்லற வாழ்க்கையில் புதிய மகிழ்ச்சியையும், நெருக்கத்தையும் உணர்வார்கள். ஒரு ரொமான்டிக் சூழல் நிலவும். குழந்தைகளின் திறமைகளை ஊக்குவிக்க இது ஒரு நல்ல நாள். அவர்களின் எதிர்காலம் குறித்த நல்ல திட்டங்களை வகுப்பீர்கள்.\nஉங்கள் படைப்பாற்றல் உச்சத்தில் இருக்கும். கலை, இசை, இலக்கியம் போன்ற துறைகளில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். புதிய முயற்சிகளில் ஈடுபட இது உகந்தது. உங்கள் பொழுதுபோக்குகளில் அதிக கவனம் செலுத்தலாம். இது உங்கள் மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சி அளிக்கும். இயற்கையுடன் இணைந்திருப்பதன் மூலம் மனதிற்கு அமைதி கிடைக்கும். தோட்டம் அமைப்பது அல்லது பூச்செடிகளைப் பராமரிப்பது போன்ற செயல்களில் ஈடுபடலாம். இது உங்கள் மனதிற்கு மகிழ்ச்சியைத் தரும்.\nஆன்மீக ரீதியாகவும் நீங்கள் முன்னேற்றம் காண்பீர்கள். இறைவழிபாடு மற்றும் தியானத்தில் ஈடுபடுவதன் மூலம் மன அமைதி கிடைக்கும். உங்கள் அக உணர்வுகள் மேலும் தெளிவு பெறும். வாழ்க்கையின் நோக்கங்கள் குறித்து ஆழமாக சிந்திக்க இது ஒரு நல்ல வாய்ப்பு. பிறருக்கு உதவி செய்வதன் மூலம் நீங்கள் மனநிறைவைப் பெறுவீர்கள். சிறிய அளவில் தொண்டு காரியங்களில் ஈடுபடலாம். இது உங்கள் புண்ணிய கணக்கை அதிகரிக்கும்.\nபொதுவாக, இன்று நீங்கள் சூழ்நிலைகளை மிக நேர்மறையாக அணுகுவீர்கள். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொண்டு, அதிலிருந்து கற்றுக்கொள்வதற்கான வாய்ப்புகளைப் பெறுவீர்கள். தன்னம்பிக்கையுடன் செயல்படுவதன் மூலம் பல நல்ல காரியங்களை சாதிக்க முடியும். உங்கள் ஆளுமைத்திறன் அதிகரிக்கும். பிறரைக் கவர்ந்து, அவர்களை உங்கள் வழிக்குக் கொண்டு வரும் சக்தி உங்களுக்கு உண்டு. இதனால், உங்கள் சமூக மற்றும் தனிப்பட்ட உறவுகளில் பல சாதகமான மாற்றங்கள் ஏற்படும். எந்தவொரு விஷயத்திலும் அவசரப்படாமல், நிதானத்துடன் செயல்படுவது வெற்றியைப் பெற்றுத்தரும். இன்றைய நாள் உங்கள் வாழ்க்கையில் புதிய பொலிவையும், மகிழ்ச்சியையும் கொண்டு வரும்.",
    "prediction_en": "Today, Friday, will bring mental peace and spiritual progress for Pisces natives. Under the influence of Venus, your inner feelings will become clear. You will engage in deep, meaningful conversations with others. Your artistic and creative talents will manifest, and harmony will be found in personal relationships. You will spend more time with your family or loved ones, and a joyful atmosphere will prevail at home.\nYou will engage in activities that bring peace to your mind. Specifically, this is the right time to complete a task you have long desired. Your thoughts will become clear, and you will act with a positive approach in everything. Opportunities will arise to have heartfelt conversations with friends and relatives, which will further strengthen your relationships. You will gain satisfaction by helping others. This is an excellent day to engage in social service. As your social circle expands, you will gain new perspectives and ideas, further enriching your mind.\nFor those in romantic relationships, today is a very sweet day. You will establish a deep understanding with your partner. You can support each other and have healthy discussions about future plans. Married couples will feel new joy and intimacy in their marital life. A romantic atmosphere will prevail. This is a good day to encourage your children's talents. You will formulate good plans regarding their future.\nYour creativity will be at its peak. Good opportunities will arise for those in fields like art, music, and literature. This is suitable for engaging in new ventures. You can focus more on your hobbies, which will reduce your stress and rejuvenate you. Connecting with nature will bring peace of mind. You may engage in activities like gardening or maintaining flowering plants, which will bring joy to your mind.\nSpiritually, you will also see progress. Engaging in prayer and meditation will bring mental peace. Your inner consciousness will become clearer. This is a good opportunity to reflect deeply on the purposes of life. You will gain satisfaction by helping others. You may engage in small acts of charity, which will increase your merits.\nGenerally, today you will approach situations very positively. You will face any challenge with confidence and find opportunities to learn from it. By acting with self-confidence, you can achieve many good things. Your personality will shine. You have the power to charm others and bring them to your way. This will lead to many favorable changes in your social and personal relationships. Acting calmly without haste in any matter will bring success. Today will bring new splendor and happiness into your life.",
    "career_ta": "பணியிடத்தில் உங்கள் படைப்பாற்றல் மற்றும் உள்ளுணர்வு பாராட்டப்படும். புதிய திட்டங்களில் உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். கலை, சேவை மற்றும் தியானம் சார்ந்த துறைகளில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். சக ஊழியர்களுடன் நல்லுறவு பேணுவீர்கள். உங்கள் கடின உழைப்புக்கு அங்கீகாரம் கிடைக்கும். புதிய பொறுப்புகளை ஏற்க இது ஒரு நல்ல நாள். உங்களின் உணர்ச்சிபூர்வமான அணுகுமுறை வெற்றிக்கு வழிவகுக்கும்.",
    "career_en": "In the workplace, your creativity and intuition will be appreciated. Your contribution to new projects will be significant. Good opportunities will arise for those in artistic, service, and spiritual fields. You will maintain good relationships with colleagues. Your hard work will be recognized, and this is a good day to take on new responsibilities. Your empathetic approach will lead to success.",
    "finance_ta": "நிதிநிலைமை சீராக இருக்கும். எதிர்பாராத வகையில் ஒரு சிறிய நிதி ஆதாயம் கிடைக்கலாம். நீண்டகால சேமிப்புத் திட்டங்களில் முதலீடு செய்ய இது ஒரு நல்ல நேரம். குடும்பச் செலவுகள் சீராக இருக்கும். ஆன்மீக மற்றும் தொண்டு காரியங்களுக்கு செலவு செய்யலாம். வரவு செலவுக் கணக்கை சரியாக நிர்வகிப்பதன் மூலம் நிதி நிலைமை மேம்படும். எதிர்காலத்திற்கான நிதி பாதுகாப்பு உறுதி செய்யப்படும்.",
    "finance_en": "Your financial situation will be stable. An unexpected small financial gain may occur. This is a good time to invest in long-term savings plans. Family expenses will be stable. You may spend on spiritual and charitable activities. By properly managing income and expenses, your financial situation will improve, and financial security for the future will be ensured.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். மன அமைதியுடன் இருப்பதால், உடல்நிலையும் சீராக இருக்கும். தியானம், யோகா மற்றும் சுவாசப் பயிற்சிகள் மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சி தரும். நீர்ச்சத்து நிறைந்த உணவுகளை எடுத்துக்கொள்வது நல்லது. போதுமான தூக்கம் உடல் ஆரோக்கியத்திற்கு மிகவும் அவசியம். நீண்டகாலமாக இருந்த சிறிய உடல்நலக் கோளாறுகள் விரைவில் நீங்கும்.",
    "health_en": "Physical health will improve. As you maintain mental peace, your physical condition will also be stable. Meditation, yoga, and breathing exercises will reduce stress and rejuvenate you. It's good to consume water-rich foods. Adequate sleep is very essential for physical health. Minor health issues that have been present for a long time will soon resolve.",
    "lucky_number": "7",
    "lucky_color_ta": "வெள்ளி",
    "lucky_color_en": "Silver"
  }
]
