[
  {
    "sign_ta": "மேஷம்",
    "sign_en": "Aries",
    "date": "20-02-2026",
    "prediction_ta": "இன்று சுக்கிரன் ஆதிக்கம் செலுத்தும் நாள் என்பதால், உங்கள் வாழ்வில் இனிமையும், இணக்கமும், அழகியலும் நிறைந்திருக்கும். உறவுகளில் புதிய ஒரு நல்லுறவு மலர்வதையோ அல்லது பழைய உறவுகள் வலுப்படுவதையோ நீங்கள் உணர்வீர்கள். உங்கள் வீடு அல்லது பணியிடத்தில் அழகியல் மேம்பாடுகளைச் செய்ய இது ஒரு அருமையான நாள். கலை மற்றும் படைப்புத் திறனில் ஈடுபடுவது உங்களுக்கு ஆழ்ந்த மனநிறைவைத் தரும். இசை கேட்பது, ஓவியம் வரைவது, எழுதுவது அல்லது வேறு எந்தவொரு கலைத் துறையிலும் உங்கள் நேரத்தைச் செலவிடுவது மனதுக்கு அமைதியையும், புத்துணர்வையும் அளிக்கும். சமூக நிகழ்வுகளில் கலந்து கொள்வது புதிய நட்புகளை ஏற்படுத்திக் கொள்ளவோ அல்லது ஏற்கனவே உள்ள நண்பர்களுடன் மகிழ்ச்சியான தருணங்களைப் பகிர்ந்து கொள்ளவோ உதவும். உங்கள் பேச்சு இனிமையாகவும், இராஜதந்திரமாகவும் இருக்கும். இது எந்தவிதமான கருத்து வேறுபாடுகளையும் சுமுகமாகத் தீர்க்க உதவும். உங்கள் துணையுடன் அல்லது நெருங்கியவர்களுடன் நல்லுறவை மேம்படுத்த இது ஒரு பொன்னான வாய்ப்பு. அன்பையும், பாசத்தையும் வெளிப்படுத்துவது உறவுகளை மேலும் பலப்படுத்தும். இன்று நீங்கள் அழகின் மீதும், நேர்த்தியின் மீதும் அதிக நாட்டம் கொள்வீர்கள். உங்கள் சுற்றுப்புறத்தை சுத்தமாகவும், அழகாகவும் வைத்துக் கொள்வது உங்களுக்குள் ஒரு நேர்மறை ஆற்றலை உருவாக்கும். ஆடம்பரமான பொருட்களையோ அல்லது அழகிய பொருட்களையோ வாங்குவதற்கு இது ஒரு நல்ல நாள். ஆனால், வரவு செலவு திட்டத்தை மனதில் கொண்டு செயல்படுவது நல்லது. இன்றைய தினம் உங்கள் மகிழ்ச்சிக்குரிய விஷயங்களில் கவனம் செலுத்தவும், உங்களுக்குள் இருக்கும் படைப்புத் திறனை வெளிப்படுத்தவும் உகந்தது. புதிய முயற்சிகளைத் தொடங்குவதற்கு இது ஒரு நல்ல தருணம், குறிப்பாக அவை கூட்டாகச் செய்யப்படும்போது இன்னும் சிறப்பான பலன்களைத் தரும். ஒருவருடன் இணைந்து ஒரு வேலையைச் செய்வது, தனித்துச் செய்வதை விட அதிக திருப்தியைத் தரும். உங்கள் நண்பர்கள் மற்றும் குடும்பத்தினருடன் நேரம் செலவிடுவது உங்களுக்கு மன அமைதியையும், பாதுகாப்பான உணர்வையும் தரும். அவர்களின் அன்பும் ஆதரவும் உங்களுக்கு பெரிய பலமாக அமையும். இன்றைய நாளில் உங்கள் உள்ளுணர்வு மிகவும் துல்லியமாக இருக்கும், எனவே அதை நம்பி செயல்படலாம். உங்கள் எண்ணங்களும், உணர்வுகளும் மிகத் தெளிவான நிலையில் இருக்கும். இதனால் சரியான முடிவுகளை எடுக்க முடியும். உங்கள் மனதை அமைதியாக வைத்துக்கொண்டு, அன்றாட சவால்களைச் சந்திக்க இது ஒரு நல்ல வாய்ப்பு. பிறரின் தேவைகளை உணர்ந்து அவர்களுக்கு உதவுவது உங்களுக்குள் ஒரு பெரிய மகிழ்ச்சியை ஏற்படுத்தும். சிறிய உதவிகள் கூட இன்று பெரிய மாற்றங்களை ஏற்படுத்தும். உங்கள் தாராள மனப்பான்மை பாராட்டப்படும். இன்றைய நாள், உங்கள் வாழ்க்கையில் அன்பையும், மகிழ்ச்சியையும், அமைதியையும் கொண்டு வரும் ஒரு பொன்னான நாளாக அமையும். மனநிறைவுடன் செயல்படுங்கள், நல்லதே நடக்கும். உங்கள் மனம் அமைதியாகவும், புதிய ஆற்றலுடன் செயல்படவும் உதவும். பிறரிடம் இனிமையாகப் பேசுவது உங்கள் உறவுகளைப் பலப்படுத்தும். உங்களுக்குப் பிடித்தமான விஷயங்களைச் செய்வதன் மூலம் மகிழ்ச்சியைப் பெறுவீர்கள். புதிய பொழுதுபோக்குகளில் ஈடுபட இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்திலும், உடலிலும் ஒரு புத்துணர்ச்சி உண்டாகும். அழகியல் விஷயங்களில் உங்கள் ரசனை மேம்படும். இன்று உங்கள் எண்ணங்கள் அனைத்தும் நேர்மறையாகவும், ஆக்கபூர்வமாகவும் இருக்கும். கலை சார்ந்த விஷயங்களில் ஈடுபடுவது, உங்கள் மனதுக்கு மிகுந்த ஆறுதலையும், மகிழ்ச்சியையும் தரும். உங்கள் தனிப்பட்ட வாழ்க்கையிலும், சமூக வாழ்க்கையிலும் நல்லுறவுகள் வலுப்பெறும். இது உங்களுக்கு மிகுந்த நம்பிக்கையையும், உற்சாகத்தையும் அளிக்கும். எந்தவொரு சிறிய விஷயத்திலும் மகிழ்ச்சியைக் கண்டறியும் திறன் இன்று உங்களுக்கு அதிகமாக இருக்கும். இன்றைய நாள் அன்பையும், அழகையும் போற்றும் நாளாக அமையும்.",
    "prediction_en": "Today, being ruled by Venus, your life will be filled with sweetness, harmony, and aesthetics. You will sense the blossoming of a new good relationship or the strengthening of old ones. This is an excellent day to make aesthetic improvements to your home or workplace. Engaging in art and creative endeavors will bring you deep satisfaction. Spending your time listening to music, painting, writing, or any other artistic field will bring peace of mind and rejuvenation. Participating in social events will help you forge new friendships or share joyful moments with existing friends. Your speech will be sweet and diplomatic, helping you resolve any disagreements amicably. This is a golden opportunity to improve your relationship with your partner or close ones. Expressing love and affection will further strengthen relationships. Today, you will have a greater inclination towards beauty and neatness. Keeping your surroundings clean and beautiful will create positive energy within you. This is a good day to buy luxurious or beautiful items, but it's good to operate with a budget in mind. Today is suitable for focusing on your happiness and expressing your creativity. This is a good time to start new ventures, especially when they are done collaboratively, yielding even better results. Working on a task with someone will be more satisfying than doing it alone. Spending time with your friends and family will bring you peace of mind and a sense of security. Their love and support will be a great strength to you. Your intuition will be very accurate today, so you can trust and act on it. Your thoughts and feelings will be very clear, enabling you to make good decisions. This is a good opportunity to keep your mind calm and face daily challenges. Helping others by understanding their needs will bring great joy within you. Even small acts of kindness can make a big difference today. Your generosity will be appreciated. Today will be a golden day, bringing love, joy, and peace into your life. Act with contentment, and good things will happen. Your mind will be calm and able to work with new energy. Speaking kindly to others will strengthen your relationships. You will find joy by doing things you love. This is a great day to engage in new hobbies. You will feel rejuvenated in your health and body. Your aesthetic taste will improve. Today, all your thoughts will be positive and constructive. Engaging in artistic matters will bring great comfort and joy to your mind. Relationships in your personal and social life will strengthen. This will give you great confidence and enthusiasm. Your ability to find joy in even small things will be enhanced today. Today will be a day to appreciate love and beauty.",
    "career_ta": "உங்கள் பணியிடத்தில் இணக்கமான சூழ்நிலை நிலவும். சக ஊழியர்களுடனும், மேலதிகாரிகளுடனும் நல்லுறவுகள் வலுப்படும். புதிய திட்டங்களில் கூட்டாகச் செயல்படுவதன் மூலம் சிறந்த முடிவுகளைப் பெறுவீர்கள். கலை மற்றும் படைப்புத் துறைகளில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் அமையும். உங்கள் கருத்துக்களுக்கு நல்ல வரவேற்பு கிடைக்கும்.",
    "career_en": "A harmonious atmosphere will prevail in your workplace. Relationships with colleagues and superiors will strengthen. You will achieve excellent results by working collaboratively on new projects. New opportunities will arise for those in artistic and creative fields. Your ideas will be well received.",
    "finance_ta": "நிதி நிலைமைகள் சீராக இருக்கும். குடும்பத்தினருடனும், நண்பர்களுடனும் சேர்ந்து மகிழ்ச்சியான நிகழ்வுகளுக்காக செலவு செய்ய நேரிடலாம். அழகியல் சார்ந்த பொருட்களிலோ அல்லது வீட்டு அலங்காரத்திலோ முதலீடு செய்வது உங்களுக்கு மகிழ்ச்சியைத் தரும். சிறிய அளவில் லாபகரமான முதலீடுகளையும் பரிசீலிக்கலாம்.",
    "finance_en": "Financial conditions will be stable. You may have to spend on joyful events with family and friends. Investing in aesthetic items or home decor will bring you happiness. You may also consider small profitable investments.",
    "health_ta": "உங்கள் மன ஆரோக்கியத்தில் கவனம் செலுத்துவது முக்கியம். மன அமைதியைத் தரும் தியானம் அல்லது யோகா போன்ற பயிற்சிகளில் ஈடுபடலாம். அழகியல் சார்ந்த செயல்களில் ஈடுபடுவது மனதுக்கு உற்சாகத்தை அளிக்கும். உடற்பயிற்சி மற்றும் ஆரோக்கியமான உணவுப் பழக்கங்களை மேற்கொள்ளுங்கள். குறிப்பாக மனதை சந்தோஷமாக வைத்துக்கொள்வது உங்கள் உடலையும் புத்துணர்ச்சியுடன் வைத்திருக்கும்.",
    "health_en": "Focusing on your mental health is important. You can engage in practices like meditation or yoga that bring peace of mind. Engaging in aesthetic activities will bring enthusiasm to the mind. Adopt exercise and healthy eating habits. Keeping your mind happy, in particular, will keep your body refreshed.",
    "lucky_number": "9",
    "lucky_color_ta": "சிவப்பு",
    "lucky_color_en": "Red"
  },
  {
    "sign_ta": "ரிஷபம்",
    "sign_en": "Taurus",
    "date": "20-02-2026",
    "prediction_ta": "இன்று சுக்கிரனின் ஆதிக்கம் உங்கள் ராசிக்கு மிகவும் சாதகமாக அமையும். உங்கள் தனிப்பட்ட வாழ்க்கையிலும், சமூக வாழ்க்கையிலும் மகிழ்ச்சியும், இணக்கமும் பெருகும். நீங்கள் வழக்கமாக விரும்புவது போலவே, வசதியான மற்றும் ஆடம்பரமான விஷயங்களை அனுபவிக்க இது ஒரு சிறந்த நாள். உங்கள் வீடு அல்லது பணியிடத்தில் அழகியல் மாற்றங்களைச் செய்வது உங்களுக்கு மிகுந்த மனநிறைவைத் தரும். இன்று உங்கள் மனது அமைதியாகவும், சமாதானத்துடனும் இருக்கும். உறவுகளில் அன்பு பெருகும், குறிப்பாக நெருங்கிய உறவினர்களுடனும், நண்பர்களுடனும் நீங்கள் செலவிடும் நேரம் மிகுந்த மகிழ்ச்சியை அளிக்கும். நீண்டகாலமாக இருந்த சிறிய கருத்து வேறுபாடுகள் கூட இன்று சுமுகமாகத் தீரும். உங்கள் மனம் கலை மற்றும் அழகின்பால் ஈர்க்கப்படும். உங்களுக்குப் பிடித்தமான பொழுதுபோக்குகளில் ஈடுபடுவது, புதிய கலை வடிவங்களைக் கற்றுக்கொள்வது அல்லது கலைப் படைப்புகளை ரசிப்பது ஆகியவை உங்கள் நாளுக்கு ஒரு புதிய பரிமாணத்தைச் சேர்க்கும். உங்கள் படைப்புத் திறனை வெளிப்படுத்த இது ஒரு சிறந்த தருணம். உங்களுக்கான ஓய்வையும், மகிழ்ச்சியையும் அளிக்கும் விஷயங்களில் கவனம் செலுத்துங்கள். உடலையும், மனதையும் புத்துணர்ச்சியுடன் வைத்துக் கொள்ள இது உதவும். உணவில் ஆரோக்கியமான, சுவையான விஷயங்களைச் சுவைப்பதன் மூலம் மனதுக்கு மகிழ்ச்சி கிடைக்கும். உங்கள் தனிப்பட்ட கவர்ச்சி அதிகரிக்கும், இதனால் சமூக நிகழ்வுகளில் நீங்கள் பிரகாசிப்பீர்கள். புதிய நபர்களைச் சந்திப்பதும், சமூக வட்டத்தை விரிவுபடுத்துவதும் சாதகமாக அமையும். நீண்டகாலமாக நிலுவையிலிருக்கும் வீட்டு வேலைகளைச் செய்து முடிப்பதற்கும், உங்கள் இல்லத்தை அழகுபடுத்துவதற்கும் இது ஒரு நல்ல நாள். உங்கள் குடும்பத்தினருடன் தரமான நேரத்தைச் செலவிடுவது உறவுகளைப் பலப்படுத்தும். உங்களுக்குள் இருக்கும் அன்பையும், பாசத்தையும் வெளிப்படுத்த தயங்க வேண்டாம். பிறருக்கு உதவவும், அவர்கள் மீது அக்கறை செலுத்தவும் இன்று உங்களுக்கு அதிகமான ஆர்வம் ஏற்படும். உங்கள் நேர்மறை அணுகுமுறை, சுற்றியுள்ளவர்களுக்கும் மகிழ்ச்சியைக் கொண்டு வரும். இன்றைய நாள் அமைதியாகவும், மகிழ்ச்சியாகவும் அமையும். உங்கள் வாழ்க்கை துணையுடனான பிணைப்பு இன்னும் ஆழமடையும், புரிதல் அதிகரிக்கும். அவர்களுக்கு நீங்கள் காட்டும் சிறிய அன்பும், பரிவும் பெரிய மகிழ்ச்சியைக் கொடுக்கும். உங்கள் உணர்ச்சிகள் சீராக இருக்கும், இது எந்தவொரு சவாலையும் திறம்பட எதிர்கொள்ள உதவும். நிதி ரீதியாக, இன்றைய நாள் ஸ்திரத்தன்மையை கொண்டுவரும். ஆடம்பரமான விஷயங்களில் செலவு செய்வதற்கு முன்னர், பட்ஜெட்டை சரிபார்த்துக் கொள்வது நல்லது. உங்களுக்குப் பிடித்தமான இசையைக் கேட்பது, அல்லது இயற்கையோடு நேரம் செலவிடுவது மனதுக்கு அமைதியைத் தரும். எந்தவொரு அவசர முடிவுகளையும் தவிர்த்து, நிதானமாகச் செயல்படுவது நல்லது. இன்றைய நாள் உங்கள் ரசனை உணர்வை மேம்படுத்தவும், உங்கள் வாழ்க்கையில் அழகான விஷயங்களைக் கொண்டு வரவும் உதவும். சிறிய சந்தோஷங்களை அனுபவித்து, மன நிறைவுடன் வாழ இது ஒரு சிறந்த நாள்.",
    "prediction_en": "Today, the influence of Venus will be very favorable for your zodiac sign. Joy and harmony will increase in your personal and social life. This is a great day to enjoy comfortable and luxurious things, just as you usually prefer. Making aesthetic changes to your home or workplace will bring you immense satisfaction. Today your mind will be calm and peaceful. Love will increase in relationships, especially the time you spend with close relatives and friends will bring great joy. Even small disagreements that have existed for a long time will be resolved amicably today. Your mind will be drawn to art and beauty. Engaging in your favorite hobbies, learning new art forms, or appreciating works of art will add a new dimension to your day. This is a great time to express your creativity. Focus on things that bring you rest and happiness. This will help keep your body and mind refreshed. Enjoying healthy and delicious foods will bring happiness to your mind. Your personal charm will increase, making you shine in social events. Meeting new people and expanding your social circle will be favorable. This is a good day to complete long-pending household chores and beautify your home. Spending quality time with your family will strengthen relationships. Do not hesitate to express the love and affection within you. Today, you will have a greater interest in helping others and caring for them. Your positive approach will bring happiness to those around you. Today will be peaceful and joyful. The bond with your life partner will deepen, and understanding will increase. The small love and care you show them will bring great happiness. Your emotions will be stable, which will help you face any challenge effectively. Financially, today will bring stability. Before spending on luxurious items, it is good to check your budget. Listening to your favorite music or spending time with nature will bring peace to your mind. It is better to avoid any hasty decisions and act calmly. Today will help enhance your sense of taste and bring beautiful things into your life. This is a great day to enjoy small joys and live with contentment.",
    "career_ta": "பணியிடத்தில் உங்கள் கடின உழைப்பும், அர்ப்பணிப்பும் பாராட்டப்படும். சக ஊழியர்களுடன் நல்லிணக்கம் நிலவும். கூட்டாகச் செயல்படும் திட்டங்களில் நல்ல முன்னேற்றம் ஏற்படும். உங்கள் படைப்புத் திறனைப் பயன்படுத்த இது ஒரு நல்ல நாள், குறிப்பாக வடிவமைத்தல், அழகுபடுத்துதல் அல்லது கலை சார்ந்த தொழில்களில் உள்ளவர்களுக்கு சிறப்பான வாய்ப்புகள் அமையும்.",
    "career_en": "Your hard work and dedication will be appreciated at work. Harmony will prevail with colleagues. Good progress will be made in collaborative projects. This is a good day to utilize your creativity, especially for those in design, beautification, or art-related professions, excellent opportunities will arise.",
    "finance_ta": "நிதி ரீதியாக நிலைத்தன்மை காணப்படும். நீங்கள் நீண்டகால முதலீடுகளைப் பற்றி சிந்திக்க இது ஒரு நல்ல நாள். வசதி மற்றும் ஆடம்பரங்களுக்காக செலவு செய்ய நேரிடலாம், ஆனால் அதை அளவோடு செய்வது நல்லது. குடும்பத்தின் நிதி நிலைமையைப் பலப்படுத்த சில திட்டங்களை வகுக்கலாம்.",
    "finance_en": "Financial stability will be observed. This is a good day for you to think about long-term investments. You may have to spend on comfort and luxury, but it is good to do so in moderation. You can make some plans to strengthen the family's financial situation.",
    "health_ta": "உங்கள் உடல்நலத்தில் கவனம் செலுத்துங்கள். உணவில் ஆரோக்கியமான மாற்றங்களைச் செய்வது நல்லது. மன அழுத்தம் இல்லாமல் இருக்க தியானம் அல்லது மென்மையான உடற்பயிற்சிகளை மேற்கொள்ளுங்கள். அழகிய சூழலில் நேரம் செலவிடுவது உங்கள் மனதுக்கு அமைதியைத் தரும். நல்ல தூக்கம் அவசியம்.",
    "health_en": "Pay attention to your health. It is good to make healthy changes in your diet. Engage in meditation or gentle exercises to avoid stress. Spending time in beautiful surroundings will bring peace to your mind. Good sleep is essential.",
    "lucky_number": "6",
    "lucky_color_ta": "வெண்மை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "மிதுனம்",
    "sign_en": "Gemini",
    "date": "20-02-2026",
    "prediction_ta": "இன்று சுக்கிரனின் செல்வாக்கு உங்கள் சமூக வாழ்க்கை மற்றும் தகவல்தொடர்புகளில் இனிமையையும், இணக்கத்தையும் கொண்டு வரும். நீங்கள் இன்று மிகவும் வசீகரமாகவும், சுறுசுறுப்பாகவும் காணப்படுவீர்கள். உங்கள் வார்த்தைகள் இனிமையாகவும், மற்றவர்களை எளிதில் கவரும் வகையிலும் இருக்கும். இது சமூக உறவுகளைப் பலப்படுத்தவும், புதிய நட்புகளை உருவாக்கவும் உதவும். நீண்டகாலமாக பேசாத நண்பர்களுடன் மீண்டும் தொடர்பு கொள்ள இது ஒரு நல்ல நாள். இன்றைய தினம் உங்கள் எண்ணங்களையும், கருத்துக்களையும் வெளிப்படுத்துவதற்கு ஒரு சாதகமான நாளாகும். உங்கள் படைப்புத் திறன் மேம்படும், எனவே கலை அல்லது எழுத்து சார்ந்த முயற்சிகளில் ஈடுபடுவது உங்களுக்கு மகிழ்ச்சியைத் தரும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்துவதற்கும் இது ஒரு பொன்னான வாய்ப்பு. சமூக நிகழ்வுகளில் கலந்து கொள்வது அல்லது புதிய குழுக்களில் சேருவது உங்கள் மனதுக்கு புத்துணர்வையும், உற்சாகத்தையும் அளிக்கும். சிறிய பயணங்கள் அல்லது குறுகிய தூரப் பயணங்கள் உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். இவை பொழுதுபோக்கு சார்ந்தவையாகவோ அல்லது தகவல் தொடர்புகளை மேம்படுத்துவதற்காகவோ இருக்கலாம். உங்கள் உடன்பிறப்புகளுடனும், அண்டை வீட்டினருடனும் உறவுகள் மேம்படும். அவர்களுடன் நல்லுரையாடல் மேற்கொள்வது உங்களுக்கு மகிழ்ச்சியைத் தரும். உங்கள் மனதில் உள்ள விஷயங்களை ஒளிவுமறைவின்றி வெளிப்படுத்த இது ஒரு நல்ல நாள். ஆனால், அதே நேரத்தில் மற்றவர்களின் கருத்துக்களுக்கும் மதிப்பு கொடுக்க வேண்டும். இன்று உங்கள் உள்ளுணர்வு கூர்மையாக இருக்கும், இது சரியான முடிவுகளை எடுக்க உதவும். எந்தவொரு விஷயத்திலும் அவசரம் காட்டாமல், நிதானமாகச் செயல்படுவது நல்லது. உங்கள் நேர்மறை எண்ணங்கள் சுற்றியுள்ளவர்களுக்கும் பரவும், இதனால் அவர்களும் மகிழ்ச்சி அடைவார்கள். இன்று உங்கள் வசீகரமான ஆளுமை மூலம் எந்தவொரு சவாலையும் எளிதில் சமாளிப்பீர்கள். குறிப்பாக புதிய யோசனைகளை முன்வைப்பதற்கும், பிறரை உங்கள் வழியில் கொண்டு வருவதற்கும் இது ஒரு சிறந்த நாள். உங்கள் அறிவுத்திறன் மற்றும் தகவல்தொடர்பு திறன் இன்று உச்சத்தில் இருக்கும். இன்று நீங்கள் சந்திக்கும் நபர்கள், உங்களுக்குப் புதிய கண்ணோட்டங்களைத் தரலாம் அல்லது புதிய வாய்ப்புகளை உருவாக்கலாம். புதிய தகவல்களைச் சேகரிப்பதற்கும், உங்கள் அறிவை விரிவுபடுத்துவதற்கும் இது ஒரு நல்ல நாள். ஆன்லைனில் அல்லது வாசிப்பு மூலம் புதிய விஷயங்களைக் கற்றுக்கொள்ள நேரம் ஒதுக்குங்கள். உங்கள் மனதில் இருக்கும் திட்டங்களுக்கு வடிவம் கொடுக்க இது ஒரு நல்ல நேரம். சிறிய கூட்டங்கள் அல்லது கலந்துரையாடல்கள் மூலம் உங்கள் யோசனைகளைப் பகிர்ந்து கொள்ளலாம். உங்கள் வாழ்க்கையில் ஒரு புதிய நேர்மறை அத்தியாயத்தைத் தொடங்க இது ஒரு நல்ல தருணம். மகிழ்ச்சியுடனும், உற்சாகத்துடனும் செயல்படுங்கள். இன்று நீங்கள் செய்யும் ஒவ்வொரு விஷயத்திலும் ஒரு தனித்துவமான திறமையுடன் செயல்படுவீர்கள். உங்கள் நகைச்சுவை உணர்வு மற்றும் புத்திசாலித்தனம் இன்று அனைவரையும் கவரும். இன்றைய நாள் உங்கள் சமூக மற்றும் அறிவுசார் வாழ்க்கையை மேம்படுத்தும். அன்பும், நல்லிணக்கமும் நிறைந்த நாளாக அமையும்.",
    "prediction_en": "Today, the influence of Venus will bring sweetness and harmony to your social life and communications. You will appear very charming and active today. Your words will be sweet and easily captivating to others. This will help strengthen social relationships and forge new friendships. This is a good day to reconnect with friends you haven't spoken to in a long time. Today is a favorable day to express your thoughts and opinions. Your creativity will improve, so engaging in artistic or writing endeavors will bring you joy. This is a golden opportunity to learn new things and improve your knowledge. Participating in social events or joining new groups will bring rejuvenation and enthusiasm to your mind. Short trips or brief excursions will refresh you. These could be for leisure or to improve communications. Relationships with your siblings and neighbors will improve. Having good conversations with them will bring you joy. This is a good day to express your feelings openly. However, at the same time, you should also value others' opinions. Today your intuition will be sharp, which will help you make good decisions. It is good to act calmly without rushing into anything. Your positive thoughts will spread to those around you, making them happy too. Today you will easily overcome any challenge with your charming personality. Especially, this is a great day to propose new ideas and bring others to your way of thinking. Your intellect and communication skills will be at their peak today. The people you meet today may offer you new perspectives or create new opportunities. This is a good day to gather new information and expand your knowledge. Dedicate time to learn new things online or through reading. This is a good time to give shape to your plans. You can share your ideas through small meetings or discussions. This is a good moment to start a new positive chapter in your life. Act with joy and enthusiasm. Today you will perform every task with a unique ability. Your sense of humor and wit will captivate everyone today. Today will enhance your social and intellectual life, being a day filled with love and harmony.",
    "career_ta": "உங்கள் தகவல் தொடர்புத் திறன்கள் இன்று பிரகாசிக்கும். புதிய யோசனைகளை முன்வைப்பதற்கும், சக ஊழியர்களுடன் இணைந்து பணியாற்றுவதற்கும் இது ஒரு நல்ல நாள். கூட்டங்களில் உங்கள் கருத்துக்களுக்கு நல்ல வரவேற்பு கிடைக்கும். எழுத்து, ஊடகம் அல்லது மக்கள் தொடர்புத் துறையில் உள்ளவர்களுக்கு சிறப்பான வளர்ச்சி அமையும். புதிய தொடர்புகள் மூலம் வாய்ப்புகள் உருவாகலாம்.",
    "career_en": "Your communication skills will shine today. This is a good day to propose new ideas and work collaboratively with colleagues. Your opinions will be well received in meetings. Those in writing, media, or public relations will see excellent growth. Opportunities may arise through new contacts.",
    "finance_ta": "நிதி மேலாண்மையில் உங்கள் புத்திசாலித்தனம் வெளிப்படும். சிறிய அளவிலான முதலீடுகளில் லாபம் ஈட்ட வாய்ப்புகள் உள்ளன. சமூக நிகழ்வுகளுக்காக அல்லது கல்வி சார்ந்த விஷயங்களுக்காக செலவு செய்ய நேரிடலாம். வரவு செலவுகளைக் கவனமாகப் பதிவு செய்வது நல்லது. புதிய வருவாய் வழிகளைப் பற்றி சிந்திக்கலாம்.",
    "finance_en": "Your cleverness in financial management will be evident. There are opportunities to make profits from small investments. You may have to spend on social events or educational matters. It is good to carefully record income and expenses. You can think about new revenue streams.",
    "health_ta": "மனதளவில் சுறுசுறுப்பாகவும், ஆரோக்கியமாகவும் இருப்பீர்கள். புதிய விஷயங்களைக் கற்றுக்கொள்வது மனதுக்கு உற்சாகத்தை அளிக்கும். லேசான உடற்பயிற்சிகளை மேற்கொள்ளுங்கள். நண்பர்களுடன் நேரம் செலவிடுவது மன அழுத்தத்தைக் குறைக்கும். ஆரோக்கியமான உணவுப் பழக்கங்களை மேற்கொள்வது முக்கியம்.",
    "health_en": "You will be mentally active and healthy. Learning new things will bring enthusiasm to the mind. Engage in light exercises. Spending time with friends will reduce stress. Adopting healthy eating habits is important.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "20-02-2026",
    "prediction_ta": "இன்று சுக்கிரனின் ஆதிக்கம் உங்கள் நிதி நிலைமைகளிலும், குடும்ப உறவுகளிலும் ஒரு இனிமையான சூழலைக் கொண்டு வரும். உங்கள் வீடு மற்றும் குடும்ப விஷயங்களில் கவனம் செலுத்துவீர்கள், அதில் மகிழ்ச்சியையும், திருப்தியையும் பெறுவீர்கள். உங்கள் வீடு மிகவும் வசதியாகவும், அழகாகவும் இருப்பதை உறுதி செய்ய முயற்சிப்பீர்கள். வீட்டு அலங்காரத்தில் புதிய மாற்றங்களைச் செய்ய அல்லது குடும்பத்தினருடன் சேர்ந்து மகிழ்ச்சியான நிகழ்வுகளை ஏற்பாடு செய்ய இது ஒரு சிறந்த நாள். உங்கள் உணர்ச்சிபூர்வமான தேவைகள் இன்று பூர்த்தி செய்யப்படும். குடும்பத்தினரிடமிருந்து அன்பையும், ஆதரவையும் பெறுவீர்கள். இது உங்கள் மனதிற்கு மிகுந்த அமைதியையும், பாதுகாப்பான உணர்வையும் தரும். நீண்டகாலமாக நிலுவையிலிருக்கும் குடும்பப் பிரச்சனைகள் இன்று சுமுகமாகத் தீர வாய்ப்புள்ளது. நீங்கள் மிகவும் பாசமாகவும், அக்கறையுடனும் நடந்துகொள்வீர்கள், இது உறவுகளை மேலும் பலப்படுத்தும். உணவு விஷயங்களில் புதிய சுவைகளை ஆராய்வதற்கும், குடும்பத்தினருடன் சேர்ந்து சமைப்பதற்கும் இது ஒரு நல்ல நாள். ஆரோக்கியமான மற்றும் சுவையான உணவுகளை அனுபவிப்பது உங்களுக்கு மகிழ்ச்சியைத் தரும். நிதி ரீதியாக, இன்றைய நாள் ஸ்திரத்தன்மையை கொண்டு வரும். உங்களுக்கு வருமானம் பெருகும் வாய்ப்புகள் அல்லது எதிர்பாராத ஆதாயங்கள் கிடைக்கலாம். ஆனால், அதே நேரத்தில், உணர்ச்சிவசப்பட்டு தேவையற்ற செலவுகளைத் தவிர்ப்பது நல்லது. உங்கள் பணத்தைப் புத்திசாலித்தனமாக நிர்வகிக்க இது ஒரு நல்ல வாய்ப்பு. நீண்டகால நிதி திட்டங்களை வகுப்பதற்கு இது உகந்த நேரம். உங்கள் கலை மற்றும் படைப்புத் திறன் மேம்படும். வீட்டை அழகுபடுத்துவதிலோ அல்லது குடும்பத்தினருக்காக அன்பளிப்புகளைத் தேர்ந்தெடுப்பதிலோ உங்கள் ரசனை வெளிப்படும். நீங்கள் சமூக நிகழ்வுகளில் கலந்து கொள்வதை விட, வீட்டில் குடும்பத்தினருடன் நேரம் செலவிடுவதையே விரும்புவீர்கள். அமைதியான சூழலில் தியானம் அல்லது ஓய்வு எடுப்பது உங்கள் மனதுக்கு மிகவும் நன்மை பயக்கும். இன்றைய நாள் உங்கள் உணர்ச்சிபூர்வமான உலகத்தை செழுமைப்படுத்தும். உங்கள் உள்ளுணர்வு மிகவும் வலுவாக இருக்கும், எனவே அதை நம்பி செயல்படலாம். உங்கள் எண்ணங்கள் தெளிவான நிலையில் இருக்கும், இது சரியான முடிவுகளை எடுக்க உதவும். உங்கள் அன்பான அணுகுமுறை, குடும்பத்தினரிடமும், நெருங்கிய நண்பர்களிடமும் நல்லுறவை மேம்படுத்தும். உங்களுக்குள் இருக்கும் அன்பை வெளிப்படுத்த தயங்காதீர்கள். இன்று நீங்கள் அமைதியையும், நல்லிணக்கத்தையும் தேடுவீர்கள். சிறிய விஷயங்களில் கூட மகிழ்ச்சியைக் கண்டறியும் திறன் இன்று உங்களுக்கு அதிகமாக இருக்கும். குடும்பத்துடனும், அன்புக்குரியவர்களுடனும் தரமான நேரம் செலவிடுங்கள். இன்றைய நாள், உங்கள் வாழ்க்கையில் அன்பையும், பாதுகாப்பையும், செழிப்பையும் கொண்டு வரும் ஒரு மகிழ்ச்சியான நாளாக அமையும். மனநிறைவுடன் செயல்படுங்கள், நல்லதே நடக்கும். நிதி சார்ந்த விஷயங்களில் புதிய திட்டங்களை வகுக்க இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்திலும், மன அமைதியிலும் கவனம் செலுத்துங்கள். உங்கள் வீடு மற்றும் குடும்பம் இன்று உங்களுக்கு ஒரு புகலிடமாக அமையும். உங்களுக்குப் பிடித்தமான விஷயங்களைச் செய்வதன் மூலம் மகிழ்ச்சியைப் பெறுவீர்கள். புதிய பொழுதுபோக்குகளில் ஈடுபட இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்திலும், உடலிலும் ஒரு புத்துணர்ச்சி உண்டாகும். அழகியல் விஷயங்களில் உங்கள் ரசனை மேம்படும். இன்று உங்கள் எண்ணங்கள் அனைத்தும் நேர்மறையாகவும், ஆக்கபூர்வமாகவும் இருக்கும். கலை சார்ந்த விஷயங்களில் ஈடுபடுவது, உங்கள் மனதுக்கு மிகுந்த ஆறுதலையும், மகிழ்ச்சியையும் தரும். உங்கள் தனிப்பட்ட வாழ்க்கையிலும், சமூக வாழ்க்கையிலும் நல்லுறவுகள் வலுப்பெறும். இது உங்களுக்கு மிகுந்த நம்பிக்கையையும், உற்சாகத்தையும் அளிக்கும். எந்தவொரு சிறிய விஷயத்திலும் மகிழ்ச்சியைக் கண்டறியும் திறன் இன்று உங்களுக்கு அதிகமாக இருக்கும். இன்றைய நாள் அன்பையும், அழகையும் போற்றும் நாளாக அமையும்.",
    "prediction_en": "Today, the influence of Venus will bring a pleasant atmosphere to your financial conditions and family relationships. You will focus on your home and family matters, and you will find joy and satisfaction in them. You will strive to ensure that your home is very comfortable and beautiful. This is a great day to make new changes in home decor or organize joyful events with family. Your emotional needs will be met today. You will receive love and support from family members. This will bring great peace of mind and a sense of security to you. Long-pending family issues may be resolved amicably today. You will be very affectionate and caring, which will further strengthen relationships. This is a good day to explore new tastes in food and cook together with family. Enjoying healthy and delicious food will bring you happiness. Financially, today will bring stability. You may have opportunities for increased income or unexpected gains. However, at the same time, it is good to avoid unnecessary emotional spending. This is a good opportunity to manage your money wisely. This is an opportune time to formulate long-term financial plans. Your artistic and creative abilities will improve. Your taste will be evident in decorating your home or choosing gifts for family members. You will prefer spending time at home with family rather than attending social events. Meditation or relaxation in a calm environment will be very beneficial for your mind. Today will enrich your emotional world. Your intuition will be very strong, so you can trust and act on it. Your thoughts will be clear, which will help you make good decisions. Your loving approach will improve relationships with family and close friends. Do not hesitate to express the love within you. Today you will seek peace and harmony. Your ability to find joy in even small things will be enhanced today. Spend quality time with family and loved ones. Today will be a happy day, bringing love, security, and prosperity into your life. Act with contentment, and good things will happen. This is a great day to formulate new plans for financial matters. Focus on your health and peace of mind. Your home and family will be a refuge for you today. You will find joy by doing things you love. This is a great day to engage in new hobbies. You will feel rejuvenated in your health and body. Your aesthetic taste will improve. Today, all your thoughts will be positive and constructive. Engaging in artistic matters will bring great comfort and joy to your mind. Relationships in your personal and social life will strengthen. This will give you great confidence and enthusiasm. Your ability to find joy in even small things will be enhanced today. Today will be a day to appreciate love and beauty.",
    "career_ta": "பணியிடத்தில் உங்கள் கடின உழைப்பும், அர்ப்பணிப்பும் பாராட்டப்படும். சக ஊழியர்களுடன் நல்லுறவுகள் வலுப்படும். கூட்டாகச் செயல்படும் திட்டங்களில் நல்ல முன்னேற்றம் ஏற்படும். உங்கள் படைப்புத் திறனைப் பயன்படுத்த இது ஒரு நல்ல நாள், குறிப்பாக வடிவமைத்தல், அழகுபடுத்துதல் அல்லது கலை சார்ந்த தொழில்களில் உள்ளவர்களுக்கு சிறப்பான வாய்ப்புகள் அமையும்.",
    "career_en": "Your hard work and dedication will be appreciated at work. Harmony will prevail with colleagues. Good progress will be made in collaborative projects. This is a good day to utilize your creativity, especially for those in design, beautification, or art-related professions, excellent opportunities will arise.",
    "finance_ta": "நிதி நிலைமைகள் சிறப்பாக இருக்கும். வீட்டுக்குத் தேவையான அல்லது அழகியல் சார்ந்த பொருட்களுக்காக செலவு செய்ய நேரிடலாம். குடும்பத்தின் நிதி நலனுக்காக நல்ல திட்டங்களை வகுப்பீர்கள். சேமிப்பதற்கான வாய்ப்புகள் அமையும். எதிர்பாராத நிதி ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது.",
    "finance_en": "Financial conditions will be excellent. You may have to spend on necessary or aesthetic items for your home. You will make good plans for the financial well-being of your family. Opportunities for savings will arise. There is a possibility of unexpected financial gains.",
    "health_ta": "மன அமைதியிலும், உணர்ச்சிபூர்வமான நலனிலும் கவனம் செலுத்துங்கள். வீட்டிலேயே நிம்மதியாக ஓய்வெடுப்பது உங்களுக்கு நல்லது. யோகா அல்லது தியானம் மன அழுத்தத்தைக் குறைக்கும். ஆரோக்கியமான, வீட்டில் சமைத்த உணவை உட்கொள்வது உங்கள் உடலுக்கு நன்மை பயக்கும். மனநிறைவுடன் இருப்பது ஆரோக்கியத்திற்கு அவசியம்.",
    "health_en": "Focus on mental peace and emotional well-being. Resting peacefully at home is good for you. Yoga or meditation will reduce stress. Consuming healthy, home-cooked food will benefit your body. Being content is essential for health.",
    "lucky_number": "2",
    "lucky_color_ta": "வெள்ளி நிறம்",
    "lucky_color_en": "Silver"
  },
  {
    "sign_ta": "சிம்மம்",
    "sign_en": "Leo",
    "date": "20-02-2026",
    "prediction_ta": "இன்று சுக்கிரனின் ஆதிக்கம் உங்கள் தனிப்பட்ட கவர்ச்சியையும், படைப்புத் திறனையும் அதிகரிக்கும். நீங்கள் இன்று மிகவும் வசீகரமாகவும், சமூகத்தில் பிரகாசமாகவும் தோன்றுவீர்கள். உங்கள் தலைமைப் பண்புகள் மென்மையான அணுகுமுறையுடன் வெளிப்படும், இது மற்றவர்களை எளிதில் கவரும். சமூக நிகழ்வுகளில் கலந்து கொள்வது அல்லது பொழுதுபோக்கு தொடர்பான விஷயங்களில் ஈடுபடுவது உங்களுக்கு மகிழ்ச்சியைத் தரும். உங்கள் நண்பர்களுடனும், கூட்டாளிகளுடனும் உறவுகள் பலப்படும். நீண்டகாலமாக நிலுவையிலிருக்கும் சமூகப் பிரச்சனைகள் இன்று சுமுகமாகத் தீர வாய்ப்புள்ளது. உங்கள் எண்ணங்களை வெளிப்படுத்துவதற்கும், புதிய திட்டங்களைத் தொடங்குவதற்கும் இது ஒரு நல்ல நாள். கலை, இசை அல்லது பொழுதுபோக்குத் துறைகளில் இருப்பவர்களுக்கு சிறப்பான வாய்ப்புகள் அமையும். உங்கள் படைப்புத் திறனை வெளிப்படுத்த தயங்க வேண்டாம். அது உங்களுக்குப் பாராட்டுகளையும், அங்கீகாரத்தையும் பெற்றுத் தரும். உங்கள் தனிப்பட்ட தோற்றத்திலும், ஸ்டைலிலும் கவனம் செலுத்துவீர்கள், இது உங்கள் தன்னம்பிக்கையை மேலும் அதிகரிக்கும். புதிய ஆடைகளை வாங்குவது அல்லது அழகு சாதனங்களில் கவனம் செலுத்துவது உங்களுக்கு மகிழ்ச்சியைத் தரும். அன்பையும், பாசத்தையும் வெளிப்படுத்துவதற்கு இது ஒரு சிறந்த நாள். உங்கள் காதல் உறவுகளில் இனிமை பெருகும், ஒற்றையர்களுக்கு புதிய காதல் அத்தியாயங்கள் தொடங்கலாம். உங்கள் நண்பர்களுடன் சேர்ந்து வெளியூர் பயணங்கள் அல்லது சிறிய கொண்டாட்டங்களில் ஈடுபட இது ஒரு நல்ல நாள். உங்கள் மனம் மகிழ்ச்சியாகவும், உற்சாகமாகவும் இருக்கும். நேர்மறையான எண்ணங்களை வளர்த்துக் கொள்ளுங்கள். உங்கள் தாராள மனப்பான்மை இன்று பிறரால் பாராட்டப்படும். பிறருக்கு உதவுவதற்கும், அவர்களுக்கு ஆதரவு அளிப்பதற்கும் இன்று உங்களுக்கு அதிக ஆர்வம் ஏற்படும். உங்கள் திறமைகளை வெளிப்படுத்தவும், உங்கள் லட்சியங்களை அடையவும் இது ஒரு நல்ல வாய்ப்பு. எந்தவொரு அவசர முடிவுகளையும் தவிர்த்து, நிதானமாகச் செயல்படுவது நல்லது. இன்று நீங்கள் சந்திக்கும் நபர்கள், உங்களுக்குப் புதிய கண்ணோட்டங்களைத் தரலாம் அல்லது புதிய வாய்ப்புகளை உருவாக்கலாம். உங்கள் வாழ்க்கையில் ஒரு புதிய நேர்மறை அத்தியாயத்தைத் தொடங்க இது ஒரு நல்ல தருணம். மகிழ்ச்சியுடனும், உற்சாகத்துடனும் செயல்படுங்கள். இன்று நீங்கள் செய்யும் ஒவ்வொரு விஷயத்திலும் ஒரு தனித்துவமான திறமையுடன் செயல்படுவீர்கள். உங்கள் நகைச்சுவை உணர்வு மற்றும் புத்திசாலித்தனம் இன்று அனைவரையும் கவரும். உங்கள் உடல்நலத்தில் ஒரு புத்துணர்ச்சி உண்டாகும். அழகியல் விஷயங்களில் உங்கள் ரசனை மேம்படும். இன்று உங்கள் எண்ணங்கள் அனைத்தும் நேர்மறையாகவும், ஆக்கபூர்வமாகவும் இருக்கும். கலை சார்ந்த விஷயங்களில் ஈடுபடுவது, உங்கள் மனதுக்கு மிகுந்த ஆறுதலையும், மகிழ்ச்சியையும் தரும். உங்கள் தனிப்பட்ட வாழ்க்கையிலும், சமூக வாழ்க்கையிலும் நல்லுறவுகள் வலுப்பெறும். இது உங்களுக்கு மிகுந்த நம்பிக்கையையும், உற்சாகத்தையும் அளிக்கும். எந்தவொரு சிறிய விஷயத்திலும் மகிழ்ச்சியைக் கண்டறியும் திறன் இன்று உங்களுக்கு அதிகமாக இருக்கும். இன்றைய நாள் அன்பையும், அழகையும் போற்றும் நாளாக அமையும். உங்கள் ஆற்றலும், தன்னம்பிக்கையும் இன்று உச்சத்தில் இருக்கும்.",
    "prediction_en": "Today, the influence of Venus will increase your personal charm and creativity. You will appear very charming and prominent in society today. Your leadership qualities will manifest with a gentle approach, which will easily captivate others. Participating in social events or engaging in entertainment-related activities will bring you joy. Relationships with your friends and partners will strengthen. Long-pending social issues may be resolved amicably today. This is a good day to express your thoughts and start new projects. Excellent opportunities will arise for those in art, music, or entertainment fields. Do not hesitate to express your creativity. It will bring you praise and recognition. You will pay attention to your personal appearance and style, which will further increase your self-confidence. Buying new clothes or focusing on beauty products will bring you happiness. This is a great day to express love and affection. Sweetness will increase in your romantic relationships, and new romantic chapters may begin for singles. This is a good day to go on trips with friends or engage in small celebrations. Your mind will be happy and enthusiastic. Cultivate positive thoughts. Your generosity will be appreciated by others today. Today you will have a greater interest in helping others and providing them support. This is a good opportunity to showcase your talents and achieve your ambitions. It is good to avoid any hasty decisions and act calmly. The people you meet today may offer you new perspectives or create new opportunities. This is a good moment to start a new positive chapter in your life. Act with joy and enthusiasm. Today you will perform every task with a unique ability. Your sense of humor and wit will captivate everyone today. A rejuvenation will occur in your health. Your aesthetic taste will improve. Today, all your thoughts will be positive and constructive. Engaging in artistic matters will bring great comfort and joy to your mind. Relationships in your personal and social life will strengthen. This will give you great confidence and enthusiasm. Your ability to find joy in even small things will be enhanced today. Today will be a day to appreciate love and beauty. Your energy and self-confidence will be at their peak today.",
    "career_ta": "பணியிடத்தில் உங்கள் படைப்புத் திறனும், தலைமைப் பண்பும் அங்கீகரிக்கப்படும். சக ஊழியர்களுடன் நல்லிணக்கம் நிலவும். புதிய திட்டங்களில் உங்கள் பங்களிப்பு பாராட்டப்படும். கலை, பொழுதுபோக்கு அல்லது மக்கள் தொடர்புத் துறையில் உள்ளவர்களுக்கு இன்று சிறப்பான வளர்ச்சி அமையும். உங்கள் திறமைகளை வெளிப்படுத்த தயங்க வேண்டாம்.",
    "career_en": "Your creativity and leadership will be recognized at work. Harmony will prevail with colleagues. Your contribution to new projects will be appreciated. Today will bring excellent growth for those in art, entertainment, or public relations. Do not hesitate to express your talents.",
    "finance_ta": "நிதி நிலைமைகள் சிறப்பாக இருக்கும். பொழுதுபோக்கு அல்லது ஆடம்பர பொருட்களுக்காக செலவு செய்ய நேரிடலாம், ஆனால் அது உங்களுக்கு மகிழ்ச்சியைத் தரும். புதிய முதலீடுகளைப் பற்றி சிந்திக்கும்போது நிதானமாகச் செயல்படவும். நிதி ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது.",
    "finance_en": "Financial conditions will be excellent. You may have to spend on entertainment or luxury items, but it will bring you joy. Act calmly when thinking about new investments. Financial gains are possible.",
    "health_ta": "உங்கள் உடல்நலத்தில் கவனம் செலுத்துங்கள். உடற்பயிற்சிகளை மேற்கொள்வது உடலையும், மனதையும் புத்துணர்ச்சியுடன் வைத்திருக்கும். சமூக நிகழ்வுகளில் கலந்து கொள்வது மனதுக்கு உற்சாகத்தை அளிக்கும். ஆரோக்கியமான உணவுப் பழக்கங்களை மேற்கொள்ளுங்கள். போதுமான ஓய்வு எடுப்பது அவசியம்.",
    "health_en": "Pay attention to your health. Engaging in exercises will keep your body and mind refreshed. Participating in social events will bring enthusiasm to the mind. Adopt healthy eating habits. Adequate rest is essential.",
    "lucky_number": "1",
    "lucky_color_ta": "பொன் நிறம்",
    "lucky_color_en": "Golden"
  },
  {
    "sign_ta": "கன்னி",
    "sign_en": "Virgo",
    "date": "20-02-2026",
    "prediction_ta": "இன்று சுக்கிரனின் ஆதிக்கம் உங்கள் தனிப்பட்ட மற்றும் தொழில் வாழ்க்கையில் இணக்கத்தையும், நேர்த்தியையும் கொண்டு வரும். நீங்கள் இன்று மிகவும் கவனமாகவும், திட்டமிட்டு செயல்படுவீர்கள். உங்கள் பணியிடத்தில் நல்லுறவுகள் வலுப்படும், சக ஊழியர்களுடனும், மேலதிகாரிகளுடனும் சுமுகமான புரிதல் ஏற்படும். புதிய திட்டங்களில் கூட்டாகச் செயல்படுவதன் மூலம் சிறந்த முடிவுகளைப் பெறுவீர்கள். உங்கள் தனிப்பட்ட திறமைகளை வெளிப்படுத்துவதற்கும், புதிய பொறுப்புகளை ஏற்றுக்கொள்வதற்கும் இது ஒரு நல்ல நாள். உங்கள் ஆரோக்கியத்திலும், உடலிலும் ஒரு புத்துணர்ச்சி உண்டாகும். அழகியல் விஷயங்களில் உங்கள் ரசனை மேம்படும். இன்று உங்கள் எண்ணங்கள் அனைத்தும் நேர்மறையாகவும், ஆக்கபூர்வமாகவும் இருக்கும். கலை சார்ந்த விஷயங்களில் ஈடுபடுவது, உங்கள் மனதுக்கு மிகுந்த ஆறுதலையும், மகிழ்ச்சியையும் தரும். உங்கள் தனிப்பட்ட வாழ்க்கையிலும், சமூக வாழ்க்கையிலும் நல்லுறவுகள் வலுப்பெறும். இது உங்களுக்கு மிகுந்த நம்பிக்கையையும், உற்சாகத்தையும் அளிக்கும். எந்தவொரு சிறிய விஷயத்திலும் மகிழ்ச்சியைக் கண்டறியும் திறன் இன்று உங்களுக்கு அதிகமாக இருக்கும். இன்றைய நாள் அன்பையும், அழகையும் போற்றும் நாளாக அமையும். உங்கள் வீடு அல்லது பணியிடத்தில் அழகியல் மேம்பாடுகளைச் செய்ய இது ஒரு அருமையான நாள். தூய்மையிலும், ஒழுங்கிலும் அதிக அக்கறை செலுத்துவீர்கள், இது உங்கள் சுற்றுப்புறத்தை மிகவும் நேர்த்தியாக மாற்றும். சிறிய மாற்றங்கள் கூட பெரிய நேர்மறை விளைவுகளை உருவாக்கும். நீண்டகாலமாக நிலுவையிலிருக்கும் வீட்டு வேலைகளைச் செய்து முடிப்பதற்கு இது ஒரு நல்ல நாள். உங்கள் நிதி நிலைமைகள் சீராக இருக்கும். வருமானத்தை அதிகரிப்பதற்கான புதிய வழிகளைப் பற்றி சிந்திக்க இது ஒரு நல்ல வாய்ப்பு. பட்ஜெட்டைத் திட்டமிடுவது மற்றும் செலவுகளைக் கட்டுக்குள் வைத்திருப்பது உங்களுக்கு நன்மை பயக்கும். இன்றைய நாள் உங்கள் உணர்ச்சிபூர்வமான உலகத்தை செழுமைப்படுத்தும். உங்கள் உள்ளுணர்வு மிகவும் வலுவாக இருக்கும், எனவே அதை நம்பி செயல்படலாம். உங்கள் எண்ணங்கள் தெளிவான நிலையில் இருக்கும், இது சரியான முடிவுகளை எடுக்க உதவும். உங்கள் அன்பான அணுகுமுறை, குடும்பத்தினரிடமும், நெருங்கிய நண்பர்களிடமும் நல்லுறவை மேம்படுத்தும். உங்களுக்குள் இருக்கும் அன்பை வெளிப்படுத்த தயங்காதீர்கள். இன்று நீங்கள் அமைதியையும், நல்லிணக்கத்தையும் தேடுவீர்கள். சிறிய விஷயங்களில் கூட மகிழ்ச்சியைக் கண்டறியும் திறன் இன்று உங்களுக்கு அதிகமாக இருக்கும். குடும்பத்துடனும், அன்புக்குரியவர்களுடனும் தரமான நேரம் செலவிடுங்கள். இன்றைய நாள், உங்கள் வாழ்க்கையில் அன்பையும், பாதுகாப்பையும், செழிப்பையும் கொண்டு வரும் ஒரு மகிழ்ச்சியான நாளாக அமையும். மனநிறைவுடன் செயல்படுங்கள், நல்லதே நடக்கும். நிதி சார்ந்த விஷயங்களில் புதிய திட்டங்களை வகுக்க இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்திலும், மன அமைதியிலும் கவனம் செலுத்துங்கள். உங்கள் வீடு மற்றும் குடும்பம் இன்று உங்களுக்கு ஒரு புகலிடமாக அமையும். உங்களுக்குப் பிடித்தமான விஷயங்களைச் செய்வதன் மூலம் மகிழ்ச்சியைப் பெறுவீர்கள். புதிய பொழுதுபோக்குகளில் ஈடுபட இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்திலும், உடலிலும் ஒரு புத்துணர்ச்சி உண்டாகும். அழகியல் விஷயங்களில் உங்கள் ரசனை மேம்படும். இன்று உங்கள் எண்ணங்கள் அனைத்தும் நேர்மறையாகவும், ஆக்கபூர்வமாகவும் இருக்கும். கலை சார்ந்த விஷயங்களில் ஈடுபடுவது, உங்கள் மனதுக்கு மிகுந்த ஆறுதலையும், மகிழ்ச்சியையும் தரும். உங்கள் தனிப்பட்ட வாழ்க்கையிலும், சமூக வாழ்க்கையிலும் நல்லுறவுகள் வலுப்பெறும். இது உங்களுக்கு மிகுந்த நம்பிக்கையையும், உற்சாகத்தையும் அளிக்கும். எந்தவொரு சிறிய விஷயத்திலும் மகிழ்ச்சியைக் கண்டறியும் திறன் இன்று உங்களுக்கு அதிகமாக இருக்கும். இன்றைய நாள் அன்பையும், அழகையும் போற்றும் நாளாக அமையும்.",
    "prediction_en": "Today, the influence of Venus will bring harmony and neatness to your personal and professional life. You will act very carefully and methodically today. Good relationships will strengthen in your workplace, and there will be smooth understanding with colleagues and superiors. You will achieve excellent results by working collaboratively on new projects. This is a good day to showcase your personal talents and take on new responsibilities. A rejuvenation will occur in your health and body. Your aesthetic taste will improve. Today, all your thoughts will be positive and constructive. Engaging in artistic matters will bring great comfort and joy to your mind. Relationships in your personal and social life will strengthen. This will give you great confidence and enthusiasm. Your ability to find joy in even small things will be enhanced today. Today will be a day to appreciate love and beauty. This is an excellent day to make aesthetic improvements to your home or workplace. You will pay great attention to cleanliness and order, which will make your surroundings very neat. Even small changes will create great positive effects. This is a good day to complete long-pending household chores. Your financial conditions will be stable. This is a good opportunity to think about new ways to increase income. Planning a budget and keeping expenses under control will benefit you. Today will enrich your emotional world. Your intuition will be very strong, so you can trust and act on it. Your thoughts will be clear, which will help you make good decisions. Your loving approach will improve relationships with family and close friends. Do not hesitate to express the love within you. Today you will seek peace and harmony. Your ability to find joy in even small things will be enhanced today. Spend quality time with family and loved ones. Today will be a happy day, bringing love, security, and prosperity into your life. Act with contentment, and good things will happen. This is a great day to formulate new plans for financial matters. Focus on your health and peace of mind. Your home and family will be a refuge for you today. You will find joy by doing things you love. This is a great day to engage in new hobbies. You will feel rejuvenated in your health and body. Your aesthetic taste will improve. Today, all your thoughts will be positive and constructive. Engaging in artistic matters will bring great comfort and joy to your mind. Relationships in your personal and social life will strengthen. This will give you great confidence and enthusiasm. Your ability to find joy in even small things will be enhanced today. Today will be a day to appreciate love and beauty.",
    "career_ta": "பணியிடத்தில் உங்கள் திறமையும், உழைப்பும் அங்கீகரிக்கப்படும். சக ஊழியர்களுடன் நல்லுறவுகள் வலுப்படும், குழுப்பணிகள் மூலம் நல்ல முன்னேற்றம் ஏற்படும். புதிய திட்டங்களைச் சிறப்பாகத் திட்டமிட்டுச் செயல்படுத்துவீர்கள். கலை அல்லது வடிவமைப்பு சார்ந்த தொழில்களில் இருப்பவர்களுக்கு இன்று சிறப்பான வளர்ச்சி அமையும்.",
    "career_en": "Your talent and hard work will be recognized at work. Good relationships with colleagues will strengthen, and good progress will be made through teamwork. You will plan and execute new projects excellently. Today will bring excellent growth for those in art or design-related professions.",
    "finance_ta": "நிதி மேலாண்மையில் உங்கள் துல்லியம் இன்று கை கொடுக்கும். பட்ஜெட்டைத் திட்டமிடுவது மற்றும் சேமிப்பது உங்களுக்கு நன்மை பயக்கும். வீட்டை அழகுபடுத்துவதற்கோ அல்லது வீட்டு உபயோகப் பொருட்களை வாங்குவதற்கோ செலவு செய்ய நேரிடலாம். வருமானத்தை அதிகரிக்கும் புதிய வழிகளைப் பற்றி சிந்திக்கலாம்.",
    "finance_en": "Your precision in financial management will be beneficial today. Planning a budget and saving will benefit you. You may have to spend on home decor or household items. You can think about new ways to increase income.",
    "health_ta": "உங்கள் உடல்நலத்தில் கவனம் செலுத்துங்கள். ஆரோக்கியமான உணவுப் பழக்கங்களை மேற்கொள்ளுங்கள். மன அமைதிக்காக தியானம் அல்லது யோகா போன்ற பயிற்சிகளில் ஈடுபடலாம். உங்கள் சுற்றுப்புறத்தை சுத்தமாக வைத்துக்கொள்வது ஆரோக்கியத்திற்கு நன்மை பயக்கும். போதுமான ஓய்வு எடுப்பது அவசியம்.",
    "health_en": "Pay attention to your health. Adopt healthy eating habits. You can engage in practices like meditation or yoga for peace of mind. Keeping your surroundings clean will benefit your health. Adequate rest is essential.",
    "lucky_number": "5",
    "lucky_color_ta": "வெளிர் நீலம்",
    "lucky_color_en": "Light Blue"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "20-02-2026",
    "prediction_ta": "இன்று சுக்கிரனின் ஆதிக்கம் உங்கள் ராசிக்கு மிகுந்த சாதகமாக அமையும், ஏனெனில் சுக்கிரன் உங்கள் ராசியின் அதிபதி. இன்று உங்கள் வாழ்க்கையில் அன்பும், அழகும், நல்லிணக்கமும் பெருகும். நீங்கள் மிகவும் வசீகரமாகவும், இராஜதந்திரமாகவும் செயல்படுவீர்கள். உறவுகளில் ஒரு புதிய அத்தியாயம் தொடங்கலாம் அல்லது ஏற்கனவே உள்ள உறவுகள் வலுப்படலாம். திருமணமானவர்களுக்கு அன்பு பெருகும், ஒற்றையர்களுக்குப் புதிய காதல் வாய்ப்புகள் அமையும். சமூக நிகழ்வுகளில் கலந்து கொள்வது அல்லது புதிய நட்புகளை உருவாக்குவது உங்களுக்கு மகிழ்ச்சியைத் தரும். உங்கள் கலை மற்றும் படைப்புத் திறன் மேம்படும். இசை, நடனம், ஓவியம் அல்லது வேறு எந்தவொரு கலைத் துறையிலும் உங்கள் திறமைகளை வெளிப்படுத்த இது ஒரு சிறந்த நாள். உங்கள் தனிப்பட்ட தோற்றத்திலும், ஸ்டைலிலும் கவனம் செலுத்துவீர்கள், இது உங்கள் தன்னம்பிக்கையை மேலும் அதிகரிக்கும். உங்கள் வீடு அல்லது பணியிடத்தில் அழகியல் மேம்பாடுகளைச் செய்ய இது ஒரு அருமையான நாள். தூய்மையிலும், ஒழுங்கிலும் அதிக அக்கறை செலுத்துவீர்கள், இது உங்கள் சுற்றுப்புறத்தை மிகவும் நேர்த்தியாக மாற்றும். உங்கள் மனது அமைதியாகவும், சமாதானத்துடனும் இருக்கும். நீண்டகாலமாக இருந்த சிறிய கருத்து வேறுபாடுகள் கூட இன்று சுமுகமாகத் தீரும். பிறருடன் இணக்கமாகப் பழகுவீர்கள், இது சமூக உறவுகளை மேம்படுத்தும். நிதி ரீதியாக, இன்றைய நாள் ஸ்திரத்தன்மையை கொண்டுவரும். உங்களுக்கு வருமானம் பெருகும் வாய்ப்புகள் அல்லது எதிர்பாராத ஆதாயங்கள் கிடைக்கலாம். ஆனால், அதே நேரத்தில், உணர்ச்சிவசப்பட்டு தேவையற்ற செலவுகளைத் தவிர்ப்பது நல்லது. உங்கள் பணத்தைப் புத்திசாலித்தனமாக நிர்வகிக்க இது ஒரு நல்ல வாய்ப்பு. நீண்டகால நிதி திட்டங்களை வகுப்பதற்கு இது உகந்த நேரம். உங்கள் படைப்புத் திறனை வெளிப்படுத்த தயங்க வேண்டாம். அது உங்களுக்குப் பாராட்டுகளையும், அங்கீகாரத்தையும் பெற்றுத் தரும். நீங்கள் சமூக நிகழ்வுகளில் கலந்து கொள்வதை விட, வீட்டில் குடும்பத்தினருடன் நேரம் செலவிடுவதையே விரும்புவீர்கள். அமைதியான சூழலில் தியானம் அல்லது ஓய்வு எடுப்பது உங்கள் மனதுக்கு மிகவும் நன்மை பயக்கும். இன்றைய நாள் உங்கள் உணர்ச்சிபூர்வமான உலகத்தை செழுமைப்படுத்தும். உங்கள் உள்ளுணர்வு மிகவும் வலுவாக இருக்கும், எனவே அதை நம்பி செயல்படலாம். உங்கள் எண்ணங்கள் தெளிவான நிலையில் இருக்கும், இது சரியான முடிவுகளை எடுக்க உதவும். உங்கள் அன்பான அணுகுமுறை, குடும்பத்தினரிடமும், நெருங்கிய நண்பர்களிடமும் நல்லுறவை மேம்படுத்தும். உங்களுக்குள் இருக்கும் அன்பை வெளிப்படுத்த தயங்காதீர்கள். இன்று நீங்கள் அமைதியையும், நல்லிணக்கத்தையும் தேடுவீர்கள். சிறிய விஷயங்களில் கூட மகிழ்ச்சியைக் கண்டறியும் திறன் இன்று உங்களுக்கு அதிகமாக இருக்கும். குடும்பத்துடனும், அன்புக்குரியவர்களுடனும் தரமான நேரம் செலவிடுங்கள். இன்றைய நாள், உங்கள் வாழ்க்கையில் அன்பையும், பாதுகாப்பையும், செழிப்பையும் கொண்டு வரும் ஒரு மகிழ்ச்சியான நாளாக அமையும். மனநிறைவுடன் செயல்படுங்கள், நல்லதே நடக்கும். நிதி சார்ந்த விஷயங்களில் புதிய திட்டங்களை வகுக்க இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்திலும், மன அமைதியிலும் கவனம் செலுத்துங்கள். உங்கள் வீடு மற்றும் குடும்பம் இன்று உங்களுக்கு ஒரு புகலிடமாக அமையும். உங்களுக்குப் பிடித்தமான விஷயங்களைச் செய்வதன் மூலம் மகிழ்ச்சியைப் பெறுவீர்கள். புதிய பொழுதுபோக்குகளில் ஈடுபட இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்திலும், உடலிலும் ஒரு புத்துணர்ச்சி உண்டாகும். அழகியல் விஷயங்களில் உங்கள் ரசனை மேம்படும். இன்று உங்கள் எண்ணங்கள் அனைத்தும் நேர்மறையாகவும், ஆக்கபூர்வமாகவும் இருக்கும். கலை சார்ந்த விஷயங்களில் ஈடுபடுவது, உங்கள் மனதுக்கு மிகுந்த ஆறுதலையும், மகிழ்ச்சியையும் தரும். உங்கள் தனிப்பட்ட வாழ்க்கையிலும், சமூக வாழ்க்கையிலும் நல்லுறவுகள் வலுப்பெறும். இது உங்களுக்கு மிகுந்த நம்பிக்கையையும், உற்சாகத்தையும் அளிக்கும். எந்தவொரு சிறிய விஷயத்திலும் மகிழ்ச்சியைக் கண்டறியும் திறன் இன்று உங்களுக்கு அதிகமாக இருக்கும். இன்றைய நாள் அன்பையும், அழகையும் போற்றும் நாளாக அமையும்.",
    "prediction_en": "Today, the influence of Venus will be very favorable for your zodiac sign, as Venus is the ruler of your sign. Today, love, beauty, and harmony will abound in your life. You will act very charmingly and diplomatically. A new chapter in relationships may begin, or existing relationships may strengthen. Love will increase for married individuals, and new romantic opportunities will arise for singles. Participating in social events or making new friendships will bring you joy. Your artistic and creative abilities will improve. This is an excellent day to showcase your talents in music, dance, painting, or any other art form. You will pay attention to your personal appearance and style, which will further increase your self-confidence. This is a great day to make aesthetic improvements to your home or workplace. You will pay great attention to cleanliness and order, which will make your surroundings very neat. Your mind will be calm and peaceful. Even small disagreements that have existed for a long time may be resolved amicably today. You will interact harmoniously with others, which will improve social relationships. Financially, today will bring stability. You may have opportunities for increased income or unexpected gains. However, at the same time, it is good to avoid unnecessary emotional spending. This is a good opportunity to manage your money wisely. This is an opportune time to formulate long-term financial plans. Do not hesitate to express your creativity. It will bring you praise and recognition. You will prefer spending time at home with family rather than attending social events. Meditation or relaxation in a calm environment will be very beneficial for your mind. Today will enrich your emotional world. Your intuition will be very strong, so you can trust and act on it. Your thoughts will be clear, which will help you make good decisions. Your loving approach will improve relationships with family and close friends. Do not hesitate to express the love within you. Today you will seek peace and harmony. Your ability to find joy in even small things will be enhanced today. Spend quality time with family and loved ones. Today will be a happy day, bringing love, security, and prosperity into your life. Act with contentment, and good things will happen. This is a great day to formulate new plans for financial matters. Focus on your health and peace of mind. Your home and family will be a refuge for you today. You will find joy by doing things you love. This is a great day to engage in new hobbies. You will feel rejuvenated in your health and body. Your aesthetic taste will improve. Today, all your thoughts will be positive and constructive. Engaging in artistic matters will bring great comfort and joy to your mind. Relationships in your personal and social life will strengthen. This will give you great confidence and enthusiasm. Your ability to find joy in even small things will be enhanced today. Today will be a day to appreciate love and beauty.",
    "career_ta": "பணியிடத்தில் உங்கள் இராஜதந்திர அணுகுமுறை பாராட்டப்படும். சக ஊழியர்களுடனும், கூட்டாளர்களுடனும் நல்லுறவுகள் வலுப்படும். புதிய திட்டங்களில் உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். கலை, வடிவமைப்பு அல்லது ஆலோசனை சார்ந்த தொழில்களில் இருப்பவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் அமையும். உங்கள் பேச்சுத் திறன் வெற்றியைப் பெற்றுத்தரும்.",
    "career_en": "Your diplomatic approach will be appreciated at work. Relationships with colleagues and partners will strengthen. Your contribution to new projects will be important. Today will bring excellent opportunities for those in art, design, or consulting professions. Your communication skills will bring success.",
    "finance_ta": "நிதி நிலைமைகள் சீராக இருக்கும். ஆடம்பரம் அல்லது அழகு சாதனங்களுக்காக செலவு செய்ய நேரிடலாம், ஆனால் அது உங்களுக்கு மகிழ்ச்சியைத் தரும். புதிய முதலீடுகளைப் பற்றி சிந்திக்கும்போது, நிதானமாகச் செயல்படுவது நல்லது. நிதி ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது.",
    "finance_en": "Financial conditions will be stable. You may have to spend on luxury or beauty products, but it will bring you joy. It is good to act calmly when thinking about new investments. Financial gains are possible.",
    "health_ta": "மன அமைதியிலும், உடல் நலத்திலும் கவனம் செலுத்துங்கள். தியானம் அல்லது யோகா போன்ற பயிற்சிகளில் ஈடுபடலாம். அழகிய சூழலில் நேரம் செலவிடுவது மனதுக்கு அமைதியைத் தரும். ஆரோக்கியமான உணவுப் பழக்கங்களை மேற்கொள்ளுங்கள். போதுமான ஓய்வு எடுப்பது அவசியம்.",
    "health_en": "Focus on mental peace and physical well-being. You can engage in practices like meditation or yoga. Spending time in beautiful surroundings will bring peace to your mind. Adopt healthy eating habits. Adequate rest is essential.",
    "lucky_number": "6",
    "lucky_color_ta": "வெளிர் நீலம்",
    "lucky_color_en": "Light Blue"
  },
  {
    "sign_ta": "விருச்சிகம்",
    "sign_en": "Scorpio",
    "date": "20-02-2026",
    "prediction_ta": "இன்று சுக்கிரனின் ஆதிக்கம் உங்கள் உணர்ச்சிபூர்வமான உலகத்திலும், உள்நோக்கிய பயணத்திலும் ஒரு இனிமையான அனுபவத்தைக் கொண்டு வரும். நீங்கள் இன்று அமைதியையும், மனநிறைவையும் தேடுவீர்கள். தனிமையிலும், தியானத்திலும் நேரம் செலவிடுவது உங்களுக்கு மிகுந்த மன அமைதியைத் தரும். உங்கள் உள்ளுணர்வு கூர்மையாக இருக்கும், எனவே அதை நம்பி செயல்படலாம். மறைந்திருக்கும் உண்மைகளைக் கண்டறிய இது ஒரு நல்ல நாள். உங்கள் ரகசிய உறவுகளில் அல்லது தனிப்பட்ட விருப்பங்களில் கவனம் செலுத்துவீர்கள், அதில் மகிழ்ச்சியைப் பெறுவீர்கள். பழைய நினைவுகளை அசைபோடுவது அல்லது உங்கள் கடந்தகால அனுபவங்களில் இருந்து படிப்பினைகளைக் கற்றுக்கொள்வது உங்களுக்கு நன்மை பயக்கும். இன்றைய தினம் உங்கள் ஆன்மீக வளர்ச்சிக்கு உகந்தது. தியானம், பிரார்த்தனை அல்லது ஆன்மீக நூல்களைப் படிப்பது உங்களுக்கு மன அமைதியைத் தரும். உங்கள் கனவுகளும், உள்ளுணர்வுகளும் மிகவும் வலிமையாக இருக்கும். அவற்றிற்குச் செவிசாய்ப்பது நல்லது. பிறருக்கு உதவுவதற்கும், அவர்களுக்கு ஆதரவு அளிப்பதற்கும் இன்று உங்களுக்கு அதிக ஆர்வம் ஏற்படும். உங்கள் இரக்க சுபாவம் பாராட்டப்படும். உங்கள் தனிப்பட்ட தோற்றத்திலும், ஆரோக்கியத்திலும் கவனம் செலுத்துவீர்கள். மென்மையான உடற்பயிற்சிகள் அல்லது இயற்கையோடு நேரம் செலவிடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். கலை மற்றும் படைப்புத் துறைகளில் ஈடுபடுவது உங்களுக்கு ஆழ்ந்த மனநிறைவைத் தரும். குறிப்பாக, மனதிற்கு அமைதியைத் தரும் இசை அல்லது ஓவியம் போன்ற கலைகளில் கவனம் செலுத்தலாம். நிதி ரீதியாக, இன்றைய நாள் ஸ்திரத்தன்மையை கொண்டு வரும். உங்களுக்கு வருமானம் பெருகும் வாய்ப்புகள் அல்லது எதிர்பாராத ஆதாயங்கள் கிடைக்கலாம். ஆனால், அதே நேரத்தில், உணர்ச்சிவசப்பட்டு தேவையற்ற செலவுகளைத் தவிர்ப்பது நல்லது. உங்கள் பணத்தைப் புத்திசாலித்தனமாக நிர்வகிக்க இது ஒரு நல்ல வாய்ப்பு. நீண்டகால நிதி திட்டங்களை வகுப்பதற்கு இது உகந்த நேரம். உங்கள் படைப்புத் திறனை வெளிப்படுத்த தயங்க வேண்டாம். அது உங்களுக்குப் பாராட்டுகளையும், அங்கீகாரத்தையும் பெற்றுத் தரும். நீங்கள் சமூக நிகழ்வுகளில் கலந்து கொள்வதை விட, வீட்டில் குடும்பத்தினருடன் நேரம் செலவிடுவதையே விரும்புவீர்கள். அமைதியான சூழலில் தியானம் அல்லது ஓய்வு எடுப்பது உங்கள் மனதுக்கு மிகவும் நன்மை பயக்கும். இன்றைய நாள் உங்கள் உணர்ச்சிபூர்வமான உலகத்தை செழுமைப்படுத்தும். உங்கள் உள்ளுணர்வு மிகவும் வலுவாக இருக்கும், எனவே அதை நம்பி செயல்படலாம். உங்கள் எண்ணங்கள் தெளிவான நிலையில் இருக்கும், இது சரியான முடிவுகளை எடுக்க உதவும். உங்கள் அன்பான அணுகுமுறை, குடும்பத்தினரிடமும், நெருங்கிய நண்பர்களிடமும் நல்லுறவை மேம்படுத்தும். உங்களுக்குள் இருக்கும் அன்பை வெளிப்படுத்த தயங்காதீர்கள். இன்று நீங்கள் அமைதியையும், நல்லிணக்கத்தையும் தேடுவீர்கள். சிறிய விஷயங்களில் கூட மகிழ்ச்சியைக் கண்டறியும் திறன் இன்று உங்களுக்கு அதிகமாக இருக்கும். குடும்பத்துடனும், அன்புக்குரியவர்களுடனும் தரமான நேரம் செலவிடுங்கள். இன்றைய நாள், உங்கள் வாழ்க்கையில் அன்பையும், பாதுகாப்பையும், செழிப்பையும் கொண்டு வரும் ஒரு மகிழ்ச்சியான நாளாக அமையும். மனநிறைவுடன் செயல்படுங்கள், நல்லதே நடக்கும். நிதி சார்ந்த விஷயங்களில் புதிய திட்டங்களை வகுக்க இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்திலும், மன அமைதியிலும் கவனம் செலுத்துங்கள். உங்கள் வீடு மற்றும் குடும்பம் இன்று உங்களுக்கு ஒரு புகலிடமாக அமையும். உங்களுக்குப் பிடித்தமான விஷயங்களைச் செய்வதன் மூலம் மகிழ்ச்சியைப் பெறுவீர்கள். புதிய பொழுதுபோக்குகளில் ஈடுபட இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்திலும், உடலிலும் ஒரு புத்துணர்ச்சி உண்டாகும். அழகியல் விஷயங்களில் உங்கள் ரசனை மேம்படும். இன்று உங்கள் எண்ணங்கள் அனைத்தும் நேர்மறையாகவும், ஆக்கபூர்வமாகவும் இருக்கும். கலை சார்ந்த விஷயங்களில் ஈடுபடுவது, உங்கள் மனதுக்கு மிகுந்த ஆறுதலையும், மகிழ்ச்சியையும் தரும். உங்கள் தனிப்பட்ட வாழ்க்கையிலும், சமூக வாழ்க்கையிலும் நல்லுறவுகள் வலுப்பெறும். இது உங்களுக்கு மிகுந்த நம்பிக்கையையும், உற்சாகத்தையும் அளிக்கும். எந்தவொரு சிறிய விஷயத்திலும் மகிழ்ச்சியைக் கண்டறியும் திறன் இன்று உங்களுக்கு அதிகமாக இருக்கும். இன்றைய நாள் அன்பையும், அழகையும் போற்றும் நாளாக அமையும்.",
    "prediction_en": "Today, the influence of Venus will bring a pleasant experience to your emotional world and inner journey. You will seek peace and contentment today. Spending time in solitude and meditation will bring you great peace of mind. Your intuition will be sharp, so you can trust and act on it. This is a good day to uncover hidden truths. You will focus on your secret relationships or personal preferences and find joy in them. Reflecting on old memories or learning lessons from your past experiences will benefit you. Today is conducive to your spiritual growth. Meditation, prayer, or reading spiritual texts will bring you peace of mind. Your dreams and intuitions will be very strong. It is good to listen to them. Today you will have a greater interest in helping others and providing them support. Your compassion will be appreciated. You will pay attention to your personal appearance and health. Gentle exercises or spending time with nature will refresh you. Engaging in art and creative endeavors will bring you deep satisfaction. In particular, you can focus on arts like music or painting that bring peace to the mind. Financially, today will bring stability. You may have opportunities for increased income or unexpected gains. However, at the same time, it is good to avoid unnecessary emotional spending. This is a good opportunity to manage your money wisely. This is an opportune time to formulate long-term financial plans. Do not hesitate to express your creativity. It will bring you praise and recognition. You will prefer spending time at home with family rather than attending social events. Meditation or relaxation in a calm environment will be very beneficial for your mind. Today will enrich your emotional world. Your intuition will be very strong, so you can trust and act on it. Your thoughts will be clear, which will help you make good decisions. Your loving approach will improve relationships with family and close friends. Do not hesitate to express the love within you. Today you will seek peace and harmony. Your ability to find joy in even small things will be enhanced today. Spend quality time with family and loved ones. Today will be a happy day, bringing love, security, and prosperity into your life. Act with contentment, and good things will happen. This is a great day to formulate new plans for financial matters. Focus on your health and peace of mind. Your home and family will be a refuge for you today. You will find joy by doing things you love. This is a great day to engage in new hobbies. You will feel rejuvenated in your health and body. Your aesthetic taste will improve. Today, all your thoughts will be positive and constructive. Engaging in artistic matters will bring great comfort and joy to your mind. Relationships in your personal and social life will strengthen. This will give you great confidence and enthusiasm. Your ability to find joy in even small things will be enhanced today. Today will be a day to appreciate love and beauty.",
    "career_ta": "பணியிடத்தில் நீங்கள் அமைதியுடனும், நிதானத்துடனும் செயல்படுவீர்கள். உங்கள் உள்ளுணர்வு உங்களுக்கு வழிகாட்டும். ரகசியமான திட்டங்களில் அல்லது ஆராய்ச்சி சார்ந்த பணிகளில் ஈடுபட இது ஒரு நல்ல நாள். கூட்டாகச் செயல்படுவதன் மூலம் நல்ல முன்னேற்றம் ஏற்படும். உங்கள் கருத்துக்களுக்கு நல்ல வரவேற்பு கிடைக்கும்.",
    "career_en": "You will act calmly and patiently at work. Your intuition will guide you. This is a good day to engage in secret projects or research-related tasks. Good progress will be made through collaboration. Your ideas will be well received.",
    "finance_ta": "நிதி நிலைமைகள் சிறப்பாக இருக்கும். மறைமுகமான நிதி ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது. நீண்டகால முதலீடுகளைப் பற்றி சிந்திக்க இது ஒரு நல்ல நாள். தேவையற்ற செலவுகளைத் தவிர்த்து, சேமிப்பில் கவனம் செலுத்துங்கள். புதிய வருவாய் வழிகளைப் பற்றி சிந்திக்கலாம்.",
    "finance_en": "Financial conditions will be excellent. There is a possibility of indirect financial gains. This is a good day to think about long-term investments. Avoid unnecessary expenses and focus on savings. You can think about new revenue streams.",
    "health_ta": "மன அமைதியிலும், ஆன்மீக நலத்திலும் கவனம் செலுத்துங்கள். தியானம், யோகா அல்லது இயற்கையோடு நேரம் செலவிடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். மன அழுத்தத்தைக் குறைப்பதற்கான வழிகளை ஆராயுங்கள். நல்ல தூக்கம் அவசியம். ஆரோக்கியமான உணவுப் பழக்கங்களை மேற்கொள்ளுங்கள்.",
    "health_en": "Focus on mental peace and spiritual well-being. Meditation, yoga, or spending time with nature will refresh you. Explore ways to reduce stress. Good sleep is essential. Adopt healthy eating habits.",
    "lucky_number": "9",
    "lucky_color_ta": "கருநீலம்",
    "lucky_color_en": "Dark Blue"
  },
  {
    "sign_ta": "தனுசு",
    "sign_en": "Sagittarius",
    "date": "20-02-2026",
    "prediction_ta": "இன்று சுக்கிரனின் ஆதிக்கம் உங்கள் சமூக வாழ்க்கை, நட்பு வட்டாரம் மற்றும் எதிர்கால திட்டங்களில் இனிமையையும், சாதகமான சூழ்நிலையையும் கொண்டு வரும். நீங்கள் இன்று மிகவும் மகிழ்ச்சியாகவும், உற்சாகமாகவும் காணப்படுவீர்கள். புதிய நண்பர்களை உருவாக்கவும், ஏற்கனவே உள்ள நட்புகளைப் பலப்படுத்தவும் இது ஒரு சிறந்த நாள். சமூக நிகழ்வுகளில் கலந்து கொள்வது அல்லது புதிய குழுக்களில் சேருவது உங்களுக்குப் புத்துணர்வையும், உத்வேகத்தையும் அளிக்கும். உங்கள் எதிர்கால லட்சியங்களை நோக்கிச் செயல்பட இது ஒரு நல்ல வாய்ப்பு. உங்கள் எண்ணங்களையும், கருத்துக்களையும் வெளிப்படுத்துவதற்கும், பிறருடன் பகிர்ந்து கொள்வதற்கும் இது ஒரு நல்ல நாள். உங்கள் படைப்புத் திறன் மேம்படும், எனவே கலை அல்லது பொழுதுபோக்கு சார்ந்த முயற்சிகளில் ஈடுபடுவது உங்களுக்கு மகிழ்ச்சியைத் தரும். சிறிய பயணங்கள் அல்லது குறுகிய தூரப் பயணங்கள் உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். இவை பொழுதுபோக்கு சார்ந்தவையாகவோ அல்லது தகவல் தொடர்புகளை மேம்படுத்துவதற்காகவோ இருக்கலாம். உங்கள் உடன்பிறப்புகளுடனும், அண்டை வீட்டினருடனும் உறவுகள் மேம்படும். அவர்களுடன் நல்லுரையாடல் மேற்கொள்வது உங்களுக்கு மகிழ்ச்சியைத் தரும். உங்கள் மனதில் உள்ள விஷயங்களை ஒளிவுமறைவின்றி வெளிப்படுத்த இது ஒரு நல்ல நாள். ஆனால், அதே நேரத்தில் மற்றவர்களின் கருத்துக்களுக்கும் மதிப்பு கொடுக்க வேண்டும். இன்று உங்கள் உள்ளுணர்வு கூர்மையாக இருக்கும், இது சரியான முடிவுகளை எடுக்க உதவும். எந்தவொரு விஷயத்திலும் அவசரம் காட்டாமல், நிதானமாகச் செயல்படுவது நல்லது. உங்கள் நேர்மறை எண்ணங்கள் சுற்றியுள்ளவர்களுக்கும் பரவும், இதனால் அவர்களும் மகிழ்ச்சி அடைவார்கள். இன்று உங்கள் வசீகரமான ஆளுமை மூலம் எந்தவொரு சவாலையும் எளிதில் சமாளிப்பீர்கள். குறிப்பாக புதிய யோசனைகளை முன்வைப்பதற்கும், பிறரை உங்கள் வழியில் கொண்டு வருவதற்கும் இது ஒரு சிறந்த நாள். உங்கள் அறிவுத்திறன் மற்றும் தகவல்தொடர்பு திறன் இன்று உச்சத்தில் இருக்கும். இன்று நீங்கள் சந்திக்கும் நபர்கள், உங்களுக்குப் புதிய கண்ணோட்டங்களைத் தரலாம் அல்லது புதிய வாய்ப்புகளை உருவாக்கலாம். புதிய தகவல்களைச் சேகரிப்பதற்கும், உங்கள் அறிவை விரிவுபடுத்துவதற்கும் இது ஒரு நல்ல நாள். ஆன்லைனில் அல்லது வாசிப்பு மூலம் புதிய விஷயங்களைக் கற்றுக்கொள்ள நேரம் ஒதுக்குங்கள். உங்கள் மனதில் இருக்கும் திட்டங்களுக்கு வடிவம் கொடுக்க இது ஒரு நல்ல நேரம். சிறிய கூட்டங்கள் அல்லது கலந்துரையாடல்கள் மூலம் உங்கள் யோசனைகளைப் பகிர்ந்து கொள்ளலாம். உங்கள் வாழ்க்கையில் ஒரு புதிய நேர்மறை அத்தியாயத்தைத் தொடங்க இது ஒரு நல்ல தருணம். மகிழ்ச்சியுடனும், உற்சாகத்துடனும் செயல்படுங்கள். இன்று நீங்கள் செய்யும் ஒவ்வொரு விஷயத்திலும் ஒரு தனித்துவமான திறமையுடன் செயல்படுவீர்கள். உங்கள் நகைச்சுவை உணர்வு மற்றும் புத்திசாலித்தனம் இன்று அனைவரையும் கவரும். இன்றைய நாள் உங்கள் சமூக மற்றும் அறிவுசார் வாழ்க்கையை மேம்படுத்தும். அன்பும், நல்லிணக்கமும் நிறைந்த நாளாக அமையும். நீண்டகால கனவுகளை நனவாக்க இது ஒரு நல்ல நாள். பெரிய திட்டங்களுக்கு அடித்தளம் அமைப்பதில் வெற்றி காண்பீர்கள்.",
    "prediction_en": "Today, the influence of Venus will bring sweetness and favorable conditions to your social life, friendship circle, and future plans. You will appear very happy and enthusiastic today. This is an excellent day to make new friends and strengthen existing friendships. Participating in social events or joining new groups will bring you rejuvenation and inspiration. This is a good opportunity to work towards your future ambitions. This is a good day to express your thoughts and opinions and share them with others. Your creativity will improve, so engaging in artistic or entertainment-related endeavors will bring you joy. Short trips or brief excursions will refresh you. These could be for leisure or to improve communications. Relationships with your siblings and neighbors will improve. Having good conversations with them will bring you joy. This is a good day to express your feelings openly. However, at the same time, you should also value others' opinions. Today your intuition will be sharp, which will help you make good decisions. It is good to act calmly without rushing into anything. Your positive thoughts will spread to those around you, making them happy too. Today you will easily overcome any challenge with your charming personality. Especially, this is a great day to propose new ideas and bring others to your way of thinking. Your intellect and communication skills will be at their peak today. The people you meet today may offer you new perspectives or create new opportunities. This is a good day to gather new information and expand your knowledge. Dedicate time to learn new things online or through reading. This is a good time to give shape to your plans. You can share your ideas through small meetings or discussions. This is a good moment to start a new positive chapter in your life. Act with joy and enthusiasm. Today you will perform every task with a unique ability. Your sense of humor and wit will captivate everyone today. Today will enhance your social and intellectual life, being a day filled with love and harmony. This is a good day to realize long-term dreams. You will succeed in laying the groundwork for big projects.",
    "career_ta": "உங்கள் பணியிடத்தில் இணக்கமான சூழ்நிலை நிலவும். சக ஊழியர்களுடனும், மேலதிகாரிகளுடனும் நல்லுறவுகள் வலுப்படும். புதிய திட்டங்களில் கூட்டாகச் செயல்படுவதன் மூலம் சிறந்த முடிவுகளைப் பெறுவீர்கள். கலை மற்றும் படைப்புத் துறைகளில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் அமையும். உங்கள் கருத்துக்களுக்கு நல்ல வரவேற்பு கிடைக்கும்.",
    "career_en": "A harmonious atmosphere will prevail in your workplace. Relationships with colleagues and superiors will strengthen. You will achieve excellent results by working collaboratively on new projects. New opportunities will arise for those in artistic and creative fields. Your ideas will be well received.",
    "finance_ta": "நிதி நிலைமைகள் சீராக இருக்கும். சமூக நிகழ்வுகளுக்காக அல்லது நண்பர்களுடன் சேர்ந்து பொழுதுபோக்கு விஷயங்களுக்காக செலவு செய்ய நேரிடலாம். புதிய முதலீடுகளைப் பற்றி சிந்திக்கும்போது நிதானமாகச் செயல்படவும். நிதி ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது.",
    "finance_en": "Financial conditions will be stable. You may have to spend on social events or entertainment with friends. Act calmly when thinking about new investments. Financial gains are possible.",
    "health_ta": "உங்கள் உடல்நலத்தில் கவனம் செலுத்துங்கள். உடற்பயிற்சிகளை மேற்கொள்வது உடலையும், மனதையும் புத்துணர்ச்சியுடன் வைத்திருக்கும். சமூக நிகழ்வுகளில் கலந்து கொள்வது மனதுக்கு உற்சாகத்தை அளிக்கும். ஆரோக்கியமான உணவுப் பழக்கங்களை மேற்கொள்ளுங்கள். போதுமான ஓய்வு எடுப்பது அவசியம்.",
    "health_en": "Pay attention to your health. Engaging in exercises will keep your body and mind refreshed. Participating in social events will bring enthusiasm to the mind. Adopt healthy eating habits. Adequate rest is essential.",
    "lucky_number": "3",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "மகரம்",
    "sign_en": "Capricorn",
    "date": "20-02-2026",
    "prediction_ta": "இன்று சுக்கிரனின் ஆதிக்கம் உங்கள் தொழில் வாழ்க்கையிலும், சமூக அந்தஸ்திலும் ஒரு இனிமையான மற்றும் சாதகமான சூழ்நிலையைக் கொண்டு வரும். நீங்கள் இன்று மிகவும் கடமையுணர்வுடனும், பொறுப்புடனும் செயல்படுவீர்கள். உங்கள் கடின உழைப்பும், அர்ப்பணிப்பும் இன்று அங்கீகரிக்கப்படும், இது உங்களுக்குப் பாராட்டுகளையும், அங்கீகாரத்தையும் பெற்றுத் தரும். புதிய பொறுப்புகளை ஏற்றுக்கொள்வதற்கும், உங்கள் லட்சியங்களை அடையவும் இது ஒரு சிறந்த நாள். உங்கள் பணியிடத்தில் நல்லுறவுகள் வலுப்படும், சக ஊழியர்களுடனும், மேலதிகாரிகளுடனும் சுமுகமான புரிதல் ஏற்படும். கூட்டாகச் செயல்படும் திட்டங்களில் நல்ல முன்னேற்றம் ஏற்படும். உங்கள் படைப்புத் திறனைப் பயன்படுத்த இது ஒரு நல்ல நாள், குறிப்பாக வடிவமைத்தல், அழகுபடுத்துதல் அல்லது கலை சார்ந்த தொழில்களில் உள்ளவர்களுக்கு சிறப்பான வாய்ப்புகள் அமையும். உங்கள் வீடு அல்லது பணியிடத்தில் அழகியல் மேம்பாடுகளைச் செய்ய இது ஒரு அருமையான நாள். தூய்மையிலும், ஒழுங்கிலும் அதிக அக்கறை செலுத்துவீர்கள், இது உங்கள் சுற்றுப்புறத்தை மிகவும் நேர்த்தியாக மாற்றும். சிறிய மாற்றங்கள் கூட பெரிய நேர்மறை விளைவுகளை உருவாக்கும். நீண்டகாலமாக நிலுவையிலிருக்கும் வீட்டு வேலைகளைச் செய்து முடிப்பதற்கு இது ஒரு நல்ல நாள். உங்கள் நிதி நிலைமைகள் சீராக இருக்கும். வருமானத்தை அதிகரிப்பதற்கான புதிய வழிகளைப் பற்றி சிந்திக்க இது ஒரு நல்ல வாய்ப்பு. பட்ஜெட்டைத் திட்டமிடுவது மற்றும் செலவுகளைக் கட்டுக்குள் வைத்திருப்பது உங்களுக்கு நன்மை பயக்கும். இன்றைய நாள் உங்கள் உணர்ச்சிபூர்வமான உலகத்தை செழுமைப்படுத்தும். உங்கள் உள்ளுணர்வு மிகவும் வலுவாக இருக்கும், எனவே அதை நம்பி செயல்படலாம். உங்கள் எண்ணங்கள் தெளிவான நிலையில் இருக்கும், இது சரியான முடிவுகளை எடுக்க உதவும். உங்கள் அன்பான அணுகுமுறை, குடும்பத்தினரிடமும், நெருங்கிய நண்பர்களிடமும் நல்லுறவை மேம்படுத்தும். உங்களுக்குள் இருக்கும் அன்பை வெளிப்படுத்த தயங்காதீர்கள். இன்று நீங்கள் அமைதியையும், நல்லிணக்கத்தையும் தேடுவீர்கள். சிறிய விஷயங்களில் கூட மகிழ்ச்சியைக் கண்டறியும் திறன் இன்று உங்களுக்கு அதிகமாக இருக்கும். குடும்பத்துடனும், அன்புக்குரியவர்களுடனும் தரமான நேரம் செலவிடுங்கள். இன்றைய நாள், உங்கள் வாழ்க்கையில் அன்பையும், பாதுகாப்பையும், செழிப்பையும் கொண்டு வரும் ஒரு மகிழ்ச்சியான நாளாக அமையும். மனநிறைவுடன் செயல்படுங்கள், நல்லதே நடக்கும். நிதி சார்ந்த விஷயங்களில் புதிய திட்டங்களை வகுக்க இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்திலும், மன அமைதியிலும் கவனம் செலுத்துங்கள். உங்கள் வீடு மற்றும் குடும்பம் இன்று உங்களுக்கு ஒரு புகலிடமாக அமையும். உங்களுக்குப் பிடித்தமான விஷயங்களைச் செய்வதன் மூலம் மகிழ்ச்சியைப் பெறுவீர்கள். புதிய பொழுதுபோக்குகளில் ஈடுபட இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்திலும், உடலிலும் ஒரு புத்துணர்ச்சி உண்டாகும். அழகியல் விஷயங்களில் உங்கள் ரசனை மேம்படும். இன்று உங்கள் எண்ணங்கள் அனைத்தும் நேர்மறையாகவும், ஆக்கபூர்வமாகவும் இருக்கும். கலை சார்ந்த விஷயங்களில் ஈடுபடுவது, உங்கள் மனதுக்கு மிகுந்த ஆறுதலையும், மகிழ்ச்சியையும் தரும். உங்கள் தனிப்பட்ட வாழ்க்கையிலும், சமூக வாழ்க்கையிலும் நல்லுறவுகள் வலுப்பெறும். இது உங்களுக்கு மிகுந்த நம்பிக்கையையும், உற்சாகத்தையும் அளிக்கும். எந்தவொரு சிறிய விஷயத்திலும் மகிழ்ச்சியைக் கண்டறியும் திறன் இன்று உங்களுக்கு அதிகமாக இருக்கும். இன்றைய நாள் அன்பையும், அழகையும் போற்றும் நாளாக அமையும். உங்கள் சமூகத்தில் உங்கள் மதிப்பு உயரும். நீங்கள் எடுக்கும் முடிவுகள் மற்றவர்களுக்கு முன்மாதிரியாக அமையும். பொறுமையுடனும், உறுதியுடனும் செயல்படுவது நல்ல பலன்களைத் தரும்.",
    "prediction_en": "Today, the influence of Venus will bring a pleasant and favorable situation to your professional life and social status. You will act with great dedication and responsibility today. Your hard work and dedication will be recognized today, bringing you praise and acknowledgement. This is an excellent day to take on new responsibilities and achieve your ambitions. Good relationships will strengthen in your workplace, and there will be smooth understanding with colleagues and superiors. Good progress will be made in collaborative projects. This is a good day to utilize your creativity, especially for those in design, beautification, or art-related professions, excellent opportunities will arise. This is a great day to make aesthetic improvements to your home or workplace. You will pay great attention to cleanliness and order, which will make your surroundings very neat. Even small changes will create great positive effects. This is a good day to complete long-pending household chores. Your financial conditions will be stable. This is a good opportunity to think about new ways to increase income. Planning a budget and keeping expenses under control will benefit you. Today will enrich your emotional world. Your intuition will be very strong, so you can trust and act on it. Your thoughts will be clear, which will help you make good decisions. Your loving approach will improve relationships with family and close friends. Do not hesitate to express the love within you. Today you will seek peace and harmony. Your ability to find joy in even small things will be enhanced today. Spend quality time with family and loved ones. Today will be a happy day, bringing love, security, and prosperity into your life. Act with contentment, and good things will happen. This is a great day to formulate new plans for financial matters. Focus on your health and peace of mind. Your home and family will be a refuge for you today. You will find joy by doing things you love. This is a great day to engage in new hobbies. You will feel rejuvenated in your health and body. Your aesthetic taste will improve. Today, all your thoughts will be positive and constructive. Engaging in artistic matters will bring great comfort and joy to your mind. Relationships in your personal and social life will strengthen. This will give you great confidence and enthusiasm. Your ability to find joy in even small things will be enhanced today. Today will be a day to appreciate love and beauty. Your value in society will increase. Your decisions will serve as an example to others. Acting patiently and resolutely will yield good results.",
    "career_ta": "உங்கள் தொழில் வாழ்க்கையில் நல்ல முன்னேற்றம் ஏற்படும். உங்கள் கடின உழைப்பு அங்கீகரிக்கப்படும், புதிய பொறுப்புகள் அல்லது பதவிகள் கிடைக்க வாய்ப்புள்ளது. சக ஊழியர்களுடனும், மேலதிகாரிகளுடனும் நல்லுறவுகள் வலுப்படும். உங்கள் திட்டமிடல் திறன் பாராட்டப்படும். கலை அல்லது வடிவமைப்பு சார்ந்த துறைகளில் உள்ளவர்களுக்கு சிறப்பான வாய்ப்புகள் அமையும்.",
    "career_en": "Good progress will be made in your professional life. Your hard work will be recognized, and there is a possibility of new responsibilities or positions. Relationships with colleagues and superiors will strengthen. Your planning skills will be appreciated. Excellent opportunities will arise for those in art or design-related fields.",
    "finance_ta": "நிதி நிலைமைகள் சிறப்பாக இருக்கும். உங்கள் தொழில் மூலம் வருமானம் அதிகரிக்க வாய்ப்புள்ளது. நீண்டகால முதலீடுகளைப் பற்றி சிந்திக்க இது ஒரு நல்ல நாள். பட்ஜெட்டைத் திட்டமிடுவது மற்றும் சேமிப்பில் கவனம் செலுத்துவது உங்களுக்கு நன்மை பயக்கும். ஆடம்பரமான விஷயங்களுக்காக அளவோடு செலவு செய்யலாம்.",
    "finance_en": "Financial conditions will be excellent. There is a possibility of increased income through your profession. This is a good day to think about long-term investments. Planning a budget and focusing on savings will benefit you. You can spend moderately on luxurious items.",
    "health_ta": "உங்கள் உடல்நலத்தில் கவனம் செலுத்துங்கள். மன அமைதிக்காக தியானம் அல்லது யோகா போன்ற பயிற்சிகளில் ஈடுபடலாம். ஆரோக்கியமான உணவுப் பழக்கங்களை மேற்கொள்ளுங்கள். போதுமான ஓய்வு எடுப்பது முக்கியம். மன அழுத்தத்தைக் குறைப்பதற்கான வழிகளை ஆராயுங்கள்.",
    "health_en": "Pay attention to your health. You can engage in practices like meditation or yoga for peace of mind. Adopt healthy eating habits. Adequate rest is essential. Explore ways to reduce stress.",
    "lucky_number": "8",
    "lucky_color_ta": "சாம்பல்",
    "lucky_color_en": "Grey"
  },
  {
    "sign_ta": "கும்பம்",
    "sign_en": "Aquarius",
    "date": "20-02-2026",
    "prediction_ta": "இன்று சுக்கிரனின் ஆதிக்கம் உங்கள் அறிவுசார் pursuits, பயணங்கள் மற்றும் ஆன்மீக வளர்ச்சியில் ஒரு இனிமையான சூழலைக் கொண்டு வரும். நீங்கள் இன்று புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்துவதற்கும் ஆர்வமாக இருப்பீர்கள். நீண்ட தூரப் பயணங்கள் அல்லது புதிய கலாச்சாரங்களைப் பற்றி அறிந்துகொள்வது உங்களுக்கு மகிழ்ச்சியைத் தரும். உங்கள் நண்பர்களுடனும், கூட்டாளிகளுடனும் உறவுகள் பலப்படும். நீண்டகாலமாக நிலுவையிலிருக்கும் சமூகப் பிரச்சனைகள் இன்று சுமுகமாகத் தீர வாய்ப்புள்ளது. உங்கள் எண்ணங்களையும், கருத்துக்களையும் வெளிப்படுத்துவதற்கும், புதிய திட்டங்களைத் தொடங்குவதற்கும் இது ஒரு நல்ல நாள். கலை, இசை அல்லது பொழுதுபோக்குத் துறைகளில் இருப்பவர்களுக்கு சிறப்பான வாய்ப்புகள் அமையும். உங்கள் படைப்புத் திறனை வெளிப்படுத்த தயங்க வேண்டாம். அது உங்களுக்குப் பாராட்டுகளையும், அங்கீகாரத்தையும் பெற்றுத் தரும். உங்கள் தனிப்பட்ட தோற்றத்திலும், ஸ்டைலிலும் கவனம் செலுத்துவீர்கள், இது உங்கள் தன்னம்பிக்கையை மேலும் அதிகரிக்கும். புதிய ஆடைகளை வாங்குவது அல்லது அழகு சாதனங்களில் கவனம் செலுத்துவது உங்களுக்கு மகிழ்ச்சியைத் தரும். அன்பையும், பாசத்தையும் வெளிப்படுத்துவதற்கு இது ஒரு சிறந்த நாள். உங்கள் காதல் உறவுகளில் இனிமை பெருகும், ஒற்றையர்களுக்கு புதிய காதல் அத்தியாயங்கள் தொடங்கலாம். உங்கள் நண்பர்களுடன் சேர்ந்து வெளியூர் பயணங்கள் அல்லது சிறிய கொண்டாட்டங்களில் ஈடுபட இது ஒரு நல்ல நாள். உங்கள் மனம் மகிழ்ச்சியாகவும், உற்சாகமாகவும் இருக்கும். நேர்மறையான எண்ணங்களை வளர்த்துக் கொள்ளுங்கள். உங்கள் தாராள மனப்பான்மை இன்று பிறரால் பாராட்டப்படும். பிறருக்கு உதவுவதற்கும், அவர்களுக்கு ஆதரவு அளிப்பதற்கும் இன்று உங்களுக்கு அதிக ஆர்வம் ஏற்படும். உங்கள் திறமைகளை வெளிப்படுத்தவும், உங்கள் லட்சியங்களை அடையவும் இது ஒரு நல்ல வாய்ப்பு. எந்தவொரு அவசர முடிவுகளையும் தவிர்த்து, நிதானமாகச் செயல்படுவது நல்லது. இன்று நீங்கள் சந்திக்கும் நபர்கள், உங்களுக்குப் புதிய கண்ணோட்டங்களைத் தரலாம் அல்லது புதிய வாய்ப்புகளை உருவாக்கலாம். உங்கள் வாழ்க்கையில் ஒரு புதிய நேர்மறை அத்தியாயத்தைத் தொடங்க இது ஒரு நல்ல தருணம். மகிழ்ச்சியுடனும், உற்சாகத்துடனும் செயல்படுங்கள். இன்று நீங்கள் செய்யும் ஒவ்வொரு விஷயத்திலும் ஒரு தனித்துவமான திறமையுடன் செயல்படுவீர்கள். உங்கள் நகைச்சுவை உணர்வு மற்றும் புத்திசாலித்தனம் இன்று அனைவரையும் கவரும். இன்றைய நாள் உங்கள் சமூக மற்றும் அறிவுசார் வாழ்க்கையை மேம்படுத்தும். அன்பும், நல்லிணக்கமும் நிறைந்த நாளாக அமையும். ஆன்மீக விஷயங்களில் நாட்டம் அதிகரிக்கும். உலகளாவிய சகோதரத்துவம் மற்றும் சமத்துவ உணர்வு இன்று உங்களுக்குள் மேலோங்கும்.",
    "prediction_en": "Today, the influence of Venus will bring a pleasant atmosphere to your intellectual pursuits, travels, and spiritual growth. You will be interested in learning new things and improving your knowledge today. Long-distance travels or learning about new cultures will bring you joy. Relationships with your friends and partners will strengthen. Long-pending social issues may be resolved amicably today. This is a good day to express your thoughts and opinions and start new projects. Excellent opportunities will arise for those in art, music, or entertainment fields. Do not hesitate to express your creativity. It will bring you praise and recognition. You will pay attention to your personal appearance and style, which will further increase your self-confidence. Buying new clothes or focusing on beauty products will bring you happiness. This is a great day to express love and affection. Sweetness will increase in your romantic relationships, and new romantic chapters may begin for singles. This is a good day to go on trips with friends or engage in small celebrations. Your mind will be happy and enthusiastic. Cultivate positive thoughts. Your generosity will be appreciated by others today. Today you will have a greater interest in helping others and providing them support. This is a good opportunity to showcase your talents and achieve your ambitions. It is good to avoid any hasty decisions and act calmly. The people you meet today may offer you new perspectives or create new opportunities. This is a good moment to start a new positive chapter in your life. Act with joy and enthusiasm. Today you will perform every task with a unique ability. Your sense of humor and wit will captivate everyone today. Today will enhance your social and intellectual life, being a day filled with love and harmony. Interest in spiritual matters will increase. A sense of global brotherhood and equality will prevail within you today.",
    "career_ta": "பணியிடத்தில் புதிய யோசனைகளை முன்வைப்பதற்கும், புதுமையான திட்டங்களைச் செயல்படுத்துவதற்கும் இது ஒரு நல்ல நாள். சக ஊழியர்களுடன் நல்லிணக்கம் நிலவும். தொழில்நுட்பம், ஆராய்ச்சி அல்லது சமூக சேவைத் துறைகளில் உள்ளவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் அமையும். உங்கள் படைப்புத் திறன் பாராட்டப்படும்.",
    "career_en": "This is a good day to propose new ideas and implement innovative projects at work. Harmony will prevail with colleagues. Excellent opportunities will arise today for those in technology, research, or social service fields. Your creativity will be appreciated.",
    "finance_ta": "நிதி நிலைமைகள் சிறப்பாக இருக்கும். புதிய முதலீடுகளைப் பற்றி சிந்திக்கும்போது நிதானமாகச் செயல்படவும். நண்பர்களுடன் சேர்ந்து பொழுதுபோக்கு விஷயங்களுக்காக செலவு செய்ய நேரிடலாம். நிதி ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது. உங்கள் பட்ஜெட்டை கவனமாக நிர்வகிக்கவும்.",
    "finance_en": "Financial conditions will be excellent. Act calmly when thinking about new investments. You may have to spend on entertainment with friends. Financial gains are possible. Manage your budget carefully.",
    "health_ta": "உங்கள் உடல்நலத்தில் கவனம் செலுத்துங்கள். உடற்பயிற்சிகளை மேற்கொள்வது உடலையும், மனதையும் புத்துணர்ச்சியுடன் வைத்திருக்கும். சமூக நிகழ்வுகளில் கலந்து கொள்வது மனதுக்கு உற்சாகத்தை அளிக்கும். ஆரோக்கியமான உணவுப் பழக்கங்களை மேற்கொள்ளுங்கள். போதுமான ஓய்வு எடுப்பது அவசியம்.",
    "health_en": "Pay attention to your health. Engaging in exercises will keep your body and mind refreshed. Participating in social events will bring enthusiasm to the mind. Adopt healthy eating habits. Adequate rest is essential.",
    "lucky_number": "4",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "20-02-2026",
    "prediction_ta": "இன்று சுக்கிரனின் ஆதிக்கம் உங்கள் தனிப்பட்ட உறவுகள், நிதி நிலைமைகள் மற்றும் உணர்ச்சிபூர்வமான உலகத்தில் இனிமையையும், இணக்கத்தையும் கொண்டு வரும். நீங்கள் இன்று மிகவும் பாசமாகவும், அக்கறையுடனும் நடந்துகொள்வீர்கள், இது உறவுகளை மேலும் பலப்படுத்தும். உங்கள் காதல் உறவுகளில் அன்பு பெருகும், ஒற்றையர்களுக்குப் புதிய காதல் அத்தியாயங்கள் தொடங்கலாம். உங்கள் குடும்பத்தினருடன் அல்லது நெருங்கிய நண்பர்களுடன் நல்லுரையாடல் மேற்கொள்வது உங்களுக்கு மகிழ்ச்சியைத் தரும். உங்கள் நிதி நிலைமைகள் சீராக இருக்கும். வருமானம் பெருகும் வாய்ப்புகள் அல்லது எதிர்பாராத ஆதாயங்கள் கிடைக்கலாம். ஆனால், அதே நேரத்தில், உணர்ச்சிவசப்பட்டு தேவையற்ற செலவுகளைத் தவிர்ப்பது நல்லது. உங்கள் பணத்தைப் புத்திசாலித்தனமாக நிர்வகிக்க இது ஒரு நல்ல வாய்ப்பு. நீண்டகால நிதி திட்டங்களை வகுப்பதற்கு இது உகந்த நேரம். உங்கள் படைப்புத் திறன் மேம்படும். கலை, இசை அல்லது கவிதை போன்ற துறைகளில் ஈடுபடுவது உங்களுக்கு ஆழ்ந்த மனநிறைவைத் தரும். உங்கள் உள்ளுணர்வு கூர்மையாக இருக்கும், எனவே அதை நம்பி செயல்படலாம். உங்கள் கனவுகளும், உள்ளுணர்வுகளும் மிகவும் வலிமையாக இருக்கும். அவற்றிற்குச் செவிசாய்ப்பது நல்லது. பிறருக்கு உதவுவதற்கும், அவர்களுக்கு ஆதரவு அளிப்பதற்கும் இன்று உங்களுக்கு அதிக ஆர்வம் ஏற்படும். உங்கள் இரக்க சுபாவம் பாராட்டப்படும். உங்கள் தனிப்பட்ட தோற்றத்திலும், ஆரோக்கியத்திலும் கவனம் செலுத்துவீர்கள். மென்மையான உடற்பயிற்சிகள் அல்லது இயற்கையோடு நேரம் செலவிடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். இன்று நீங்கள் அமைதியையும், நல்லிணக்கத்தையும் தேடுவீர்கள். சிறிய விஷயங்களில் கூட மகிழ்ச்சியைக் கண்டறியும் திறன் இன்று உங்களுக்கு அதிகமாக இருக்கும். குடும்பத்துடனும், அன்புக்குரியவர்களுடனும் தரமான நேரம் செலவிடுங்கள். இன்றைய நாள், உங்கள் வாழ்க்கையில் அன்பையும், பாதுகாப்பையும், செழிப்பையும் கொண்டு வரும் ஒரு மகிழ்ச்சியான நாளாக அமையும். மனநிறைவுடன் செயல்படுங்கள், நல்லதே நடக்கும். நிதி சார்ந்த விஷயங்களில் புதிய திட்டங்களை வகுக்க இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்திலும், மன அமைதியிலும் கவனம் செலுத்துங்கள். உங்கள் வீடு மற்றும் குடும்பம் இன்று உங்களுக்கு ஒரு புகலிடமாக அமையும். உங்களுக்குப் பிடித்தமான விஷயங்களைச் செய்வதன் மூலம் மகிழ்ச்சியைப் பெறுவீர்கள். புதிய பொழுதுபோக்குகளில் ஈடுபட இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியத்திலும், உடலிலும் ஒரு புத்துணர்ச்சி உண்டாகும். அழகியல் விஷயங்களில் உங்கள் ரசனை மேம்படும். இன்று உங்கள் எண்ணங்கள் அனைத்தும் நேர்மறையாகவும், ஆக்கபூர்வமாகவும் இருக்கும். கலை சார்ந்த விஷயங்களில் ஈடுபடுவது, உங்கள் மனதுக்கு மிகுந்த ஆறுதலையும், மகிழ்ச்சியையும் தரும். உங்கள் தனிப்பட்ட வாழ்க்கையிலும், சமூக வாழ்க்கையிலும் நல்லுறவுகள் வலுப்பெறும். இது உங்களுக்கு மிகுந்த நம்பிக்கையையும், உற்சாகத்தையும் அளிக்கும். எந்தவொரு சிறிய விஷயத்திலும் மகிழ்ச்சியைக் கண்டறியும் திறன் இன்று உங்களுக்கு அதிகமாக இருக்கும். இன்றைய நாள் அன்பையும், அழகையும் போற்றும் நாளாக அமையும். உங்கள் உள்ளுணர்வும், கனவுகளும் இன்று உங்களுக்கு முக்கியமான செய்திகளைத் தரலாம். அதற்குக் கவனம் செலுத்துங்கள்.",
    "prediction_en": "Today, the influence of Venus will bring sweetness and harmony to your personal relationships, financial conditions, and emotional world. You will act very affectionately and caring today, which will further strengthen relationships. Love will increase in your romantic relationships, and new romantic chapters may begin for singles. Having good conversations with your family or close friends will bring you joy. Your financial conditions will be stable. You may have opportunities for increased income or unexpected gains. However, at the same time, it is good to avoid unnecessary emotional spending. This is a good opportunity to manage your money wisely. This is an opportune time to formulate long-term financial plans. Your creativity will improve. Engaging in fields like art, music, or poetry will bring you deep satisfaction. Your intuition will be sharp, so you can trust and act on it. Your dreams and intuitions will be very strong. It is good to listen to them. Today you will have a greater interest in helping others and providing them support. Your compassion will be appreciated. You will pay attention to your personal appearance and health. Gentle exercises or spending time with nature will refresh you. Today you will seek peace and harmony. Your ability to find joy in even small things will be enhanced today. Spend quality time with family and loved ones. Today will be a happy day, bringing love, security, and prosperity into your life. Act with contentment, and good things will happen. This is a great day to formulate new plans for financial matters. Focus on your health and peace of mind. Your home and family will be a refuge for you today. You will find joy by doing things you love. This is a great day to engage in new hobbies. You will feel rejuvenated in your health and body. Your aesthetic taste will improve. Today, all your thoughts will be positive and constructive. Engaging in artistic matters will bring great comfort and joy to your mind. Relationships in your personal and social life will strengthen. This will give you great confidence and enthusiasm. Your ability to find joy in even small things will be enhanced today. Today will be a day to appreciate love and beauty. Your intuition and dreams may bring you important messages today. Pay attention to them.",
    "career_ta": "பணியிடத்தில் உங்கள் படைப்புத் திறனும், உள்ளுணர்வும் பாராட்டப்படும். சக ஊழியர்களுடன் நல்லிணக்கம் நிலவும். கலை, ஆலோசனை அல்லது உதவி சார்ந்த பணிகளில் இருப்பவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் அமையும். உங்கள் கருத்துக்களுக்கு நல்ல வரவேற்பு கிடைக்கும். புதிய திட்டங்களில் கூட்டாகச் செயல்படுவதன் மூலம் நல்ல முன்னேற்றம் ஏற்படும்.",
    "career_en": "Your creativity and intuition will be appreciated at work. Harmony will prevail with colleagues. Excellent opportunities will arise today for those in art, consulting, or support-related tasks. Your ideas will be well received. Good progress will be made by working collaboratively on new projects.",
    "finance_ta": "நிதி நிலைமைகள் சிறப்பாக இருக்கும். உங்கள் உள்ளுணர்வைக் கேட்டு முதலீடுகளை மேற்கொள்ளலாம். கலை அல்லது அழகியல் சார்ந்த பொருட்களுக்காக செலவு செய்ய நேரிடலாம், ஆனால் அது உங்களுக்கு மகிழ்ச்சியைத் தரும். நிதி ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது. தேவையற்ற செலவுகளைத் தவிர்த்து சேமிப்பில் கவனம் செலுத்துங்கள்.",
    "finance_en": "Financial conditions will be excellent. You can make investments by listening to your intuition. You may have to spend on art or aesthetic items, but it will bring you joy. Financial gains are possible. Avoid unnecessary expenses and focus on savings.",
    "health_ta": "உங்கள் மன அமைதியிலும், ஆன்மீக நலத்திலும் கவனம் செலுத்துங்கள். தியானம், யோகா அல்லது இயற்கையோடு நேரம் செலவிடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். மன அழுத்தத்தைக் குறைப்பதற்கான வழிகளை ஆராயுங்கள். நல்ல தூக்கம் அவசியம். ஆரோக்கியமான உணவுப் பழக்கங்களை மேற்கொள்ளுங்கள்.",
    "health_en": "Focus on mental peace and spiritual well-being. Meditation, yoga, or spending time with nature will refresh you. Explore ways to reduce stress. Good sleep is essential. Adopt healthy eating habits.",
    "lucky_number": "7",
    "lucky_color_ta": "வெளிர் பச்சை",
    "lucky_color_en": "Light Green"
  }
]
