[
  {
    "sign_ta": "மேஷம்",
    "sign_en": "Aries",
    "date": "16-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் மேஷ ராசிக்காரர்களே, உங்கள் மனதின் ஆழமான உணர்வுகளை வெளிப்படுத்தும் நாள். சந்திரன் உங்கள் உணர்ச்சிகள், உள்மனம் மற்றும் குடும்ப வாழ்க்கையின் காரக கிரகமாக இருப்பதால், இன்று வீடு, குடும்பம், மற்றும் தனிப்பட்ட மன அமைதி ஆகியவற்றில் உங்கள் கவனம் முழுமையாக இருக்கும். பொதுவாகவே நீங்கள் துடிப்பானவர்கள், எந்த செயலையும் வேகமாக முடிக்கும் ஆர்வம் கொண்டவர்கள். ஆனால் இன்று அந்த வேகம் சற்று குறைந்து, உள்முக சிந்தனைக்கு அதிக முக்கியத்துவம் கொடுப்பீர்கள். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தாய் அல்லது தாய்வழி உறவினர்களுடன் அன்பான உரையாடல்கள் நிகழலாம். அவர்களின் நலனில் நீங்கள் அதிக அக்கறை செலுத்துவீர்கள். குடும்பத்தில் நிலவிவந்த சிறுசிறு சச்சரவுகள், மன வருத்தங்கள் நீங்கி, இணக்கமான சூழ்நிலை உருவாகும். வீட்டை அழகுபடுத்துவதிலோ, அல்லது வீட்டிற்கு தேவையான பொருட்களை வாங்குவதிலோ ஆர்வம் காட்டுவீர்கள். நீண்ட நாட்களாக நீங்கள் செய்ய நினைத்த வீட்டு வேலைகளை இன்று வெற்றிகரமாக முடிப்பீர்கள். உங்கள் துணையுடன் நீங்கள் மனப்பூர்வமாகப் பேசவும், உணர்வுகளைப் பரிமாறிக் கொள்ளவும் இது ஒரு சிறந்த வாய்ப்பு. குழந்தைகள் தங்கள் உணர்வுகளை உங்களுடன் பகிர்ந்துகொள்ள முன்வருவார்கள். அவர்களுக்கு நீங்கள் முழு ஆதரவையும், புரிதலையும் வழங்குவீர்கள். உங்கள் உள்ளுணர்வு இன்று மிகவும் கூர்மையாக இருக்கும். முக்கிய முடிவுகள் எடுக்கும்போது உங்கள் உள்ளுணர்வின் வழிகாட்டுதலைப் பின்பற்றுவது மிகுந்த நன்மையை அளிக்கும். உங்கள் மனது தெளிவுடனும், அமைதியுடனும் இருப்பதால், எந்தச் சவாலையும் நம்பிக்கையுடன் எதிர்கொள்ள முடியும். யோகா, தியானம் போன்ற மன அமைதியைத் தரும் பயிற்சிகளில் ஈடுபடுவது இன்று உங்களுக்கு மனதிற்கு புத்துணர்ச்சியை அளிக்கும். கடந்தகால நினைவுகள் உங்கள் மனதில் வந்து போகும். அவற்றில் இருந்து நல்ல பாடங்களை கற்றுக்கொண்டு, நிகழ்காலத்தை இன்னும் சிறப்பாக அமைத்துக் கொள்ள இன்று உங்களுக்கு நல்லதொரு வாய்ப்பு அமையும். உங்கள் தாய்வழி உறவினர்களுடன் நேரம் செலவிடுவது, அவர்களுக்கு நீங்கள் ஆதரவாக இருப்பது உங்கள் மனதிற்கு மிகுந்த மகிழ்ச்சியைக் கொடுக்கும். உங்கள் உணர்ச்சிகளை ஆரோக்கியமான வழியில் வெளிப்படுத்துவதன் மூலம், உறவுகளை இன்னும் வலுப்படுத்த முடியும். இன்று உங்கள் வீட்டுச் சூழல் அமைதியாகவும், மகிழ்ச்சியாகவும் இருக்கும். குடும்பத்தில் ஒரு இனிமையான நிகழ்வு அல்லது செய்தி வந்து சேரலாம். வீட்டை மையமாகக் கொண்ட திட்டங்களுக்கு இன்று நீங்கள் சரியான அடித்தளத்தை அமைப்பீர்கள். வீட்டுச் சூழலை மேலும் இனிமையாக்கும் வகையிலான புதிய பொருட்கள் வாங்குவதில் ஆர்வம் காட்டுவீர்கள். அல்லது வீட்டில் புதிய அலங்காரங்களைச் செய்வதில் ஈடுபடுவீர்கள். மொத்தத்தில், இன்று உங்கள் மனம் அமைதியாகவும், உணர்ச்சிகள் சமநிலை அடைந்தும், குடும்ப உறவுகள் வலுப்பட்டும் காணப்படும். இந்த நாளை குடும்பத்துடன் செலவிட்டு, மன அமைதியுடன் இருப்பதன் மூலம் நீங்கள் மிகுந்த இன்பம் பெறுவீர்கள். மேலும், இன்று உங்கள் தனிப்பட்ட தேவைகள் பூர்த்தி அடையும். நீங்கள் ஒரு சில தனிப்பட்ட விருப்பங்களை நிறைவேற்ற இன்று முயற்சி செய்வீர்கள். அதற்கு நல்ல பலன்களையும் பெறுவீர்கள். குடும்பத்தின் ஒரு அங்கமாக நீங்கள் ஆற்றும் பங்களிப்புக்கு நல்ல பாராட்டுகளைப் பெறுவீர்கள். குடும்ப மகிழ்ச்சியே இன்றைய உங்கள் முதன்மை இலக்காக அமையும். குடும்பத்தில் உள்ள பெரியவர்களின் ஆசிர்வாதத்தை பெறுவது இன்று உங்களின் மனதிற்கு மிகப்பெரிய பலத்தை கொடுக்கும். உங்கள் குடும்பத்தில் உள்ள ஒவ்வொருவரின் நலனையும் கருத்தில் கொண்டு நீங்கள் செயல்படுவீர்கள். இதனால் குடும்ப உறவுகள் மேலும் மேம்படும். வீட்டின் அழகை மேம்படுத்துவதில் நீங்கள் கவனம் செலுத்துவீர்கள். உங்கள் வீட்டை மேலும் இனிமையான இடமாக மாற்றுவீர்கள். உங்கள் மனதின் ஆழத்தில் உள்ள அமைதியை உணர்வீர்கள். இன்று நீங்கள் உங்கள் அன்பானவர்களுடன் நல்லுரையாடலில் ஈடுபடுவீர்கள். இது உங்கள் மனதிற்கு மகிழ்ச்சியையும், நல்லுரவுகளையும் கொண்டு வரும்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Aries natives, this is a day for expressing your deep emotions. As the Moon is the significator of your emotions, inner self, and family life, your focus today will be entirely on home, family, and personal peace of mind. Generally, you are vibrant and eager to complete any task quickly. However, today that speed will reduce slightly, and you will give more importance to introspection. Loving conversations may occur with family members, especially with your mother or maternal relatives. You will show great care for their well-being. Minor disputes and grievances that existed in the family will resolve, and a harmonious atmosphere will emerge. You will show interest in beautifying your home or purchasing necessary items for the house. You will successfully complete household tasks that you had intended to do for a long time. This is an excellent opportunity for you to have heartfelt conversations and exchange feelings with your partner. Children will come forward to share their feelings with you. You will provide them with full support and understanding. Your intuition will be very sharp today. Following your intuitive guidance when making important decisions will be highly beneficial. With your mind clear and peaceful, you can face any challenge with confidence. Engaging in practices that bring mental peace, such as yoga and meditation, will rejuvenate your mind today. Past memories may come and go in your mind. Today presents a good opportunity to learn valuable lessons from them and build a better present. Spending time with your maternal relatives and supporting them will bring great joy to your mind. By expressing your emotions in a healthy way, you can strengthen relationships even further. Today, your home environment will be peaceful and joyful. A pleasant event or news may arrive at home. You will lay a strong foundation for home-centric projects today. You will show interest in buying new items or making new decorations to further sweeten the home environment. Overall, today your mind will be peaceful, emotions balanced, and family relationships strengthened. You will gain immense pleasure by spending this day with family and being at peace. Furthermore, today your personal needs will be met. You will make an effort to fulfill some personal desires today and will receive good results. You will receive good appreciation for your contribution as a member of the family. Family happiness will be your primary goal today. Receiving the blessings of elders in your family will give great strength to your mind today. You will act considering the well-being of every member of your family. This will further improve family relationships. You will focus on enhancing the beauty of your home. You will make your home a sweeter place. You will feel the deep peace within your mind. Today you will engage in good conversations with your loved ones. This will bring joy and good relationships to your mind.",
    "career_ta": "பணி செய்யும் இடத்தில் உங்கள் மனம் அமைதியாகவும், மகிழ்ச்சியுடனும் இருப்பதால், பணிகளை திறம்பட முடிக்க முடியும். சக ஊழியர்களுடன் இணக்கமான உறவு நிலவும். குழுப்பணிகளில் நீங்கள் சிறந்த பங்களிப்பை வழங்குவீர்கள். புதிய திட்டங்களைச் செயல்படுத்துவதில் உங்கள் உள்ளுணர்வு வழிகாட்டும். உங்கள் பணிக்கு நல்ல அங்கீகாரம் கிடைக்கும்.",
    "career_en": "At your workplace, your mind will be peaceful and joyful, enabling you to complete tasks efficiently. Harmonious relationships will prevail with colleagues. You will provide excellent contributions in team projects. Your intuition will guide you in implementing new projects. Your work will receive good recognition.",
    "finance_ta": "நிதிநிலைமை சீராக இருக்கும். குடும்பத்திற்கான அத்தியாவசிய பொருட்களை வாங்குவதில் இன்று கவனம் செலுத்துவீர்கள். நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். சேமிக்கும் மனப்பான்மை அதிகரிக்கும். வீட்டை மேம்படுத்துவதற்கான செலவுகள் லாபகரமானதாக அமையும்.",
    "finance_en": "The financial situation will be stable. Today you will focus on purchasing essential items for the family. You will think about long-term investments. The inclination to save will increase. Expenses for home improvement will be profitable.",
    "health_ta": "உங்கள் மன ஆரோக்கியத்திற்கு இன்று மிகுந்த முக்கியத்துவம் கொடுப்பீர்கள். யோகா, தியானம் போன்ற மன அமைதி தரும் பயிற்சிகள் உங்களுக்கு நன்மை பயக்கும். போதிய ஓய்வு எடுப்பதன் மூலம் உடல் சோர்வு நீங்கி, புத்துணர்ச்சி பெறுவீர்கள். தாய்வழி ஆரோக்கியத்தில் கவனம் செலுத்துவது நல்லது.",
    "health_en": "Today you will give great importance to your mental health. Practices that bring mental peace, such as yoga and meditation, will benefit you. By taking adequate rest, physical fatigue will disappear, and you will feel rejuvenated. Paying attention to maternal health is good.",
    "lucky_number": "9",
    "lucky_color_ta": "வெண்மை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "ரிஷபம்",
    "sign_en": "Taurus",
    "date": "16-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் ரிஷப ராசிக்காரர்களே, உங்கள் மனம் அமைதியையும், உணர்வுபூர்வமான திருப்தியையும் நாடும். சந்திரன் மன அமைதி, தாய், வீடு மற்றும் உணர்ச்சி சமநிலைக்குக் காரகனாக இருப்பதால், இன்று உங்கள் கவனம் வீட்டுச் சூழல், குடும்ப உறவுகள் மற்றும் தனிப்பட்ட பாதுகாப்பு உணர்வில் குவியும். நீங்கள் பொதுவாகவே ஸ்திரத்தன்மையையும், பாதுகாப்பையும் விரும்புபவர்கள். இன்று உங்கள் வீடு ஒரு புகலிடமாக மாறும். குடும்பத்தினருடன் மகிழ்ச்சியான நேரத்தைச் செலவிடுவீர்கள். வீட்டை அழகுபடுத்துவதிலும், வசதியான சூழலை உருவாக்குவதிலும் அதிக ஆர்வம் காட்டுவீர்கள். நீண்ட நாட்களாக நிலுவையில் இருந்த வீட்டுப் பிரச்சனைகளுக்கு இன்று ஒரு தீர்வு கிடைக்கும். உங்கள் தாய் அல்லது தாய்வழி உறவினர்களுடன் அன்பான உறவு மேம்படும். அவர்களின் வழிகாட்டுதலும், ஆதரவும் உங்களுக்கு மிகுந்த பலத்தைத் தரும். உங்கள் உணர்ச்சிகளை வெளிப்படுத்துவதில் இன்று நீங்கள் மிகவும் வெளிப்படையாக இருப்பீர்கள். இது உறவுகளில் ஆழமான புரிதலை உருவாக்கும். உங்கள் துணையுடன் நல்லுரையாடி, பரஸ்பர அன்பை வளர்த்துக் கொள்வீர்கள். குழந்தைகளுக்கு நீங்கள் ஒரு நல்ல வழிகாட்டியாகவும், ஆதரவாகவும் இருப்பீர்கள். புதிய பொருட்களை வாங்குவதோ அல்லது வீட்டை மறுசீரமைப்பதோ உங்களுக்கு மகிழ்ச்சி தரும். உங்கள் உள்ளுணர்வு இன்று உங்களுக்கு சரியான பாதையைக் காட்டும். முக்கிய முடிவுகள் எடுக்கும்போது உங்கள் மனதின் குரலுக்கு செவிசாய்ப்பது நல்லது. கலை, இசை போன்ற மனதுக்கு அமைதி தரும் விஷயங்களில் ஈடுபடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். கடந்தகால நினைவுகளை அசைபோட்டு, அதிலிருந்து நல்ல அனுபவங்களைப் பெறுவீர்கள். இன்றைய நாள் முழுவதும் நீங்கள் மன அமைதியுடனும், மகிழ்ச்சியுடனும் காணப்படுவீர்கள். குடும்பத்தின் மகிழ்ச்சியே உங்களின் முதல் விருப்பமாக இருக்கும். குடும்ப உறுப்பினர்களின் தேவைகளைப் பூர்த்தி செய்வதில் நீங்கள் ஆர்வம் காட்டுவீர்கள். வீட்டின் சூழ்நிலை மிகவும் இனிமையாகவும், அமைதியாகவும் இருக்கும். இன்று நீங்கள் வீட்டிலிருந்து வேலை செய்பவராக இருந்தால், உங்கள் பணி மிகவும் சிறப்பாக அமையும். குடும்பத்தில் பெரியவர்களின் ஆசீர்வாதத்தைப் பெறுவது உங்களுக்கு மன நிம்மதியைத் தரும். உங்கள் வீட்டை ஒரு அமைதியான புகலிடமாக மாற்றுவதற்கு நீங்கள் எடுக்கும் முயற்சிகள் அனைத்தும் வெற்றியடையும். இன்று நீங்கள் சமையலறையில் புதிய முயற்சிகளில் ஈடுபடுவீர்கள். அல்லது சுவையான உணவுகளைத் தயாரிப்பதில் ஆர்வம் காட்டுவீர்கள். மொத்தத்தில், இன்று ரிஷப ராசிக்காரர்களுக்கு மன அமைதி, குடும்ப மகிழ்ச்சி, மற்றும் உணர்வுபூர்வமான திருப்தி நிறைந்த நாளாக அமையும். வீடும், குடும்பமும் இன்று உங்களின் பாதுகாப்பு அரணாக விளங்கும். குடும்பத்தில் அமைதியையும் நல்லுறவுகளையும் மேம்படுத்துவீர்கள். உங்களின் தனிப்பட்ட தேவைகள் அனைத்தும் பூர்த்தி அடையும்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Taurus natives, your mind will seek peace and emotional satisfaction. As the Moon signifies mental peace, mother, home, and emotional balance, your focus today will be on your home environment, family relationships, and a sense of personal security. You generally prefer stability and security. Today, your home will become a sanctuary. You will spend joyful time with family members. You will show great interest in beautifying your home and creating a comfortable environment. A solution will be found for pending household problems that have existed for a long time. A loving relationship with your mother or maternal relatives will improve. Their guidance and support will give you immense strength. Today, you will be very open in expressing your emotions. This will create a deeper understanding in relationships. You will have good conversations with your partner and foster mutual love. You will be a good guide and support for children. Purchasing new items or redecorating your home will bring you joy. Your intuition will show you the right path today. It is good to listen to your inner voice when making important decisions. Engaging in activities that bring mental peace, such as art and music, will rejuvenate you. You will ponder over past memories and gain good experiences from them. You will be seen with mental peace and joy throughout the day. Family happiness will be your first priority. You will show interest in fulfilling the needs of family members. The home atmosphere will be very pleasant and peaceful. If you are working from home today, your work will be very successful. Receiving the blessings of elders in the family will bring you peace of mind. All your efforts to make your home a peaceful sanctuary will succeed. Today you will engage in new culinary endeavors or show interest in preparing delicious foods. Overall, today will be a day filled with mental peace, family happiness, and emotional satisfaction for Taurus natives. Home and family will serve as your protective fortress today. You will enhance peace and good relationships in the family. All your personal needs will be fulfilled.",
    "career_ta": "பணி இடத்தில் அமைதியான சூழ்நிலை நிலவும். சக ஊழியர்களுடன் நல்லுறவு பேணுவீர்கள். வீட்டை மையமாகக் கொண்ட தொழில் செய்பவர்களுக்கு இன்று நல்ல லாபம் உண்டாகும். திட்டங்களைச் செயல்படுத்துவதில் உங்கள் நிதானமான அணுகுமுறை வெற்றி தரும். தலைமைப் பதவியில் இருப்பவர்கள் நல்ல முடிவுகளை எடுப்பார்கள்.",
    "career_en": "A peaceful atmosphere will prevail at the workplace. You will maintain good relationships with colleagues. Those who work in home-based businesses will gain good profits today. Your calm approach in implementing projects will bring success. Those in leadership positions will make good decisions.",
    "finance_ta": "நிதி நிலைமை மிகவும் சிறப்பாக இருக்கும். குடும்பத்திற்கான சேமிப்புகள் அதிகரிக்கும். வீட்டு உபயோகப் பொருட்களை வாங்குவதில் இன்று நல்ல லாபம் உண்டாகும். நீண்டகால முதலீடுகளைச் செய்வதற்கு இது ஒரு நல்ல நாள். நிதி சம்பந்தப்பட்ட விஷயங்களில் பொறுமையாக முடிவெடுப்பது நல்லது. குடும்பத்திற்கான முதலீடுகளில் கவனம் செலுத்துவீர்கள்.",
    "finance_en": "The financial situation will be very good. Family savings will increase. There will be good profits in purchasing household items today. This is a good day to make long-term investments. It is good to make financial decisions patiently. You will focus on investments for the family.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதி உடல் ஆரோக்கியத்தை மேம்படுத்தும். வீட்டின் தூய்மையிலும், ஆரோக்கியமான உணவுப் பழக்கங்களிலும் கவனம் செலுத்துவீர்கள். சத்தான உணவுகளை உட்கொள்வது உங்களுக்கு நன்மை பயக்கும். மனதை ரிலாக்ஸ் செய்யும் பயிற்சிகளில் ஈடுபடுவீர்கள்.",
    "health_en": "Physical health will be good. Mental peace will improve physical health. You will pay attention to home cleanliness and healthy eating habits. Consuming nutritious foods will benefit you. You will engage in relaxation exercises for the mind.",
    "lucky_number": "6",
    "lucky_color_ta": "இளநீலம்",
    "lucky_color_en": "Light Blue"
  },
  {
    "sign_ta": "மிதுனம்",
    "sign_en": "Gemini",
    "date": "16-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் மிதுன ராசிக்காரர்களே, உங்கள் மனது சற்று உள்முக சிந்தனையை நாடும். சந்திரன் மன அமைதி, தாய், வீடு மற்றும் உணர்ச்சி சமநிலைக்குக் காரகனாக இருப்பதால், இன்று குடும்பம், தனிப்பட்ட உணர்வுகள் மற்றும் வீட்டுச் சூழலில் உங்கள் கவனம் இருக்கும். பொதுவாகவே நீங்கள் சமூகத்தில் பழக விரும்புபவர்கள், விரைவாக தகவல்களைப் பரிமாறிக் கொள்பவர்கள். ஆனால் இன்று அந்த வெளிப்படையான தன்மை சற்று குறைந்து, ஆழ்ந்த சிந்தனையுடன் செயல்படுவீர்கள். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தாய் அல்லது தாய்வழி உறவினர்களுடன் இனிமையான உரையாடல்கள் நிகழும். அவர்களின் ஆலோசனைகளும், ஆதரவும் உங்களுக்கு மிகுந்த நன்மையை அளிக்கும். குடும்பத்தில் உள்ளவர்களுடன் நீங்கள் மனப்பூர்வமாகப் பேசி, கடந்தகால பிரச்சனைகளைத் தீர்ப்பீர்கள். வீட்டுச் சூழலை அமைதியாகவும், மகிழ்ச்சியாகவும் மாற்றுவதற்கு நீங்கள் முயற்சி செய்வீர்கள். நீண்ட நாட்களாக நிலுவையில் இருந்த வீட்டு வேலைகளை இன்று முடிப்பதற்கான வாய்ப்புகள் உண்டு. உங்கள் துணையுடன் நீங்கள் உணர்வுபூர்வமான தொடர்பை ஏற்படுத்திக் கொள்வீர்கள். குழந்தைகளுக்கு நீங்கள் ஒரு நல்ல நண்பராகவும், வழிகாட்டியாகவும் செயல்படுவீர்கள். உங்கள் உள்ளுணர்வு இன்று மிகவும் கூர்மையாக இருக்கும். முக்கிய முடிவுகள் எடுக்கும்போது, உங்கள் மனதின் குரலுக்கு செவிசாய்ப்பது நல்லது. மனதை அமைதிப்படுத்தும் செயல்களில் ஈடுபடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். உதாரணத்திற்கு, வாசிப்பு, எழுத்து அல்லது தியானம் போன்றவற்றில் ஈடுபடலாம். பழைய நினைவுகள் உங்கள் மனதில் வந்து போகலாம். அவற்றிலிருந்து நல்ல பாடங்களை கற்றுக்கொண்டு, நிகழ்காலத்தை இன்னும் சிறப்பாக அமைத்துக் கொள்ள இன்று நல்ல வாய்ப்பு அமையும். இன்று நீங்கள் தனிப்பட்ட வளர்ச்சிக்காகவும், உள்மன அமைதிக்காகவும் அதிக நேரம் செலவிடுவீர்கள். உங்கள் குடும்பத்தின் அனைத்து அம்சங்களிலும் நீங்கள் மிகுந்த கவனத்துடன் செயல்படுவீர்கள். ஒரு சில சந்தர்ப்பங்களில் உங்கள் சகோதர, சகோதரிகளுடனும் நல்லுறவு மேம்படும். வீட்டின் சூழலை மேலும் இனிமையாக்கும் வகையிலான புதிய திட்டங்களைச் செயல்படுத்துவீர்கள். குடும்பத்தில் அமைதியையும், மகிழ்ச்சியையும் நிலைநாட்டுவதற்கு நீங்கள் எடுக்கும் முயற்சிகள் அனைத்தும் வெற்றியடையும். இன்று நீங்கள் வீட்டிலிருந்து செய்யக்கூடிய பணிகளில் அதிக ஈடுபாடு காட்டுவீர்கள். மேலும், உங்கள் குடும்ப உறுப்பினர்களுக்கு ஆதரவாக நீங்கள் செயல்படுவீர்கள். சமூகத்தில் உங்கள் குடும்பத்திற்கான அங்கீகாரம் அதிகரிக்கும். குடும்பத்துடன் சுற்றுலா செல்ல அல்லது ஒரு குடும்ப விருந்தில் பங்கேற்க வாய்ப்புகள் உண்டாகலாம். இந்த நாள் உங்களுக்கு மன அமைதியையும், குடும்ப மகிழ்ச்சியையும் அளிக்கும். உங்கள் உணர்ச்சிகளை வெளிப்படுத்துவதில் நீங்கள் மிகவும் வெளிப்படையாக இருப்பீர்கள். இது உறவுகளை மேம்படுத்தும். இன்றைய நாள் உங்களுக்கு நல்லுணர்வுகளையும், அமைதியையும் தரும்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Gemini natives, your mind will seek some introspection. As the Moon signifies mental peace, mother, home, and emotional balance, your focus today will be on family, personal emotions, and the home environment. Generally, you are sociable and quick to exchange information. But today, that outgoing nature will be slightly reduced, and you will act with deep thought. Pleasant conversations will occur with family members, especially with your mother or maternal relatives. Their advice and support will greatly benefit you. You will speak from the heart with family members and resolve past issues. You will try to make the home environment peaceful and joyful. There are opportunities today to complete pending household tasks that have existed for a long time. You will establish an emotional connection with your partner. You will act as a good friend and guide for children. Your intuition will be very sharp today. When making important decisions, it is good to listen to your inner voice. Engaging in activities that calm the mind will rejuvenate you. For example, you can engage in reading, writing, or meditation. Old memories may come and go in your mind. Today presents a good opportunity to learn valuable lessons from them and build a better present. Today you will spend more time for personal growth and inner peace. You will act with great attention in all aspects of your family. In some instances, good relationships with your siblings will also improve. You will implement new plans to further sweeten the home environment. All your efforts to establish peace and happiness in the family will succeed. Today you will show great involvement in tasks that can be done from home. Furthermore, you will act in support of your family members. The recognition for your family in society will increase. There may be opportunities to go on a family trip or participate in a family gathering. This day will bring you mental peace and family happiness. You will be very open in expressing your emotions. This will improve relationships. Today will bring you good feelings and peace.",
    "career_ta": "பணி செய்யும் இடத்தில் உங்கள் உள்மனத் தெளிவு உங்களுக்கு நல்ல வழிகாட்டும். சக ஊழியர்களுடன் நீங்கள் இணக்கமாகப் பழகுவீர்கள். கருத்துப் பரிமாற்றங்களில் கவனத்துடன் இருப்பதன் மூலம் தவறான புரிதல்களைத் தவிர்க்கலாம். வீட்டை மையமாகக் கொண்ட தொழில்கள் நல்ல வளர்ச்சி பெறும். உங்கள் வார்த்தைகளில் மென்மை இருக்கும்.",
    "career_en": "At your workplace, your inner clarity will guide you well. You will interact harmoniously with colleagues. By being careful in communication, you can avoid misunderstandings. Home-based businesses will see good growth. There will be gentleness in your words.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். குடும்பச் செலவுகள் அதிகரிக்கும். ஆனால் அவை நல்ல காரணங்களுக்காகவே இருக்கும். சேமிப்பை அதிகரிப்பதற்கான வாய்ப்புகள் உண்டு. நிதி தொடர்பான முக்கிய முடிவுகளை எடுக்கும்போது நிதானத்துடன் செயல்படுவது நல்லது. குடும்பத்திற்கான முதலீடுகளில் கவனம் செலுத்துவீர்கள்.",
    "finance_en": "The financial situation will be stable. Family expenses will increase, but they will be for good reasons. There are opportunities to increase savings. It is good to act with composure when making important financial decisions. You will focus on investments for the family.",
    "health_ta": "உங்கள் மன ஆரோக்கியத்தில் கவனம் செலுத்துவது மிகவும் முக்கியம். மனதை அமைதியாக வைத்திருக்க யோகா, தியானம் போன்ற பயிற்சிகள் உதவும். மன அழுத்தத்தைத் தவிர்க்க, போதிய ஓய்வு எடுப்பது அவசியம். ஆரோக்கியமான வீட்டு உணவுகளை உட்கொள்வது நல்லது. தாய்வழி ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும்.",
    "health_en": "Paying attention to your mental health is very important. Practices like yoga and meditation will help keep your mind peaceful. To avoid stress, adequate rest is essential. Consuming healthy home-cooked meals is good. You should pay attention to maternal health.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "16-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் கடக ராசிக்காரர்களே, சந்திரன் உங்களின் ராசி நாதன் என்பதால், இன்று உங்களுக்கு மிகவும் சிறப்பு வாய்ந்த நாள். சந்திரனின் முழுமையான ஆற்றல் இன்று உங்களுக்குக் கிடைக்கும். மனம் அமைதி, தாய், வீடு மற்றும் உணர்ச்சி சமநிலையின் காரகனாக சந்திரன் இருப்பதால், உங்கள் கவனம் முழுவதும் இந்த விஷயங்களிலேயே இருக்கும். உங்கள் உள்ளுணர்வு இன்று உச்சத்தில் இருக்கும். எந்த ஒரு செயலிலும் உங்கள் மனதின் குரலுக்கு செவிசாய்த்து செயல்படுவது மிகுந்த நன்மையை அளிக்கும். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தாய் அல்லது தாய்வழி உறவினர்களுடன் ஆழமான உணர்வுபூர்வமான பிணைப்பு ஏற்படும். அவர்களின் ஆசியும், ஆதரவும் உங்களுக்கு மிகுந்த பலத்தைத் தரும். வீட்டில் மகிழ்ச்சியான சூழ்நிலை நிலவும். நீங்கள் வீட்டை அழகுபடுத்துவதிலோ அல்லது குடும்பத்தினருடன் நேரத்தைச் செலவிடுவதிலோ அதிக ஆர்வம் காட்டுவீர்கள். நீண்ட நாட்களாக நீங்கள் செய்ய நினைத்த வீட்டு வேலைகள் இன்று வெற்றிகரமாக முடிவடையும். உங்கள் துணையுடன் நீங்கள் ஆழமான அன்பைப் பரிமாறிக் கொள்வீர்கள். குழந்தைகளுக்கு நீங்கள் சிறந்த வழிகாட்டியாகவும், ஆதரவாகவும் இருப்பீர்கள். புதிய திட்டங்கள் அல்லது குடும்ப நிகழ்வுகள் குறித்து நீங்கள் திட்டமிடலாம். வீட்டை மையமாகக் கொண்ட செயல்பாடுகளில் நீங்கள் அதிக ஆர்வம் காட்டுவீர்கள். கலை, இசை, மற்றும் இயற்கையுடன் இணைந்த செயல்களில் ஈடுபடுவது உங்களுக்கு மன அமைதியையும், புத்துணர்ச்சியையும் அளிக்கும். கடந்தகால நினைவுகள் உங்கள் மனதில் வந்து போகலாம். அவற்றிலிருந்து நல்ல பாடங்களை கற்றுக்கொண்டு, நிகழ்காலத்தை மேலும் சிறப்பாக அமைத்துக் கொள்ள இது ஒரு நல்ல வாய்ப்பு. உங்கள் உணர்ச்சிகளை ஆரோக்கியமான வழியில் வெளிப்படுத்துவதன் மூலம் உறவுகளை மேலும் வலுப்படுத்த முடியும். இன்று உங்கள் வீட்டுச் சூழல் அமைதியாகவும், மகிழ்ச்சியாகவும் இருக்கும். குடும்பத்தில் ஒரு இனிமையான நிகழ்வு அல்லது ஒரு நல்ல செய்தி வந்து சேரலாம். நீங்கள் வீட்டு வேலைகளில் மிகவும் ஈடுபாட்டுடன் இருப்பீர்கள். குடும்ப உறுப்பினர்களின் ஆதரவும், அன்பும் உங்களைச் சூழ்ந்து இருக்கும். இது உங்களுக்கு ஒரு பாதுகாப்பான உணர்வைத் தரும். வீட்டை மையமாகக் கொண்ட ஒரு முக்கிய முடிவை இன்று நீங்கள் எடுக்க நேரிடலாம். அது உங்களுக்கு சாதகமாக அமையும். உறவினர்களுடனான சந்திப்புகள் மகிழ்ச்சியை அளிக்கும். குறிப்பாக தாய்வழி உறவினர்களுடன் நீங்கள் நல்லுரையாடலில் ஈடுபடுவீர்கள். குடும்பத்தில் அமைதியையும், மகிழ்ச்சியையும் மேம்படுத்துவதற்கு நீங்கள் எடுக்கும் முயற்சிகள் அனைத்தும் வெற்றியடையும். இன்று நீங்கள் வீட்டுப் பொருட்களை வாங்குவதிலோ அல்லது வீட்டை மேம்படுத்துவதிலோ அதிக ஆர்வம் காட்டுவீர்கள். உங்கள் உள்ளுணர்வு இன்று உங்களுக்கு சரியான வழியைக் காட்டும். மன அமைதியும், குடும்ப மகிழ்ச்சியும் நிறைந்த நாளாக இன்று அமையும். இன்றைய நாள் உங்களுக்கு மன அமைதியையும், நல்லுறவுகளையும் தரும். நீங்கள் செய்யும் காரியங்கள் அனைத்தும் வெற்றியடையும்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Cancer natives, as the Moon is your ruling planet, today is a very special day for you. The full energy of the Moon will be available to you today. As the Moon signifies mental peace, mother, home, and emotional balance, your entire focus will be on these matters. Your intuition will be at its peak today. Acting by listening to your inner voice in any task will bring great benefits. A deep emotional bond will form with family members, especially with your mother or maternal relatives. Their blessings and support will give you immense strength. A joyful atmosphere will prevail at home. You will show great interest in beautifying your home or spending time with family members. Household tasks that you had intended to do for a long time will be successfully completed today. You will exchange deep love with your partner. You will be an excellent guide and support for children. You may plan new projects or family events. You will show great interest in home-centric activities. Engaging in activities connected with art, music, and nature will bring you mental peace and rejuvenation. Past memories may come and go in your mind. This is a good opportunity to learn valuable lessons from them and build a better present. By expressing your emotions in a healthy way, you can strengthen relationships even further. Today, your home environment will be peaceful and joyful. A pleasant event or good news may arrive in the family. You will be very involved in household chores. The support and love of family members will surround you. This will give you a sense of security. You may have to make an important home-centric decision today, which will be favorable for you. Meetings with relatives will bring joy. You will have good conversations, especially with maternal relatives. All your efforts to improve peace and happiness in the family will succeed. Today you will show great interest in purchasing household items or improving your home. Your intuition will show you the right path today. Today will be a day full of mental peace and family happiness. Today will bring you peace of mind and good relationships. All your endeavors will succeed.",
    "career_ta": "பணி இடத்தில் உங்கள் உள்மனம் உங்களுக்கு நல்ல வழிகாட்டும். சக ஊழியர்களுடன் அன்பான உறவு நிலவும். வீட்டை மையமாகக் கொண்ட தொழில் அல்லது சேவைகளில் ஈடுபடுபவர்களுக்கு இன்று நல்ல வளர்ச்சி இருக்கும். உங்கள் உணர்ச்சிபூர்வமான நுண்ணறிவு பணியிடத்தில் நல்ல முடிவுகளை எடுக்க உதவும். புதிய பொறுப்புகள் கிடைக்கும்.",
    "career_en": "At your workplace, your inner self will guide you well. A loving relationship will prevail with colleagues. Those involved in home-based businesses or services will see good growth today. Your emotional intelligence will help you make good decisions at work. You will receive new responsibilities.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். குடும்பத்திற்காக செலவு செய்வீர்கள், அவை நல்ல முதலீடுகளாக மாறும். சேமிப்பை அதிகரிக்கும் முயற்சிகள் வெற்றியடையும். வீட்டு மேம்பாட்டுக்கான முதலீடுகள் நன்மை பயக்கும். நிதி சம்பந்தப்பட்ட விஷயங்களில் இன்று நல்ல திட்டமிடுதலுடன் செயல்படுவீர்கள்.",
    "finance_en": "The financial situation will be stable. You will spend for the family, and these will turn into good investments. Efforts to increase savings will succeed. Investments for home improvement will be beneficial. You will act with good planning in financial matters today.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதி உடலுக்கு புத்துணர்ச்சி அளிக்கும். வீட்டின் சுகாதாரத்திலும், ஆரோக்கியமான உணவுப் பழக்கங்களிலும் நீங்கள் கவனம் செலுத்துவீர்கள். நீங்களே சமைத்து சாப்பிடுவது உடலுக்கு நல்லது. மனதை அமைதிப்படுத்தும் பயிற்சிகள் மிகுந்த நன்மை தரும். தாய்வழி ஆரோக்கியத்தில் கவனம் தேவை.",
    "health_en": "Physical health will be good. Mental peace will rejuvenate the body. You will pay attention to home hygiene and healthy eating habits. Cooking and eating yourself is good for the body. Mind-calming exercises will be very beneficial. Attention to maternal health is needed.",
    "lucky_number": "2",
    "lucky_color_ta": "வெள்ளை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "சிம்மம்",
    "sign_en": "Leo",
    "date": "16-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் சிம்ம ராசிக்காரர்களே, உங்கள் மனம் சற்று உள்முகமாகச் செயல்படும். சந்திரன் மன அமைதி, தாய், வீடு மற்றும் உணர்ச்சி சமநிலைக்குக் காரகனாக இருப்பதால், இன்று உங்கள் கவனம் வீடு, குடும்பம், தனிப்பட்ட உணர்வுகள் மற்றும் உள்மன அமைதியில் குவியும். பொதுவாகவே நீங்கள் வெளிப்படையானவர்கள், தலைமைப் பண்பு கொண்டவர்கள். ஆனால் இன்று உங்கள் ஆளுமை சற்று மென்மையாகவும், கருணையுடனும் வெளிப்படும். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தாய் அல்லது தாய்வழி உறவினர்களுடன் அன்பான உரையாடல்கள் நிகழலாம். அவர்களின் ஆலோசனைகளும், ஆதரவும் உங்களுக்கு மிகுந்த பலத்தைத் தரும். வீட்டில் மகிழ்ச்சியான சூழ்நிலை நிலவும். வீட்டை அழகுபடுத்துவதிலோ, அல்லது குடும்பத்தினருடன் இனிமையான நேரத்தைச் செலவிடுவதிலோ ஆர்வம் காட்டுவீர்கள். நீண்ட நாட்களாக நிலுவையில் இருந்த வீட்டு வேலைகளை இன்று வெற்றிகரமாக முடிப்பீர்கள். உங்கள் துணையுடன் நீங்கள் ஆழமான உணர்வுகளைப் பரிமாறிக் கொள்வீர்கள். குழந்தைகளுக்கு நீங்கள் ஒரு நல்ல வழிகாட்டியாகவும், ஆதரவாகவும் இருப்பீர்கள். உங்கள் உள்ளுணர்வு இன்று மிகவும் கூர்மையாக இருக்கும். முக்கிய முடிவுகள் எடுக்கும்போது, உங்கள் மனதின் குரலுக்கு செவிசாய்ப்பது நல்லது. கலை, இசை அல்லது தியானம் போன்ற மனதை அமைதிப்படுத்தும் செயல்களில் ஈடுபடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். கடந்தகால நினைவுகள் உங்கள் மனதில் வந்து போகலாம். அவற்றிலிருந்து நல்ல பாடங்களை கற்றுக்கொண்டு, நிகழ்காலத்தை இன்னும் சிறப்பாக அமைத்துக் கொள்ள இன்று நல்லதொரு வாய்ப்பு அமையும். இன்று நீங்கள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கும், மன அமைதிக்கும் அதிக நேரம் செலவிடுவீர்கள். உங்கள் குடும்பத்தின் அனைத்து அம்சங்களிலும் நீங்கள் மிகுந்த கவனத்துடன் செயல்படுவீர்கள். குடும்பத்தின் உறுப்பினர்களுடன் நீங்கள் இனிமையான உரையாடலில் ஈடுபடுவீர்கள். இது உங்கள் உறவுகளை வலுப்படுத்தும். வீட்டை மையமாகக் கொண்ட திட்டங்களுக்கு இன்று நீங்கள் சரியான அடித்தளத்தை அமைப்பீர்கள். உங்கள் வீட்டுச் சூழலை மேலும் இனிமையாக்கும் வகையிலான புதிய பொருட்களை வாங்குவீர்கள். குடும்பத்தில் உள்ள பெரியவர்களின் ஆசிர்வாதத்தைப் பெறுவது இன்று உங்களுக்கு மன நிம்மதியைத் தரும். குடும்பத்தில் அமைதியையும், மகிழ்ச்சியையும் மேம்படுத்துவதற்கு நீங்கள் எடுக்கும் முயற்சிகள் அனைத்தும் வெற்றியடையும். இன்று நீங்கள் வீட்டிலிருந்து செய்யக்கூடிய பணிகளில் அதிக ஈடுபாடு காட்டுவீர்கள். மேலும், உங்கள் குடும்ப உறுப்பினர்களுக்கு ஆதரவாக நீங்கள் செயல்படுவீர்கள். சமூகத்தில் உங்கள் குடும்பத்திற்கான அங்கீகாரம் அதிகரிக்கும். குடும்பத்துடன் சுற்றுலா செல்ல அல்லது ஒரு குடும்ப விருந்தில் பங்கேற்க வாய்ப்புகள் உண்டாகலாம். இந்த நாள் உங்களுக்கு மன அமைதியையும், குடும்ப மகிழ்ச்சியையும் அளிக்கும். உங்கள் உணர்ச்சிகளை வெளிப்படுத்துவதில் நீங்கள் மிகவும் வெளிப்படையாக இருப்பீர்கள். இது உறவுகளை மேம்படுத்தும். இன்றைய நாள் உங்களுக்கு நல்லுணர்வுகளையும், அமைதியையும் தரும். இன்றைய நாள் உங்களின் குடும்ப மகிழ்ச்சிக்கு உதவும்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Leo natives, your mind will be somewhat introspective. As the Moon signifies mental peace, mother, home, and emotional balance, your focus today will be on home, family, personal emotions, and inner peace. Generally, you are outgoing and possess leadership qualities. But today, your personality will manifest with more gentleness and compassion. Loving conversations may occur with family members, especially with your mother or maternal relatives. Their advice and support will give you immense strength. A joyful atmosphere will prevail at home. You will show interest in beautifying your home or spending pleasant time with family members. Household tasks that have been pending for a long time will be successfully completed today. You will exchange deep emotions with your partner. You will be a good guide and support for children. Your intuition will be very sharp today. When making important decisions, it is good to listen to your inner voice. Engaging in activities that calm the mind, such as art, music, or meditation, will rejuvenate you. Past memories may come and go in your mind. Today presents a good opportunity to learn valuable lessons from them and build a better present. Today you will spend more time for your personal growth and peace of mind. You will act with great attention in all aspects of your family. You will engage in pleasant conversations with family members. This will strengthen your relationships. You will lay a strong foundation for home-centric projects today. You will purchase new items to further sweeten your home environment. Receiving the blessings of elders in the family will bring you peace of mind today. All your efforts to improve peace and happiness in the family will succeed. Today you will show great involvement in tasks that can be done from home. Furthermore, you will act in support of your family members. The recognition for your family in society will increase. There may be opportunities to go on a family trip or participate in a family gathering. This day will bring you mental peace and family happiness. You will be very open in expressing your emotions. This will improve relationships. Today will bring you good feelings and peace. Today will help with your family happiness.",
    "career_ta": "பணி இடத்தில் உங்கள் தலைமைப் பண்பு மென்மையுடன் வெளிப்படும். சக ஊழியர்களுடன் இணக்கமான உறவு நிலவும். குழுப்பணிகளில் நீங்கள் சிறந்த பங்களிப்பை வழங்குவீர்கள். உங்கள் உணர்ச்சிபூர்வமான அணுகுமுறை பணியிடத்தில் நல்ல முடிவுகளை எடுக்க உதவும். புதிய திட்டங்களைச் செயல்படுத்துவதில் உங்கள் உள்ளுணர்வு வழிகாட்டும். உங்கள் பணிக்கு நல்ல அங்கீகாரம் கிடைக்கும்.",
    "career_en": "At your workplace, your leadership quality will manifest with gentleness. Harmonious relationships will prevail with colleagues. You will provide excellent contributions in team projects. Your emotional approach will help you make good decisions at work. Your intuition will guide you in implementing new projects. Your work will receive good recognition.",
    "finance_ta": "நிதிநிலைமை சீராக இருக்கும். குடும்பத்திற்கான சேமிப்புகள் அதிகரிக்கும். வீட்டு உபயோகப் பொருட்களை வாங்குவதில் இன்று நல்ல லாபம் உண்டாகும். நீண்டகால முதலீடுகளைச் செய்வதற்கு இது ஒரு நல்ல நாள். நிதி சம்பந்தப்பட்ட விஷயங்களில் பொறுமையாக முடிவெடுப்பது நல்லது. வீட்டை மேம்படுத்துவதற்கான செலவுகள் லாபகரமானதாக அமையும்.",
    "finance_en": "The financial situation will be stable. Family savings will increase. There will be good profits in purchasing household items today. This is a good day to make long-term investments. It is good to make financial decisions patiently. Expenses for home improvement will be profitable.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதி உடல் ஆரோக்கியத்தை மேம்படுத்தும். வீட்டின் தூய்மையிலும், ஆரோக்கியமான உணவுப் பழக்கங்களிலும் கவனம் செலுத்துவீர்கள். சத்தான உணவுகளை உட்கொள்வது உங்களுக்கு நன்மை பயக்கும். மனதை ரிலாக்ஸ் செய்யும் பயிற்சிகளில் ஈடுபடுவீர்கள். தாய்வழி ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும்.",
    "health_en": "Physical health will be good. Mental peace will improve physical health. You will pay attention to home cleanliness and healthy eating habits. Consuming nutritious foods will benefit you. You will engage in relaxation exercises for the mind. You should pay attention to maternal health.",
    "lucky_number": "1",
    "lucky_color_ta": "பொன் நிறம்",
    "lucky_color_en": "Golden"
  },
  {
    "sign_ta": "கன்னி",
    "sign_en": "Virgo",
    "date": "16-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் கன்னி ராசிக்காரர்களே, உங்கள் மனம் அமைதியையும், உள்மனத் தெளிவையும் நாடும். சந்திரன் மன அமைதி, தாய், வீடு மற்றும் உணர்ச்சி சமநிலைக்குக் காரகனாக இருப்பதால், இன்று உங்கள் கவனம் வீடு, குடும்பம், தனிப்பட்ட உணர்வுகள் மற்றும் உள்மன அமைதியில் குவியும். பொதுவாகவே நீங்கள் பகுத்தறிவு மிக்கவர்கள், விவரங்களில் கவனம் செலுத்துபவர்கள். ஆனால் இன்று உங்கள் அணுகுமுறை சற்று மென்மையாகவும், உணர்வுபூர்வமாகவும் இருக்கும். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தாய் அல்லது தாய்வழி உறவினர்களுடன் அன்பான உரையாடல்கள் நிகழலாம். அவர்களின் ஆலோசனைகளும், ஆதரவும் உங்களுக்கு மிகுந்த பலத்தைத் தரும். வீட்டில் மகிழ்ச்சியான சூழ்நிலை நிலவும். வீட்டை அழகுபடுத்துவதிலோ, அல்லது குடும்பத்தினருடன் இனிமையான நேரத்தைச் செலவிடுவதிலோ ஆர்வம் காட்டுவீர்கள். நீண்ட நாட்களாக நிலுவையில் இருந்த வீட்டு வேலைகளை இன்று வெற்றிகரமாக முடிப்பீர்கள். உங்கள் துணையுடன் நீங்கள் ஆழமான உணர்வுகளைப் பரிமாறிக் கொள்வீர்கள். குழந்தைகளுக்கு நீங்கள் ஒரு நல்ல வழிகாட்டியாகவும், ஆதரவாகவும் இருப்பீர்கள். உங்கள் உள்ளுணர்வு இன்று மிகவும் கூர்மையாக இருக்கும். முக்கிய முடிவுகள் எடுக்கும்போது, உங்கள் மனதின் குரலுக்கு செவிசாய்ப்பது நல்லது. கலை, இசை அல்லது தியானம் போன்ற மனதை அமைதிப்படுத்தும் செயல்களில் ஈடுபடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். கடந்தகால நினைவுகள் உங்கள் மனதில் வந்து போகலாம். அவற்றிலிருந்து நல்ல பாடங்களை கற்றுக்கொண்டு, நிகழ்காலத்தை இன்னும் சிறப்பாக அமைத்துக் கொள்ள இன்று நல்லதொரு வாய்ப்பு அமையும். இன்று நீங்கள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கும், மன அமைதிக்கும் அதிக நேரம் செலவிடுவீர்கள். உங்கள் குடும்பத்தின் அனைத்து அம்சங்களிலும் நீங்கள் மிகுந்த கவனத்துடன் செயல்படுவீர்கள். குடும்பத்தின் உறுப்பினர்களுடன் நீங்கள் இனிமையான உரையாடலில் ஈடுபடுவீர்கள். இது உங்கள் உறவுகளை வலுப்படுத்தும். வீட்டை மையமாகக் கொண்ட திட்டங்களுக்கு இன்று நீங்கள் சரியான அடித்தளத்தை அமைப்பீர்கள். உங்கள் வீட்டுச் சூழலை மேலும் இனிமையாக்கும் வகையிலான புதிய பொருட்களை வாங்குவீர்கள். குடும்பத்தில் உள்ள பெரியவர்களின் ஆசிர்வாதத்தைப் பெறுவது இன்று உங்களுக்கு மன நிம்மதியைத் தரும். குடும்பத்தில் அமைதியையும், மகிழ்ச்சியையும் மேம்படுத்துவதற்கு நீங்கள் எடுக்கும் முயற்சிகள் அனைத்தும் வெற்றியடையும். இன்று நீங்கள் வீட்டிலிருந்து செய்யக்கூடிய பணிகளில் அதிக ஈடுபாடு காட்டுவீர்கள். மேலும், உங்கள் குடும்ப உறுப்பினர்களுக்கு ஆதரவாக நீங்கள் செயல்படுவீர்கள். சமூகத்தில் உங்கள் குடும்பத்திற்கான அங்கீகாரம் அதிகரிக்கும். குடும்பத்துடன் சுற்றுலா செல்ல அல்லது ஒரு குடும்ப விருந்தில் பங்கேற்க வாய்ப்புகள் உண்டாகலாம். இந்த நாள் உங்களுக்கு மன அமைதியையும், குடும்ப மகிழ்ச்சியையும் அளிக்கும். உங்கள் உணர்ச்சிகளை வெளிப்படுத்துவதில் நீங்கள் மிகவும் வெளிப்படையாக இருப்பீர்கள். இது உறவுகளை மேம்படுத்தும். இன்றைய நாள் உங்களுக்கு நல்லுணர்வுகளையும், அமைதியையும் தரும். உங்கள் சிந்தனைகளில் ஒரு தெளிவு பிறக்கும்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Virgo natives, your mind will seek peace and inner clarity. As the Moon signifies mental peace, mother, home, and emotional balance, your focus today will be on home, family, personal emotions, and inner peace. Generally, you are rational and pay attention to details. But today, your approach will be somewhat gentler and more emotional. Loving conversations may occur with family members, especially with your mother or maternal relatives. Their advice and support will give you immense strength. A joyful atmosphere will prevail at home. You will show interest in beautifying your home or spending pleasant time with family members. Household tasks that have been pending for a long time will be successfully completed today. You will exchange deep emotions with your partner. You will be a good guide and support for children. Your intuition will be very sharp today. When making important decisions, it is good to listen to your inner voice. Engaging in activities that calm the mind, such as art, music, or meditation, will rejuvenate you. Past memories may come and go in your mind. Today presents a good opportunity to learn valuable lessons from them and build a better present. Today you will spend more time for your personal growth and peace of mind. You will act with great attention in all aspects of your family. You will engage in pleasant conversations with family members. This will strengthen your relationships. You will lay a strong foundation for home-centric projects today. You will purchase new items to further sweeten your home environment. Receiving the blessings of elders in the family will bring you peace of mind today. All your efforts to improve peace and happiness in the family will succeed. Today you will show great involvement in tasks that can be done from home. Furthermore, you will act in support of your family members. The recognition for your family in society will increase. There may be opportunities to go on a family trip or participate in a family gathering. This day will bring you mental peace and family happiness. You will be very open in expressing your emotions. This will improve relationships. Today will bring you good feelings and peace. A clarity will emerge in your thoughts.",
    "career_ta": "பணி இடத்தில் உங்கள் கவனமும், பொறுமையும் பாராட்டு பெறும். சக ஊழியர்களுடன் நல்லுறவு பேணுவீர்கள். குழுப்பணிகளில் நீங்கள் சிறந்த பங்களிப்பை வழங்குவீர்கள். வீட்டை மையமாகக் கொண்ட தொழில் அல்லது சேவைகளில் ஈடுபடுபவர்களுக்கு இன்று நல்ல வளர்ச்சி இருக்கும். உங்கள் பணிக்கு நல்ல அங்கீகாரம் கிடைக்கும்.",
    "career_en": "At your workplace, your attention and patience will be praised. You will maintain good relationships with colleagues. You will provide excellent contributions in team projects. Those involved in home-based businesses or services will see good growth today. Your work will receive good recognition.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். குடும்பத்திற்கான சேமிப்புகள் அதிகரிக்கும். வீட்டு உபயோகப் பொருட்களை வாங்குவதில் இன்று நல்ல லாபம் உண்டாகும். நீண்டகால முதலீடுகளைச் செய்வதற்கு இது ஒரு நல்ல நாள். நிதி சம்பந்தப்பட்ட விஷயங்களில் பொறுமையாக முடிவெடுப்பது நல்லது. வீட்டை மேம்படுத்துவதற்கான செலவுகள் லாபகரமானதாக அமையும்.",
    "finance_en": "The financial situation will be stable. Family savings will increase. There will be good profits in purchasing household items today. This is a good day to make long-term investments. It is good to make financial decisions patiently. Expenses for home improvement will be profitable.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதி உடல் ஆரோக்கியத்தை மேம்படுத்தும். வீட்டின் தூய்மையிலும், ஆரோக்கியமான உணவுப் பழக்கங்களிலும் கவனம் செலுத்துவீர்கள். சத்தான உணவுகளை உட்கொள்வது உங்களுக்கு நன்மை பயக்கும். மனதை ரிலாக்ஸ் செய்யும் பயிற்சிகளில் ஈடுபடுவீர்கள். தாய்வழி ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும்.",
    "health_en": "Physical health will be good. Mental peace will improve physical health. You will pay attention to home cleanliness and healthy eating habits. Consuming nutritious foods will benefit you. You will engage in relaxation exercises for the mind. You should pay attention to maternal health.",
    "lucky_number": "5",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "16-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் துலாம் ராசிக்காரர்களே, உங்கள் மனம் அமைதியையும், இணக்கத்தையும் நாடும். சந்திரன் மன அமைதி, தாய், வீடு மற்றும் உணர்ச்சி சமநிலைக்குக் காரகனாக இருப்பதால், இன்று உங்கள் கவனம் வீடு, குடும்பம், உறவுகள் மற்றும் தனிப்பட்ட மன அமைதியில் குவியும். பொதுவாகவே நீங்கள் சமநிலையையும், அழகையும் விரும்புபவர்கள். இன்று உங்கள் வீடு ஒரு அமைதியான புகலிடமாக மாறும். குடும்பத்தினருடன் மகிழ்ச்சியான நேரத்தைச் செலவிடுவீர்கள். வீட்டை அழகுபடுத்துவதிலும், வசதியான சூழலை உருவாக்குவதிலும் அதிக ஆர்வம் காட்டுவீர்கள். நீண்ட நாட்களாக நிலுவையில் இருந்த வீட்டுப் பிரச்சனைகளுக்கு இன்று ஒரு தீர்வு கிடைக்கும். உங்கள் தாய் அல்லது தாய்வழி உறவினர்களுடன் அன்பான உறவு மேம்படும். அவர்களின் வழிகாட்டுதலும், ஆதரவும் உங்களுக்கு மிகுந்த பலத்தைத் தரும். உங்கள் உணர்ச்சிகளை வெளிப்படுத்துவதில் இன்று நீங்கள் மிகவும் வெளிப்படையாக இருப்பீர்கள். இது உறவுகளில் ஆழமான புரிதலை உருவாக்கும். உங்கள் துணையுடன் நல்லுரையாடி, பரஸ்பர அன்பை வளர்த்துக் கொள்வீர்கள். குழந்தைகளுக்கு நீங்கள் ஒரு நல்ல வழிகாட்டியாகவும், ஆதரவாகவும் இருப்பீர்கள். புதிய பொருட்களை வாங்குவதோ அல்லது வீட்டை மறுசீரமைப்பதோ உங்களுக்கு மகிழ்ச்சி தரும். உங்கள் உள்ளுணர்வு இன்று உங்களுக்கு சரியான பாதையைக் காட்டும். முக்கிய முடிவுகள் எடுக்கும்போது உங்கள் மனதின் குரலுக்கு செவிசாய்ப்பது நல்லது. கலை, இசை போன்ற மனதுக்கு அமைதி தரும் விஷயங்களில் ஈடுபடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். கடந்தகால நினைவுகளை அசைபோட்டு, அதிலிருந்து நல்ல அனுபவங்களைப் பெறுவீர்கள். இன்றைய நாள் முழுவதும் நீங்கள் மன அமைதியுடனும், மகிழ்ச்சியுடனும் காணப்படுவீர்கள். குடும்பத்தின் மகிழ்ச்சியே உங்களின் முதல் விருப்பமாக இருக்கும். குடும்ப உறுப்பினர்களின் தேவைகளைப் பூர்த்தி செய்வதில் நீங்கள் ஆர்வம் காட்டுவீர்கள். வீட்டின் சூழ்நிலை மிகவும் இனிமையாகவும், அமைதியாகவும் இருக்கும். இன்று நீங்கள் வீட்டிலிருந்து வேலை செய்பவராக இருந்தால், உங்கள் பணி மிகவும் சிறப்பாக அமையும். குடும்பத்தில் பெரியவர்களின் ஆசீர்வாதத்தைப் பெறுவது உங்களுக்கு மன நிம்மதியைத் தரும். உங்கள் வீட்டை ஒரு அமைதியான புகலிடமாக மாற்றுவதற்கு நீங்கள் எடுக்கும் முயற்சிகள் அனைத்தும் வெற்றியடையும். இன்று நீங்கள் சமையலறையில் புதிய முயற்சிகளில் ஈடுபடுவீர்கள். அல்லது சுவையான உணவுகளைத் தயாரிப்பதில் ஆர்வம் காட்டுவீர்கள். மொத்தத்தில், இன்று துலாம் ராசிக்காரர்களுக்கு மன அமைதி, குடும்ப மகிழ்ச்சி, மற்றும் உணர்வுபூர்வமான திருப்தி நிறைந்த நாளாக அமையும். வீடும், குடும்பமும் இன்று உங்களின் பாதுகாப்பு அரணாக விளங்கும். குடும்பத்தில் அமைதியையும் நல்லுறவுகளையும் மேம்படுத்துவீர்கள். உங்களின் தனிப்பட்ட தேவைகள் அனைத்தும் பூர்த்தி அடையும். உறவுகளின் முக்கியத்துவத்தை உணர்வீர்கள்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Libra natives, your mind will seek peace and harmony. As the Moon signifies mental peace, mother, home, and emotional balance, your focus today will be on home, family, relationships, and personal peace of mind. Generally, you prefer balance and beauty. Today, your home will become a peaceful sanctuary. You will spend joyful time with family members. You will show great interest in beautifying your home and creating a comfortable environment. A solution will be found for pending household problems that have existed for a long time. A loving relationship with your mother or maternal relatives will improve. Their guidance and support will give you immense strength. Today, you will be very open in expressing your emotions. This will create a deeper understanding in relationships. You will have good conversations with your partner and foster mutual love. You will be a good guide and support for children. Purchasing new items or redecorating your home will bring you joy. Your intuition will show you the right path today. It is good to listen to your inner voice when making important decisions. Engaging in activities that bring mental peace, such as art and music, will rejuvenate you. You will ponder over past memories and gain good experiences from them. You will be seen with mental peace and joy throughout the day. Family happiness will be your first priority. You will show interest in fulfilling the needs of family members. The home atmosphere will be very pleasant and peaceful. If you are working from home today, your work will be very successful. Receiving the blessings of elders in the family will bring you peace of mind. All your efforts to make your home a peaceful sanctuary will succeed. Today you will engage in new culinary endeavors or show interest in preparing delicious foods. Overall, today will be a day filled with mental peace, family happiness, and emotional satisfaction for Libra natives. Home and family will serve as your protective fortress today. You will enhance peace and good relationships in the family. All your personal needs will be fulfilled. You will realize the importance of relationships.",
    "career_ta": "பணி இடத்தில் உங்கள் இணக்கமான அணுகுமுறை பாராட்டு பெறும். சக ஊழியர்களுடன் நல்லுறவு பேணுவீர்கள். குழுப்பணிகளில் நீங்கள் சிறந்த பங்களிப்பை வழங்குவீர்கள். வீட்டை மையமாகக் கொண்ட தொழில் அல்லது சேவைகளில் ஈடுபடுபவர்களுக்கு இன்று நல்ல வளர்ச்சி இருக்கும். உங்கள் பணிக்கு நல்ல அங்கீகாரம் கிடைக்கும். சமநிலையான முடிவுகளை எடுப்பீர்கள்.",
    "career_en": "At your workplace, your harmonious approach will be praised. You will maintain good relationships with colleagues. You will provide excellent contributions in team projects. Those involved in home-based businesses or services will see good growth today. Your work will receive good recognition. You will make balanced decisions.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். குடும்பத்திற்கான சேமிப்புகள் அதிகரிக்கும். வீட்டு உபயோகப் பொருட்களை வாங்குவதில் இன்று நல்ல லாபம் உண்டாகும். நீண்டகால முதலீடுகளைச் செய்வதற்கு இது ஒரு நல்ல நாள். நிதி சம்பந்தப்பட்ட விஷயங்களில் பொறுமையாக முடிவெடுப்பது நல்லது. வீட்டை மேம்படுத்துவதற்கான செலவுகள் லாபகரமானதாக அமையும்.",
    "finance_en": "The financial situation will be stable. Family savings will increase. There will be good profits in purchasing household items today. This is a good day to make long-term investments. It is good to make financial decisions patiently. Expenses for home improvement will be profitable.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதி உடல் ஆரோக்கியத்தை மேம்படுத்தும். வீட்டின் தூய்மையிலும், ஆரோக்கியமான உணவுப் பழக்கங்களிலும் கவனம் செலுத்துவீர்கள். சத்தான உணவுகளை உட்கொள்வது உங்களுக்கு நன்மை பயக்கும். மனதை ரிலாக்ஸ் செய்யும் பயிற்சிகளில் ஈடுபடுவீர்கள். தாய்வழி ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும்.",
    "health_en": "Physical health will be good. Mental peace will improve physical health. You will pay attention to home cleanliness and healthy eating habits. Consuming nutritious foods will benefit you. You will engage in relaxation exercises for the mind. You should pay attention to maternal health.",
    "lucky_number": "6",
    "lucky_color_ta": "வெள்ளி",
    "lucky_color_en": "Silver"
  },
  {
    "sign_ta": "விருச்சிகம்",
    "sign_en": "Scorpio",
    "date": "16-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் விருச்சிக ராசிக்காரர்களே, உங்கள் மனது ஆழமான உணர்வுகளையும், உள்முக சிந்தனையையும் நாடும். சந்திரன் மன அமைதி, தாய், வீடு மற்றும் உணர்ச்சி சமநிலைக்குக் காரகனாக இருப்பதால், இன்று உங்கள் கவனம் வீடு, குடும்பம், தனிப்பட்ட உணர்வுகள் மற்றும் உள்மன அமைதியில் குவியும். பொதுவாகவே நீங்கள் தீவிரமானவர்கள், உணர்ச்சிகளை வெளிப்படுத்த தயங்குபவர்கள். ஆனால் இன்று உங்கள் ஆளுமை சற்று மென்மையாகவும், கருணையுடனும் வெளிப்படும். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தாய் அல்லது தாய்வழி உறவினர்களுடன் அன்பான உரையாடல்கள் நிகழலாம். அவர்களின் ஆலோசனைகளும், ஆதரவும் உங்களுக்கு மிகுந்த பலத்தைத் தரும். வீட்டில் மகிழ்ச்சியான சூழ்நிலை நிலவும். வீட்டை அழகுபடுத்துவதிலோ, அல்லது குடும்பத்தினருடன் இனிமையான நேரத்தைச் செலவிடுவதிலோ ஆர்வம் காட்டுவீர்கள். நீண்ட நாட்களாக நிலுவையில் இருந்த வீட்டு வேலைகளை இன்று வெற்றிகரமாக முடிப்பீர்கள். உங்கள் துணையுடன் நீங்கள் ஆழமான உணர்வுகளைப் பரிமாறிக் கொள்வீர்கள். குழந்தைகளுக்கு நீங்கள் ஒரு நல்ல வழிகாட்டியாகவும், ஆதரவாகவும் இருப்பீர்கள். உங்கள் உள்ளுணர்வு இன்று மிகவும் கூர்மையாக இருக்கும். முக்கிய முடிவுகள் எடுக்கும்போது, உங்கள் மனதின் குரலுக்கு செவிசாய்ப்பது நல்லது. கலை, இசை அல்லது தியானம் போன்ற மனதை அமைதிப்படுத்தும் செயல்களில் ஈடுபடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். கடந்தகால நினைவுகள் உங்கள் மனதில் வந்து போகலாம். அவற்றிலிருந்து நல்ல பாடங்களை கற்றுக்கொண்டு, நிகழ்காலத்தை இன்னும் சிறப்பாக அமைத்துக் கொள்ள இன்று நல்லதொரு வாய்ப்பு அமையும். இன்று நீங்கள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கும், மன அமைதிக்கும் அதிக நேரம் செலவிடுவீர்கள். உங்கள் குடும்பத்தின் அனைத்து அம்சங்களிலும் நீங்கள் மிகுந்த கவனத்துடன் செயல்படுவீர்கள். குடும்பத்தின் உறுப்பினர்களுடன் நீங்கள் இனிமையான உரையாடலில் ஈடுபடுவீர்கள். இது உங்கள் உறவுகளை வலுப்படுத்தும். வீட்டை மையமாகக் கொண்ட திட்டங்களுக்கு இன்று நீங்கள் சரியான அடித்தளத்தை அமைப்பீர்கள். உங்கள் வீட்டுச் சூழலை மேலும் இனிமையாக்கும் வகையிலான புதிய பொருட்களை வாங்குவீர்கள். குடும்பத்தில் உள்ள பெரியவர்களின் ஆசிர்வாதத்தைப் பெறுவது இன்று உங்களுக்கு மன நிம்மதியைத் தரும். குடும்பத்தில் அமைதியையும், மகிழ்ச்சியையும் மேம்படுத்துவதற்கு நீங்கள் எடுக்கும் முயற்சிகள் அனைத்தும் வெற்றியடையும். இன்று நீங்கள் வீட்டிலிருந்து செய்யக்கூடிய பணிகளில் அதிக ஈடுபாடு காட்டுவீர்கள். மேலும், உங்கள் குடும்ப உறுப்பினர்களுக்கு ஆதரவாக நீங்கள் செயல்படுவீர்கள். சமூகத்தில் உங்கள் குடும்பத்திற்கான அங்கீகாரம் அதிகரிக்கும். குடும்பத்துடன் சுற்றுலா செல்ல அல்லது ஒரு குடும்ப விருந்தில் பங்கேற்க வாய்ப்புகள் உண்டாகலாம். இந்த நாள் உங்களுக்கு மன அமைதியையும், குடும்ப மகிழ்ச்சியையும் அளிக்கும். உங்கள் உணர்ச்சிகளை வெளிப்படுத்துவதில் நீங்கள் மிகவும் வெளிப்படையாக இருப்பீர்கள். இது உறவுகளை மேம்படுத்தும். இன்றைய நாள் உங்களுக்கு நல்லுணர்வுகளையும், அமைதியையும் தரும். உங்கள் ஆழ்மனதில் உள்ள விஷயங்களை புரிந்து கொள்வீர்கள்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Scorpio natives, your mind will seek deep emotions and introspection. As the Moon signifies mental peace, mother, home, and emotional balance, your focus today will be on home, family, personal emotions, and inner peace. Generally, you are intense and hesitate to express emotions. But today, your personality will manifest with more gentleness and compassion. Loving conversations may occur with family members, especially with your mother or maternal relatives. Their advice and support will give you immense strength. A joyful atmosphere will prevail at home. You will show interest in beautifying your home or spending pleasant time with family members. Household tasks that have been pending for a long time will be successfully completed today. You will exchange deep emotions with your partner. You will be a good guide and support for children. Your intuition will be very sharp today. When making important decisions, it is good to listen to your inner voice. Engaging in activities that calm the mind, such as art, music, or meditation, will rejuvenate you. Past memories may come and go in your mind. Today presents a good opportunity to learn valuable lessons from them and build a better present. Today you will spend more time for your personal growth and peace of mind. You will act with great attention in all aspects of your family. You will engage in pleasant conversations with family members. This will strengthen your relationships. You will lay a strong foundation for home-centric projects today. You will purchase new items to further sweeten your home environment. Receiving the blessings of elders in the family will bring you peace of mind today. All your efforts to improve peace and happiness in the family will succeed. Today you will show great involvement in tasks that can be done from home. Furthermore, you will act in support of your family members. The recognition for your family in society will increase. There may be opportunities to go on a family trip or participate in a family gathering. This day will bring you mental peace and family happiness. You will be very open in expressing your emotions. This will improve relationships. Today will bring you good feelings and peace. You will understand matters within your subconscious.",
    "career_ta": "பணி இடத்தில் உங்கள் உள்மனத் தெளிவு உங்களுக்கு நல்ல வழிகாட்டும். சக ஊழியர்களுடன் இணக்கமான உறவு நிலவும். குழுப்பணிகளில் நீங்கள் சிறந்த பங்களிப்பை வழங்குவீர்கள். வீட்டை மையமாகக் கொண்ட தொழில்கள் நல்ல வளர்ச்சி பெறும். உங்கள் நுண்ணறிவு பணியிடத்தில் நல்ல முடிவுகளை எடுக்க உதவும்.",
    "career_en": "At your workplace, your inner clarity will guide you well. Harmonious relationships will prevail with colleagues. You will provide excellent contributions in team projects. Home-based businesses will see good growth. Your intuition will help you make good decisions at work.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். குடும்பத்திற்கான சேமிப்புகள் அதிகரிக்கும். வீட்டு உபயோகப் பொருட்களை வாங்குவதில் இன்று நல்ல லாபம் உண்டாகும். நீண்டகால முதலீடுகளைச் செய்வதற்கு இது ஒரு நல்ல நாள். நிதி சம்பந்தப்பட்ட விஷயங்களில் பொறுமையாக முடிவெடுப்பது நல்லது. வீட்டை மேம்படுத்துவதற்கான செலவுகள் லாபகரமானதாக அமையும்.",
    "finance_en": "The financial situation will be stable. Family savings will increase. There will be good profits in purchasing household items today. This is a good day to make long-term investments. It is good to make financial decisions patiently. Expenses for home improvement will be profitable.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதி உடல் ஆரோக்கியத்தை மேம்படுத்தும். வீட்டின் தூய்மையிலும், ஆரோக்கியமான உணவுப் பழக்கங்களிலும் கவனம் செலுத்துவீர்கள். சத்தான உணவுகளை உட்கொள்வது உங்களுக்கு நன்மை பயக்கும். மனதை ரிலாக்ஸ் செய்யும் பயிற்சிகளில் ஈடுபடுவீர்கள். தாய்வழி ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும்.",
    "health_en": "Physical health will be good. Mental peace will improve physical health. You will pay attention to home cleanliness and healthy eating habits. Consuming nutritious foods will benefit you. You will engage in relaxation exercises for the mind. You should pay attention to maternal health.",
    "lucky_number": "9",
    "lucky_color_ta": "மெரூன்",
    "lucky_color_en": "Maroon"
  },
  {
    "sign_ta": "தனுசு",
    "sign_en": "Sagittarius",
    "date": "16-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் தனுசு ராசிக்காரர்களே, உங்கள் மனம் அமைதியையும், உள்மனத் தெளிவையும் நாடும். சந்திரன் மன அமைதி, தாய், வீடு மற்றும் உணர்ச்சி சமநிலைக்குக் காரகனாக இருப்பதால், இன்று உங்கள் கவனம் வீடு, குடும்பம், தனிப்பட்ட உணர்வுகள் மற்றும் உள்மன அமைதியில் குவியும். பொதுவாகவே நீங்கள் சுதந்திரமானவர்கள், சாகசங்களை விரும்புபவர்கள். ஆனால் இன்று உங்கள் அணுகுமுறை சற்று மென்மையாகவும், உணர்வுபூர்வமாகவும் இருக்கும். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தாய் அல்லது தாய்வழி உறவினர்களுடன் அன்பான உரையாடல்கள் நிகழலாம். அவர்களின் ஆலோசனைகளும், ஆதரவும் உங்களுக்கு மிகுந்த பலத்தைத் தரும். வீட்டில் மகிழ்ச்சியான சூழ்நிலை நிலவும். வீட்டை அழகுபடுத்துவதிலோ, அல்லது குடும்பத்தினருடன் இனிமையான நேரத்தைச் செலவிடுவதிலோ ஆர்வம் காட்டுவீர்கள். நீண்ட நாட்களாக நிலுவையில் இருந்த வீட்டு வேலைகளை இன்று வெற்றிகரமாக முடிப்பீர்கள். உங்கள் துணையுடன் நீங்கள் ஆழமான உணர்வுகளைப் பரிமாறிக் கொள்வீர்கள். குழந்தைகளுக்கு நீங்கள் ஒரு நல்ல வழிகாட்டியாகவும், ஆதரவாகவும் இருப்பீர்கள். உங்கள் உள்ளுணர்வு இன்று மிகவும் கூர்மையாக இருக்கும். முக்கிய முடிவுகள் எடுக்கும்போது, உங்கள் மனதின் குரலுக்கு செவிசாய்ப்பது நல்லது. கலை, இசை அல்லது தியானம் போன்ற மனதை அமைதிப்படுத்தும் செயல்களில் ஈடுபடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். கடந்தகால நினைவுகள் உங்கள் மனதில் வந்து போகலாம். அவற்றிலிருந்து நல்ல பாடங்களை கற்றுக்கொண்டு, நிகழ்காலத்தை இன்னும் சிறப்பாக அமைத்துக் கொள்ள இன்று நல்லதொரு வாய்ப்பு அமையும். இன்று நீங்கள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கும், மன அமைதிக்கும் அதிக நேரம் செலவிடுவீர்கள். உங்கள் குடும்பத்தின் அனைத்து அம்சங்களிலும் நீங்கள் மிகுந்த கவனத்துடன் செயல்படுவீர்கள். குடும்பத்தின் உறுப்பினர்களுடன் நீங்கள் இனிமையான உரையாடலில் ஈடுபடுவீர்கள். இது உங்கள் உறவுகளை வலுப்படுத்தும். வீட்டை மையமாகக் கொண்ட திட்டங்களுக்கு இன்று நீங்கள் சரியான அடித்தளத்தை அமைப்பீர்கள். உங்கள் வீட்டுச் சூழலை மேலும் இனிமையாக்கும் வகையிலான புதிய பொருட்களை வாங்குவீர்கள். குடும்பத்தில் உள்ள பெரியவர்களின் ஆசிர்வாதத்தைப் பெறுவது இன்று உங்களுக்கு மன நிம்மதியைத் தரும். குடும்பத்தில் அமைதியையும், மகிழ்ச்சியையும் மேம்படுத்துவதற்கு நீங்கள் எடுக்கும் முயற்சிகள் அனைத்தும் வெற்றியடையும். இன்று நீங்கள் வீட்டிலிருந்து செய்யக்கூடிய பணிகளில் அதிக ஈடுபாடு காட்டுவீர்கள். மேலும், உங்கள் குடும்ப உறுப்பினர்களுக்கு ஆதரவாக நீங்கள் செயல்படுவீர்கள். சமூகத்தில் உங்கள் குடும்பத்திற்கான அங்கீகாரம் அதிகரிக்கும். குடும்பத்துடன் சுற்றுலா செல்ல அல்லது ஒரு குடும்ப விருந்தில் பங்கேற்க வாய்ப்புகள் உண்டாகலாம். இந்த நாள் உங்களுக்கு மன அமைதியையும், குடும்ப மகிழ்ச்சியையும் அளிக்கும். உங்கள் உணர்ச்சிகளை வெளிப்படுத்துவதில் நீங்கள் மிகவும் வெளிப்படையாக இருப்பீர்கள். இது உறவுகளை மேம்படுத்தும். இன்றைய நாள் உங்களுக்கு நல்லுணர்வுகளையும், அமைதியையும் தரும். உங்கள் மனதில் புதிய யோசனைகள் பிறக்கும்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Sagittarius natives, your mind will seek peace and inner clarity. As the Moon signifies mental peace, mother, home, and emotional balance, your focus today will be on home, family, personal emotions, and inner peace. Generally, you are independent and seek adventures. But today, your approach will be somewhat gentler and more emotional. Loving conversations may occur with family members, especially with your mother or maternal relatives. Their advice and support will give you immense strength. A joyful atmosphere will prevail at home. You will show interest in beautifying your home or spending pleasant time with family members. Household tasks that have been pending for a long time will be successfully completed today. You will exchange deep emotions with your partner. You will be a good guide and support for children. Your intuition will be very sharp today. When making important decisions, it is good to listen to your inner voice. Engaging in activities that calm the mind, such as art, music, or meditation, will rejuvenate you. Past memories may come and go in your mind. Today presents a good opportunity to learn valuable lessons from them and build a better present. Today you will spend more time for your personal growth and peace of mind. You will act with great attention in all aspects of your family. You will engage in pleasant conversations with family members. This will strengthen your relationships. You will lay a strong foundation for home-centric projects today. You will purchase new items to further sweeten your home environment. Receiving the blessings of elders in the family will bring you peace of mind today. All your efforts to improve peace and happiness in the family will succeed. Today you will show great involvement in tasks that can be done from home. Furthermore, you will act in support of your family members. The recognition for your family in society will increase. There may be opportunities to go on a family trip or participate in a family gathering. This day will bring you mental peace and family happiness. You will be very open in expressing your emotions. This will improve relationships. Today will bring you good feelings and peace. New ideas will emerge in your mind.",
    "career_ta": "பணி இடத்தில் உங்கள் உள்மனத் தெளிவு உங்களுக்கு நல்ல வழிகாட்டும். சக ஊழியர்களுடன் இணக்கமான உறவு நிலவும். குழுப்பணிகளில் நீங்கள் சிறந்த பங்களிப்பை வழங்குவீர்கள். வீட்டை மையமாகக் கொண்ட தொழில்கள் நல்ல வளர்ச்சி பெறும். உங்கள் பணிக்கு நல்ல அங்கீகாரம் கிடைக்கும். புதிய திட்டங்களை வெற்றிகரமாக செயல்படுத்துவீர்கள்.",
    "career_en": "At your workplace, your inner clarity will guide you well. Harmonious relationships will prevail with colleagues. You will provide excellent contributions in team projects. Home-based businesses will see good growth. Your work will receive good recognition. You will successfully implement new projects.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். குடும்பத்திற்கான சேமிப்புகள் அதிகரிக்கும். வீட்டு உபயோகப் பொருட்களை வாங்குவதில் இன்று நல்ல லாபம் உண்டாகும். நீண்டகால முதலீடுகளைச் செய்வதற்கு இது ஒரு நல்ல நாள். நிதி சம்பந்தப்பட்ட விஷயங்களில் பொறுமையாக முடிவெடுப்பது நல்லது. வீட்டை மேம்படுத்துவதற்கான செலவுகள் லாபகரமானதாக அமையும்.",
    "finance_en": "The financial situation will be stable. Family savings will increase. There will be good profits in purchasing household items today. This is a good day to make long-term investments. It is good to make financial decisions patiently. Expenses for home improvement will be profitable.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதி உடல் ஆரோக்கியத்தை மேம்படுத்தும். வீட்டின் தூய்மையிலும், ஆரோக்கியமான உணவுப் பழக்கங்களிலும் கவனம் செலுத்துவீர்கள். சத்தான உணவுகளை உட்கொள்வது உங்களுக்கு நன்மை பயக்கும். மனதை ரிலாக்ஸ் செய்யும் பயிற்சிகளில் ஈடுபடுவீர்கள். தாய்வழி ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும்.",
    "health_en": "Physical health will be good. Mental peace will improve physical health. You will pay attention to home cleanliness and healthy eating habits. Consuming nutritious foods will benefit you. You will engage in relaxation exercises for the mind. You should pay attention to maternal health.",
    "lucky_number": "3",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "மகரம்",
    "sign_en": "Capricorn",
    "date": "16-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் மகர ராசிக்காரர்களே, உங்கள் மனம் சற்று அமைதியையும், உணர்வுபூர்வமான திருப்தியையும் நாடும். சந்திரன் மன அமைதி, தாய், வீடு மற்றும் உணர்ச்சி சமநிலைக்குக் காரகனாக இருப்பதால், இன்று உங்கள் கவனம் வீட்டுச் சூழல், குடும்ப உறவுகள் மற்றும் தனிப்பட்ட பாதுகாப்பு உணர்வில் குவியும். பொதுவாகவே நீங்கள் ஒழுக்கமானவர்கள், குறிக்கோளுடன் செயல்படுபவர்கள். ஆனால் இன்று உங்கள் அணுகுமுறை சற்று மென்மையாகவும், கருணையுடனும் வெளிப்படும். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தாய் அல்லது தாய்வழி உறவினர்களுடன் அன்பான உரையாடல்கள் நிகழலாம். அவர்களின் ஆலோசனைகளும், ஆதரவும் உங்களுக்கு மிகுந்த பலத்தைத் தரும். வீட்டில் மகிழ்ச்சியான சூழ்நிலை நிலவும். வீட்டை அழகுபடுத்துவதிலோ, அல்லது குடும்பத்தினருடன் இனிமையான நேரத்தைச் செலவிடுவதிலோ ஆர்வம் காட்டுவீர்கள். நீண்ட நாட்களாக நிலுவையில் இருந்த வீட்டு வேலைகளை இன்று வெற்றிகரமாக முடிப்பீர்கள். உங்கள் துணையுடன் நீங்கள் ஆழமான உணர்வுகளைப் பரிமாறிக் கொள்வீர்கள். குழந்தைகளுக்கு நீங்கள் ஒரு நல்ல வழிகாட்டியாகவும், ஆதரவாகவும் இருப்பீர்கள். உங்கள் உள்ளுணர்வு இன்று மிகவும் கூர்மையாக இருக்கும். முக்கிய முடிவுகள் எடுக்கும்போது, உங்கள் மனதின் குரலுக்கு செவிசாய்ப்பது நல்லது. கலை, இசை அல்லது தியானம் போன்ற மனதை அமைதிப்படுத்தும் செயல்களில் ஈடுபடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். கடந்தகால நினைவுகள் உங்கள் மனதில் வந்து போகலாம். அவற்றிலிருந்து நல்ல பாடங்களை கற்றுக்கொண்டு, நிகழ்காலத்தை இன்னும் சிறப்பாக அமைத்துக் கொள்ள இன்று நல்லதொரு வாய்ப்பு அமையும். இன்று நீங்கள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கும், மன அமைதிக்கும் அதிக நேரம் செலவிடுவீர்கள். உங்கள் குடும்பத்தின் அனைத்து அம்சங்களிலும் நீங்கள் மிகுந்த கவனத்துடன் செயல்படுவீர்கள். குடும்பத்தின் உறுப்பினர்களுடன் நீங்கள் இனிமையான உரையாடலில் ஈடுபடுவீர்கள். இது உங்கள் உறவுகளை வலுப்படுத்தும். வீட்டை மையமாகக் கொண்ட திட்டங்களுக்கு இன்று நீங்கள் சரியான அடித்தளத்தை அமைப்பீர்கள். உங்கள் வீட்டுச் சூழலை மேலும் இனிமையாக்கும் வகையிலான புதிய பொருட்களை வாங்குவீர்கள். குடும்பத்தில் உள்ள பெரியவர்களின் ஆசிர்வாதத்தைப் பெறுவது இன்று உங்களுக்கு மன நிம்மதியைத் தரும். குடும்பத்தில் அமைதியையும், மகிழ்ச்சியையும் மேம்படுத்துவதற்கு நீங்கள் எடுக்கும் முயற்சிகள் அனைத்தும் வெற்றியடையும். இன்று நீங்கள் வீட்டிலிருந்து செய்யக்கூடிய பணிகளில் அதிக ஈடுபாடு காட்டுவீர்கள். மேலும், உங்கள் குடும்ப உறுப்பினர்களுக்கு ஆதரவாக நீங்கள் செயல்படுவீர்கள். சமூகத்தில் உங்கள் குடும்பத்திற்கான அங்கீகாரம் அதிகரிக்கும். குடும்பத்துடன் சுற்றுலா செல்ல அல்லது ஒரு குடும்ப விருந்தில் பங்கேற்க வாய்ப்புகள் உண்டாகலாம். இந்த நாள் உங்களுக்கு மன அமைதியையும், குடும்ப மகிழ்ச்சியையும் அளிக்கும். உங்கள் உணர்ச்சிகளை வெளிப்படுத்துவதில் நீங்கள் மிகவும் வெளிப்படையாக இருப்பீர்கள். இது உறவுகளை மேம்படுத்தும். இன்றைய நாள் உங்களுக்கு நல்லுணர்வுகளையும், அமைதியையும் தரும். உங்கள் குடும்ப பொறுப்புகளையும் உணர்வீர்கள்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Capricorn natives, your mind will seek some peace and emotional satisfaction. As the Moon signifies mental peace, mother, home, and emotional balance, your focus today will be on your home environment, family relationships, and a sense of personal security. Generally, you are disciplined and goal-oriented. But today, your approach will be somewhat gentler and more compassionate. Loving conversations may occur with family members, especially with your mother or maternal relatives. Their advice and support will give you immense strength. A joyful atmosphere will prevail at home. You will show interest in beautifying your home or spending pleasant time with family members. Household tasks that have been pending for a long time will be successfully completed today. You will exchange deep emotions with your partner. You will be a good guide and support for children. Your intuition will be very sharp today. When making important decisions, it is good to listen to your inner voice. Engaging in activities that calm the mind, such as art, music, or meditation, will rejuvenate you. Past memories may come and go in your mind. Today presents a good opportunity to learn valuable lessons from them and build a better present. Today you will spend more time for your personal growth and peace of mind. You will act with great attention in all aspects of your family. You will engage in pleasant conversations with family members. This will strengthen your relationships. You will lay a strong foundation for home-centric projects today. You will purchase new items to further sweeten your home environment. Receiving the blessings of elders in the family will bring you peace of mind today. All your efforts to improve peace and happiness in the family will succeed. Today you will show great involvement in tasks that can be done from home. Furthermore, you will act in support of your family members. The recognition for your family in society will increase. There may be opportunities to go on a family trip or participate in a family gathering. This day will bring you mental peace and family happiness. You will be very open in expressing your emotions. This will improve relationships. Today will bring you good feelings and peace. You will also feel your family responsibilities.",
    "career_ta": "பணி இடத்தில் உங்கள் பொறுமையும், விடாமுயற்சியும் பாராட்டு பெறும். சக ஊழியர்களுடன் நல்லுறவு பேணுவீர்கள். குழுப்பணிகளில் நீங்கள் சிறந்த பங்களிப்பை வழங்குவீர்கள். வீட்டை மையமாகக் கொண்ட தொழில் அல்லது சேவைகளில் ஈடுபடுபவர்களுக்கு இன்று நல்ல வளர்ச்சி இருக்கும். உங்கள் பணிக்கு நல்ல அங்கீகாரம் கிடைக்கும். உங்கள் பணித்திறன் மேம்படும்.",
    "career_en": "At your workplace, your patience and perseverance will be praised. You will maintain good relationships with colleagues. You will provide excellent contributions in team projects. Those involved in home-based businesses or services will see good growth today. Your work will receive good recognition. Your work efficiency will improve.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். குடும்பத்திற்கான சேமிப்புகள் அதிகரிக்கும். வீட்டு உபயோகப் பொருட்களை வாங்குவதில் இன்று நல்ல லாபம் உண்டாகும். நீண்டகால முதலீடுகளைச் செய்வதற்கு இது ஒரு நல்ல நாள். நிதி சம்பந்தப்பட்ட விஷயங்களில் பொறுமையாக முடிவெடுப்பது நல்லது. வீட்டை மேம்படுத்துவதற்கான செலவுகள் லாபகரமானதாக அமையும்.",
    "finance_en": "The financial situation will be stable. Family savings will increase. There will be good profits in purchasing household items today. This is a good day to make long-term investments. It is good to make financial decisions patiently. Expenses for home improvement will be profitable.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதி உடல் ஆரோக்கியத்தை மேம்படுத்தும். வீட்டின் தூய்மையிலும், ஆரோக்கியமான உணவுப் பழக்கங்களிலும் கவனம் செலுத்துவீர்கள். சத்தான உணவுகளை உட்கொள்வது உங்களுக்கு நன்மை பயக்கும். மனதை ரிலாக்ஸ் செய்யும் பயிற்சிகளில் ஈடுபடுவீர்கள். தாய்வழி ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும்.",
    "health_en": "Physical health will be good. Mental peace will improve physical health. You will pay attention to home cleanliness and healthy eating habits. Consuming nutritious foods will benefit you. You will engage in relaxation exercises for the mind. You should pay attention to maternal health.",
    "lucky_number": "8",
    "lucky_color_ta": "சாம்பல்",
    "lucky_color_en": "Grey"
  },
  {
    "sign_ta": "கும்பம்",
    "sign_en": "Aquarius",
    "date": "16-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் கும்ப ராசிக்காரர்களே, உங்கள் மனம் அமைதியையும், உள்மனத் தெளிவையும் நாடும். சந்திரன் மன அமைதி, தாய், வீடு மற்றும் உணர்ச்சி சமநிலைக்குக் காரகனாக இருப்பதால், இன்று உங்கள் கவனம் வீடு, குடும்பம், தனிப்பட்ட உணர்வுகள் மற்றும் உள்மன அமைதியில் குவியும். பொதுவாகவே நீங்கள் தனித்துவமானவர்கள், சமூக சிந்தனை கொண்டவர்கள். ஆனால் இன்று உங்கள் அணுகுமுறை சற்று மென்மையாகவும், கருணையுடனும் வெளிப்படும். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தாய் அல்லது தாய்வழி உறவினர்களுடன் அன்பான உரையாடல்கள் நிகழலாம். அவர்களின் ஆலோசனைகளும், ஆதரவும் உங்களுக்கு மிகுந்த பலத்தைத் தரும். வீட்டில் மகிழ்ச்சியான சூழ்நிலை நிலவும். வீட்டை அழகுபடுத்துவதிலோ, அல்லது குடும்பத்தினருடன் இனிமையான நேரத்தைச் செலவிடுவதிலோ ஆர்வம் காட்டுவீர்கள். நீண்ட நாட்களாக நிலுவையில் இருந்த வீட்டு வேலைகளை இன்று வெற்றிகரமாக முடிப்பீர்கள். உங்கள் துணையுடன் நீங்கள் ஆழமான உணர்வுகளைப் பரிமாறிக் கொள்வீர்கள். குழந்தைகளுக்கு நீங்கள் ஒரு நல்ல வழிகாட்டியாகவும், ஆதரவாகவும் இருப்பீர்கள். உங்கள் உள்ளுணர்வு இன்று மிகவும் கூர்மையாக இருக்கும். முக்கிய முடிவுகள் எடுக்கும்போது, உங்கள் மனதின் குரலுக்கு செவிசாய்ப்பது நல்லது. கலை, இசை அல்லது தியானம் போன்ற மனதை அமைதிப்படுத்தும் செயல்களில் ஈடுபடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். கடந்தகால நினைவுகள் உங்கள் மனதில் வந்து போகலாம். அவற்றிலிருந்து நல்ல பாடங்களை கற்றுக்கொண்டு, நிகழ்காலத்தை இன்னும் சிறப்பாக அமைத்துக் கொள்ள இன்று நல்லதொரு வாய்ப்பு அமையும். இன்று நீங்கள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கும், மன அமைதிக்கும் அதிக நேரம் செலவிடுவீர்கள். உங்கள் குடும்பத்தின் அனைத்து அம்சங்களிலும் நீங்கள் மிகுந்த கவனத்துடன் செயல்படுவீர்கள். குடும்பத்தின் உறுப்பினர்களுடன் நீங்கள் இனிமையான உரையாடலில் ஈடுபடுவீர்கள். இது உங்கள் உறவுகளை வலுப்படுத்தும். வீட்டை மையமாகக் கொண்ட திட்டங்களுக்கு இன்று நீங்கள் சரியான அடித்தளத்தை அமைப்பீர்கள். உங்கள் வீட்டுச் சூழலை மேலும் இனிமையாக்கும் வகையிலான புதிய பொருட்களை வாங்குவீர்கள். குடும்பத்தில் உள்ள பெரியவர்களின் ஆசிர்வாதத்தைப் பெறுவது இன்று உங்களுக்கு மன நிம்மதியைத் தரும். குடும்பத்தில் அமைதியையும், மகிழ்ச்சியையும் மேம்படுத்துவதற்கு நீங்கள் எடுக்கும் முயற்சிகள் அனைத்தும் வெற்றியடையும். இன்று நீங்கள் வீட்டிலிருந்து செய்யக்கூடிய பணிகளில் அதிக ஈடுபாடு காட்டுவீர்கள். மேலும், உங்கள் குடும்ப உறுப்பினர்களுக்கு ஆதரவாக நீங்கள் செயல்படுவீர்கள். சமூகத்தில் உங்கள் குடும்பத்திற்கான அங்கீகாரம் அதிகரிக்கும். குடும்பத்துடன் சுற்றுலா செல்ல அல்லது ஒரு குடும்ப விருந்தில் பங்கேற்க வாய்ப்புகள் உண்டாகலாம். இந்த நாள் உங்களுக்கு மன அமைதியையும், குடும்ப மகிழ்ச்சியையும் அளிக்கும். உங்கள் உணர்ச்சிகளை வெளிப்படுத்துவதில் நீங்கள் மிகவும் வெளிப்படையாக இருப்பீர்கள். இது உறவுகளை மேம்படுத்தும். இன்றைய நாள் உங்களுக்கு நல்லுணர்வுகளையும், அமைதியையும் தரும். உங்கள் தனிப்பட்ட விருப்பங்கள் பூர்த்தி அடையும்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Aquarius natives, your mind will seek peace and inner clarity. As the Moon signifies mental peace, mother, home, and emotional balance, your focus today will be on home, family, personal emotions, and inner peace. Generally, you are unique and socially conscious. But today, your approach will be somewhat gentler and more compassionate. Loving conversations may occur with family members, especially with your mother or maternal relatives. Their advice and support will give you immense strength. A joyful atmosphere will prevail at home. You will show interest in beautifying your home or spending pleasant time with family members. Household tasks that have been pending for a long time will be successfully completed today. You will exchange deep emotions with your partner. You will be a good guide and support for children. Your intuition will be very sharp today. When making important decisions, it is good to listen to your inner voice. Engaging in activities that calm the mind, such as art, music, or meditation, will rejuvenate you. Past memories may come and go in your mind. Today presents a good opportunity to learn valuable lessons from them and build a better present. Today you will spend more time for your personal growth and peace of mind. You will act with great attention in all aspects of your family. You will engage in pleasant conversations with family members. This will strengthen your relationships. You will lay a strong foundation for home-centric projects today. You will purchase new items to further sweeten your home environment. Receiving the blessings of elders in the family will bring you peace of mind today. All your efforts to improve peace and happiness in the family will succeed. Today you will show great involvement in tasks that can be done from home. Furthermore, you will act in support of your family members. The recognition for your family in society will increase. There may be opportunities to go on a family trip or participate in a family gathering. This day will bring you mental peace and family happiness. You will be very open in expressing your emotions. This will improve relationships. Today will bring you good feelings and peace. Your personal desires will be fulfilled.",
    "career_ta": "பணி இடத்தில் உங்கள் உள்மனத் தெளிவு உங்களுக்கு நல்ல வழிகாட்டும். சக ஊழியர்களுடன் இணக்கமான உறவு நிலவும். குழுப்பணிகளில் நீங்கள் சிறந்த பங்களிப்பை வழங்குவீர்கள். வீட்டை மையமாகக் கொண்ட தொழில்கள் நல்ல வளர்ச்சி பெறும். உங்கள் தனிப்பட்ட யோசனைகள் பணியிடத்தில் நல்ல முடிவுகளை எடுக்க உதவும். உங்கள் பணிக்கு நல்ல அங்கீகாரம் கிடைக்கும்.",
    "career_en": "At your workplace, your inner clarity will guide you well. Harmonious relationships will prevail with colleagues. You will provide excellent contributions in team projects. Home-based businesses will see good growth. Your unique ideas will help you make good decisions at work. Your work will receive good recognition.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். குடும்பத்திற்கான சேமிப்புகள் அதிகரிக்கும். வீட்டு உபயோகப் பொருட்களை வாங்குவதில் இன்று நல்ல லாபம் உண்டாகும். நீண்டகால முதலீடுகளைச் செய்வதற்கு இது ஒரு நல்ல நாள். நிதி சம்பந்தப்பட்ட விஷயங்களில் பொறுமையாக முடிவெடுப்பது நல்லது. வீட்டை மேம்படுத்துவதற்கான செலவுகள் லாபகரமானதாக அமையும்.",
    "finance_en": "The financial situation will be stable. Family savings will increase. There will be good profits in purchasing household items today. This is a good day to make long-term investments. It is good to make financial decisions patiently. Expenses for home improvement will be profitable.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதி உடல் ஆரோக்கியத்தை மேம்படுத்தும். வீட்டின் தூய்மையிலும், ஆரோக்கியமான உணவுப் பழக்கங்களிலும் கவனம் செலுத்துவீர்கள். சத்தான உணவுகளை உட்கொள்வது உங்களுக்கு நன்மை பயக்கும். மனதை ரிலாக்ஸ் செய்யும் பயிற்சிகளில் ஈடுபடுவீர்கள். தாய்வழி ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும்.",
    "health_en": "Physical health will be good. Mental peace will improve physical health. You will pay attention to home cleanliness and healthy eating habits. Consuming nutritious foods will benefit you. You will engage in relaxation exercises for the mind. You should pay attention to maternal health.",
    "lucky_number": "4",
    "lucky_color_ta": "கருநீலம்",
    "lucky_color_en": "Indigo"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "16-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் மீன ராசிக்காரர்களே, உங்கள் மனம் அமைதியையும், உணர்வுபூர்வமான திருப்தியையும் நாடும். சந்திரன் மன அமைதி, தாய், வீடு மற்றும் உணர்ச்சி சமநிலைக்குக் காரகனாக இருப்பதால், இன்று உங்கள் கவனம் வீட்டுச் சூழல், குடும்ப உறவுகள் மற்றும் தனிப்பட்ட பாதுகாப்பு உணர்வில் குவியும். பொதுவாகவே நீங்கள் உணர்ச்சிவசப்படுபவர்கள், கருணையுடனும், இரக்கத்துடனும் செயல்படுபவர்கள். இன்று உங்கள் ஆளுமை சற்று மென்மையாகவும், கருணையுடனும் வெளிப்படும். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தாய் அல்லது தாய்வழி உறவினர்களுடன் அன்பான உரையாடல்கள் நிகழலாம். அவர்களின் ஆலோசனைகளும், ஆதரவும் உங்களுக்கு மிகுந்த பலத்தைத் தரும். வீட்டில் மகிழ்ச்சியான சூழ்நிலை நிலவும். வீட்டை அழகுபடுத்துவதிலோ, அல்லது குடும்பத்தினருடன் இனிமையான நேரத்தைச் செலவிடுவதிலோ ஆர்வம் காட்டுவீர்கள். நீண்ட நாட்களாக நிலுவையில் இருந்த வீட்டு வேலைகளை இன்று வெற்றிகரமாக முடிப்பீர்கள். உங்கள் துணையுடன் நீங்கள் ஆழமான உணர்வுகளைப் பரிமாறிக் கொள்வீர்கள். குழந்தைகளுக்கு நீங்கள் ஒரு நல்ல வழிகாட்டியாகவும், ஆதரவாகவும் இருப்பீர்கள். உங்கள் உள்ளுணர்வு இன்று மிகவும் கூர்மையாக இருக்கும். முக்கிய முடிவுகள் எடுக்கும்போது, உங்கள் மனதின் குரலுக்கு செவிசாய்ப்பது நல்லது. கலை, இசை அல்லது தியானம் போன்ற மனதை அமைதிப்படுத்தும் செயல்களில் ஈடுபடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். கடந்தகால நினைவுகள் உங்கள் மனதில் வந்து போகலாம். அவற்றிலிருந்து நல்ல பாடங்களை கற்றுக்கொண்டு, நிகழ்காலத்தை இன்னும் சிறப்பாக அமைத்துக் கொள்ள இன்று நல்லதொரு வாய்ப்பு அமையும். இன்று நீங்கள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கும், மன அமைதிக்கும் அதிக நேரம் செலவிடுவீர்கள். உங்கள் குடும்பத்தின் அனைத்து அம்சங்களிலும் நீங்கள் மிகுந்த கவனத்துடன் செயல்படுவீர்கள். குடும்பத்தின் உறுப்பினர்களுடன் நீங்கள் இனிமையான உரையாடலில் ஈடுபடுவீர்கள். இது உங்கள் உறவுகளை வலுப்படுத்தும். வீட்டை மையமாகக் கொண்ட திட்டங்களுக்கு இன்று நீங்கள் சரியான அடித்தளத்தை அமைப்பீர்கள். உங்கள் வீட்டுச் சூழலை மேலும் இனிமையாக்கும் வகையிலான புதிய பொருட்களை வாங்குவீர்கள். குடும்பத்தில் உள்ள பெரியவர்களின் ஆசிர்வாதத்தைப் பெறுவது இன்று உங்களுக்கு மன நிம்மதியைத் தரும். குடும்பத்தில் அமைதியையும், மகிழ்ச்சியையும் மேம்படுத்துவதற்கு நீங்கள் எடுக்கும் முயற்சிகள் அனைத்தும் வெற்றியடையும். இன்று நீங்கள் வீட்டிலிருந்து செய்யக்கூடிய பணிகளில் அதிக ஈடுபாடு காட்டுவீர்கள். மேலும், உங்கள் குடும்ப உறுப்பினர்களுக்கு ஆதரவாக நீங்கள் செயல்படுவீர்கள். சமூகத்தில் உங்கள் குடும்பத்திற்கான அங்கீகாரம் அதிகரிக்கும். குடும்பத்துடன் சுற்றுலா செல்ல அல்லது ஒரு குடும்ப விருந்தில் பங்கேற்க வாய்ப்புகள் உண்டாகலாம். இந்த நாள் உங்களுக்கு மன அமைதியையும், குடும்ப மகிழ்ச்சியையும் அளிக்கும். உங்கள் உணர்ச்சிகளை வெளிப்படுத்துவதில் நீங்கள் மிகவும் வெளிப்படையாக இருப்பீர்கள். இது உறவுகளை மேம்படுத்தும். இன்றைய நாள் உங்களுக்கு நல்லுணர்வுகளையும், அமைதியையும் தரும். உங்கள் மனதில் புதிய ஆன்மீக சிந்தனைகள் பிறக்கும்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Pisces natives, your mind will seek peace and emotional satisfaction. As the Moon signifies mental peace, mother, home, and emotional balance, your focus today will be on your home environment, family relationships, and a sense of personal security. Generally, you are emotional, compassionate, and empathetic. Today, your personality will manifest with more gentleness and compassion. Loving conversations may occur with family members, especially with your mother or maternal relatives. Their advice and support will give you immense strength. A joyful atmosphere will prevail at home. You will show interest in beautifying your home or spending pleasant time with family members. Household tasks that have been pending for a long time will be successfully completed today. You will exchange deep emotions with your partner. You will be an excellent guide and support for children. Your intuition will be very sharp today. When making important decisions, it is good to listen to your inner voice. Engaging in activities that calm the mind, such as art, music, or meditation, will rejuvenate you. Past memories may come and go in your mind. Today presents a good opportunity to learn valuable lessons from them and build a better present. Today you will spend more time for your personal growth and peace of mind. You will act with great attention in all aspects of your family. You will engage in pleasant conversations with family members. This will strengthen your relationships. You will lay a strong foundation for home-centric projects today. You will purchase new items to further sweeten your home environment. Receiving the blessings of elders in the family will bring you peace of mind today. All your efforts to improve peace and happiness in the family will succeed. Today you will show great involvement in tasks that can be done from home. Furthermore, you will act in support of your family members. The recognition for your family in society will increase. There may be opportunities to go on a family trip or participate in a family gathering. This day will bring you mental peace and family happiness. You will be very open in expressing your emotions. This will improve relationships. Today will bring you good feelings and peace. New spiritual thoughts will emerge in your mind.",
    "career_ta": "பணி இடத்தில் உங்கள் உள்மனத் தெளிவு உங்களுக்கு நல்ல வழிகாட்டும். சக ஊழியர்களுடன் இணக்கமான உறவு நிலவும். குழுப்பணிகளில் நீங்கள் சிறந்த பங்களிப்பை வழங்குவீர்கள். வீட்டை மையமாகக் கொண்ட தொழில்கள் நல்ல வளர்ச்சி பெறும். உங்கள் கருணை மற்றும் ஒத்துழைப்பு பாராட்டப்படும்.",
    "career_en": "At your workplace, your inner clarity will guide you well. Harmonious relationships will prevail with colleagues. You will provide excellent contributions in team projects. Home-based businesses will see good growth. Your compassion and cooperation will be praised.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். குடும்பத்திற்கான சேமிப்புகள் அதிகரிக்கும். வீட்டு உபயோகப் பொருட்களை வாங்குவதில் இன்று நல்ல லாபம் உண்டாகும். நீண்டகால முதலீடுகளைச் செய்வதற்கு இது ஒரு நல்ல நாள். நிதி சம்பந்தப்பட்ட விஷயங்களில் பொறுமையாக முடிவெடுப்பது நல்லது. வீட்டை மேம்படுத்துவதற்கான செலவுகள் லாபகரமானதாக அமையும்.",
    "finance_en": "The financial situation will be stable. Family savings will increase. There will be good profits in purchasing household items today. This is a good day to make long-term investments. It is good to make financial decisions patiently. Expenses for home improvement will be profitable.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதி உடல் ஆரோக்கியத்தை மேம்படுத்தும். வீட்டின் தூய்மையிலும், ஆரோக்கியமான உணவுப் பழக்கங்களிலும் கவனம் செலுத்துவீர்கள். சத்தான உணவுகளை உட்கொள்வது உங்களுக்கு நன்மை பயக்கும். மனதை ரிலாக்ஸ் செய்யும் பயிற்சிகளில் ஈடுபடுவீர்கள். தாய்வழி ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும்.",
    "health_en": "Physical health will be good. Mental peace will improve physical health. You will pay attention to home cleanliness and healthy eating habits. Consuming nutritious foods will benefit you. You will engage in relaxation exercises for the mind. You should pay attention to maternal health.",
    "lucky_number": "7",
    "lucky_color_ta": "கடல்நீலம்",
    "lucky_color_en": "Sea Blue"
  }
]
