[
  {
    "sign_ta": "மேஷம்",
    "sign_en": "Aries",
    "date": "17-02-2026",
    "prediction_ta": "இன்று செவ்வாய்க்கிழமை, செவ்வாய் கிரகத்தின் ஆதிக்கத்தில் உங்கள் நாள் தொடங்குகிறது. செவ்வாய் உங்கள் ஆற்றலையும், துணிச்சலையும், செயல்திறனையும் அதிகரிக்கும் கிரகம். மேஷ ராசிக்காரர்களாகிய உங்களுக்கு இது ஒரு அற்புதமான நாள். உங்கள் இயல்பான வீரம் இன்று பன்மடங்கு பெருகும். நீங்கள் மேற்கொள்ளும் முயற்சிகள் அனைத்தும் வெற்றிப் பாதையை நோக்கியே பயணிக்கும். நீண்ட நாட்களாக நீங்கள் தள்ளிப்போட்ட காரியங்களை இன்று துணிச்சலுடன் செய்து முடிப்பதற்கான சிறந்த ஆற்றல் உங்களுக்குக் கிடைக்கும். உங்களின் மன உறுதி, எத்தகைய தடைகளையும் தகர்த்தெறியும் வலிமையை அளிக்கும். குடும்பத்தில் உள்ள உறவுகளுடன் இணக்கமாகப் பழகுவீர்கள். உறவினர்களுக்கிடையே ஏதேனும் சிறு மனஸ்தாபங்கள் இருந்தால், அவற்றை நீங்கள் முன்வந்து சரிசெய்வதற்கான வாய்ப்புகள் உண்டாகும். உங்கள் தலைமைப் பண்புகள் இன்று வெளிப்படும். பல விஷயங்களில் நீங்கள் முன்னின்று செயல்பட்டு, மற்றவர்களுக்கு வழிகாட்டுவீர்கள்.\n\nஉங்கள் கருத்துக்களுக்கு மதிப்புக் கொடுக்கப்படும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயம் தரும் பயணங்களாக அமையும். குறிப்பாக, நிலம் அல்லது வீடு தொடர்பான விஷயங்களில் நீங்கள் எடுக்கும் முடிவுகள் சாதகமாக இருக்கும். புதிய வீடு வாங்குவது அல்லது புதுப்பிப்பது தொடர்பான யோசனைகள் இன்று நடைமுறைக்கு வரும் வாய்ப்புள்ளது. உங்களின் தன்னம்பிக்கை உயரும். சக பணியாளர்களுடன் இணைந்து ஒரு குழுவாக செயல்படும்போது, உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். கலைத்துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் கூடுதல் கவனம் செலுத்தி, சிறப்பான முன்னேற்றத்தை அடைவார்கள். ஆசிரியர்களின் பாராட்டுகளைப் பெறுவார்கள். போட்டித் தேர்வுகளில் கலந்துகொள்பவர்கள் இன்று தங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்பைப் பெறுவார்கள். உங்களின் ஆழ்ந்த அறிவு, கடின உழைப்பு, மற்றும் விடாமுயற்சி ஆகியவை உங்களுக்கு வெற்றியைத் தேடித் தரும்.\n\nஉங்கள் வாழ்க்கைத் துணையுடன் இனிமையான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். அவர்களின் அன்பும் ஆதரவும் உங்களுக்கு மன அமைதியைத் தரும். திருமணமான தம்பதிகள் தங்கள் உறவை மேம்படுத்தும் வகையில் சிறப்பு நேரத்தை செலவிடுவார்கள். அன்பு இன்று மேலும் வலுப்பெறும். காதலர்களுக்கு இனிமையான அனுபவங்கள் ஏற்படும். அவர்கள் தங்கள் உறவை அடுத்த கட்டத்திற்கு எடுத்துச் செல்வது பற்றிச் சிந்திப்பார்கள். பெற்றோர்கள் தங்கள் குழந்தைகளின் எதிர்காலம் குறித்து ஆக்கபூர்வமான திட்டங்களை வகுப்பார்கள். குழந்தைகளின் திறமைகளை ஊக்குவிக்கும் விதமாக செயல்படுவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகள் இன்று அமையும். இதன் மூலம் உங்களின் நல்லெண்ணம் பரவும். உங்களின் தாராள குணம், மற்றவர்களுக்கு உதவும் மனப்பான்மை இன்று வெளிப்படும். நீங்கள் செய்யும் உதவிக்கு அங்கீகாரம் கிடைக்கும்.\n\nபுதிய திட்டங்களைத் தொடங்குவதற்கு இன்று மிகவும் பொருத்தமான நாள். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய முதலீடுகளைப் பற்றி நிபுணர்களுடன் ஆலோசிப்பீர்கள். உங்கள் உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். யோகா மற்றும் தியானம் போன்ற பயிற்சிகளை மேற்கொள்வது உங்கள் மனதுக்கும் உடலுக்கும் புத்துணர்வை அளிக்கும். உங்கள் ஆன்மிக நாட்டங்கள் அதிகரிக்கும். இறை வழிபாட்டில் அதிக நேரம் செலவிடுவீர்கள். உங்களின் நேர்மறை எண்ணங்கள், உங்களைச் சுற்றியுள்ளவர்களுக்கும் பரவும். நேர்மறையான கண்ணோட்டத்துடன் செயல்பட்டு, அனைத்து சவால்களையும் வெற்றிகரமாக எதிர்கொள்வீர்கள். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் எதிர்காலத்திற்கு நன்மை பயப்பதாக இருக்கும். உங்கள் ஆற்றல் இன்று உச்சத்தில் இருக்கும். நீங்கள் செய்யும் அனைத்து செயல்களிலும் வெற்றி நிச்சயம். இன்று உங்களுக்கு புதிய உத்வேகமும், புதுமையான எண்ணங்களும் பிறக்கும். இவற்றை சரியாகப் பயன்படுத்தி உங்கள் வாழ்வை வளமாக்கிக் கொள்வீர்கள். இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணிப்பீர்கள். உங்கள் தன்னம்பிக்கையும் தைரியமும் இன்று உங்களுக்கு சிறந்த துணையாக இருக்கும். எதிர்பாராத பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும்.",
    "prediction_en": "Today is Tuesday, and your day begins under the influence of the planet Mars. Mars is a planet that enhances your energy, courage, and efficiency. For you, Aries natives, this is a wonderful day. Your natural bravery will multiply today. All your endeavors will move towards the path of success. You will receive excellent energy today to courageously complete tasks you have long postponed. Your mental determination will provide the strength to overcome any obstacles. You will interact harmoniously with family members. If there are any minor disagreements among relatives, opportunities will arise for you to proactively resolve them. Your leadership qualities will shine today. You will take the lead in many matters and guide others.\n\nYour opinions will be valued. Journeys you undertake today will prove beneficial. Especially, decisions you make regarding land or property matters will be favorable. Ideas related to buying a new home or renovating an existing one may materialize today. Your self-confidence will rise. When working as a team with colleagues, your contribution will be significant. Innovative thoughts will guide you. Those in the arts will receive new opportunities. Students will pay extra attention to their studies and achieve excellent progress, earning praise from teachers. Those appearing for competitive exams will get a good opportunity to showcase their talents today. Your deep knowledge, hard work, and perseverance will bring you success.\n\nYou will share sweet moments with your life partner. Their love and support will bring you peace of mind. Married couples will spend quality time together to enhance their relationship. Love will grow stronger today. Lovers will have pleasant experiences and will think about taking their relationship to the next level. Parents will formulate constructive plans for their children's future and act in ways that encourage their children's talents. Opportunities for engaging in social service will arise today, through which your goodwill will spread. Your generous nature and willingness to help others will be evident today. Your assistance will be recognized.\n\nToday is a very suitable day to start new projects. You will consider new investments. You will consult experts about long-term profitable investments. Your physical health will improve. You will perform daily tasks with enthusiasm. Practicing yoga and meditation will refresh your mind and body. Your spiritual inclinations will increase, and you will spend more time in devotion. Your positive thoughts will spread to those around you. You will act with a positive outlook and successfully overcome all challenges. All decisions you make today will be beneficial for your future. Your energy will be at its peak today, and success is certain in all your endeavors. Today, you will experience new enthusiasm and innovative ideas. By utilizing them correctly, you will enrich your life. Today, you will move steadfastly towards your goals. Your self-confidence and courage will be your best companions today. Unexpected praise and recognition await you.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் உத்வேகம் அதிகரிக்கும். புதிய திட்டங்களை முன்னின்று நடத்துவீர்கள். உங்கள் துணிச்சல் நிறைந்த அணுகுமுறை உயரதிகாரிகளால் பாராட்டப்படும். குழுப்பணிகளில் உங்கள் தலைமைப் பண்பு சிறப்பாக வெளிப்படும். புதுமையான யோசனைகளை முன்வைத்து, சக பணியாளர்களின் ஒத்துழைப்பைப் பெறுவீர்கள். புதிய பொறுப்புகள் உங்களைத் தேடி வரும். நம்பிக்கையுடன் அவற்றை ஏற்றுக்கொண்டு, சிறப்பாகச் செயல்படுவீர்கள். சுயதொழில் புரிபவர்களுக்கு இன்று புதிய வாடிக்கையாளர்கள் கிடைப்பார்கள்.",
    "career_en": "Your enthusiasm will increase at work. You will take the lead in new projects. Your courageous approach will be appreciated by superiors. Your leadership qualities will shine brightly in team tasks. You will propose innovative ideas and gain the cooperation of colleagues. New responsibilities will come your way, which you will accept with confidence and perform excellently. Self-employed individuals will gain new clients today.",
    "finance_ta": "நிதிநிலைமை இன்று சாதகமாக இருக்கும். நீண்டகால முதலீடுகள் பற்றி ஆலோசிப்பீர்கள். சேமிக்கும் பழக்கத்தை மேம்படுத்துவீர்கள். எதிர்பாராத வகையில் சிறு ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது. நிலம் அல்லது வீடு தொடர்பான விஷயங்களில் நல்ல முடிவுகளை எடுப்பீர்கள். இன்று நீங்கள் மேற்கொள்ளும் நிதி சார்ந்த முடிவுகள் எதிர்காலத்திற்கு நன்மை பயக்கும். பண வரவு சீராக இருக்கும்.",
    "finance_en": "The financial situation will be favorable today. You will consult about long-term investments and improve your saving habits. There is a possibility of small unexpected gains. You will make good decisions regarding land or property matters. Financial decisions you make today will be beneficial for the future. Cash flow will be stable.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். உற்சாகத்துடன் இருப்பீர்கள். யோகா, நடைப்பயிற்சி போன்ற உடற்பயிற்சிகளை மேற்கொள்வது உங்கள் ஆற்றலை மேலும் அதிகரிக்கும். மன அமைதிக்காக தியானம் செய்வது நன்மை பயக்கும். இன்று முழுவதும் சுறுசுறுப்புடன் செயல்படுவீர்கள். சரியான உணவுப் பழக்கத்தைப் பின்பற்றுவது நல்லது.",
    "health_en": "Your physical health will be excellent. You will be energetic. Practicing exercises like yoga and walking will further boost your energy. Meditating for mental peace will be beneficial. You will be active throughout the day. Following a proper diet is advisable.",
    "lucky_number": "9",
    "lucky_color_ta": "செந்திறம்",
    "lucky_color_en": "Scarlet"
  },
  {
    "sign_ta": "ரிஷபம்",
    "sign_en": "Taurus",
    "date": "17-02-2026",
    "prediction_ta": "ரிஷப ராசிக்காரர்களுக்கு இன்று செவ்வாய்க்கிழமை, செவ்வாயின் ஆதிக்கத்தில் உங்கள் நாள் ஆற்றல் மிக்கதாக இருக்கும். உங்கள் இயல்பான பொறுமைக்கு சற்று மாறுதலாக, இன்று நீங்கள் துணிச்சலுடன் முடிவெடுக்கும் ஆற்றலைப் பெறுவீர்கள். இது உங்கள் நீண்டகால இலக்குகளை அடைவதற்குப் பெரிதும் உதவும். நீங்கள் இதுவரை செய்யத் தயங்கிய விஷயங்களை இன்று உறுதியுடன் தொடங்கி வெற்றிகரமாக முடிப்பீர்கள். குடும்ப உறுப்பினர்களுடன் இன்று நல்லுறவு ஏற்படும். சகோதர சகோதரிகளுடன் சுமுகமான உரையாடல்கள் நிகழும். உங்கள் மனதை அழுத்திக்கொண்டிருந்த சில விஷயங்களுக்கு இன்று தெளிவான தீர்வு கிடைக்கும். குறிப்பாக, சொத்து சம்பந்தமான விஷயங்களில் சாதகமான திருப்பங்கள் ஏற்படும். புதிய முதலீடுகள் பற்றி சிந்திப்பீர்கள், அவற்றுக்கு இது ஒரு நல்ல நாளாகும்.\n\nஉங்களின் விடாமுயற்சி இன்று கூடுதல் பலனளிக்கும். பணியிடத்தில் உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். சக ஊழியர்களுடன் இணைந்து ஒரு திட்டத்தை வெற்றிகரமாக முடிப்பீர்கள். உங்கள் தலைமைப் பண்புகள் இன்று வெளிப்படும். நீங்கள் முன்வைக்கும் யோசனைகள் ஏற்றுக்கொள்ளப்படும். கல்வித்துறையில் உள்ளவர்கள் தங்கள் படிப்பில் சிறந்து விளங்குவார்கள். போட்டித் தேர்வுகளுக்குத் தயாராகும் மாணவர்கள் இன்று கூடுதல் ஊக்கத்துடன் படிப்பார்கள். ஆசிரியர்களின் வழிகாட்டுதல் உங்களுக்குப் பயனுள்ளதாக அமையும். உங்கள் திறமைகளை வெளிப்படுத்த இன்று நல்ல வாய்ப்புகள் அமையும். சமூக வலைத்தளங்களில் உங்கள் கருத்துக்கள் பாராட்டு பெறும். புதிய நண்பர்களைச் சந்திப்பீர்கள், அவர்களுடன் ஆழமான உறவை வளர்த்துக்கொள்வீர்கள்.\n\nகாதல் உறவுகளில் இன்று இனிமை பெருகும். உங்கள் துணையுடன் ஆழமான உணர்வுகளைப் பகிர்ந்து கொள்வீர்கள். திருமணமான தம்பதிகள் தங்கள் உறவில் புதிய அத்தியாயத்தைத் தொடங்குவார்கள். பரஸ்பர புரிதல் அதிகரிக்கும். குழந்தைகளுடன் நேரத்தைச் செலவிடுவது உங்களுக்கு மனமகிழ்ச்சியைத் தரும். அவர்களின் எதிர்காலத் திட்டங்களில் நீங்கள் ஆதரவாக இருப்பீர்கள். பெற்றோர்களின் ஆரோக்கியத்தில் கவனம் செலுத்துவீர்கள். சமூக சேவைகளில் ஈடுபட இன்று வாய்ப்புகள் அமையும். இதன் மூலம் உங்களின் நல்லெண்ணம் மேலும் பரவும். மற்றவர்களுக்கு உதவும் மனப்பான்மை இன்று உங்களைச் சுற்றியுள்ளவர்களின் பாராட்டுகளைப் பெற்றுத் தரும்.\n\nஆன்மிகப் பயணங்களை மேற்கொள்வதற்கு இன்று நல்ல நாள். கோயில் தரிசனங்கள் மன அமைதியைத் தரும். உங்கள் ஆன்மிக நாட்டங்கள் அதிகரிக்கும். புதிய கலாச்சாரங்களை அறிந்துகொள்வதில் ஆர்வம் காட்டுவீர்கள். கலை மற்றும் இசைத்துறையில் உள்ளவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் கிடைக்கும். உங்கள் திறமைகளை வெளிப்படுத்த இது ஒரு நல்ல நாள். மனதளவில் மிகவும் அமைதியாகவும், உறுதியாகவும் இருப்பீர்கள். உடல் ஆரோக்கியம் மேம்படும். யோகா, தியானம் போன்ற பயிற்சிகள் உங்களுக்கு நன்மை பயக்கும். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் வாழ்க்கைக்குச் சாதகமாக அமையும். தன்னம்பிக்கையுடன் செயல்பட்டு, இலக்குகளை அடைவீர்கள். நேர்மறை எண்ணங்கள் உங்களைச் சுற்றியுள்ளவர்களுக்கும் பரவும். இன்று நீங்கள் மேற்கொள்ளும் அனைத்து முயற்சிகளிலும் வெற்றி நிச்சயம். இன்று உங்களுக்கு புதிய உத்வேகமும், புதுமையான எண்ணங்களும் பிறக்கும். இவற்றை சரியாகப் பயன்படுத்தி உங்கள் வாழ்வை வளமாக்கிக் கொள்வீர்கள். உங்கள் தைரியமும், விடாமுயற்சியும் இன்று உங்களுக்கு சிறந்த துணையாக இருக்கும். எதிர்பாராத அங்கீகாரமும், மகிழ்ச்சியும் கிடைக்கும்.",
    "prediction_en": "For Taurus natives, today, Tuesday, will be an energetic day under the influence of Mars. Contrary to your usual patience, today you will gain the ability to make courageous decisions. This will greatly help you achieve your long-term goals. You will confidently start and successfully complete tasks you have hesitated to do until now. Good relationships will form with family members today. There will be harmonious conversations with siblings. A clear solution will be found today for some matters that have been weighing on your mind. Particularly, favorable turns will occur in property-related matters. You will think about new investments, and this is a good day for them.\n\nYour perseverance will yield extra benefits today. Your contribution will be significant in the workplace. Innovative thoughts will guide you. You will successfully complete a project in collaboration with colleagues. Your leadership qualities will emerge today, and your ideas will be accepted. Those in education will excel in their studies. Students preparing for competitive exams will study with added motivation today. Teacher's guidance will be beneficial to you. Good opportunities will arise today to showcase your talents. Your opinions will receive praise on social media. You will meet new friends and develop deep relationships with them.\n\nToday, sweetness will abound in romantic relationships. You will share deep feelings with your partner. Married couples will begin a new chapter in their relationship. Mutual understanding will increase. Spending time with children will bring you joy. You will be supportive of their future plans. You will pay attention to your parents' health. Opportunities to engage in social service will arise today, through which your goodwill will further spread. Your willingness to help others will earn you praise from those around you today.\n\nToday is a good day to undertake spiritual journeys. Temple visits will bring peace of mind. Your spiritual inclinations will increase. You will show interest in learning about new cultures. Those in the arts and music fields will receive excellent opportunities today. This is a good day to showcase your talents. You will be mentally very calm and resolute. Physical health will improve. Practices like yoga and meditation will benefit you. All decisions you make today will be favorable for your life. You will act with self-confidence and achieve your goals. Positive thoughts will spread to those around you. Success is certain in all your endeavors today. Today, new inspiration and innovative ideas will arise for you. By using them correctly, you will enrich your life. Your courage and perseverance will be your best companions today. Unexpected recognition and happiness await you.",
    "career_ta": "பணியிடத்தில் உங்கள் முயற்சிகள் பாராட்டப்படும். புதிய பொறுப்புகள் உங்களைத் தேடி வரும். சக ஊழியர்களுடன் இணைந்து செயல்பட்டு, திட்டங்களை வெற்றிகரமாக முடிப்பீர்கள். உங்கள் துணிச்சலான முடிவுகள் உங்கள் பதவி உயர்வுக்கு வழி வகுக்கும். சுயதொழில் புரிபவர்களுக்கு இன்று புதிய வாடிக்கையாளர்கள் கிடைப்பார்கள், வியாபாரம் பெருகும். உங்கள் பேச்சுத்திறமை உங்களுக்கு உதவும்.",
    "career_en": "Your efforts at the workplace will be appreciated. New responsibilities will come your way. You will work with colleagues to successfully complete projects. Your courageous decisions will pave the way for your promotion. Self-employed individuals will gain new clients today, and business will flourish. Your communication skills will assist you.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதி தேவைகள் பூர்த்தி செய்யப்படும். சிறு அளவில் எதிர்பாராத லாபம் கிடைக்க வாய்ப்புள்ளது. நிலம் அல்லது வீடு தொடர்பான விஷயங்களில் சாதகமான முடிவுகள் எடுக்கப்படும். பட்ஜெட் திட்டமிடல் உங்களுக்கு உதவும்.",
    "finance_en": "The financial situation will be stable. You will consider new investments and focus on savings plans. Family financial needs will be met. There is a possibility of small unexpected profits. Favorable decisions will be made regarding land or property matters. Budget planning will assist you.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். நடைப்பயிற்சி, உடற்பயிற்சி போன்றவற்றை மேற்கொள்வது நல்லது. மன அமைதிக்காக தியானம் செய்வது நன்மை தரும். புதிய உணவுப் பழக்கங்களை மேற்கொள்வீர்கள். புத்துணர்ச்சியுடன் செயல்படுவீர்கள்.",
    "health_en": "Physical health will improve. You will perform daily tasks with enthusiasm. It is good to engage in activities like walking and exercise. Meditating for mental peace will be beneficial. You will adopt new eating habits and act with renewed vigor.",
    "lucky_number": "6",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "மிதுனம்",
    "sign_en": "Gemini",
    "date": "17-02-2026",
    "prediction_ta": "மிதுன ராசிக்காரர்களுக்கு இன்று செவ்வாய்க்கிழமை, செவ்வாய் கிரகத்தின் ஆதிக்கத்தில் உங்கள் நாள் தொடங்குவதால், உங்கள் எண்ணங்களும் செயல்களும் துடிப்புடன் இருக்கும். உங்கள் இயல்பான அறிவுக்கூர்மையுடன், இன்று துணிச்சலும் சேரும். இதனால், நீங்கள் எடுக்கும் முடிவுகள் தெளிவுடனும், வேகத்துடனும் இருக்கும். நீண்ட நாட்களாக நீங்கள் தள்ளிப்போட்ட காரியங்களை இன்று முடிப்பதற்கான நல்ல ஆற்றல் உங்களுக்குக் கிடைக்கும். குறிப்பாக, தகவல் தொடர்புத் துறையில் நீங்கள் மேற்கொள்ளும் முயற்சிகள் வெற்றி பெறும். புதிய ஒப்பந்தங்கள் அல்லது திட்டங்கள் குறித்துப் பேசுவதற்கு இது ஒரு சிறந்த நாளாகும். உங்கள் கருத்துக்கள் தெளிவாகவும், உறுதியாகவும் வெளிப்படும், அவை மற்றவர்களால் ஏற்றுக்கொள்ளப்படும்.\n\nகுடும்பத்தில் மகிழ்ச்சி நிலவும். உடன்பிறப்புகளுடன் நல்லுறவு ஏற்படும். அவர்களின் நலனில் அக்கறை காட்டுவீர்கள். உறவினர்களுடன் சிறிய அளவில் மனஸ்தாபங்கள் இருந்தால், அதைத் தீர்க்க நீங்கள் முன்வருவீர்கள். பெற்றோர்களின் ஆலோசனைகள் உங்களுக்குப் பயனுள்ளதாக அமையும். உங்கள் நகைச்சுவை உணர்வு இன்று பலரையும் ஈர்க்கும். சமூகத்தில் உங்கள் மதிப்பு உயரும். புதிய நண்பர்களைச் சந்திப்பதற்கான வாய்ப்புகள் அமையும். நீங்கள் ஒரு புதிய குழுவில் இணைவதற்கான வாய்ப்பும் உள்ளது. கலை மற்றும் இலக்கியத் துறையில் உள்ளவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் கிடைக்கும். உங்கள் எழுத்துத்திறமை அல்லது பேச்சுத்திறமை பாராட்டப்படும். மாணவர்கள் தங்கள் படிப்பில் கூடுதல் கவனம் செலுத்தி, நல்ல மதிப்பெண்களைப் பெறுவார்கள். போட்டித் தேர்வுகளுக்குத் தயாராகும் மாணவர்கள் இன்று தங்கள் பாடங்களில் ஆழமான புரிதலைப் பெறுவார்கள். ஆசிரியர்களின் வழிகாட்டுதல் இன்று உங்களுக்கு மிகவும் பயனுள்ளதாக இருக்கும்.\n\nஉங்கள் வாழ்க்கைத் துணையுடன் இனிமையான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். அவர்களின் அன்பும் ஆதரவும் உங்களுக்கு மன அமைதியைத் தரும். திருமணமான தம்பதிகள் தங்கள் உறவை மேம்படுத்தும் வகையில் சிறப்பு நேரத்தைச் செலவிடுவார்கள். காதலர்களுக்கு இன்று இனிமையான அனுபவங்கள் ஏற்படும், தங்கள் உறவை அடுத்த கட்டத்திற்கு எடுத்துச் செல்வது பற்றிச் சிந்திப்பார்கள். குழந்தைகளின் திறமைகளை ஊக்குவிப்பீர்கள். அவர்களின் எதிர்காலத் திட்டங்களுக்கு ஆதரவாக இருப்பீர்கள். பொதுத் தொண்டுகளில் ஈடுபட இன்று வாய்ப்புகள் அமையும். இதன் மூலம் உங்களின் நல்லெண்ணம் பரவும். உங்களின் தாராள குணம், மற்றவர்களுக்கு உதவும் மனப்பான்மை இன்று வெளிப்படும். நீங்கள் செய்யும் உதவிக்கு அங்கீகாரம் கிடைக்கும். உங்கள் கருத்துக்கள் இன்று பலரால் ஏற்றுக்கொள்ளப்படும்.\n\nபுதிய திட்டங்களைத் தொடங்குவதற்கு இன்று மிகவும் பொருத்தமான நாள். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய முதலீடுகளைப் பற்றி நிபுணர்களுடன் ஆலோசிப்பீர்கள். உங்கள் உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். மன அழுத்தத்தைப் போக்க தியானம் செய்வது நன்மை பயக்கும். யோகா பயிற்சிகள் உங்கள் உடலுக்குப் புத்துணர்ச்சி அளிக்கும். உங்கள் ஆன்மிக நாட்டங்கள் அதிகரிக்கும். இறை வழிபாட்டில் அதிக நேரம் செலவிடுவீர்கள். உங்களின் நேர்மறை எண்ணங்கள், உங்களைச் சுற்றியுள்ளவர்களுக்கும் பரவும். நேர்மறையான கண்ணோட்டத்துடன் செயல்பட்டு, அனைத்து சவால்களையும் வெற்றிகரமாக எதிர்கொள்வீர்கள். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் எதிர்காலத்திற்கு நன்மை பயப்பதாக இருக்கும். உங்கள் ஆற்றல் இன்று உச்சத்தில் இருக்கும். நீங்கள் செய்யும் அனைத்து செயல்களிலும் வெற்றி நிச்சயம். இன்று உங்களுக்கு புதிய உத்வேகமும், புதுமையான எண்ணங்களும் பிறக்கும். இவற்றை சரியாகப் பயன்படுத்தி உங்கள் வாழ்வை வளமாக்கிக் கொள்வீர்கள். இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணிப்பீர்கள். உங்கள் தன்னம்பிக்கையும் தைரியமும் இன்று உங்களுக்கு சிறந்த துணையாக இருக்கும். எதிர்பாராத பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும்.",
    "prediction_en": "For Gemini natives, today, Tuesday, starting under the influence of Mars, your thoughts and actions will be vibrant. With your inherent intellectual prowess, courage will also be added today. As a result, your decisions will be clear and swift. You will gain good energy today to complete tasks you have long postponed. Particularly, your efforts in the field of communication will succeed. This is an excellent day to discuss new contracts or projects. Your ideas will be expressed clearly and firmly, and they will be accepted by others.\n\nThere will be happiness in the family. Good relationships will form with siblings; you will show concern for their welfare. If there are minor disagreements with relatives, you will come forward to resolve them. Parents' advice will be beneficial to you. Your sense of humor will attract many today. Your prestige in society will increase. Opportunities to meet new friends will arise. There is also a possibility of joining a new group. Those in the arts and literature fields will receive excellent opportunities today. Your writing or speaking skills will be appreciated. Students will pay extra attention to their studies and achieve good marks. Students preparing for competitive exams will gain a deep understanding of their subjects today. Teacher's guidance will be very beneficial to you today.\n\nYou will share sweet moments with your life partner. Their love and support will bring you peace of mind. Married couples will spend quality time together to enhance their relationship. Lovers will have pleasant experiences today and will think about taking their relationship to the next level. You will encourage your children's talents and be supportive of their future plans. Opportunities to engage in public service will arise today, through which your goodwill will spread. Your generous nature and willingness to help others will be evident today. Your assistance will be recognized. Your opinions will be accepted by many today.\n\nToday is a very suitable day to start new projects. You will consider new investments. You will consult experts about long-term profitable investments. Your physical health will improve. You will perform daily tasks with enthusiasm. Practicing meditation to relieve stress will be beneficial. Yoga exercises will refresh your body. Your spiritual inclinations will increase, and you will spend more time in devotion. Your positive thoughts will spread to those around you. You will act with a positive outlook and successfully overcome all challenges. All decisions you make today will be beneficial for your future. Your energy will be at its peak today, and success is certain in all your endeavors. Today, new inspiration and innovative ideas will arise for you. By utilizing them correctly, you will enrich your life. Today, you will move steadfastly towards your goals. Your self-confidence and courage will be your best companions today. Unexpected praise and recognition await you.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் கருத்துக்களுக்கு நல்ல வரவேற்பு கிடைக்கும். புதிய திட்டங்களை வெற்றிகரமாக முடிப்பீர்கள். சக பணியாளர்களுடன் சுமுகமான உறவு நீடிக்கும். உங்கள் புத்திசாலித்தனம் இன்று உங்களுக்கு நல்ல பெயரைப் பெற்றுத்தரும். நிர்வாகத் திறமைகள் மேம்படும். இன்று நீங்கள் எடுக்கும் துணிச்சலான முடிவுகள் உங்கள் தொழில் வாழ்க்கைக்கு நன்மை பயக்கும்.",
    "career_en": "Your ideas will be well received at the workplace. You will successfully complete new projects. Harmonious relationships with colleagues will continue. Your intelligence will earn you a good reputation today. Management skills will improve. The courageous decisions you make today will benefit your professional life.",
    "finance_ta": "நிதிநிலையில் நல்ல முன்னேற்றம் இருக்கும். புதிய வருமான வழிகள் உருவாக வாய்ப்புள்ளது. முதலீடுகள் குறித்து ஆலோசிப்பீர்கள். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். தேவையில்லாத செலவுகளைக் கட்டுப்படுத்துவீர்கள். இன்று நீங்கள் எடுக்கும் நிதி முடிவுகள் நீண்டகால லாபம் தரும். குடும்பத்தின் நிதி ஸ்திரத்தன்மை அதிகரிக்கும்.",
    "finance_en": "There will be good progress in finances. New income streams are likely to emerge. You will consult about investments and focus on savings plans. You will control unnecessary expenses. Financial decisions you make today will yield long-term profits. Family financial stability will increase.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் புதிய உற்சாகம் பிறக்கும். யோகா, தியானம் போன்றவற்றை மேற்கொள்வது உங்கள் மனதை அமைதிப்படுத்தும். நடைப்பயிற்சி செய்வது உடலுக்கு நல்லது. ஆரோக்கியமான உணவுப் பழக்கங்களை மேற்கொள்வீர்கள். உங்கள் உடல் ஆற்றல் இன்று பெருகும்.",
    "health_en": "Physical health will be stable. New enthusiasm will arise in your mind. Engaging in yoga and meditation will calm your mind. Walking is good for the body. You will adopt healthy eating habits. Your physical energy will increase today.",
    "lucky_number": "5",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "17-02-2026",
    "prediction_ta": "கடக ராசிக்காரர்களுக்கு இன்று செவ்வாய்க்கிழமை, செவ்வாய் கிரகத்தின் ஆதிக்கத்தில் உங்கள் நாள் தொடங்குகிறது. பொதுவாக உணர்ச்சிபூர்வமானவர்களாக இருக்கும் நீங்கள், இன்று துணிச்சலுடனும், உறுதியுடனும் செயல்படுவீர்கள். உங்கள் மனதில் தோன்றும் நல்லெண்ணங்கள் செயல்களாக மாறும். குடும்பத்தின் மீது உங்களுக்குள்ள அன்பு மேலும் அதிகரிக்கும். வீட்டைப் புதுப்பிப்பது அல்லது புதிய பொருட்களை வாங்குவது தொடர்பான யோசனைகள் இன்று நடைமுறைக்கு வரலாம். சொத்து தொடர்பான விஷயங்களில் நீங்கள் எடுக்கும் முடிவுகள் சாதகமாக இருக்கும்.\n\nபணியிடத்தில் உங்கள் கடின உழைப்புக்கு அங்கீகாரம் கிடைக்கும். புதிய பொறுப்புகளை நம்பிக்கையுடன் ஏற்றுக்கொள்வீர்கள். சக பணியாளர்களுடன் இணக்கமாகப் பழகுவீர்கள். உங்கள் தலைமைப் பண்புகள் இன்று வெளிப்படும். பல விஷயங்களில் நீங்கள் முன்னின்று செயல்பட்டு, மற்றவர்களுக்கு வழிகாட்டுவீர்கள். புதுமையான திட்டங்களை முன்வைத்து, வெற்றிகரமாக செயல்படுத்துவீர்கள். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயம் தரும் பயணங்களாக அமையும். குறிப்பாக, நிலம் அல்லது வீடு தொடர்பான விஷயங்களில் நீங்கள் எடுக்கும் முடிவுகள் சாதகமாக இருக்கும். உங்களின் தன்னம்பிக்கை உயரும். சக பணியாளர்களுடன் இணைந்து ஒரு குழுவாக செயல்படும்போது, உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். கலைத்துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் கூடுதல் கவனம் செலுத்தி, சிறப்பான முன்னேற்றத்தை அடைவார்கள். ஆசிரியர்களின் பாராட்டுகளைப் பெறுவார்கள். போட்டித் தேர்வுகளில் கலந்துகொள்பவர்கள் இன்று தங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்பைப் பெறுவார்கள். உங்களின் ஆழ்ந்த அறிவு, கடின உழைப்பு, மற்றும் விடாமுயற்சி ஆகியவை உங்களுக்கு வெற்றியைத் தேடித் தரும்.\n\nஉங்கள் வாழ்க்கைத் துணையுடன் இனிமையான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். அவர்களின் அன்பும் ஆதரவும் உங்களுக்கு மன அமைதியைத் தரும். திருமணமான தம்பதிகள் தங்கள் உறவை மேம்படுத்தும் வகையில் சிறப்பு நேரத்தை செலவிடுவார்கள். அன்பு இன்று மேலும் வலுப்பெறும். காதலர்களுக்கு இனிமையான அனுபவங்கள் ஏற்படும். அவர்கள் தங்கள் உறவை அடுத்த கட்டத்திற்கு எடுத்துச் செல்வது பற்றிச் சிந்திப்பார்கள். பெற்றோர்கள் தங்கள் குழந்தைகளின் எதிர்காலம் குறித்து ஆக்கபூர்வமான திட்டங்களை வகுப்பார்கள். குழந்தைகளின் திறமைகளை ஊக்குவிக்கும் விதமாக செயல்படுவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகள் இன்று அமையும். இதன் மூலம் உங்களின் நல்லெண்ணம் பரவும். உங்களின் தாராள குணம், மற்றவர்களுக்கு உதவும் மனப்பான்மை இன்று வெளிப்படும். நீங்கள் செய்யும் உதவிக்கு அங்கீகாரம் கிடைக்கும்.\n\nபுதிய திட்டங்களைத் தொடங்குவதற்கு இன்று மிகவும் பொருத்தமான நாள். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய முதலீடுகளைப் பற்றி நிபுணர்களுடன் ஆலோசிப்பீர்கள். உங்கள் உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். யோகா மற்றும் தியானம் போன்ற பயிற்சிகளை மேற்கொள்வது உங்கள் மனதுக்கும் உடலுக்கும் புத்துணர்வை அளிக்கும். உங்கள் ஆன்மிக நாட்டங்கள் அதிகரிக்கும். இறை வழிபாட்டில் அதிக நேரம் செலவிடுவீர்கள். உங்களின் நேர்மறை எண்ணங்கள், உங்களைச் சுற்றியுள்ளவர்களுக்கும் பரவும். நேர்மறையான கண்ணோட்டத்துடன் செயல்பட்டு, அனைத்து சவால்களையும் வெற்றிகரமாக எதிர்கொள்வீர்கள். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் எதிர்காலத்திற்கு நன்மை பயப்பதாக இருக்கும். உங்கள் ஆற்றல் இன்று உச்சத்தில் இருக்கும். நீங்கள் செய்யும் அனைத்து செயல்களிலும் வெற்றி நிச்சயம். இன்று உங்களுக்கு புதிய உத்வேகமும், புதுமையான எண்ணங்களும் பிறக்கும். இவற்றை சரியாகப் பயன்படுத்தி உங்கள் வாழ்வை வளமாக்கிக் கொள்வீர்கள். இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணிப்பீர்கள். உங்கள் தன்னம்பிக்கையும் தைரியமும் இன்று உங்களுக்கு சிறந்த துணையாக இருக்கும். எதிர்பாராத பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும்.",
    "prediction_en": "For Cancer natives, today is Tuesday, and your day begins under the influence of Mars. Usually emotional, today you will act with courage and determination. Your good intentions will translate into actions. Your love for your family will further increase. Ideas related to renovating your home or buying new items may materialize today. Decisions you make regarding property matters will be favorable.\n\nYour hard work will be recognized at the workplace. You will confidently accept new responsibilities. You will interact harmoniously with colleagues. Your leadership qualities will shine today. You will take the lead in many matters and guide others. You will propose innovative projects and implement them successfully. Journeys you undertake today will prove beneficial. Especially, decisions you make regarding land or property matters will be favorable. Your self-confidence will rise. When working as a team with colleagues, your contribution will be significant. Innovative thoughts will guide you. Those in the arts will receive new opportunities. Students will pay extra attention to their studies and achieve excellent progress, earning praise from teachers. Those appearing for competitive exams will get a good opportunity to showcase their talents today. Your deep knowledge, hard work, and perseverance will bring you success.\n\nYou will share sweet moments with your life partner. Their love and support will bring you peace of mind. Married couples will spend quality time together to enhance their relationship. Love will grow stronger today. Lovers will have pleasant experiences and will think about taking their relationship to the next level. Parents will formulate constructive plans for their children's future and act in ways that encourage their children's talents. Opportunities for engaging in social service will arise today, through which your goodwill will spread. Your generous nature and willingness to help others will be evident today. Your assistance will be recognized.\n\nToday is a very suitable day to start new projects. You will consider new investments. You will consult experts about long-term profitable investments. Your physical health will improve. You will perform daily tasks with enthusiasm. Practicing yoga and meditation will refresh your mind and body. Your spiritual inclinations will increase, and you will spend more time in devotion. Your positive thoughts will spread to those around you. You will act with a positive outlook and successfully overcome all challenges. All decisions you make today will be beneficial for your future. Your energy will be at its peak today, and success is certain in all your endeavors. Today, new inspiration and innovative ideas will arise for you. By utilizing them correctly, you will enrich your life. Today, you will move steadfastly towards your goals. Your self-confidence and courage will be your best companions today. Unexpected praise and recognition await you.",
    "career_ta": "பணியிடத்தில் உங்கள் அர்ப்பணிப்பு பாராட்டப்படும். புதிய சவால்களை துணிச்சலுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். உங்கள் யோசனைகள் ஏற்றுக்கொள்ளப்படும். குழுத் தலைவராக செயல்பட வாய்ப்புகள் கிடைக்கும். புதிய திட்டங்களை வெற்றிகரமாக முடிப்பீர்கள். உங்கள் கடின உழைப்புக்கு ஏற்ற அங்கீகாரம் கிடைக்கும்.",
    "career_en": "Your dedication at the workplace will be appreciated. You will bravely face new challenges and succeed. Your ideas will be accepted. Opportunities to act as a team leader will arise. You will successfully complete new projects. You will receive due recognition for your hard work.",
    "finance_ta": "நிதிநிலையில் முன்னேற்றம் ஏற்படும். சொத்து தொடர்பான விஷயங்களில் சாதகமான திருப்பங்கள் ஏற்படும். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். குடும்பத்தின் நிதி தேவைகள் பூர்த்தி செய்யப்படும். சிறு அளவில் எதிர்பாராத ஆதாயம் கிடைக்க வாய்ப்புள்ளது. சிக்கன நடவடிக்கைகளை மேற்கொண்டு சேமிப்பை உயர்த்துவீர்கள்.",
    "finance_en": "There will be financial progress. Favorable turns will occur in property-related matters. You will consider new investments. Family financial needs will be met. There is a possibility of small unexpected gains. You will take austerity measures and increase savings.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். மனதில் புதிய உற்சாகம் நிலவும். சரியான உணவுப் பழக்கங்களைப் பின்பற்றுவீர்கள். மன அழுத்தத்தைப் போக்க தியானம் செய்வது நன்மை பயக்கும். யோகா பயிற்சிகள் உடலுக்குப் புத்துணர்ச்சி அளிக்கும். சுறுசுறுப்புடன் செயல்படுவீர்கள்.",
    "health_en": "Physical health will improve. New enthusiasm will prevail in your mind. You will follow proper eating habits. Meditating to relieve stress will be beneficial. Yoga exercises will refresh the body. You will act actively.",
    "lucky_number": "2",
    "lucky_color_ta": "வெள்ளி",
    "lucky_color_en": "Silver"
  },
  {
    "sign_ta": "சிம்மம்",
    "sign_en": "Leo",
    "date": "17-02-2026",
    "prediction_ta": "சிம்ம ராசிக்காரர்களுக்கு இன்று செவ்வாய்க்கிழமை, செவ்வாய் கிரகத்தின் ஆதிக்கத்தில் உங்கள் நாள் ஆற்றல் மிக்கதாகத் தொடங்குகிறது. உங்கள் இயல்பான தலைமைத்துவப் பண்புகளுடன், இன்று கூடுதல் துணிச்சலும், உறுதிப்பாடும் சேரும். இதனால், நீங்கள் எடுக்கும் முடிவுகள் சிறப்பாக அமையும். நீண்டகாலமாக நிலுவையில் உள்ள காரியங்களை இன்று துணிச்சலுடன் முடிப்பீர்கள். உங்கள் தன்னம்பிக்கை உயரும், அது உங்கள் இலக்குகளை அடைய உதவும். குடும்பத்தில் மகிழ்ச்சி நிலவும். உடன்பிறப்புகளுடன் இணக்கமான உறவு ஏற்படும். அவர்களுக்குத் தேவையான உதவிகளைச் செய்வீர்கள்.\n\nசமூகத்தில் உங்கள் மதிப்பு உயரும். புதிய நண்பர்களைச் சந்திப்பதற்கான வாய்ப்புகள் அமையும். உங்கள் கருத்துக்கள் பலரால் ஏற்றுக்கொள்ளப்படும். பணியிடத்தில் உங்கள் தலைமைப் பண்புகள் வெளிப்படும். புதிய திட்டங்களை முன்னின்று நடத்துவீர்கள். உங்கள் திறமைகளும், அர்ப்பணிப்பும் உயரதிகாரிகளால் பாராட்டப்படும். சக ஊழியர்களுடன் இணைந்து ஒரு குழுவாக செயல்படும்போது, உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். கலைத்துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் கூடுதல் கவனம் செலுத்தி, சிறப்பான முன்னேற்றத்தை அடைவார்கள். ஆசிரியர்களின் பாராட்டுகளைப் பெறுவார்கள். போட்டித் தேர்வுகளில் கலந்துகொள்பவர்கள் இன்று தங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்பைப் பெறுவார்கள். உங்களின் ஆழ்ந்த அறிவு, கடின உழைப்பு, மற்றும் விடாமுயற்சி ஆகியவை உங்களுக்கு வெற்றியைத் தேடித் தரும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயம் தரும் பயணங்களாக அமையும். குறிப்பாக, நிலம் அல்லது வீடு தொடர்பான விஷயங்களில் நீங்கள் எடுக்கும் முடிவுகள் சாதகமாக இருக்கும்.\n\nஉங்கள் வாழ்க்கைத் துணையுடன் இனிமையான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். அவர்களின் அன்பும் ஆதரவும் உங்களுக்கு மன அமைதியைத் தரும். திருமணமான தம்பதிகள் தங்கள் உறவை மேம்படுத்தும் வகையில் சிறப்பு நேரத்தை செலவிடுவார்கள். அன்பு இன்று மேலும் வலுப்பெறும். காதலர்களுக்கு இனிமையான அனுபவங்கள் ஏற்படும். அவர்கள் தங்கள் உறவை அடுத்த கட்டத்திற்கு எடுத்துச் செல்வது பற்றிச் சிந்திப்பார்கள். பெற்றோர்கள் தங்கள் குழந்தைகளின் எதிர்காலம் குறித்து ஆக்கபூர்வமான திட்டங்களை வகுப்பார்கள். குழந்தைகளின் திறமைகளை ஊக்குவிக்கும் விதமாக செயல்படுவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகள் இன்று அமையும். இதன் மூலம் உங்களின் நல்லெண்ணம் பரவும். உங்களின் தாராள குணம், மற்றவர்களுக்கு உதவும் மனப்பான்மை இன்று வெளிப்படும். நீங்கள் செய்யும் உதவிக்கு அங்கீகாரம் கிடைக்கும்.\n\nபுதிய திட்டங்களைத் தொடங்குவதற்கு இன்று மிகவும் பொருத்தமான நாள். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய முதலீடுகளைப் பற்றி நிபுணர்களுடன் ஆலோசிப்பீர்கள். உங்கள் உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். யோகா மற்றும் தியானம் போன்ற பயிற்சிகளை மேற்கொள்வது உங்கள் மனதுக்கும் உடலுக்கும் புத்துணர்வை அளிக்கும். உங்கள் ஆன்மிக நாட்டங்கள் அதிகரிக்கும். இறை வழிபாட்டில் அதிக நேரம் செலவிடுவீர்கள். உங்களின் நேர்மறை எண்ணங்கள், உங்களைச் சுற்றியுள்ளவர்களுக்கும் பரவும். நேர்மறையான கண்ணோட்டத்துடன் செயல்பட்டு, அனைத்து சவால்களையும் வெற்றிகரமாக எதிர்கொள்வீர்கள். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் எதிர்காலத்திற்கு நன்மை பயப்பதாக இருக்கும். உங்கள் ஆற்றல் இன்று உச்சத்தில் இருக்கும். நீங்கள் செய்யும் அனைத்து செயல்களிலும் வெற்றி நிச்சயம். இன்று உங்களுக்கு புதிய உத்வேகமும், புதுமையான எண்ணங்களும் பிறக்கும். இவற்றை சரியாகப் பயன்படுத்தி உங்கள் வாழ்வை வளமாக்கிக் கொள்வீர்கள். இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணிப்பீர்கள். உங்கள் தன்னம்பிக்கையும் தைரியமும் இன்று உங்களுக்கு சிறந்த துணையாக இருக்கும். எதிர்பாராத பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும்.",
    "prediction_en": "For Leo natives, today is Tuesday, and your day begins with great energy under the influence of Mars. With your natural leadership qualities, added courage and determination will join today. As a result, your decisions will be excellent. You will courageously complete long-pending tasks today. Your self-confidence will rise, helping you achieve your goals. There will be happiness in the family. Harmonious relationships will form with siblings; you will provide them with necessary assistance.\n\nYour prestige in society will increase. Opportunities to meet new friends will arise. Your opinions will be accepted by many. Your leadership qualities will shine at the workplace. You will take the lead in new projects. Your talents and dedication will be appreciated by superiors. When working as a team with colleagues, your contribution will be significant. Innovative thoughts will guide you. Those in the arts will receive new opportunities. Students will pay extra attention to their studies and achieve excellent progress, earning praise from teachers. Those appearing for competitive exams will get a good opportunity to showcase their talents today. Your deep knowledge, hard work, and perseverance will bring you success. Journeys you undertake today will prove beneficial. Especially, decisions you make regarding land or property matters will be favorable.\n\nYou will share sweet moments with your life partner. Their love and support will bring you peace of mind. Married couples will spend quality time together to enhance their relationship. Love will grow stronger today. Lovers will have pleasant experiences and will think about taking their relationship to the next level. Parents will formulate constructive plans for their children's future and act in ways that encourage their children's talents. Opportunities for engaging in social service will arise today, through which your goodwill will spread. Your generous nature and willingness to help others will be evident today. Your assistance will be recognized.\n\nToday is a very suitable day to start new projects. You will consider new investments. You will consult experts about long-term profitable investments. Your physical health will improve. You will perform daily tasks with enthusiasm. Practicing yoga and meditation will refresh your mind and body. Your spiritual inclinations will increase, and you will spend more time in devotion. Your positive thoughts will spread to those around you. You will act with a positive outlook and successfully overcome all challenges. All decisions you make today will be beneficial for your future. Your energy will be at its peak today, and success is certain in all your endeavors. Today, new inspiration and innovative ideas will arise for you. By utilizing them correctly, you will enrich your life. Today, you will move steadfastly towards your goals. Your self-confidence and courage will be your best companions today. Unexpected praise and recognition await you.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் ஆளுமை வெளிப்படும். புதிய பொறுப்புகளை நம்பிக்கையுடன் ஏற்றுக்கொள்வீர்கள். உங்கள் தலைமைத்துவம் மற்றவர்களுக்கு முன்மாதிரியாக அமையும். சக பணியாளர்களின் ஒத்துழைப்பு கிடைக்கும். உங்கள் திட்டங்கள் வெற்றிகரமாக நிறைவேறும். பதவி உயர்வுக்கான வாய்ப்புகள் பிரகாசமாக இருக்கும்.",
    "career_en": "Your personality will shine at the workplace. You will confidently accept new responsibilities. Your leadership will set an example for others. You will receive cooperation from colleagues. Your projects will be successfully completed. Opportunities for promotion will be bright.",
    "finance_ta": "நிதிநிலைமை சாதகமாக இருக்கும். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய திட்டங்களில் முதலீடு செய்வீர்கள். குடும்பத்தின் நிதி தேவைகள் பூர்த்தி செய்யப்படும். எதிர்பாராத வகையில் ஆதாயம் கிடைக்க வாய்ப்புள்ளது. உங்கள் நிதி முடிவுகள் புத்திசாலித்தனமாக இருக்கும்.",
    "finance_en": "The financial situation will be favorable. You will consider new investments and invest in long-term profitable plans. Family financial needs will be met. There is a possibility of unexpected gains. Your financial decisions will be wise.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மனதளவிலும் உற்சாகத்துடன் செயல்படுவீர்கள். உடற்பயிற்சிகளை மேற்கொள்வது உங்கள் ஆற்றலை மேம்படுத்தும். சரியான உணவுப் பழக்கத்தைப் பின்பற்றுவீர்கள். தியானம் செய்வது மன அமைதிக்கு உதவும். புத்துணர்ச்சியுடன் அன்றாடப் பணிகளைச் செய்வீர்கள்.",
    "health_en": "Physical health will be excellent. You will also be mentally energetic. Engaging in exercises will enhance your energy. You will follow a proper diet. Meditating will help with mental peace. You will perform daily tasks with renewed vigor.",
    "lucky_number": "1",
    "lucky_color_ta": "ஆரஞ்சு",
    "lucky_color_en": "Orange"
  },
  {
    "sign_ta": "கன்னி",
    "sign_en": "Virgo",
    "date": "17-02-2026",
    "prediction_ta": "கன்னி ராசிக்காரர்களுக்கு இன்று செவ்வாய்க்கிழமை, செவ்வாய் கிரகத்தின் ஆதிக்கத்தில் உங்கள் நாள் தொடங்குகிறது. பொதுவாக பகுத்தறிவுடன் செயல்படும் நீங்கள், இன்று கூடுதல் துணிச்சலுடன் முடிவெடுக்கும் ஆற்றலைப் பெறுவீர்கள். இது உங்கள் திட்டங்களைச் செயல்படுத்துவதற்குப் பெரிதும் உதவும். நீண்ட நாட்களாக நீங்கள் தள்ளிப்போட்ட காரியங்களை இன்று உறுதியுடன் தொடங்கி வெற்றிகரமாக முடிப்பீர்கள். உங்கள் தன்னம்பிக்கை உயரும். குடும்ப உறுப்பினர்களுடன் இன்று நல்லுறவு ஏற்படும். சகோதர சகோதரிகளுடன் சுமுகமான உரையாடல்கள் நிகழும். உங்கள் மனதை அழுத்திக்கொண்டிருந்த சில விஷயங்களுக்கு இன்று தெளிவான தீர்வு கிடைக்கும்.\n\nபணியிடத்தில் உங்கள் கடின உழைப்புக்கு அங்கீகாரம் கிடைக்கும். புதிய பொறுப்புகளை நம்பிக்கையுடன் ஏற்றுக்கொள்வீர்கள். சக பணியாளர்களுடன் இணக்கமாகப் பழகுவீர்கள். உங்கள் தலைமைப் பண்புகள் இன்று வெளிப்படும். பல விஷயங்களில் நீங்கள் முன்னின்று செயல்பட்டு, மற்றவர்களுக்கு வழிகாட்டுவீர்கள். புதுமையான திட்டங்களை முன்வைத்து, வெற்றிகரமாக செயல்படுத்துவீர்கள். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயம் தரும் பயணங்களாக அமையும். குறிப்பாக, நிலம் அல்லது வீடு தொடர்பான விஷயங்களில் நீங்கள் எடுக்கும் முடிவுகள் சாதகமாக இருக்கும். உங்களின் தன்னம்பிக்கை உயரும். சக பணியாளர்களுடன் இணைந்து ஒரு குழுவாக செயல்படும்போது, உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். கலைத்துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் கூடுதல் கவனம் செலுத்தி, சிறப்பான முன்னேற்றத்தை அடைவார்கள். ஆசிரியர்களின் பாராட்டுகளைப் பெறுவார்கள். போட்டித் தேர்வுகளில் கலந்துகொள்பவர்கள் இன்று தங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்பைப் பெறுவார்கள். உங்களின் ஆழ்ந்த அறிவு, கடின உழைப்பு, மற்றும் விடாமுயற்சி ஆகியவை உங்களுக்கு வெற்றியைத் தேடித் தரும்.\n\nஉங்கள் வாழ்க்கைத் துணையுடன் இனிமையான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். அவர்களின் அன்பும் ஆதரவும் உங்களுக்கு மன அமைதியைத் தரும். திருமணமான தம்பதிகள் தங்கள் உறவை மேம்படுத்தும் வகையில் சிறப்பு நேரத்தை செலவிடுவார்கள். அன்பு இன்று மேலும் வலுப்பெறும். காதலர்களுக்கு இனிமையான அனுபவங்கள் ஏற்படும். அவர்கள் தங்கள் உறவை அடுத்த கட்டத்திற்கு எடுத்துச் செல்வது பற்றிச் சிந்திப்பார்கள். பெற்றோர்கள் தங்கள் குழந்தைகளின் எதிர்காலம் குறித்து ஆக்கபூர்வமான திட்டங்களை வகுப்பார்கள். குழந்தைகளின் திறமைகளை ஊக்குவிக்கும் விதமாக செயல்படுவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகள் இன்று அமையும். இதன் மூலம் உங்களின் நல்லெண்ணம் பரவும். உங்களின் தாராள குணம், மற்றவர்களுக்கு உதவும் மனப்பான்மை இன்று வெளிப்படும். நீங்கள் செய்யும் உதவிக்கு அங்கீகாரம் கிடைக்கும்.\n\nபுதிய திட்டங்களைத் தொடங்குவதற்கு இன்று மிகவும் பொருத்தமான நாள். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய முதலீடுகளைப் பற்றி நிபுணர்களுடன் ஆலோசிப்பீர்கள். உங்கள் உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். யோகா மற்றும் தியானம் போன்ற பயிற்சிகளை மேற்கொள்வது உங்கள் மனதுக்கும் உடலுக்கும் புத்துணர்வை அளிக்கும். உங்கள் ஆன்மிக நாட்டங்கள் அதிகரிக்கும். இறை வழிபாட்டில் அதிக நேரம் செலவிடுவீர்கள். உங்களின் நேர்மறை எண்ணங்கள், உங்களைச் சுற்றியுள்ளவர்களுக்கும் பரவும். நேர்மறையான கண்ணோட்டத்துடன் செயல்பட்டு, அனைத்து சவால்களையும் வெற்றிகரமாக எதிர்கொள்வீர்கள். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் எதிர்காலத்திற்கு நன்மை பயப்பதாக இருக்கும். உங்கள் ஆற்றல் இன்று உச்சத்தில் இருக்கும். நீங்கள் செய்யும் அனைத்து செயல்களிலும் வெற்றி நிச்சயம். இன்று உங்களுக்கு புதிய உத்வேகமும், புதுமையான எண்ணங்களும் பிறக்கும். இவற்றை சரியாகப் பயன்படுத்தி உங்கள் வாழ்வை வளமாக்கிக் கொள்வீர்கள். இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணிப்பீர்கள். உங்கள் தன்னம்பிக்கையும் தைரியமும் இன்று உங்களுக்கு சிறந்த துணையாக இருக்கும். எதிர்பாராத பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும்.",
    "prediction_en": "For Virgo natives, today is Tuesday, and your day begins under the influence of Mars. Usually analytical, today you will gain the ability to make decisions with added courage. This will greatly help you implement your plans. You will confidently start and successfully complete tasks you have long postponed. Your self-confidence will rise. Good relationships will form with family members today. There will be harmonious conversations with siblings. A clear solution will be found today for some matters that have been weighing on your mind.\n\nYour hard work will be recognized at the workplace. You will confidently accept new responsibilities. You will interact harmoniously with colleagues. Your leadership qualities will shine today. You will take the lead in many matters and guide others. You will propose innovative projects and implement them successfully. Journeys you undertake today will prove beneficial. Especially, decisions you make regarding land or property matters will be favorable. Your self-confidence will rise. When working as a team with colleagues, your contribution will be significant. Innovative thoughts will guide you. Those in the arts will receive new opportunities. Students will pay extra attention to their studies and achieve excellent progress, earning praise from teachers. Those appearing for competitive exams will get a good opportunity to showcase their talents today. Your deep knowledge, hard work, and perseverance will bring you success.\n\nYou will share sweet moments with your life partner. Their love and support will bring you peace of mind. Married couples will spend quality time together to enhance their relationship. Love will grow stronger today. Lovers will have pleasant experiences and will think about taking their relationship to the next level. Parents will formulate constructive plans for their children's future and act in ways that encourage their children's talents. Opportunities for engaging in social service will arise today, through which your goodwill will spread. Your generous nature and willingness to help others will be evident today. Your assistance will be recognized.\n\nToday is a very suitable day to start new projects. You will consider new investments. You will consult experts about long-term profitable investments. Your physical health will improve. You will perform daily tasks with enthusiasm. Practicing yoga and meditation will refresh your mind and body. Your spiritual inclinations will increase, and you will spend more time in devotion. Your positive thoughts will spread to those around you. You will act with a positive outlook and successfully overcome all challenges. All decisions you make today will be beneficial for your future. Your energy will be at its peak today, and success is certain in all your endeavors. Today, new inspiration and innovative ideas will arise for you. By utilizing them correctly, you will enrich your life. Today, you will move steadfastly towards your goals. Your self-confidence and courage will be your best companions today. Unexpected praise and recognition await you.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் கடின உழைப்புக்கு நல்ல அங்கீகாரம் கிடைக்கும். புதிய சவால்களை துணிச்சலுடன் எதிர்கொள்வீர்கள். சக ஊழியர்களின் ஒத்துழைப்புடன் திட்டங்களை வெற்றிகரமாக முடிப்பீர்கள். உங்கள் நிர்வாகத் திறமைகள் மேம்படும். இன்று நீங்கள் எடுக்கும் துணிச்சலான முடிவுகள் உங்கள் தொழில் வாழ்க்கைக்கு நன்மை பயக்கும்.",
    "career_en": "Your hard work at the workplace will receive good recognition. You will bravely face new challenges. With the cooperation of colleagues, you will successfully complete projects. Your management skills will improve. The courageous decisions you make today will benefit your professional life.",
    "finance_ta": "நிதிநிலைமை சாதகமாக இருக்கும். புதிய வருமான வழிகள் உருவாக வாய்ப்புள்ளது. சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதி தேவைகள் பூர்த்தி செய்யப்படும். சிறு அளவில் எதிர்பாராத லாபம் கிடைக்க வாய்ப்புள்ளது. நிதி திட்டமிடல் உங்களுக்கு நன்மை பயக்கும்.",
    "finance_en": "The financial situation will be favorable. New income streams are likely to emerge. You will focus on savings plans. Family financial needs will be met. There is a possibility of small unexpected profits. Financial planning will benefit you.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். மனதில் புதிய உற்சாகம் நிலவும். சரியான உணவுப் பழக்கங்களை மேற்கொள்வீர்கள். மன அழுத்தத்தைப் போக்க தியானம் செய்வது நன்மை பயக்கும். நடைப்பயிற்சி உங்கள் உடலுக்குப் புத்துணர்ச்சி அளிக்கும். சுறுசுறுப்புடன் செயல்படுவீர்கள்.",
    "health_en": "Physical health will improve. New enthusiasm will prevail in your mind. You will follow proper eating habits. Meditating to relieve stress will be beneficial. Walking will refresh your body. You will act actively.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "17-02-2026",
    "prediction_ta": "துலாம் ராசிக்காரர்களுக்கு இன்று செவ்வாய்க்கிழமை, செவ்வாய் கிரகத்தின் ஆதிக்கத்தில் உங்கள் நாள் தொடங்குகிறது. உங்கள் இயல்பான இணக்கமான குணம் இன்று துணிச்சலான முடிவெடுக்கும் ஆற்றலுடன் இணையும். இது உங்கள் தனிப்பட்ட மற்றும் தொழில் வாழ்க்கையில் சிறப்பான முன்னேற்றங்களை உண்டாக்கும். நீண்ட நாட்களாக நீங்கள் தள்ளிப்போட்ட காரியங்களை இன்று உறுதியுடன் தொடங்கி வெற்றிகரமாக முடிப்பீர்கள். உங்களின் தன்னம்பிக்கை உயரும். குடும்ப உறவுகளில் நல்லிணக்கம் ஏற்படும். சகோதர சகோதரிகளுடன் சுமுகமான உரையாடல்கள் நிகழும். அவர்களுக்குத் தேவையான உதவிகளைச் செய்வீர்கள். குறிப்பாக, சொத்து சம்பந்தமான விஷயங்களில் சாதகமான திருப்பங்கள் ஏற்படும்.\n\nசமூகத்தில் உங்கள் மதிப்பு உயரும். புதிய நண்பர்களைச் சந்திப்பதற்கான வாய்ப்புகள் அமையும். உங்கள் கருத்துக்கள் பலரால் ஏற்றுக்கொள்ளப்படும். பணியிடத்தில் உங்கள் தலைமைப் பண்புகள் வெளிப்படும். புதிய திட்டங்களை முன்னின்று நடத்துவீர்கள். உங்கள் திறமைகளும், அர்ப்பணிப்பும் உயரதிகாரிகளால் பாராட்டப்படும். சக ஊழியர்களுடன் இணைந்து ஒரு குழுவாக செயல்படும்போது, உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். கலைத்துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் கூடுதல் கவனம் செலுத்தி, சிறப்பான முன்னேற்றத்தை அடைவார்கள். ஆசிரியர்களின் பாராட்டுகளைப் பெறுவார்கள். போட்டித் தேர்வுகளில் கலந்துகொள்பவர்கள் இன்று தங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்பைப் பெறுவார்கள். உங்களின் ஆழ்ந்த அறிவு, கடின உழைப்பு, மற்றும் விடாமுயற்சி ஆகியவை உங்களுக்கு வெற்றியைத் தேடித் தரும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயம் தரும் பயணங்களாக அமையும்.\n\nஉங்கள் வாழ்க்கைத் துணையுடன் இனிமையான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். அவர்களின் அன்பும் ஆதரவும் உங்களுக்கு மன அமைதியைத் தரும். திருமணமான தம்பதிகள் தங்கள் உறவை மேம்படுத்தும் வகையில் சிறப்பு நேரத்தை செலவிடுவார்கள். அன்பு இன்று மேலும் வலுப்பெறும். காதலர்களுக்கு இனிமையான அனுபவங்கள் ஏற்படும். அவர்கள் தங்கள் உறவை அடுத்த கட்டத்திற்கு எடுத்துச் செல்வது பற்றிச் சிந்திப்பார்கள். பெற்றோர்கள் தங்கள் குழந்தைகளின் எதிர்காலம் குறித்து ஆக்கபூர்வமான திட்டங்களை வகுப்பார்கள். குழந்தைகளின் திறமைகளை ஊக்குவிக்கும் விதமாக செயல்படுவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகள் இன்று அமையும். இதன் மூலம் உங்களின் நல்லெண்ணம் பரவும். உங்களின் தாராள குணம், மற்றவர்களுக்கு உதவும் மனப்பான்மை இன்று வெளிப்படும். நீங்கள் செய்யும் உதவிக்கு அங்கீகாரம் கிடைக்கும். உங்கள் கருத்துக்கள் இன்று பலரால் ஏற்றுக்கொள்ளப்படும்.\n\nபுதிய திட்டங்களைத் தொடங்குவதற்கு இன்று மிகவும் பொருத்தமான நாள். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய முதலீடுகளைப் பற்றி நிபுணர்களுடன் ஆலோசிப்பீர்கள். உங்கள் உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். யோகா மற்றும் தியானம் போன்ற பயிற்சிகளை மேற்கொள்வது உங்கள் மனதுக்கும் உடலுக்கும் புத்துணர்வை அளிக்கும். உங்கள் ஆன்மிக நாட்டங்கள் அதிகரிக்கும். இறை வழிபாட்டில் அதிக நேரம் செலவிடுவீர்கள். உங்களின் நேர்மறை எண்ணங்கள், உங்களைச் சுற்றியுள்ளவர்களுக்கும் பரவும். நேர்மறையான கண்ணோட்டத்துடன் செயல்பட்டு, அனைத்து சவால்களையும் வெற்றிகரமாக எதிர்கொள்வீர்கள். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் எதிர்காலத்திற்கு நன்மை பயப்பதாக இருக்கும். உங்கள் ஆற்றல் இன்று உச்சத்தில் இருக்கும். நீங்கள் செய்யும் அனைத்து செயல்களிலும் வெற்றி நிச்சயம். இன்று உங்களுக்கு புதிய உத்வேகமும், புதுமையான எண்ணங்களும் பிறக்கும். இவற்றை சரியாகப் பயன்படுத்தி உங்கள் வாழ்வை வளமாக்கிக் கொள்வீர்கள். இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணிப்பீர்கள். உங்கள் தன்னம்பிக்கையும் தைரியமும் இன்று உங்களுக்கு சிறந்த துணையாக இருக்கும். எதிர்பாராத பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும்.",
    "prediction_en": "For Libra natives, today is Tuesday, and your day begins under the influence of Mars. Your natural harmonious nature will combine with the ability to make courageous decisions today. This will lead to excellent progress in your personal and professional life. You will confidently start and successfully complete tasks you have long postponed. Your self-confidence will rise. There will be harmony in family relationships. Harmonious conversations will take place with siblings; you will provide them with necessary assistance. Particularly, favorable turns will occur in property-related matters.\n\nYour prestige in society will increase. Opportunities to meet new friends will arise. Your opinions will be accepted by many. Your leadership qualities will shine at the workplace. You will take the lead in new projects. Your talents and dedication will be appreciated by superiors. When working as a team with colleagues, your contribution will be significant. Innovative thoughts will guide you. Those in the arts will receive new opportunities. Students will pay extra attention to their studies and achieve excellent progress, earning praise from teachers. Those appearing for competitive exams will get a good opportunity to showcase their talents today. Your deep knowledge, hard work, and perseverance will bring you success. Journeys you undertake today will prove beneficial.\n\nYou will share sweet moments with your life partner. Their love and support will bring you peace of mind. Married couples will spend quality time together to enhance their relationship. Love will grow stronger today. Lovers will have pleasant experiences and will think about taking their relationship to the next level. Parents will formulate constructive plans for their children's future and act in ways that encourage their children's talents. Opportunities for engaging in social service will arise today, through which your goodwill will spread. Your generous nature and willingness to help others will be evident today. Your assistance will be recognized. Your opinions will be accepted by many today.\n\nToday is a very suitable day to start new projects. You will consider new investments. You will consult experts about long-term profitable investments. Your physical health will improve. You will perform daily tasks with enthusiasm. Practicing yoga and meditation will refresh your mind and body. Your spiritual inclinations will increase, and you will spend more time in devotion. Your positive thoughts will spread to those around you. You will act with a positive outlook and successfully overcome all challenges. All decisions you make today will be beneficial for your future. Your energy will be at its peak today, and success is certain in all your endeavors. Today, new inspiration and innovative ideas will arise for you. By utilizing them correctly, you will enrich your life. Today, you will move steadfastly towards your goals. Your self-confidence and courage will be your best companions today. Unexpected praise and recognition await you.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் துணிச்சலான முடிவுகள் பாராட்டப்படும். புதிய திட்டங்களை முன்னின்று நடத்துவீர்கள். சக பணியாளர்களுடன் இணக்கமான உறவு நீடிக்கும். உங்கள் தலைமைப் பண்புகள் வெளிப்படும். உங்கள் திறமைகளும், அர்ப்பணிப்பும் உயரதிகாரிகளால் அங்கீகரிக்கப்படும். பதவி உயர்வுக்கான வாய்ப்புகள் பிரகாசமாக இருக்கும்.",
    "career_en": "Your courageous decisions at the workplace will be appreciated. You will take the lead in new projects. Harmonious relationships with colleagues will continue. Your leadership qualities will shine. Your talents and dedication will be recognized by superiors. Opportunities for promotion will be bright.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதி தேவைகள் பூர்த்தி செய்யப்படும். சிறு அளவில் எதிர்பாராத லாபம் கிடைக்க வாய்ப்புள்ளது. நிலம் அல்லது வீடு தொடர்பான விஷயங்களில் சாதகமான முடிவுகள் எடுக்கப்படும்.",
    "finance_en": "The financial situation will be stable. You will consider new investments and focus on savings plans. Family financial needs will be met. There is a possibility of small unexpected profits. Favorable decisions will be made regarding land or property matters.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். நடைப்பயிற்சி, யோகா போன்றவற்றை மேற்கொள்வது உங்கள் ஆற்றலை அதிகரிக்கும். மன அமைதிக்காக தியானம் செய்வது நன்மை தரும். ஆரோக்கியமான உணவுப் பழக்கங்களை மேற்கொள்வீர்கள்.",
    "health_en": "Physical health will improve. You will perform daily tasks with enthusiasm. Engaging in activities like walking and yoga will increase your energy. Meditating for mental peace will be beneficial. You will adopt healthy eating habits.",
    "lucky_number": "6",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "விருச்சிகம்",
    "sign_en": "Scorpio",
    "date": "17-02-2026",
    "prediction_ta": "விருச்சிக ராசிக்காரர்களுக்கு இன்று செவ்வாய்க்கிழமை, செவ்வாய் கிரகத்தின் ஆதிக்கத்தில் உங்கள் நாள் தொடங்குகிறது. உங்கள் ராசியின் அதிபதியான செவ்வாயின் முழுமையான ஆற்றல் இன்று உங்களை ஆட்கொள்ளும். இது ஒரு அற்புதமான நாள். உங்கள் இயல்பான துணிச்சலும், மன உறுதியும் இன்று பன்மடங்கு பெருகும். நீங்கள் மேற்கொள்ளும் முயற்சிகள் அனைத்தும் வெற்றிப் பாதையை நோக்கியே பயணிக்கும். நீண்ட நாட்களாக நீங்கள் தள்ளிப்போட்ட காரியங்களை இன்று துணிச்சலுடன் செய்து முடிப்பதற்கான சிறந்த ஆற்றல் உங்களுக்குக் கிடைக்கும். உங்களின் மன உறுதி, எத்தகைய தடைகளையும் தகர்த்தெறியும் வலிமையை அளிக்கும். குடும்பத்தில் உள்ள உறவுகளுடன் இணக்கமாகப் பழகுவீர்கள். உறவினர்களுக்கிடையே ஏதேனும் சிறு மனஸ்தாபங்கள் இருந்தால், அவற்றை நீங்கள் முன்வந்து சரிசெய்வதற்கான வாய்ப்புகள் உண்டாகும்.\n\nஉங்கள் தலைமைப் பண்புகள் இன்று வெளிப்படும். பல விஷயங்களில் நீங்கள் முன்னின்று செயல்பட்டு, மற்றவர்களுக்கு வழிகாட்டுவீர்கள். உங்கள் கருத்துக்களுக்கு மதிப்புக் கொடுக்கப்படும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயம் தரும் பயணங்களாக அமையும். குறிப்பாக, நிலம் அல்லது வீடு தொடர்பான விஷயங்களில் நீங்கள் எடுக்கும் முடிவுகள் சாதகமாக இருக்கும். புதிய வீடு வாங்குவது அல்லது புதுப்பிப்பது தொடர்பான யோசனைகள் இன்று நடைமுறைக்கு வரும் வாய்ப்புள்ளது. உங்களின் தன்னம்பிக்கை உயரும். சக பணியாளர்களுடன் இணைந்து ஒரு குழுவாக செயல்படும்போது, உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். கலைத்துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் கூடுதல் கவனம் செலுத்தி, சிறப்பான முன்னேற்றத்தை அடைவார்கள். ஆசிரியர்களின் பாராட்டுகளைப் பெறுவார்கள். போட்டித் தேர்வுகளில் கலந்துகொள்பவர்கள் இன்று தங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்பைப் பெறுவார்கள். உங்களின் ஆழ்ந்த அறிவு, கடின உழைப்பு, மற்றும் விடாமுயற்சி ஆகியவை உங்களுக்கு வெற்றியைத் தேடித் தரும்.\n\nஉங்கள் வாழ்க்கைத் துணையுடன் இனிமையான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். அவர்களின் அன்பும் ஆதரவும் உங்களுக்கு மன அமைதியைத் தரும். திருமணமான தம்பதிகள் தங்கள் உறவை மேம்படுத்தும் வகையில் சிறப்பு நேரத்தை செலவிடுவார்கள். அன்பு இன்று மேலும் வலுப்பெறும். காதலர்களுக்கு இனிமையான அனுபவங்கள் ஏற்படும். அவர்கள் தங்கள் உறவை அடுத்த கட்டத்திற்கு எடுத்துச் செல்வது பற்றிச் சிந்திப்பார்கள். பெற்றோர்கள் தங்கள் குழந்தைகளின் எதிர்காலம் குறித்து ஆக்கபூர்வமான திட்டங்களை வகுப்பார்கள். குழந்தைகளின் திறமைகளை ஊக்குவிக்கும் விதமாக செயல்படுவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகள் இன்று அமையும். இதன் மூலம் உங்களின் நல்லெண்ணம் பரவும். உங்களின் தாராள குணம், மற்றவர்களுக்கு உதவும் மனப்பான்மை இன்று வெளிப்படும். நீங்கள் செய்யும் உதவிக்கு அங்கீகாரம் கிடைக்கும்.\n\nபுதிய திட்டங்களைத் தொடங்குவதற்கு இன்று மிகவும் பொருத்தமான நாள். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய முதலீடுகளைப் பற்றி நிபுணர்களுடன் ஆலோசிப்பீர்கள். உங்கள் உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். யோகா மற்றும் தியானம் போன்ற பயிற்சிகளை மேற்கொள்வது உங்கள் மனதுக்கும் உடலுக்கும் புத்துணர்வை அளிக்கும். உங்கள் ஆன்மிக நாட்டங்கள் அதிகரிக்கும். இறை வழிபாட்டில் அதிக நேரம் செலவிடுவீர்கள். உங்களின் நேர்மறை எண்ணங்கள், உங்களைச் சுற்றியுள்ளவர்களுக்கும் பரவும். நேர்மறையான கண்ணோட்டத்துடன் செயல்பட்டு, அனைத்து சவால்களையும் வெற்றிகரமாக எதிர்கொள்வீர்கள். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் எதிர்காலத்திற்கு நன்மை பயப்பதாக இருக்கும். உங்கள் ஆற்றல் இன்று உச்சத்தில் இருக்கும். நீங்கள் செய்யும் அனைத்து செயல்களிலும் வெற்றி நிச்சயம். இன்று உங்களுக்கு புதிய உத்வேகமும், புதுமையான எண்ணங்களும் பிறக்கும். இவற்றை சரியாகப் பயன்படுத்தி உங்கள் வாழ்வை வளமாக்கிக் கொள்வீர்கள். இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணிப்பீர்கள். உங்கள் தன்னம்பிக்கையும் தைரியமும் இன்று உங்களுக்கு சிறந்த துணையாக இருக்கும். எதிர்பாராத பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும்.",
    "prediction_en": "For Scorpio natives, today is Tuesday, and your day begins under the influence of Mars. The full energy of Mars, your ruling planet, will envelop you today. This is a wonderful day. Your natural courage and determination will multiply today. All your endeavors will move towards the path of success. You will receive excellent energy today to courageously complete tasks you have long postponed. Your mental determination will provide the strength to overcome any obstacles. You will interact harmoniously with family members. If there are any minor disagreements among relatives, opportunities will arise for you to proactively resolve them.\n\nYour leadership qualities will shine today. You will take the lead in many matters and guide others. Your opinions will be valued. Journeys you undertake today will prove beneficial. Especially, decisions you make regarding land or property matters will be favorable. Ideas related to buying a new home or renovating an existing one may materialize today. Your self-confidence will rise. When working as a team with colleagues, your contribution will be significant. Innovative thoughts will guide you. Those in the arts will receive new opportunities. Students will pay extra attention to their studies and achieve excellent progress, earning praise from teachers. Those appearing for competitive exams will get a good opportunity to showcase their talents today. Your deep knowledge, hard work, and perseverance will bring you success.\n\nYou will share sweet moments with your life partner. Their love and support will bring you peace of mind. Married couples will spend quality time together to enhance their relationship. Love will grow stronger today. Lovers will have pleasant experiences and will think about taking their relationship to the next level. Parents will formulate constructive plans for their children's future and act in ways that encourage their children's talents. Opportunities for engaging in social service will arise today, through which your goodwill will spread. Your generous nature and willingness to help others will be evident today. Your assistance will be recognized.\n\nToday is a very suitable day to start new projects. You will consider new investments. You will consult experts about long-term profitable investments. Your physical health will improve. You will perform daily tasks with enthusiasm. Practicing yoga and meditation will refresh your mind and body. Your spiritual inclinations will increase, and you will spend more time in devotion. Your positive thoughts will spread to those around you. You will act with a positive outlook and successfully overcome all challenges. All decisions you make today will be beneficial for your future. Your energy will be at its peak today, and success is certain in all your endeavors. Today, new inspiration and innovative ideas will arise for you. By utilizing them correctly, you will enrich your life. Today, you will move steadfastly towards your goals. Your self-confidence and courage will be your best companions today. Unexpected praise and recognition await you.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் ஆற்றல் உச்சத்தில் இருக்கும். புதிய சவால்களை துணிச்சலுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். உங்கள் தலைமைப் பண்புகள் பாராட்டப்படும். சக ஊழியர்களுடன் இணைந்து செயல்பட்டு, திட்டங்களை வெற்றிகரமாக முடிப்பீர்கள். இன்று நீங்கள் எடுக்கும் துணிச்சலான முடிவுகள் உங்கள் தொழில் வாழ்க்கைக்கு நன்மை பயக்கும்.",
    "career_en": "Your energy will be at its peak at the workplace. You will bravely face new challenges and succeed. Your leadership qualities will be appreciated. You will work with colleagues to successfully complete projects. The courageous decisions you make today will benefit your professional life.",
    "finance_ta": "நிதிநிலைமை இன்று மிகவும் சாதகமாக இருக்கும். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய திட்டங்களில் முதலீடு செய்வீர்கள். குடும்பத்தின் நிதி தேவைகள் பூர்த்தி செய்யப்படும். எதிர்பாராத வகையில் ஆதாயம் கிடைக்க வாய்ப்புள்ளது. உங்கள் நிதி முடிவுகள் புத்திசாலித்தனமாக இருக்கும்.",
    "finance_en": "The financial situation will be very favorable today. You will consider new investments and invest in long-term profitable plans. Family financial needs will be met. There is a possibility of unexpected gains. Your financial decisions will be wise.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் இருப்பீர்கள். யோகா, நடைப்பயிற்சி போன்ற உடற்பயிற்சிகளை மேற்கொள்வது உங்கள் ஆற்றலை மேலும் அதிகரிக்கும். மன அமைதிக்காக தியானம் செய்வது நன்மை பயக்கும். இன்று முழுவதும் சுறுசுறுப்புடன் செயல்படுவீர்கள். சரியான உணவுப் பழக்கத்தைப் பின்பற்றுவது நல்லது.",
    "health_en": "Your physical health will be excellent. You will be energetic. Practicing exercises like yoga and walking will further boost your energy. Meditating for mental peace will be beneficial. You will be active throughout the day. Following a proper diet is advisable.",
    "lucky_number": "9",
    "lucky_color_ta": "செந்திறம்",
    "lucky_color_en": "Scarlet"
  },
  {
    "sign_ta": "தனுசு",
    "sign_en": "Sagittarius",
    "date": "17-02-2026",
    "prediction_ta": "தனுசு ராசிக்காரர்களுக்கு இன்று செவ்வாய்க்கிழமை, செவ்வாய் கிரகத்தின் ஆதிக்கத்தில் உங்கள் நாள் தொடங்குகிறது. உங்கள் இயல்பான நம்பிக்கையுடனும், உற்சாகத்துடனும், இன்று கூடுதல் துணிச்சலும், செயல்திறனும் சேரும். இது உங்கள் வாழ்க்கையில் புதிய மாற்றங்களைக் கொண்டு வரும். நீண்ட நாட்களாக நீங்கள் தள்ளிப்போட்ட காரியங்களை இன்று துணிச்சலுடன் செய்து முடிப்பதற்கான சிறந்த ஆற்றல் உங்களுக்குக் கிடைக்கும். உங்களின் மன உறுதி, எத்தகைய தடைகளையும் தகர்த்தெறியும் வலிமையை அளிக்கும். குடும்பத்தில் உள்ள உறவுகளுடன் இணக்கமாகப் பழகுவீர்கள். உறவினர்களுக்கிடையே ஏதேனும் சிறு மனஸ்தாபங்கள் இருந்தால், அவற்றை நீங்கள் முன்வந்து சரிசெய்வதற்கான வாய்ப்புகள் உண்டாகும்.\n\nஉங்கள் தலைமைப் பண்புகள் இன்று வெளிப்படும். பல விஷயங்களில் நீங்கள் முன்னின்று செயல்பட்டு, மற்றவர்களுக்கு வழிகாட்டுவீர்கள். உங்கள் கருத்துக்களுக்கு மதிப்புக் கொடுக்கப்படும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயம் தரும் பயணங்களாக அமையும். குறிப்பாக, நிலம் அல்லது வீடு தொடர்பான விஷயங்களில் நீங்கள் எடுக்கும் முடிவுகள் சாதகமாக இருக்கும். புதிய வீடு வாங்குவது அல்லது புதுப்பிப்பது தொடர்பான யோசனைகள் இன்று நடைமுறைக்கு வரும் வாய்ப்புள்ளது. உங்களின் தன்னம்பிக்கை உயரும். சக பணியாளர்களுடன் இணைந்து ஒரு குழுவாக செயல்படும்போது, உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். கலைத்துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் கூடுதல் கவனம் செலுத்தி, சிறப்பான முன்னேற்றத்தை அடைவார்கள். ஆசிரியர்களின் பாராட்டுகளைப் பெறுவார்கள். போட்டித் தேர்வுகளில் கலந்துகொள்பவர்கள் இன்று தங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்பைப் பெறுவார்கள். உங்களின் ஆழ்ந்த அறிவு, கடின உழைப்பு, மற்றும் விடாமுயற்சி ஆகியவை உங்களுக்கு வெற்றியைத் தேடித் தரும்.\n\nஉங்கள் வாழ்க்கைத் துணையுடன் இனிமையான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். அவர்களின் அன்பும் ஆதரவும் உங்களுக்கு மன அமைதியைத் தரும். திருமணமான தம்பதிகள் தங்கள் உறவை மேம்படுத்தும் வகையில் சிறப்பு நேரத்தை செலவிடுவார்கள். அன்பு இன்று மேலும் வலுப்பெறும். காதலர்களுக்கு இனிமையான அனுபவங்கள் ஏற்படும். அவர்கள் தங்கள் உறவை அடுத்த கட்டத்திற்கு எடுத்துச் செல்வது பற்றிச் சிந்திப்பார்கள். பெற்றோர்கள் தங்கள் குழந்தைகளின் எதிர்காலம் குறித்து ஆக்கபூர்வமான திட்டங்களை வகுப்பார்கள். குழந்தைகளின் திறமைகளை ஊக்குவிக்கும் விதமாக செயல்படுவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகள் இன்று அமையும். இதன் மூலம் உங்களின் நல்லெண்ணம் பரவும். உங்களின் தாராள குணம், மற்றவர்களுக்கு உதவும் மனப்பான்மை இன்று வெளிப்படும். நீங்கள் செய்யும் உதவிக்கு அங்கீகாரம் கிடைக்கும்.\n\nபுதிய திட்டங்களைத் தொடங்குவதற்கு இன்று மிகவும் பொருத்தமான நாள். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய முதலீடுகளைப் பற்றி நிபுணர்களுடன் ஆலோசிப்பீர்கள். உங்கள் உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். யோகா மற்றும் தியானம் போன்ற பயிற்சிகளை மேற்கொள்வது உங்கள் மனதுக்கும் உடலுக்கும் புத்துணர்வை அளிக்கும். உங்கள் ஆன்மிக நாட்டங்கள் அதிகரிக்கும். இறை வழிபாட்டில் அதிக நேரம் செலவிடுவீர்கள். உங்களின் நேர்மறை எண்ணங்கள், உங்களைச் சுற்றியுள்ளவர்களுக்கும் பரவும். நேர்மறையான கண்ணோட்டத்துடன் செயல்பட்டு, அனைத்து சவால்களையும் வெற்றிகரமாக எதிர்கொள்வீர்கள். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் எதிர்காலத்திற்கு நன்மை பயப்பதாக இருக்கும். உங்கள் ஆற்றல் இன்று உச்சத்தில் இருக்கும். நீங்கள் செய்யும் அனைத்து செயல்களிலும் வெற்றி நிச்சயம். இன்று உங்களுக்கு புதிய உத்வேகமும், புதுமையான எண்ணங்களும் பிறக்கும். இவற்றை சரியாகப் பயன்படுத்தி உங்கள் வாழ்வை வளமாக்கிக் கொள்வீர்கள். இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணிப்பீர்கள். உங்கள் தன்னம்பிக்கையும் தைரியமும் இன்று உங்களுக்கு சிறந்த துணையாக இருக்கும். எதிர்பாராத பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும்.",
    "prediction_en": "For Sagittarius natives, today is Tuesday, and your day begins under the influence of Mars. With your natural optimism and enthusiasm, added courage and efficiency will join today. This will bring new changes in your life. You will receive excellent energy today to courageously complete tasks you have long postponed. Your mental determination will provide the strength to overcome any obstacles. You will interact harmoniously with family members. If there are any minor disagreements among relatives, opportunities will arise for you to proactively resolve them.\n\nYour leadership qualities will shine today. You will take the lead in many matters and guide others. Your opinions will be valued. Journeys you undertake today will prove beneficial. Especially, decisions you make regarding land or property matters will be favorable. Ideas related to buying a new home or renovating an existing one may materialize today. Your self-confidence will rise. When working as a team with colleagues, your contribution will be significant. Innovative thoughts will guide you. Those in the arts will receive new opportunities. Students will pay extra attention to their studies and achieve excellent progress, earning praise from teachers. Those appearing for competitive exams will get a good opportunity to showcase their talents today. Your deep knowledge, hard work, and perseverance will bring you success.\n\nYou will share sweet moments with your life partner. Their love and support will bring you peace of mind. Married couples will spend quality time together to enhance their relationship. Love will grow stronger today. Lovers will have pleasant experiences and will think about taking their relationship to the next level. Parents will formulate constructive plans for their children's future and act in ways that encourage their children's talents. Opportunities for engaging in social service will arise today, through which your goodwill will spread. Your generous nature and willingness to help others will be evident today. Your assistance will be recognized.\n\nToday is a very suitable day to start new projects. You will consider new investments. You will consult experts about long-term profitable investments. Your physical health will improve. You will perform daily tasks with enthusiasm. Practicing yoga and meditation will refresh your mind and body. Your spiritual inclinations will increase, and you will spend more time in devotion. Your positive thoughts will spread to those around you. You will act with a positive outlook and successfully overcome all challenges. All decisions you make today will be beneficial for your future. Your energy will be at its peak today, and success is certain in all your endeavors. Today, new inspiration and innovative ideas will arise for you. By utilizing them correctly, you will enrich your life. Today, you will move steadfastly towards your goals. Your self-confidence and courage will be your best companions today. Unexpected praise and recognition await you.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் உத்வேகம் அதிகரிக்கும். புதிய திட்டங்களை முன்னின்று நடத்துவீர்கள். உங்கள் துணிச்சல் நிறைந்த அணுகுமுறை உயரதிகாரிகளால் பாராட்டப்படும். குழுப்பணிகளில் உங்கள் தலைமைப் பண்பு சிறப்பாக வெளிப்படும். புதுமையான யோசனைகளை முன்வைத்து, சக பணியாளர்களின் ஒத்துழைப்பைப் பெறுவீர்கள். புதிய பொறுப்புகள் உங்களைத் தேடி வரும்.",
    "career_en": "Your enthusiasm will increase at work. You will take the lead in new projects. Your courageous approach will be appreciated by superiors. Your leadership qualities will shine brightly in team tasks. You will propose innovative ideas and gain the cooperation of colleagues. New responsibilities will come your way.",
    "finance_ta": "நிதிநிலைமை இன்று சாதகமாக இருக்கும். நீண்டகால முதலீடுகள் பற்றி ஆலோசிப்பீர்கள். சேமிக்கும் பழக்கத்தை மேம்படுத்துவீர்கள். எதிர்பாராத வகையில் சிறு ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது. நிலம் அல்லது வீடு தொடர்பான விஷயங்களில் நல்ல முடிவுகளை எடுப்பீர்கள். இன்று நீங்கள் மேற்கொள்ளும் நிதி சார்ந்த முடிவுகள் எதிர்காலத்திற்கு நன்மை பயக்கும்.",
    "finance_en": "The financial situation will be favorable today. You will consult about long-term investments and improve your saving habits. There is a possibility of small unexpected gains. You will make good decisions regarding land or property matters. Financial decisions you make today will be beneficial for the future.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். உற்சாகத்துடன் இருப்பீர்கள். யோகா, நடைப்பயிற்சி போன்ற உடற்பயிற்சிகளை மேற்கொள்வது உங்கள் ஆற்றலை மேலும் அதிகரிக்கும். மன அமைதிக்காக தியானம் செய்வது நன்மை பயக்கும். இன்று முழுவதும் சுறுசுறுப்புடன் செயல்படுவீர்கள். சரியான உணவுப் பழக்கத்தைப் பின்பற்றுவது நல்லது.",
    "health_en": "Your physical health will be excellent. You will be energetic. Practicing exercises like yoga and walking will further boost your energy. Meditating for mental peace will be beneficial. You will be active throughout the day. Following a proper diet is advisable.",
    "lucky_number": "3",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "மகரம்",
    "sign_en": "Capricorn",
    "date": "17-02-2026",
    "prediction_ta": "மகர ராசிக்காரர்களுக்கு இன்று செவ்வாய்க்கிழமை, செவ்வாய் கிரகத்தின் ஆதிக்கத்தில் உங்கள் நாள் தொடங்குகிறது. உங்கள் இயல்பான கடின உழைப்பும், ஒழுக்கமும் இன்று கூடுதல் துணிச்சலுடனும், செயல்திறனுடனும் இணையும். இது உங்கள் நீண்டகால இலக்குகளை அடைவதற்குப் பெரிதும் உதவும். நீங்கள் இதுவரை செய்யத் தயங்கிய விஷயங்களை இன்று உறுதியுடன் தொடங்கி வெற்றிகரமாக முடிப்பீர்கள். உங்கள் தன்னம்பிக்கை உயரும். குடும்ப உறவுகளில் நல்லிணக்கம் ஏற்படும். சகோதர சகோதரிகளுடன் சுமுகமான உரையாடல்கள் நிகழும். அவர்களுக்குத் தேவையான உதவிகளைச் செய்வீர்கள். குறிப்பாக, சொத்து சம்பந்தமான விஷயங்களில் சாதகமான திருப்பங்கள் ஏற்படும்.\n\nசமூகத்தில் உங்கள் மதிப்பு உயரும். புதிய நண்பர்களைச் சந்திப்பதற்கான வாய்ப்புகள் அமையும். உங்கள் கருத்துக்கள் பலரால் ஏற்றுக்கொள்ளப்படும். பணியிடத்தில் உங்கள் தலைமைப் பண்புகள் வெளிப்படும். புதிய திட்டங்களை முன்னின்று நடத்துவீர்கள். உங்கள் திறமைகளும், அர்ப்பணிப்பும் உயரதிகாரிகளால் பாராட்டப்படும். சக ஊழியர்களுடன் இணைந்து ஒரு குழுவாக செயல்படும்போது, உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். கலைத்துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் கூடுதல் கவனம் செலுத்தி, சிறப்பான முன்னேற்றத்தை அடைவார்கள். ஆசிரியர்களின் பாராட்டுகளைப் பெறுவார்கள். போட்டித் தேர்வுகளில் கலந்துகொள்பவர்கள் இன்று தங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்பைப் பெறுவார்கள். உங்களின் ஆழ்ந்த அறிவு, கடின உழைப்பு, மற்றும் விடாமுயற்சி ஆகியவை உங்களுக்கு வெற்றியைத் தேடித் தரும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயம் தரும் பயணங்களாக அமையும்.\n\nஉங்கள் வாழ்க்கைத் துணையுடன் இனிமையான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். அவர்களின் அன்பும் ஆதரவும் உங்களுக்கு மன அமைதியைத் தரும். திருமணமான தம்பதிகள் தங்கள் உறவை மேம்படுத்தும் வகையில் சிறப்பு நேரத்தை செலவிடுவார்கள். அன்பு இன்று மேலும் வலுப்பெறும். காதலர்களுக்கு இனிமையான அனுபவங்கள் ஏற்படும். அவர்கள் தங்கள் உறவை அடுத்த கட்டத்திற்கு எடுத்துச் செல்வது பற்றிச் சிந்திப்பார்கள். பெற்றோர்கள் தங்கள் குழந்தைகளின் எதிர்காலம் குறித்து ஆக்கபூர்வமான திட்டங்களை வகுப்பார்கள். குழந்தைகளின் திறமைகளை ஊக்குவிக்கும் விதமாக செயல்படுவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகள் இன்று அமையும். இதன் மூலம் உங்களின் நல்லெண்ணம் பரவும். உங்களின் தாராள குணம், மற்றவர்களுக்கு உதவும் மனப்பான்மை இன்று வெளிப்படும். நீங்கள் செய்யும் உதவிக்கு அங்கீகாரம் கிடைக்கும். உங்கள் கருத்துக்கள் இன்று பலரால் ஏற்றுக்கொள்ளப்படும்.\n\nபுதிய திட்டங்களைத் தொடங்குவதற்கு இன்று மிகவும் பொருத்தமான நாள். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய முதலீடுகளைப் பற்றி நிபுணர்களுடன் ஆலோசிப்பீர்கள். உங்கள் உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். யோகா மற்றும் தியானம் போன்ற பயிற்சிகளை மேற்கொள்வது உங்கள் மனதுக்கும் உடலுக்கும் புத்துணர்வை அளிக்கும். உங்கள் ஆன்மிக நாட்டங்கள் அதிகரிக்கும். இறை வழிபாட்டில் அதிக நேரம் செலவிடுவீர்கள். உங்களின் நேர்மறை எண்ணங்கள், உங்களைச் சுற்றியுள்ளவர்களுக்கும் பரவும். நேர்மறையான கண்ணோட்டத்துடன் செயல்பட்டு, அனைத்து சவால்களையும் வெற்றிகரமாக எதிர்கொள்வீர்கள். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் எதிர்காலத்திற்கு நன்மை பயப்பதாக இருக்கும். உங்கள் ஆற்றல் இன்று உச்சத்தில் இருக்கும். நீங்கள் செய்யும் அனைத்து செயல்களிலும் வெற்றி நிச்சயம். இன்று உங்களுக்கு புதிய உத்வேகமும், புதுமையான எண்ணங்களும் பிறக்கும். இவற்றை சரியாகப் பயன்படுத்தி உங்கள் வாழ்வை வளமாக்கிக் கொள்வீர்கள். இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணிப்பீர்கள். உங்கள் தன்னம்பிக்கையும் தைரியமும் இன்று உங்களுக்கு சிறந்த துணையாக இருக்கும். எதிர்பாராத பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும்.",
    "prediction_en": "For Capricorn natives, today is Tuesday, and your day begins under the influence of Mars. Your natural hard work and discipline will combine with added courage and efficiency today. This will greatly help you achieve your long-term goals. You will confidently start and successfully complete tasks you have hesitated to do until now. Your self-confidence will rise. There will be harmony in family relationships. Harmonious conversations will take place with siblings; you will provide them with necessary assistance. Particularly, favorable turns will occur in property-related matters.\n\nYour prestige in society will increase. Opportunities to meet new friends will arise. Your opinions will be accepted by many. Your leadership qualities will shine at the workplace. You will take the lead in new projects. Your talents and dedication will be appreciated by superiors. When working as a team with colleagues, your contribution will be significant. Innovative thoughts will guide you. Those in the arts will receive new opportunities. Students will pay extra attention to their studies and achieve excellent progress, earning praise from teachers. Those appearing for competitive exams will get a good opportunity to showcase their talents today. Your deep knowledge, hard work, and perseverance will bring you success. Journeys you undertake today will prove beneficial.\n\nYou will share sweet moments with your life partner. Their love and support will bring you peace of mind. Married couples will spend quality time together to enhance their relationship. Love will grow stronger today. Lovers will have pleasant experiences and will think about taking their relationship to the next level. Parents will formulate constructive plans for their children's future and act in ways that encourage their children's talents. Opportunities for engaging in social service will arise today, through which your goodwill will spread. Your generous nature and willingness to help others will be evident today. Your assistance will be recognized. Your opinions will be accepted by many today.\n\nToday is a very suitable day to start new projects. You will consider new investments. You will consult experts about long-term profitable investments. Your physical health will improve. You will perform daily tasks with enthusiasm. Practicing yoga and meditation will refresh your mind and body. Your spiritual inclinations will increase, and you will spend more time in devotion. Your positive thoughts will spread to those around you. You will act with a positive outlook and successfully overcome all challenges. All decisions you make today will be beneficial for your future. Your energy will be at its peak today, and success is certain in all your endeavors. Today, new inspiration and innovative ideas will arise for you. By utilizing them correctly, you will enrich your life. Today, you will move steadfastly towards your goals. Your self-confidence and courage will be your best companions today. Unexpected praise and recognition await you.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் கடின உழைப்புக்கு அங்கீகாரம் கிடைக்கும். புதிய திட்டங்களை வெற்றிகரமாக முடிப்பீர்கள். உங்கள் தலைமைப் பண்புகள் வெளிப்படும். சக ஊழியர்களின் ஒத்துழைப்புடன் திட்டங்களை நிறைவேற்றுவீர்கள். இன்று நீங்கள் எடுக்கும் துணிச்சலான முடிவுகள் உங்கள் தொழில் வாழ்க்கைக்கு நன்மை பயக்கும்.",
    "career_en": "Your hard work at the workplace will receive recognition. You will successfully complete new projects. Your leadership qualities will shine. You will accomplish projects with the cooperation of colleagues. The courageous decisions you make today will benefit your professional life.",
    "finance_ta": "நிதிநிலைமை சாதகமாக இருக்கும். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய திட்டங்களில் முதலீடு செய்வீர்கள். குடும்பத்தின் நிதி தேவைகள் பூர்த்தி செய்யப்படும். எதிர்பாராத வகையில் ஆதாயம் கிடைக்க வாய்ப்புள்ளது. உங்கள் நிதி முடிவுகள் புத்திசாலித்தனமாக இருக்கும்.",
    "finance_en": "The financial situation will be favorable. You will consider new investments and invest in long-term profitable plans. Family financial needs will be met. There is a possibility of unexpected gains. Your financial decisions will be wise.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் இருப்பீர்கள். யோகா, நடைப்பயிற்சி போன்ற உடற்பயிற்சிகளை மேற்கொள்வது உங்கள் ஆற்றலை மேலும் அதிகரிக்கும். மன அமைதிக்காக தியானம் செய்வது நன்மை பயக்கும். இன்று முழுவதும் சுறுசுறுப்புடன் செயல்படுவீர்கள். சரியான உணவுப் பழக்கத்தைப் பின்பற்றுவது நல்லது.",
    "health_en": "Your physical health will be excellent. You will be energetic. Practicing exercises like yoga and walking will further boost your energy. Meditating for mental peace will be beneficial. You will be active throughout the day. Following a proper diet is advisable.",
    "lucky_number": "8",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "கும்பம்",
    "sign_en": "Aquarius",
    "date": "17-02-2026",
    "prediction_ta": "கும்ப ராசிக்காரர்களுக்கு இன்று செவ்வாய்க்கிழமை, செவ்வாய் கிரகத்தின் ஆதிக்கத்தில் உங்கள் நாள் தொடங்குகிறது. உங்கள் புதுமையான சிந்தனைகளுடன், இன்று கூடுதல் துணிச்சலும், செயல்திறனும் சேரும். இது உங்கள் வாழ்க்கையில் புதிய மாற்றங்களைக் கொண்டு வரும். நீண்ட நாட்களாக நீங்கள் தள்ளிப்போட்ட காரியங்களை இன்று துணிச்சலுடன் செய்து முடிப்பதற்கான சிறந்த ஆற்றல் உங்களுக்குக் கிடைக்கும். உங்களின் மன உறுதி, எத்தகைய தடைகளையும் தகர்த்தெறியும் வலிமையை அளிக்கும். குடும்பத்தில் உள்ள உறவுகளுடன் இணக்கமாகப் பழகுவீர்கள். உறவினர்களுக்கிடையே ஏதேனும் சிறு மனஸ்தாபங்கள் இருந்தால், அவற்றை நீங்கள் முன்வந்து சரிசெய்வதற்கான வாய்ப்புகள் உண்டாகும்.\n\nஉங்கள் தலைமைப் பண்புகள் இன்று வெளிப்படும். பல விஷயங்களில் நீங்கள் முன்னின்று செயல்பட்டு, மற்றவர்களுக்கு வழிகாட்டுவீர்கள். உங்கள் கருத்துக்களுக்கு மதிப்புக் கொடுக்கப்படும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயம் தரும் பயணங்களாக அமையும். குறிப்பாக, நிலம் அல்லது வீடு தொடர்பான விஷயங்களில் நீங்கள் எடுக்கும் முடிவுகள் சாதகமாக இருக்கும். புதிய வீடு வாங்குவது அல்லது புதுப்பிப்பது தொடர்பான யோசனைகள் இன்று நடைமுறைக்கு வரும் வாய்ப்புள்ளது. உங்களின் தன்னம்பிக்கை உயரும். சக பணியாளர்களுடன் இணைந்து ஒரு குழுவாக செயல்படும்போது, உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். கலைத்துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் கூடுதல் கவனம் செலுத்தி, சிறப்பான முன்னேற்றத்தை அடைவார்கள். ஆசிரியர்களின் பாராட்டுகளைப் பெறுவார்கள். போட்டித் தேர்வுகளில் கலந்துகொள்பவர்கள் இன்று தங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்பைப் பெறுவார்கள். உங்களின் ஆழ்ந்த அறிவு, கடின உழைப்பு, மற்றும் விடாமுயற்சி ஆகியவை உங்களுக்கு வெற்றியைத் தேடித் தரும்.\n\nஉங்கள் வாழ்க்கைத் துணையுடன் இனிமையான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். அவர்களின் அன்பும் ஆதரவும் உங்களுக்கு மன அமைதியைத் தரும். திருமணமான தம்பதிகள் தங்கள் உறவை மேம்படுத்தும் வகையில் சிறப்பு நேரத்தை செலவிடுவார்கள். அன்பு இன்று மேலும் வலுப்பெறும். காதலர்களுக்கு இனிமையான அனுபவங்கள் ஏற்படும். அவர்கள் தங்கள் உறவை அடுத்த கட்டத்திற்கு எடுத்துச் செல்வது பற்றிச் சிந்திப்பார்கள். பெற்றோர்கள் தங்கள் குழந்தைகளின் எதிர்காலம் குறித்து ஆக்கபூர்வமான திட்டங்களை வகுப்பார்கள். குழந்தைகளின் திறமைகளை ஊக்குவிக்கும் விதமாக செயல்படுவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகள் இன்று அமையும். இதன் மூலம் உங்களின் நல்லெண்ணம் பரவும். உங்களின் தாராள குணம், மற்றவர்களுக்கு உதவும் மனப்பான்மை இன்று வெளிப்படும். நீங்கள் செய்யும் உதவிக்கு அங்கீகாரம் கிடைக்கும்.\n\nபுதிய திட்டங்களைத் தொடங்குவதற்கு இன்று மிகவும் பொருத்தமான நாள். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய முதலீடுகளைப் பற்றி நிபுணர்களுடன் ஆலோசிப்பீர்கள். உங்கள் உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். யோகா மற்றும் தியானம் போன்ற பயிற்சிகளை மேற்கொள்வது உங்கள் மனதுக்கும் உடலுக்கும் புத்துணர்வை அளிக்கும். உங்கள் ஆன்மிக நாட்டங்கள் அதிகரிக்கும். இறை வழிபாட்டில் அதிக நேரம் செலவிடுவீர்கள். உங்களின் நேர்மறை எண்ணங்கள், உங்களைச் சுற்றியுள்ளவர்களுக்கும் பரவும். நேர்மறையான கண்ணோட்டத்துடன் செயல்பட்டு, அனைத்து சவால்களையும் வெற்றிகரமாக எதிர்கொள்வீர்கள். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் எதிர்காலத்திற்கு நன்மை பயப்பதாக இருக்கும். உங்கள் ஆற்றல் இன்று உச்சத்தில் இருக்கும். நீங்கள் செய்யும் அனைத்து செயல்களிலும் வெற்றி நிச்சயம். இன்று உங்களுக்கு புதிய உத்வேகமும், புதுமையான எண்ணங்களும் பிறக்கும். இவற்றை சரியாகப் பயன்படுத்தி உங்கள் வாழ்வை வளமாக்கிக் கொள்வீர்கள். இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணிப்பீர்கள். உங்கள் தன்னம்பிக்கையும் தைரியமும் இன்று உங்களுக்கு சிறந்த துணையாக இருக்கும். எதிர்பாராத பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும்.",
    "prediction_en": "For Aquarius natives, today is Tuesday, and your day begins under the influence of Mars. With your innovative ideas, added courage and efficiency will join today. This will bring new changes in your life. You will receive excellent energy today to courageously complete tasks you have long postponed. Your mental determination will provide the strength to overcome any obstacles. You will interact harmoniously with family members. If there are any minor disagreements among relatives, opportunities will arise for you to proactively resolve them.\n\nYour leadership qualities will shine today. You will take the lead in many matters and guide others. Your opinions will be valued. Journeys you undertake today will prove beneficial. Especially, decisions you make regarding land or property matters will be favorable. Ideas related to buying a new home or renovating an existing one may materialize today. Your self-confidence will rise. When working as a team with colleagues, your contribution will be significant. Innovative thoughts will guide you. Those in the arts will receive new opportunities. Students will pay extra attention to their studies and achieve excellent progress, earning praise from teachers. Those appearing for competitive exams will get a good opportunity to showcase their talents today. Your deep knowledge, hard work, and perseverance will bring you success.\n\nYou will share sweet moments with your life partner. Their love and support will bring you peace of mind. Married couples will spend quality time together to enhance their relationship. Love will grow stronger today. Lovers will have pleasant experiences and will think about taking their relationship to the next level. Parents will formulate constructive plans for their children's future and act in ways that encourage their children's talents. Opportunities for engaging in social service will arise today, through which your goodwill will spread. Your generous nature and willingness to help others will be evident today. Your assistance will be recognized.\n\nToday is a very suitable day to start new projects. You will consider new investments. You will consult experts about long-term profitable investments. Your physical health will improve. You will perform daily tasks with enthusiasm. Practicing yoga and meditation will refresh your mind and body. Your spiritual inclinations will increase, and you will spend more time in devotion. Your positive thoughts will spread to those around you. You will act with a positive outlook and successfully overcome all challenges. All decisions you make today will be beneficial for your future. Your energy will be at its peak today, and success is certain in all your endeavors. Today, new inspiration and innovative ideas will arise for you. By utilizing them correctly, you will enrich your life. Today, you will move steadfastly towards your goals. Your self-confidence and courage will be your best companions today. Unexpected praise and recognition await you.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் புதுமையான யோசனைகள் வரவேற்கப்படும். புதிய திட்டங்களை முன்னின்று நடத்துவீர்கள். உங்கள் துணிச்சல் நிறைந்த அணுகுமுறை உயரதிகாரிகளால் பாராட்டப்படும். குழுப்பணிகளில் உங்கள் தலைமைப் பண்பு சிறப்பாக வெளிப்படும். புதிய பொறுப்புகள் உங்களைத் தேடி வரும். நம்பிக்கையுடன் அவற்றை ஏற்றுக்கொண்டு, சிறப்பாகச் செயல்படுவீர்கள்.",
    "career_en": "Your innovative ideas will be welcomed at the workplace. You will take the lead in new projects. Your courageous approach will be appreciated by superiors. Your leadership qualities will shine brightly in team tasks. New responsibilities will come your way, which you will accept with confidence and perform excellently.",
    "finance_ta": "நிதிநிலைமை இன்று சாதகமாக இருக்கும். நீண்டகால முதலீடுகள் பற்றி ஆலோசிப்பீர்கள். சேமிக்கும் பழக்கத்தை மேம்படுத்துவீர்கள். எதிர்பாராத வகையில் சிறு ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது. நிலம் அல்லது வீடு தொடர்பான விஷயங்களில் நல்ல முடிவுகளை எடுப்பீர்கள். இன்று நீங்கள் மேற்கொள்ளும் நிதி சார்ந்த முடிவுகள் எதிர்காலத்திற்கு நன்மை பயக்கும்.",
    "finance_en": "The financial situation will be favorable today. You will consult about long-term investments and improve your saving habits. There is a possibility of small unexpected gains. You will make good decisions regarding land or property matters. Financial decisions you make today will be beneficial for the future.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். உற்சாகத்துடன் இருப்பீர்கள். யோகா, நடைப்பயிற்சி போன்ற உடற்பயிற்சிகளை மேற்கொள்வது உங்கள் ஆற்றலை மேலும் அதிகரிக்கும். மன அமைதிக்காக தியானம் செய்வது நன்மை பயக்கும். இன்று முழுவதும் சுறுசுறுப்புடன் செயல்படுவீர்கள். சரியான உணவுப் பழக்கத்தைப் பின்பற்றுவது நல்லது.",
    "health_en": "Your physical health will be excellent. You will be energetic. Practicing exercises like yoga and walking will further boost your energy. Meditating for mental peace will be beneficial. You will be active throughout the day. Following a proper diet is advisable.",
    "lucky_number": "4",
    "lucky_color_ta": "கருநீலம்",
    "lucky_color_en": "Indigo"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "17-02-2026",
    "prediction_ta": "மீன ராசிக்காரர்களுக்கு இன்று செவ்வாய்க்கிழமை, செவ்வாய் கிரகத்தின் ஆதிக்கத்தில் உங்கள் நாள் தொடங்குகிறது. உங்கள் இயல்பான கருணையுடனும், படைப்பாற்றலுடனும், இன்று கூடுதல் துணிச்சலும், செயல்திறனும் சேரும். இது உங்கள் கனவுகளை நனவாக்க உதவும். நீண்ட நாட்களாக நீங்கள் தள்ளிப்போட்ட காரியங்களை இன்று துணிச்சலுடன் செய்து முடிப்பதற்கான சிறந்த ஆற்றல் உங்களுக்குக் கிடைக்கும். உங்களின் மன உறுதி, எத்தகைய தடைகளையும் தகர்த்தெறியும் வலிமையை அளிக்கும். குடும்பத்தில் உள்ள உறவுகளுடன் இணக்கமாகப் பழகுவீர்கள். உறவினர்களுக்கிடையே ஏதேனும் சிறு மனஸ்தாபங்கள் இருந்தால், அவற்றை நீங்கள் முன்வந்து சரிசெய்வதற்கான வாய்ப்புகள் உண்டாகும்.\n\nஉங்கள் தலைமைப் பண்புகள் இன்று வெளிப்படும். பல விஷயங்களில் நீங்கள் முன்னின்று செயல்பட்டு, மற்றவர்களுக்கு வழிகாட்டுவீர்கள். உங்கள் கருத்துக்களுக்கு மதிப்புக் கொடுக்கப்படும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயம் தரும் பயணங்களாக அமையும். குறிப்பாக, நிலம் அல்லது வீடு தொடர்பான விஷயங்களில் நீங்கள் எடுக்கும் முடிவுகள் சாதகமாக இருக்கும். புதிய வீடு வாங்குவது அல்லது புதுப்பிப்பது தொடர்பான யோசனைகள் இன்று நடைமுறைக்கு வரும் வாய்ப்புள்ளது. உங்களின் தன்னம்பிக்கை உயரும். சக பணியாளர்களுடன் இணைந்து ஒரு குழுவாக செயல்படும்போது, உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். கலைத்துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் கூடுதல் கவனம் செலுத்தி, சிறப்பான முன்னேற்றத்தை அடைவார்கள். ஆசிரியர்களின் பாராட்டுகளைப் பெறுவார்கள். போட்டித் தேர்வுகளில் கலந்துகொள்பவர்கள் இன்று தங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்பைப் பெறுவார்கள். உங்களின் ஆழ்ந்த அறிவு, கடின உழைப்பு, மற்றும் விடாமுயற்சி ஆகியவை உங்களுக்கு வெற்றியைத் தேடித் தரும்.\n\nஉங்கள் வாழ்க்கைத் துணையுடன் இனிமையான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். அவர்களின் அன்பும் ஆதரவும் உங்களுக்கு மன அமைதியைத் தரும். திருமணமான தம்பதிகள் தங்கள் உறவை மேம்படுத்தும் வகையில் சிறப்பு நேரத்தை செலவிடுவார்கள். அன்பு இன்று மேலும் வலுப்பெறும். காதலர்களுக்கு இனிமையான அனுபவங்கள் ஏற்படும். அவர்கள் தங்கள் உறவை அடுத்த கட்டத்திற்கு எடுத்துச் செல்வது பற்றிச் சிந்திப்பார்கள். பெற்றோர்கள் தங்கள் குழந்தைகளின் எதிர்காலம் குறித்து ஆக்கபூர்வமான திட்டங்களை வகுப்பார்கள். குழந்தைகளின் திறமைகளை ஊக்குவிக்கும் விதமாக செயல்படுவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகள் இன்று அமையும். இதன் மூலம் உங்களின் நல்லெண்ணம் பரவும். உங்களின் தாராள குணம், மற்றவர்களுக்கு உதவும் மனப்பான்மை இன்று வெளிப்படும். நீங்கள் செய்யும் உதவிக்கு அங்கீகாரம் கிடைக்கும்.\n\nபுதிய திட்டங்களைத் தொடங்குவதற்கு இன்று மிகவும் பொருத்தமான நாள். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய முதலீடுகளைப் பற்றி நிபுணர்களுடன் ஆலோசிப்பீர்கள். உங்கள் உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். யோகா மற்றும் தியானம் போன்ற பயிற்சிகளை மேற்கொள்வது உங்கள் மனதுக்கும் உடலுக்கும் புத்துணர்வை அளிக்கும். உங்கள் ஆன்மிக நாட்டங்கள் அதிகரிக்கும். இறை வழிபாட்டில் அதிக நேரம் செலவிடுவீர்கள். உங்களின் நேர்மறை எண்ணங்கள், உங்களைச் சுற்றியுள்ளவர்களுக்கும் பரவும். நேர்மறையான கண்ணோட்டத்துடன் செயல்பட்டு, அனைத்து சவால்களையும் வெற்றிகரமாக எதிர்கொள்வீர்கள். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் எதிர்காலத்திற்கு நன்மை பயப்பதாக இருக்கும். உங்கள் ஆற்றல் இன்று உச்சத்தில் இருக்கும். நீங்கள் செய்யும் அனைத்து செயல்களிலும் வெற்றி நிச்சயம். இன்று உங்களுக்கு புதிய உத்வேகமும், புதுமையான எண்ணங்களும் பிறக்கும். இவற்றை சரியாகப் பயன்படுத்தி உங்கள் வாழ்வை வளமாக்கிக் கொள்வீர்கள். இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணிப்பீர்கள். உங்கள் தன்னம்பிக்கையும் தைரியமும் இன்று உங்களுக்கு சிறந்த துணையாக இருக்கும். எதிர்பாராத பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும்.",
    "prediction_en": "For Pisces natives, today is Tuesday, and your day begins under the influence of Mars. With your natural compassion and creativity, added courage and efficiency will join today. This will help you realize your dreams. You will receive excellent energy today to courageously complete tasks you have long postponed. Your mental determination will provide the strength to overcome any obstacles. You will interact harmoniously with family members. If there are any minor disagreements among relatives, opportunities will arise for you to proactively resolve them.\n\nYour leadership qualities will shine today. You will take the lead in many matters and guide others. Your opinions will be valued. Journeys you undertake today will prove beneficial. Especially, decisions you make regarding land or property matters will be favorable. Ideas related to buying a new home or renovating an existing one may materialize today. Your self-confidence will rise. When working as a team with colleagues, your contribution will be significant. Innovative thoughts will guide you. Those in the arts will receive new opportunities. Students will pay extra attention to their studies and achieve excellent progress, earning praise from teachers. Those appearing for competitive exams will get a good opportunity to showcase their talents today. Your deep knowledge, hard work, and perseverance will bring you success.\n\nYou will share sweet moments with your life partner. Their love and support will bring you peace of mind. Married couples will spend quality time together to enhance their relationship. Love will grow stronger today. Lovers will have pleasant experiences and will think about taking their relationship to the next level. Parents will formulate constructive plans for their children's future and act in ways that encourage their children's talents. Opportunities for engaging in social service will arise today, through which your goodwill will spread. Your generous nature and willingness to help others will be evident today. Your assistance will be recognized.\n\nToday is a very suitable day to start new projects. You will consider new investments. You will consult experts about long-term profitable investments. Your physical health will improve. You will perform daily tasks with enthusiasm. Practicing yoga and meditation will refresh your mind and body. Your spiritual inclinations will increase, and you will spend more time in devotion. Your positive thoughts will spread to those around you. You will act with a positive outlook and successfully overcome all challenges. All decisions you make today will be beneficial for your future. Your energy will be at its peak today, and success is certain in all your endeavors. Today, new inspiration and innovative ideas will arise for you. By utilizing them correctly, you will enrich your life. Today, you will move steadfastly towards your goals. Your self-confidence and courage will be your best companions today. Unexpected praise and recognition await you.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் படைப்பாற்றல் பாராட்டப்படும். புதிய திட்டங்களை துணிச்சலுடன் முன்னின்று நடத்துவீர்கள். சக பணியாளர்களுடன் இணக்கமான உறவு நீடிக்கும். உங்கள் தலைமைப் பண்புகள் வெளிப்படும். உங்கள் திறமைகளும், அர்ப்பணிப்பும் உயரதிகாரிகளால் அங்கீகரிக்கப்படும். பதவி உயர்வுக்கான வாய்ப்புகள் பிரகாசமாக இருக்கும்.",
    "career_en": "Your creativity at the workplace will be appreciated. You will courageously lead new projects. Harmonious relationships with colleagues will continue. Your leadership qualities will shine. Your talents and dedication will be recognized by superiors. Opportunities for promotion will be bright.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதி தேவைகள் பூர்த்தி செய்யப்படும். சிறு அளவில் எதிர்பாராத லாபம் கிடைக்க வாய்ப்புள்ளது. நிதி திட்டமிடல் உங்களுக்கு நன்மை பயக்கும். தேவையில்லாத செலவுகளைக் கட்டுப்படுத்துவீர்கள்.",
    "finance_en": "The financial situation will be stable. You will consider new investments and focus on savings plans. Family financial needs will be met. There is a possibility of small unexpected profits. Financial planning will benefit you. You will control unnecessary expenses.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். மனதில் புதிய உற்சாகம் நிலவும். சரியான உணவுப் பழக்கங்களைப் பின்பற்றுவீர்கள். மன அழுத்தத்தைப் போக்க தியானம் செய்வது நன்மை பயக்கும். நடைப்பயிற்சி உங்கள் உடலுக்குப் புத்துணர்ச்சி அளிக்கும். சுறுசுறுப்புடன் செயல்படுவீர்கள்.",
    "health_en": "Physical health will improve. New enthusiasm will prevail in your mind. You will follow proper eating habits. Meditating to relieve stress will be beneficial. Walking will refresh your body. You will act actively.",
    "lucky_number": "7",
    "lucky_color_ta": "மெரூன்",
    "lucky_color_en": "Maroon"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "17-02-2026",
    "prediction_ta": "கடக ராசிக்காரர்களுக்கு இன்று செவ்வாய்க்கிழமை, செவ்வாய் கிரகத்தின் ஆதிக்கத்தில் உங்கள் நாள் தொடங்குகிறது. பொதுவாக உணர்ச்சிபூர்வமானவர்களாக இருக்கும் நீங்கள், இன்று துணிச்சலுடனும், உறுதியுடனும் செயல்படுவீர்கள். உங்கள் மனதில் தோன்றும் நல்லெண்ணங்கள் செயல்களாக மாறும். குடும்பத்தின் மீது உங்களுக்குள்ள அன்பு மேலும் அதிகரிக்கும். வீட்டைப் புதுப்பிப்பது அல்லது புதிய பொருட்களை வாங்குவது தொடர்பான யோசனைகள் இன்று நடைமுறைக்கு வரலாம். சொத்து தொடர்பான விஷயங்களில் நீங்கள் எடுக்கும் முடிவுகள் சாதகமாக இருக்கும்.\n\nபணியிடத்தில் உங்கள் கடின உழைப்புக்கு அங்கீகாரம் கிடைக்கும். புதிய பொறுப்புகளை நம்பிக்கையுடன் ஏற்றுக்கொள்வீர்கள். சக பணியாளர்களுடன் இணக்கமாகப் பழகுவீர்கள். உங்கள் தலைமைப் பண்புகள் இன்று வெளிப்படும். பல விஷயங்களில் நீங்கள் முன்னின்று செயல்பட்டு, மற்றவர்களுக்கு வழிகாட்டுவீர்கள். புதுமையான திட்டங்களை முன்வைத்து, வெற்றிகரமாக செயல்படுத்துவீர்கள். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயம் தரும் பயணங்களாக அமையும். குறிப்பாக, நிலம் அல்லது வீடு தொடர்பான விஷயங்களில் நீங்கள் எடுக்கும் முடிவுகள் சாதகமாக இருக்கும். உங்களின் தன்னம்பிக்கை உயரும். சக பணியாளர்களுடன் இணைந்து ஒரு குழுவாக செயல்படும்போது, உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். கலைத்துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் கூடுதல் கவனம் செலுத்தி, சிறப்பான முன்னேற்றத்தை அடைவார்கள். ஆசிரியர்களின் பாராட்டுகளைப் பெறுவார்கள். போட்டித் தேர்வுகளில் கலந்துகொள்பவர்கள் இன்று தங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்பைப் பெறுவார்கள். உங்களின் ஆழ்ந்த அறிவு, கடின உழைப்பு, மற்றும் விடாமுயற்சி ஆகியவை உங்களுக்கு வெற்றியைத் தேடித் தரும்.\n\nஉங்கள் வாழ்க்கைத் துணையுடன் இனிமையான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். அவர்களின் அன்பும் ஆதரவும் உங்களுக்கு மன அமைதியைத் தரும். திருமணமான தம்பதிகள் தங்கள் உறவை மேம்படுத்தும் வகையில் சிறப்பு நேரத்தை செலவிடுவார்கள். அன்பு இன்று மேலும் வலுப்பெறும். காதலர்களுக்கு இனிமையான அனுபவங்கள் ஏற்படும். அவர்கள் தங்கள் உறவை அடுத்த கட்டத்திற்கு எடுத்துச் செல்வது பற்றிச் சிந்திப்பார்கள். பெற்றோர்கள் தங்கள் குழந்தைகளின் எதிர்காலம் குறித்து ஆக்கபூர்வமான திட்டங்களை வகுப்பார்கள். குழந்தைகளின் திறமைகளை ஊக்குவிக்கும் விதமாக செயல்படுவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகள் இன்று அமையும். இதன் மூலம் உங்களின் நல்லெண்ணம் பரவும். உங்களின் தாராள குணம், மற்றவர்களுக்கு உதவும் மனப்பான்மை இன்று வெளிப்படும். நீங்கள் செய்யும் உதவிக்கு அங்கீகாரம் கிடைக்கும்.\n\nபுதிய திட்டங்களைத் தொடங்குவதற்கு இன்று மிகவும் பொருத்தமான நாள். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய முதலீடுகளைப் பற்றி நிபுணர்களுடன் ஆலோசிப்பீர்கள். உங்கள் உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். யோகா மற்றும் தியானம் போன்ற பயிற்சிகளை மேற்கொள்வது உங்கள் மனதுக்கும் உடலுக்கும் புத்துணர்வை அளிக்கும். உங்கள் ஆன்மிக நாட்டங்கள் அதிகரிக்கும். இறை வழிபாட்டில் அதிக நேரம் செலவிடுவீர்கள். உங்களின் நேர்மறை எண்ணங்கள், உங்களைச் சுற்றியுள்ளவர்களுக்கும் பரவும். நேர்மறையான கண்ணோட்டத்துடன் செயல்பட்டு, அனைத்து சவால்களையும் வெற்றிகரமாக எதிர்கொள்வீர்கள். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் எதிர்காலத்திற்கு நன்மை பயப்பதாக இருக்கும். உங்கள் ஆற்றல் இன்று உச்சத்தில் இருக்கும். நீங்கள் செய்யும் அனைத்து செயல்களிலும் வெற்றி நிச்சயம். இன்று உங்களுக்கு புதிய உத்வேகமும், புதுமையான எண்ணங்களும் பிறக்கும். இவற்றை சரியாகப் பயன்படுத்தி உங்கள் வாழ்வை வளமாக்கிக் கொள்வீர்கள். இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணிப்பீர்கள். உங்கள் தன்னம்பிக்கையும் தைரியமும் இன்று உங்களுக்கு சிறந்த துணையாக இருக்கும். எதிர்பாராத பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும்.",
    "prediction_en": "For Cancer natives, today is Tuesday, and your day begins under the influence of Mars. Usually emotional, today you will act with courage and determination. Your good intentions will translate into actions. Your love for your family will further increase. Ideas related to renovating your home or buying new items may materialize today. Decisions you make regarding property matters will be favorable.\n\nYour hard work will be recognized at the workplace. You will confidently accept new responsibilities. You will interact harmoniously with colleagues. Your leadership qualities will shine today. You will take the lead in many matters and guide others. You will propose innovative projects and implement them successfully. Journeys you undertake today will prove beneficial. Especially, decisions you make regarding land or property matters will be favorable. Your self-confidence will rise. When working as a team with colleagues, your contribution will be significant. Innovative thoughts will guide you. Those in the arts will receive new opportunities. Students will pay extra attention to their studies and achieve excellent progress, earning praise from teachers. Those appearing for competitive exams will get a good opportunity to showcase their talents today. Your deep knowledge, hard work, and perseverance will bring you success.\n\nYou will share sweet moments with your life partner. Their love and support will bring you peace of mind. Married couples will spend quality time together to enhance their relationship. Love will grow stronger today. Lovers will have pleasant experiences and will think about taking their relationship to the next level. Parents will formulate constructive plans for their children's future and act in ways that encourage their children's talents. Opportunities for engaging in social service will arise today, through which your goodwill will spread. Your generous nature and willingness to help others will be evident today. Your assistance will be recognized.\n\nToday is a very suitable day to start new projects. You will consider new investments. You will consult experts about long-term profitable investments. Your physical health will improve. You will perform daily tasks with enthusiasm. Practicing yoga and meditation will refresh your mind and body. Your spiritual inclinations will increase, and you will spend more time in devotion. Your positive thoughts will spread to those around you. You will act with a positive outlook and successfully overcome all challenges. All decisions you make today will be beneficial for your future. Your energy will be at its peak today, and success is certain in all your endeavors. Today, new inspiration and innovative ideas will arise for you. By utilizing them correctly, you will enrich your life. Today, you will move steadfastly towards your goals. Your self-confidence and courage will be your best companions today. Unexpected praise and recognition await you.",
    "career_ta": "பணியிடத்தில் உங்கள் அர்ப்பணிப்பு பாராட்டப்படும். புதிய சவால்களை துணிச்சலுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். உங்கள் யோசனைகள் ஏற்றுக்கொள்ளப்படும். குழுத் தலைவராக செயல்பட வாய்ப்புகள் கிடைக்கும். புதிய திட்டங்களை வெற்றிகரமாக முடிப்பீர்கள். உங்கள் கடின உழைப்புக்கு ஏற்ற அங்கீகாரம் கிடைக்கும்.",
    "career_en": "Your dedication at the workplace will be appreciated. You will bravely face new challenges and succeed. Your ideas will be accepted. Opportunities to act as a team leader will arise. You will successfully complete new projects. You will receive due recognition for your hard work.",
    "finance_ta": "நிதிநிலையில் முன்னேற்றம் ஏற்படும். சொத்து தொடர்பான விஷயங்களில் சாதகமான திருப்பங்கள் ஏற்படும். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். குடும்பத்தின் நிதி தேவைகள் பூர்த்தி செய்யப்படும். சிறு அளவில் எதிர்பாராத ஆதாயம் கிடைக்க வாய்ப்புள்ளது. சிக்கன நடவடிக்கைகளை மேற்கொண்டு சேமிப்பை உயர்த்துவீர்கள்.",
    "finance_en": "There will be financial progress. Favorable turns will occur in property-related matters. You will consider new investments. Family financial needs will be met. There is a possibility of small unexpected gains. You will take austerity measures and increase savings.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். மனதில் புதிய உற்சாகம் நிலவும். சரியான உணவுப் பழக்கங்களைப் பின்பற்றுவீர்கள். மன அழுத்தத்தைப் போக்க தியானம் செய்வது நன்மை பயக்கும். யோகா பயிற்சிகள் உடலுக்குப் புத்துணர்ச்சி அளிக்கும். சுறுசுறுப்புடன் செயல்படுவீர்கள்.",
    "health_en": "Physical health will improve. New enthusiasm will prevail in your mind. You will follow proper eating habits. Meditating to relieve stress will be beneficial. Yoga exercises will refresh the body. You will act actively.",
    "lucky_number": "2",
    "lucky_color_ta": "வெள்ளி",
    "lucky_color_en": "Silver"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "17-02-2026",
    "prediction_ta": "துலாம் ராசிக்காரர்களுக்கு இன்று செவ்வாய்க்கிழமை, செவ்வாய் கிரகத்தின் ஆதிக்கத்தில் உங்கள் நாள் தொடங்குகிறது. உங்கள் இயல்பான இணக்கமான குணம் இன்று துணிச்சலான முடிவெடுக்கும் ஆற்றலுடன் இணையும். இது உங்கள் தனிப்பட்ட மற்றும் தொழில் வாழ்க்கையில் சிறப்பான முன்னேற்றங்களை உண்டாக்கும். நீண்ட நாட்களாக நீங்கள் தள்ளிப்போட்ட காரியங்களை இன்று உறுதியுடன் தொடங்கி வெற்றிகரமாக முடிப்பீர்கள். உங்களின் தன்னம்பிக்கை உயரும். குடும்ப உறவுகளில் நல்லிணக்கம் ஏற்படும். சகோதர சகோதரிகளுடன் சுமுகமான உரையாடல்கள் நிகழும். அவர்களுக்குத் தேவையான உதவிகளைச் செய்வீர்கள். குறிப்பாக, சொத்து சம்பந்தமான விஷயங்களில் சாதகமான திருப்பங்கள் ஏற்படும்.\n\nசமூகத்தில் உங்கள் மதிப்பு உயரும். புதிய நண்பர்களைச் சந்திப்பதற்கான வாய்ப்புகள் அமையும். உங்கள் கருத்துக்கள் பலரால் ஏற்றுக்கொள்ளப்படும். பணியிடத்தில் உங்கள் தலைமைப் பண்புகள் வெளிப்படும். புதிய திட்டங்களை முன்னின்று நடத்துவீர்கள். உங்கள் திறமைகளும், அர்ப்பணிப்பும் உயரதிகாரிகளால் பாராட்டப்படும். சக ஊழியர்களுடன் இணைந்து ஒரு குழுவாக செயல்படும்போது, உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். கலைத்துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் கூடுதல் கவனம் செலுத்தி, சிறப்பான முன்னேற்றத்தை அடைவார்கள். ஆசிரியர்களின் பாராட்டுகளைப் பெறுவார்கள். போட்டித் தேர்வுகளில் கலந்துகொள்பவர்கள் இன்று தங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்பைப் பெறுவார்கள். உங்களின் ஆழ்ந்த அறிவு, கடின உழைப்பு, மற்றும் விடாமுயற்சி ஆகியவை உங்களுக்கு வெற்றியைத் தேடித் தரும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயம் தரும் பயணங்களாக அமையும்.\n\nஉங்கள் வாழ்க்கைத் துணையுடன் இனிமையான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். அவர்களின் அன்பும் ஆதரவும் உங்களுக்கு மன அமைதியைத் தரும். திருமணமான தம்பதிகள் தங்கள் உறவை மேம்படுத்தும் வகையில் சிறப்பு நேரத்தை செலவிடுவார்கள். அன்பு இன்று மேலும் வலுப்பெறும். காதலர்களுக்கு இனிமையான அனுபவங்கள் ஏற்படும். அவர்கள் தங்கள் உறவை அடுத்த கட்டத்திற்கு எடுத்துச் செல்வது பற்றிச் சிந்திப்பார்கள். பெற்றோர்கள் தங்கள் குழந்தைகளின் எதிர்காலம் குறித்து ஆக்கபூர்வமான திட்டங்களை வகுப்பார்கள். குழந்தைகளின் திறமைகளை ஊக்குவிக்கும் விதமாக செயல்படுவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகள் இன்று அமையும். இதன் மூலம் உங்களின் நல்லெண்ணம் பரவும். உங்களின் தாராள குணம், மற்றவர்களுக்கு உதவும் மனப்பான்மை இன்று வெளிப்படும். நீங்கள் செய்யும் உதவிக்கு அங்கீகாரம் கிடைக்கும். உங்கள் கருத்துக்கள் இன்று பலரால் ஏற்றுக்கொள்ளப்படும்.\n\nபுதிய திட்டங்களைத் தொடங்குவதற்கு இன்று மிகவும் பொருத்தமான நாள். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய முதலீடுகளைப் பற்றி நிபுணர்களுடன் ஆலோசிப்பீர்கள். உங்கள் உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். யோகா மற்றும் தியானம் போன்ற பயிற்சிகளை மேற்கொள்வது உங்கள் மனதுக்கும் உடலுக்கும் புத்துணர்வை அளிக்கும். உங்கள் ஆன்மிக நாட்டங்கள் அதிகரிக்கும். இறை வழிபாட்டில் அதிக நேரம் செலவிடுவீர்கள். உங்களின் நேர்மறை எண்ணங்கள், உங்களைச் சுற்றியுள்ளவர்களுக்கும் பரவும். நேர்மறையான கண்ணோட்டத்துடன் செயல்பட்டு, அனைத்து சவால்களையும் வெற்றிகரமாக எதிர்கொள்வீர்கள். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் எதிர்காலத்திற்கு நன்மை பயப்பதாக இருக்கும். உங்கள் ஆற்றல் இன்று உச்சத்தில் இருக்கும். நீங்கள் செய்யும் அனைத்து செயல்களிலும் வெற்றி நிச்சயம். இன்று உங்களுக்கு புதிய உத்வேகமும், புதுமையான எண்ணங்களும் பிறக்கும். இவற்றை சரியாகப் பயன்படுத்தி உங்கள் வாழ்வை வளமாக்கிக் கொள்வீர்கள். இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணிப்பீர்கள். உங்கள் தன்னம்பிக்கையும் தைரியமும் இன்று உங்களுக்கு சிறந்த துணையாக இருக்கும். எதிர்பாராத பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும்.",
    "prediction_en": "For Libra natives, today is Tuesday, and your day begins under the influence of Mars. Your natural harmonious nature will combine with the ability to make courageous decisions today. This will lead to excellent progress in your personal and professional life. You will confidently start and successfully complete tasks you have long postponed. Your self-confidence will rise. There will be harmony in family relationships. Harmonious conversations will take place with siblings; you will provide them with necessary assistance. Particularly, favorable turns will occur in property-related matters.\n\nYour prestige in society will increase. Opportunities to meet new friends will arise. Your opinions will be accepted by many. Your leadership qualities will shine at the workplace. You will take the lead in new projects. Your talents and dedication will be appreciated by superiors. When working as a team with colleagues, your contribution will be significant. Innovative thoughts will guide you. Those in the arts will receive new opportunities. Students will pay extra attention to their studies and achieve excellent progress, earning praise from teachers. Those appearing for competitive exams will get a good opportunity to showcase their talents today. Your deep knowledge, hard work, and perseverance will bring you success. Journeys you undertake today will prove beneficial.\n\nYou will share sweet moments with your life partner. Their love and support will bring you peace of mind. Married couples will spend quality time together to enhance their relationship. Love will grow stronger today. Lovers will have pleasant experiences and will think about taking their relationship to the next level. Parents will formulate constructive plans for their children's future and act in ways that encourage their children's talents. Opportunities for engaging in social service will arise today, through which your goodwill will spread. Your generous nature and willingness to help others will be evident today. Your assistance will be recognized. Your opinions will be accepted by many today.\n\nToday is a very suitable day to start new projects. You will consider new investments. You will consult experts about long-term profitable investments. Your physical health will improve. You will perform daily tasks with enthusiasm. Practicing yoga and meditation will refresh your mind and body. Your spiritual inclinations will increase, and you will spend more time in devotion. Your positive thoughts will spread to those around you. You will act with a positive outlook and successfully overcome all challenges. All decisions you make today will be beneficial for your future. Your energy will be at its peak today, and success is certain in all your endeavors. Today, new inspiration and innovative ideas will arise for you. By utilizing them correctly, you will enrich your life. Today, you will move steadfastly towards your goals. Your self-confidence and courage will be your best companions today. Unexpected praise and recognition await you.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் துணிச்சலான முடிவுகள் பாராட்டப்படும். புதிய திட்டங்களை முன்னின்று நடத்துவீர்கள். சக பணியாளர்களுடன் இணக்கமான உறவு நீடிக்கும். உங்கள் தலைமைப் பண்புகள் வெளிப்படும். உங்கள் திறமைகளும், அர்ப்பணிப்பும் உயரதிகாரிகளால் அங்கீகரிக்கப்படும். பதவி உயர்வுக்கான வாய்ப்புகள் பிரகாசமாக இருக்கும்.",
    "career_en": "Your courageous decisions at the workplace will be appreciated. You will take the lead in new projects. Harmonious relationships with colleagues will continue. Your leadership qualities will shine. Your talents and dedication will be recognized by superiors. Opportunities for promotion will be bright.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதி தேவைகள் பூர்த்தி செய்யப்படும். சிறு அளவில் எதிர்பாராத லாபம் கிடைக்க வாய்ப்புள்ளது. நிலம் அல்லது வீடு தொடர்பான விஷயங்களில் சாதகமான முடிவுகள் எடுக்கப்படும்.",
    "finance_en": "The financial situation will be stable. You will consider new investments and focus on savings plans. Family financial needs will be met. There is a possibility of small unexpected profits. Favorable decisions will be made regarding land or property matters.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். நடைப்பயிற்சி, யோகா போன்றவற்றை மேற்கொள்வது உங்கள் ஆற்றலை அதிகரிக்கும். மன அமைதிக்காக தியானம் செய்வது நன்மை தரும். ஆரோக்கியமான உணவுப் பழக்கங்களை மேற்கொள்வீர்கள்.",
    "health_en": "Physical health will improve. You will perform daily tasks with enthusiasm. Engaging in activities like walking and yoga will increase your energy. Meditating for mental peace will be beneficial. You will adopt healthy eating habits.",
    "lucky_number": "6",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "17-02-2026",
    "prediction_ta": "மீன ராசிக்காரர்களுக்கு இன்று செவ்வாய்க்கிழமை, செவ்வாய் கிரகத்தின் ஆதிக்கத்தில் உங்கள் நாள் தொடங்குகிறது. உங்கள் இயல்பான கருணையுடனும், படைப்பாற்றலுடனும், இன்று கூடுதல் துணிச்சலும், செயல்திறனும் சேரும். இது உங்கள் கனவுகளை நனவாக்க உதவும். நீண்ட நாட்களாக நீங்கள் தள்ளிப்போட்ட காரியங்களை இன்று துணிச்சலுடன் செய்து முடிப்பதற்கான சிறந்த ஆற்றல் உங்களுக்குக் கிடைக்கும். உங்களின் மன உறுதி, எத்தகைய தடைகளையும் தகர்த்தெறியும் வலிமையை அளிக்கும். குடும்பத்தில் உள்ள உறவுகளுடன் இணக்கமாகப் பழகுவீர்கள். உறவினர்களுக்கிடையே ஏதேனும் சிறு மனஸ்தாபங்கள் இருந்தால், அவற்றை நீங்கள் முன்வந்து சரிசெய்வதற்கான வாய்ப்புகள் உண்டாகும்.\n\nஉங்கள் தலைமைப் பண்புகள் இன்று வெளிப்படும். பல விஷயங்களில் நீங்கள் முன்னின்று செயல்பட்டு, மற்றவர்களுக்கு வழிகாட்டுவீர்கள். உங்கள் கருத்துக்களுக்கு மதிப்புக் கொடுக்கப்படும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் ஆதாயம் தரும் பயணங்களாக அமையும். குறிப்பாக, நிலம் அல்லது வீடு தொடர்பான விஷயங்களில் நீங்கள் எடுக்கும் முடிவுகள் சாதகமாக இருக்கும். புதிய வீடு வாங்குவது அல்லது புதுப்பிப்பது தொடர்பான யோசனைகள் இன்று நடைமுறைக்கு வரும் வாய்ப்புள்ளது. உங்களின் தன்னம்பிக்கை உயரும். சக பணியாளர்களுடன் இணைந்து ஒரு குழுவாக செயல்படும்போது, உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். கலைத்துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் கிடைக்கும். மாணவர்கள் தங்கள் படிப்பில் கூடுதல் கவனம் செலுத்தி, சிறப்பான முன்னேற்றத்தை அடைவார்கள். ஆசிரியர்களின் பாராட்டுகளைப் பெறுவார்கள். போட்டித் தேர்வுகளில் கலந்துகொள்பவர்கள் இன்று தங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்பைப் பெறுவார்கள். உங்களின் ஆழ்ந்த அறிவு, கடின உழைப்பு, மற்றும் விடாமுயற்சி ஆகியவை உங்களுக்கு வெற்றியைத் தேடித் தரும்.\n\nஉங்கள் வாழ்க்கைத் துணையுடன் இனிமையான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். அவர்களின் அன்பும் ஆதரவும் உங்களுக்கு மன அமைதியைத் தரும். திருமணமான தம்பதிகள் தங்கள் உறவை மேம்படுத்தும் வகையில் சிறப்பு நேரத்தை செலவிடுவார்கள். அன்பு இன்று மேலும் வலுப்பெறும். காதலர்களுக்கு இனிமையான அனுபவங்கள் ஏற்படும். அவர்கள் தங்கள் உறவை அடுத்த கட்டத்திற்கு எடுத்துச் செல்வது பற்றிச் சிந்திப்பார்கள். பெற்றோர்கள் தங்கள் குழந்தைகளின் எதிர்காலம் குறித்து ஆக்கபூர்வமான திட்டங்களை வகுப்பார்கள். குழந்தைகளின் திறமைகளை ஊக்குவிக்கும் விதமாக செயல்படுவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகள் இன்று அமையும். இதன் மூலம் உங்களின் நல்லெண்ணம் பரவும். உங்களின் தாராள குணம், மற்றவர்களுக்கு உதவும் மனப்பான்மை இன்று வெளிப்படும். நீங்கள் செய்யும் உதவிக்கு அங்கீகாரம் கிடைக்கும்.\n\nபுதிய திட்டங்களைத் தொடங்குவதற்கு இன்று மிகவும் பொருத்தமான நாள். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். நீண்டகால அடிப்படையில் லாபம் தரக்கூடிய முதலீடுகளைப் பற்றி நிபுணர்களுடன் ஆலோசிப்பீர்கள். உங்கள் உடல் ஆரோக்கியம் மேம்படும். உற்சாகத்துடன் அன்றாடப் பணிகளைச் செய்வீர்கள். யோகா மற்றும் தியானம் போன்ற பயிற்சிகளை மேற்கொள்வது உங்கள் மனதுக்கும் உடலுக்கும் புத்துணர்வை அளிக்கும். உங்கள் ஆன்மிக நாட்டங்கள் அதிகரிக்கும். இறை வழிபாட்டில் அதிக நேரம் செலவிடுவீர்கள். உங்களின் நேர்மறை எண்ணங்கள், உங்களைச் சுற்றியுள்ளவர்களுக்கும் பரவும். நேர்மறையான கண்ணோட்டத்துடன் செயல்பட்டு, அனைத்து சவால்களையும் வெற்றிகரமாக எதிர்கொள்வீர்கள். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் உங்கள் எதிர்காலத்திற்கு நன்மை பயப்பதாக இருக்கும். உங்கள் ஆற்றல் இன்று உச்சத்தில் இருக்கும். நீங்கள் செய்யும் அனைத்து செயல்களிலும் வெற்றி நிச்சயம். இன்று உங்களுக்கு புதிய உத்வேகமும், புதுமையான எண்ணங்களும் பிறக்கும். இவற்றை சரியாகப் பயன்படுத்தி உங்கள் வாழ்வை வளமாக்கிக் கொள்வீர்கள். இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி உறுதியுடன் பயணிப்பீர்கள். உங்கள் தன்னம்பிக்கையும் தைரியமும் இன்று உங்களுக்கு சிறந்த துணையாக இருக்கும். எதிர்பாராத பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும்.",
    "prediction_en": "For Pisces natives, today is Tuesday, and your day begins under the influence of Mars. With your natural compassion and creativity, added courage and efficiency will join today. This will help you realize your dreams. You will receive excellent energy today to courageously complete tasks you have long postponed. Your mental determination will provide the strength to overcome any obstacles. You will interact harmoniously with family members. If there are any minor disagreements among relatives, opportunities will arise for you to proactively resolve them.\n\nYour leadership qualities will shine today. You will take the lead in many matters and guide others. Your opinions will be valued. Journeys you undertake today will prove beneficial. Especially, decisions you make regarding land or property matters will be favorable. Ideas related to buying a new home or renovating an existing one may materialize today. Your self-confidence will rise. When working as a team with colleagues, your contribution will be significant. Innovative thoughts will guide you. Those in the arts will receive new opportunities. Students will pay extra attention to their studies and achieve excellent progress, earning praise from teachers. Those appearing for competitive exams will get a good opportunity to showcase their talents today. Your deep knowledge, hard work, and perseverance will bring you success.\n\nYou will share sweet moments with your life partner. Their love and support will bring you peace of mind. Married couples will spend quality time together to enhance their relationship. Love will grow stronger today. Lovers will have pleasant experiences and will think about taking their relationship to the next level. Parents will formulate constructive plans for their children's future and act in ways that encourage their children's talents. Opportunities for engaging in social service will arise today, through which your goodwill will spread. Your generous nature and willingness to help others will be evident today. Your assistance will be recognized.\n\nToday is a very suitable day to start new projects. You will consider new investments. You will consult experts about long-term profitable investments. Your physical health will improve. You will perform daily tasks with enthusiasm. Practicing yoga and meditation will refresh your mind and body. Your spiritual inclinations will increase, and you will spend more time in devotion. Your positive thoughts will spread to those around you. You will act with a positive outlook and successfully overcome all challenges. All decisions you make today will be beneficial for your future. Your energy will be at its peak today, and success is certain in all your endeavors. Today, new inspiration and innovative ideas will arise for you. By utilizing them correctly, you will enrich your life. Today, you will move steadfastly towards your goals. Your self-confidence and courage will be your best companions today. Unexpected praise and recognition await you.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் படைப்பாற்றல் பாராட்டப்படும். புதிய திட்டங்களை துணிச்சலுடன் முன்னின்று நடத்துவீர்கள். சக பணியாளர்களுடன் இணக்கமான உறவு நீடிக்கும். உங்கள் தலைமைப் பண்புகள் வெளிப்படும். உங்கள் திறமைகளும், அர்ப்பணிப்பும் உயரதிகாரிகளால் அங்கீகரிக்கப்படும். பதவி உயர்வுக்கான வாய்ப்புகள் பிரகாசமாக இருக்கும்.",
    "career_en": "Your creativity at the workplace will be appreciated. You will courageously lead new projects. Harmonious relationships with colleagues will continue. Your leadership qualities will shine. Your talents and dedication will be recognized by superiors. Opportunities for promotion will be bright.",
    "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். புதிய முதலீடுகளைப் பற்றி சிந்திப்பீர்கள். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதி தேவைகள் பூர்த்தி செய்யப்படும். சிறு அளவில் எதிர்பாராத லாபம் கிடைக்க வாய்ப்புள்ளது. நிதி திட்டமிடல் உங்களுக்கு நன்மை பயக்கும். தேவையில்லாத செலவுகளைக் கட்டுப்படுத்துவீர்கள்.",
    "finance_en": "The financial situation will be stable. You will consider new investments and focus on savings plans. Family financial needs will be met. There is a possibility of small unexpected profits. Financial planning will benefit you. You will control unnecessary expenses.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். மனதில் புதிய உற்சாகம் நிலவும். சரியான உணவுப் பழக்கங்களைப் பின்பற்றுவீர்கள். மன அழுத்தத்தைப் போக்க தியானம் செய்வது நன்மை பயக்கும். நடைப்பயிற்சி உங்கள் உடலுக்குப் புத்துணர்ச்சி அளிக்கும். சுறுசுறுப்புடன் செயல்படுவீர்கள்.",
    "health_en": "Physical health will improve. New enthusiasm will prevail in your mind. You will follow proper eating habits. Meditating to relieve stress will be beneficial. Walking will refresh your body. You will act actively.",
    "lucky_number": "7",
    "lucky_color_ta": "மெரூன்",
    "lucky_color_en": "Maroon"
  }
]
