[
  {
    "sign_ta": "மேஷம்",
    "sign_en": "Aries",
    "date": "11-02-2026",
    "prediction_ta": "இன்று புதன்கிழமை என்பதாலும், புதன் கிரகத்தின் ஆதிக்கம் நிறைந்த நாளாக இருப்பதாலும், மேஷ ராசிக்காரர்களுக்கு அறிவு மற்றும் தகவல் தொடர்பில் சிறந்த நாள். உங்களின் சிந்தனைத் தெளிவும், பேச்சாற்றலும் அபரிமிதமாக வெளிப்படும் ஒரு சிறப்புமிக்க நாளாக இது அமைகிறது. அறிவுசார்ந்த விஷயங்களில் ஈடுபடுவதற்கும், புதிய தகவல்களைக் கற்றுக்கொள்வதற்கும், உங்கள் எண்ணங்களை தெளிவாக எடுத்துரைப்பதற்கும் இது ஒரு பொன்னான வாய்ப்பை வழங்கும். நீங்கள் மேற்கொள்ளும் ஒவ்வொரு உரையாடலிலும் ஒரு புதிய கோணத்தையும், ஒரு புதிய புரிதலையும் பெறுவீர்கள். உங்கள் மனதில் தோன்றும் எண்ணங்கள் தெளிவாகவும், உறுதியாகவும் வெளிப்படும் என்பதால், எந்தவொரு காரியத்திலும் திட்டவட்டமான முன்னேற்றத்தைப் பார்க்க முடியும். புதிய திட்டங்களை வகுப்பதற்கும், அவற்றைச் செயல்படுத்துவதற்கும், உங்கள் அறிவாற்றலைப் பயன்படுத்துவதற்கும் இது ஒரு சிறப்பான நாள். சமுதாயத்தில் உங்களின் கருத்துகளுக்கு நல்ல மதிப்பும் மரியாதையும் கிடைக்கும். சமூக ஊடகங்களில் அல்லது பொதுவெளியில் உங்களின் கருத்துக்களைப் பகிர சிறந்த நேரமிது. குடும்ப உறவுகளிலும், நண்பர்களுடனும் திறந்த மனதுடன் பேசுவது நல்லிணக்கத்தை அதிகரிக்கும். நீண்ட நாட்களாகப் பேசாமல் இருந்த விஷயங்களைப் பற்றிப் பேசுவதற்கும், தவறான புரிதல்களைச் சரிசெய்வதற்கும் இது உகந்த நாள். சிறிய பயணங்கள் மேற்கொள்வதற்கு வாய்ப்புகள் உண்டு, அவை மனதிற்கு புத்துணர்ச்சியையும் புதிய அனுபவங்களையும் தரும். உங்கள் உடன் பிறந்தவர்களுடன் உறவுகளைப் பலப்படுத்திக் கொள்ள இது ஒரு நல்ல தருணம். அவர்களுடன் நல்ல புரிதலுடன் பழகுவது எதிர்காலத்திற்கு நன்மை பயக்கும். மனரீதியாக நீங்கள் மிகவும் சுறுசுறுப்பாகவும், புத்துணர்ச்சியுடனும் இருப்பீர்கள். புதிய புத்தகங்களைப் படிப்பதன் மூலமோ அல்லது புதிய கலைகளைக் கற்றுக்கொள்வதன் மூலமோ உங்கள் அறிவை வளர்த்துக் கொள்ளலாம். உங்கள் உடல் மற்றும் மனம் சீரான நிலையில் இருப்பதால், எதையும் எளிதில் எதிர்கொள்ளும் ஆற்றலைப் பெறுவீர்கள். ஆன்மீக நாட்டம் கொண்டவர்கள் புதிய ஞானத்தைப் பெறுவார்கள். பிறருக்கு அறிவுரை வழங்குவதிலும், வழி காட்டுவதிலும் நீங்கள் சிறந்து விளங்குவீர்கள். ஆனால், உங்கள் பேச்சில் மிதமும், தெளிவும் இருக்க வேண்டும். தேவையற்ற விவாதங்களைத் தவிர்த்து, ஆக்கபூர்வமான உரையாடல்களில் ஈடுபடுவது நல்லது. மாணவர்களுக்குக் கல்வி தொடர்பான முயற்சிகளில் வெற்றி கிடைக்கும். பரீட்சைகளில் நல்ல மதிப்பெண்கள் பெற வாய்ப்புண்டு. மொத்தத்தில், இது மனத்தெளிவையும், புதிய வாய்ப்புகளையும், ஆக்கபூர்வமான கருத்துப் பரிமாற்றங்களையும் வழங்கும் ஒரு நல்ல நாளாகும். உங்கள் புத்திசாலித்தனத்தை சரியான திசையில் பயன்படுத்தி முன்னேறுங்கள். காலையில் சிறிது நேரம் தியானம் செய்வது அல்லது மனதை ஒருமுகப்படுத்துவது நாள் முழுவதும் உங்களுக்கு நல்ல ஆற்றலைக் கொடுக்கும். புதிய சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். இந்த நாள் உங்களுக்கு மேலும் சிறப்படைய எனது வாழ்த்துகள்.",
    "prediction_en": "Today, being a Wednesday and a day influenced by the planet Mercury, is an excellent day for individuals born under the Aries sign in terms of intellect and communication. This day will prove to be very special, with your clarity of thought and eloquence shining brightly. It offers a golden opportunity to engage in intellectual pursuits, learn new information, and express your thoughts clearly. You will gain a new perspective and a deeper understanding in every conversation you undertake. As your thoughts will emerge clearly and decisively, you can expect definite progress in any endeavor. This is an opportune day for formulating new plans, implementing them, and utilizing your intellectual prowess. Your opinions will gain good respect and recognition in society. It is an excellent time to share your views on social media or in public forums. Open communication with family members and friends will enhance harmony. This day is suitable for discussing long-pending matters and rectifying misunderstandings. There may be opportunities for short journeys, which will bring mental rejuvenation and new experiences. This is a good time to strengthen relationships with your siblings. Interacting with them with good understanding will be beneficial for the future. Mentally, you will feel very active and refreshed. You can enhance your knowledge by reading new books or learning new arts. With your body and mind in a balanced state, you will gain the ability to face anything easily. Those with spiritual inclinations will acquire new wisdom. You will excel in offering advice and guidance to others. However, your speech should be moderate and clear. It is advisable to avoid unnecessary debates and engage in constructive conversations. Students will find success in their academic endeavors, with good chances of scoring well in examinations. Overall, this is a good day that offers mental clarity, new opportunities, and constructive exchange of ideas. Use your intelligence in the right direction to progress. Spending a short time in meditation or focusing your mind in the morning will provide you with good energy throughout the day. You will be ready to face new challenges. My best wishes for this day to be even more special for you.",
    "career_ta": "வேலை மற்றும் தொழில் ரீதியாக இன்று மிகவும் சிறப்பான நாள். புதிய திட்டங்களை முன்வைப்பதற்கும், கூட்டங்களில் உங்கள் கருத்துக்களைத் தெளிவாகப் பேசுவதற்கும் இது உகந்த நேரம். தகவல் தொடர்பு சார்ந்த பணிகள், எழுத்துப் பணிகள், கணக்கீடு மற்றும் பகுப்பாய்வு சார்ந்த துறைகளில் பணிபுரிபவர்களுக்கு முன்னேற்றம் உண்டு. புதிய ஒப்பந்தங்கள் கையெழுத்தாக வாய்ப்புள்ளது. சக ஊழியர்களுடன் நல்லுறவு மேலோங்கும். புதிய திறன் மேம்பாட்டு பயிற்சிகளில் ஈடுபட இது நல்ல நேரம். உங்கள் புத்திசாலித்தனத்தால் அலுவலகத்தில் நற்பெயர் பெறுவீர்கள்.",
    "career_en": "Professionally, today is an excellent day. It is an opportune time to propose new projects and articulate your ideas clearly in meetings. Those working in communication, writing, accounting, and analytical fields will see progress. There is a chance for new contracts to be signed. Good relationships with colleagues will prevail. This is a good time to engage in new skill development training. You will earn a good reputation in the office through your intelligence.",
    "finance_ta": "நிதிநிலைமை இன்று சாதகமாக இருக்கும். புத்திசாலித்தனமான முதலீட்டு முடிவுகளை எடுப்பதற்கும், நிதி ஆலோசகர்களுடன் கலந்துரையாடுவதற்கும் இது சிறந்த நாள். கடன் கொடுத்தவர்கள் பணத்தை திரும்பப் பெற வாய்ப்புள்ளது. திடீர் பணவரவுக்கு வாய்ப்புகள் உண்டு. ஆனால், எந்தவொரு பெரிய நிதி முடிவையும் அவசரப்படாமல், நன்கு ஆராய்ந்து எடுக்க வேண்டும். சிறு சிறு சேமிப்புகள் எதிர்காலத்திற்குப் பயன் தரும். தேவையில்லாத செலவுகளைக் கட்டுப்படுத்துவது அவசியம்.",
    "finance_en": "Financial conditions will be favorable today. It is an excellent day for making intelligent investment decisions and consulting with financial advisors. Those who have lent money may have opportunities to recover it. There are chances for sudden income. However, any major financial decision should be made after thorough research and without haste. Small savings will be beneficial for the future. It is essential to control unnecessary expenses.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனரீதியாக நீங்கள் மிகவும் சுறுசுறுப்பாகவும், புத்துணர்ச்சியுடனும் இருப்பதால், சிறிய அளவிலான உடற்பயிற்சிகளை மேற்கொள்வது நல்லது. புத்திசார்ந்த செயல்பாடுகளில் ஈடுபடுவது மனதை ஆரோக்கியமாக வைத்திருக்க உதவும். தியானம், யோகா போன்றவற்றை மேற்கொள்வது மன அமைதியைத் தரும். முறையான உணவுப் பழக்கத்தையும், போதுமான ஓய்வையும் கடைப்பிடிப்பது மிகவும் முக்கியம். எந்தவிதமான பெரிய உடல்நலக் குறைபாடுகளும் இருக்காது.",
    "health_en": "Physical health will be stable. As you are mentally very active and refreshed, it is good to engage in light exercises. Engaging in intellectual activities will help keep your mind healthy. Practicing meditation and yoga will bring mental peace. Adhering to proper eating habits and getting adequate rest is very important. There will be no major health ailments.",
    "lucky_number": "9",
    "lucky_color_ta": "சிகப்பு",
    "lucky_color_en": "Red"
  },
  {
    "sign_ta": "ரிஷபம்",
    "sign_en": "Taurus",
    "date": "11-02-2026",
    "prediction_ta": "ரிஷப ராசிக்காரர்களுக்கு இன்று புதன்கிழமை, புதனின் ஆதிக்கம் நிறைந்த இந்த நாளில், உங்கள் நிதிநிலை மற்றும் குடும்ப விஷயங்களில் புதிய சிந்தனைகள் உதயமாகும். உங்கள் மனதில் தோன்றும் நல்ல திட்டங்களைச் செயல்படுத்துவதற்கு ஏற்ற நாளாக இது அமையும். குடும்ப உறுப்பினர்களுடன் இணக்கமான உரையாடல்கள் மூலம் பழைய பிரச்சினைகளுக்குத் தீர்வு காணலாம். உங்களின் பேச்சுத்திறனும், இராஜதந்திர அணுகுமுறையும் இன்று உங்களுக்குப் பெரும் பலமாக அமையும். நீங்கள் பேசும் ஒவ்வொரு வார்த்தையும் மிகவும் கவனமாகப் பேசப்பட வேண்டும், ஏனெனில் அதன் மூலம் நல்ல விளைவுகளைப் பெற முடியும். திடீர் பணவரவுக்கான வாய்ப்புகள் உருவாகலாம், ஆனால் அதை நிர்வகிப்பதில் தெளிவான அணுகுமுறை தேவை. புதிய முதலீடுகள் அல்லது சேமிப்பு திட்டங்கள் குறித்து இன்று ஆழமாகச் சிந்திப்பது நல்லது. நீண்ட கால நோக்கங்களுக்காகச் செய்யப்படும் நிதித் திட்டமிடல்கள் இன்று வலுப்பெறும். சுவையான உணவை குடும்பத்துடன் உண்டு மகிழ்வீர்கள். வீட்டிற்குத் தேவையான பொருட்களை வாங்குவதற்கும், வீட்டில் சில மாற்றங்களைச் செய்வதற்கும் இது உகந்த நாளாகும். உங்கள் உடன் பிறந்தவர்கள் அல்லது நெருங்கிய உறவினர்களுடன் தகவல் பரிமாற்றம் அதிகரிக்கும். அவர்களுடன் நல்ல புரிதலுடன் பழகுவது, உறவுகளை மேலும் வலுப்படுத்தும். கலை மற்றும் அழகு சார்ந்த விஷயங்களில் இன்று உங்களுக்கு ஆர்வம் அதிகரிக்கும். வீட்டில் புதிய கலைப்பொருட்களைச் சேர்ப்பது அல்லது வீட்டிற்குப் புத்துணர்ச்சி அளிக்கும் அலங்காரங்களைச் செய்வது குறித்து சிந்திப்பீர்கள். மன அமைதியையும், உள் திருப்தியையும் உணர்வீர்கள். உங்கள் உள்ளுணர்வு இன்று மிகவும் கூர்மையாக இருக்கும், முக்கியமான முடிவுகளை எடுப்பதில் உங்களுக்கு வழிகாட்டும். எந்தவொரு விஷயத்திலும் அவசரப்படாமல், நிதானமாகச் செயல்படுவது வெற்றியைத் தரும். உங்கள் உடல் மற்றும் மன ஆரோக்கியத்திற்கு முக்கியத்துவம் கொடுங்கள். தியானம் அல்லது இயற்கை சூழலில் நேரம் செலவிடுவது மனதை அமைதிப்படுத்தும். மாணவர்களுக்குக் கல்வி தொடர்பான ஆராய்ச்சிகளில் ஆர்வம் அதிகரிக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், நூலகங்களில் நேரம் செலவிடுவதற்கும் இது நல்ல நாள். சமுதாயத்தில் உங்களின் பங்களிப்பு நல்ல அங்கீகாரத்தைப் பெறும். புதிய நண்பர்களை உருவாக்குவதற்கும், பழைய நண்பர்களைச் சந்திப்பதற்கும் வாய்ப்புகள் உண்டு. மொத்தத்தில், இது உங்களுக்குச் சிந்தனைத் தெளிவையும், நிதி முன்னேற்றத்திற்கான வாய்ப்புகளையும், குடும்ப நல்லிணக்கத்தையும் வழங்கும் ஒரு சிறப்பான நாளாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு சிறப்பான பலன்களைப் பெறுங்கள்.",
    "prediction_en": "For Taurus individuals, today, being a Wednesday and a day rich with Mercury's influence, new thoughts will emerge regarding your financial situation and family matters. This day will be suitable for implementing the good plans that come to your mind. Through harmonious conversations with family members, old issues can be resolved. Your eloquence and diplomatic approach will be a great strength for you today. Every word you speak should be uttered very carefully, as you can achieve good results through it. Opportunities for sudden income may arise, but a clear approach is needed in managing it. It is good to deeply contemplate new investments or savings plans today. Long-term financial planning done with foresight will be strengthened today. You will enjoy delicious food with your family. This is an opportune day for purchasing household items and making some changes at home. Communication with your siblings or close relatives will increase. Interacting with them with good understanding will further strengthen relationships. Your interest in art and beauty-related matters will increase today. You will think about adding new art pieces to your home or making decorations that bring freshness to your house. You will feel mental peace and inner satisfaction. Your intuition will be very sharp today, guiding you in making important decisions. Acting calmly and patiently in any matter, without haste, will bring success. Give importance to your physical and mental health. Practicing meditation or spending time in nature will calm your mind. For students, interest in academic research will increase. This is a good day for learning new things and spending time in libraries. Your contribution to society will receive good recognition. There will be opportunities to make new friends and meet old ones. Overall, this is an excellent day that offers clarity of thought, opportunities for financial progress, and family harmony. Act with positive thoughts and achieve excellent results.",
    "career_ta": "தொழில்ரீதியாக இன்று சுறுசுறுப்பாக செயல்படுவீர்கள். பணப்புழக்கம் மற்றும் நிர்வாகம் தொடர்பான துறைகளில் நல்ல முன்னேற்றம் காணலாம். உங்கள் திட்டமிடும் திறன் மற்றும் பகுப்பாய்வு திறன்கள் அலுவலகத்தில் பாராட்டப்படும். புதிய பொறுப்புகள் அல்லது திட்டங்கள் உங்களைத் தேடி வரும். சக ஊழியர்களுடன் நல்லிணக்கம் அதிகரிக்கும். பேச்சுவார்த்தைகள் மற்றும் ஒப்பந்தங்களில் வெற்றி கிடைக்கும். புதிய வணிக வாய்ப்புகளை ஆராய இது உகந்த நேரம்.",
    "career_en": "Professionally, you will be active today. You can see good progress in fields related to cash flow and administration. Your planning and analytical skills will be appreciated in the office. New responsibilities or projects will come your way. Harmony with colleagues will increase. You will achieve success in negotiations and agreements. This is a suitable time to explore new business opportunities.",
    "finance_ta": "நிதிநிலைமை இன்று மிகவும் வலுப்பெறும். புதிய முதலீடுகள் குறித்து நன்கு ஆராய்ந்து முடிவெடுக்கலாம். சேமிப்பு திட்டங்களில் கவனம் செலுத்த இது ஒரு நல்ல நாள். எதிர்பாராத ஆதாயங்கள் அல்லது பரிசுகள் கிடைக்க வாய்ப்புள்ளது. நிலுவையில் உள்ள பாக்கிகளை வசூலிக்க இது உகந்த நேரம். வரவு செலவு கணக்குகளைத் தெளிவாகப் பராமரிப்பது எதிர்காலத்திற்குப் பயன் தரும். புத்திசாலித்தனமான நிதி முடிவுகள் நீண்டகால ஸ்திரத்தன்மைக்கு வழிவகுக்கும்.",
    "finance_en": "Financial conditions will strengthen considerably today. You can make well-researched decisions regarding new investments. This is a good day to focus on savings plans. There is a possibility of unexpected gains or gifts. This is an opportune time to collect outstanding dues. Maintaining clear income and expenditure accounts will be beneficial for the future. Intelligent financial decisions will lead to long-term stability.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். இருப்பினும், மன அழுத்தத்தைத் தவிர்க்க, போதிய ஓய்வும் மன அமைதியும் தேவை. தியானம், யோகா மற்றும் இயற்கையான உணவுகள் மூலம் உடலை வலுப்படுத்திக் கொள்ளலாம். கலை மற்றும் பொழுதுபோக்கு சார்ந்த விஷயங்களில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி அளிக்கும். நடைப்பயிற்சி அல்லது மிதமான உடற்பயிற்சிகளை மேற்கொள்வது உங்களை நாள் முழுவதும் சுறுசுறுப்பாக வைத்திருக்கும். குடும்பத்துடன் நேரம் செலவிடுவது மனதிற்கு மகிழ்ச்சி தரும்.",
    "health_en": "Physical health will be excellent. However, to avoid stress, adequate rest and mental peace are necessary. You can strengthen your body through meditation, yoga, and natural foods. Engaging in arts and hobbies will rejuvenate your mind. Walking or moderate exercises will keep you active throughout the day. Spending time with family will bring joy to your mind.",
    "lucky_number": "6",
    "lucky_color_ta": "வெள்ளை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "மிதுனம்",
    "sign_en": "Gemini",
    "date": "11-02-2026",
    "prediction_ta": "மிதுன ராசிக்காரர்களுக்கு இன்று புதன்கிழமை, உங்களின் ஆளும் கிரகமான புதனின் ஆதிக்கம் நிறைந்த நாள் என்பதால், உங்களின் அனைத்து செயல்பாடுகளிலும் ஒரு தெளிவும், சுறுசுறுப்பும் மேலோங்கும். புதிய சிந்தனைகளும், புதிய கருத்துக்களும் உங்கள் மனதில் புத்துணர்ச்சியுடன் தோன்றும். அவற்றை மற்றவர்களுடன் பகிர்ந்து கொள்வதன் மூலம், சிறந்த பாராட்டுகளையும், நல்ல ஆலோசனைகளையும் பெறுவீர்கள். பேச்சுவார்த்தைகள், விவாதங்கள் மற்றும் அறிவுசார்ந்த பரிமாற்றங்களுக்கு இது ஒரு சிறந்த நாள். உங்கள் மனதில் உள்ள திட்டங்களை வெளிப்படையாகப் பேசுவதன் மூலம், அவை வெற்றிகரமாகச் செயல்பட வாய்ப்புகள் உருவாகும். நீங்கள் சமூக வலைத்தளங்களில் அல்லது பொதுவெளியில் உங்கள் கருத்துக்களைப் பகிர விரும்பினால், அதற்கான சிறந்த நேரம் இது. புதிய தகவல்களைக் கற்றுக்கொள்வதற்கும், புதிய கலைகளைப் பயில்வதற்கும் இது உகந்த நாள். குறுகிய பயணங்கள் மேற்கொள்வதற்கு வாய்ப்புகள் உண்டு, அத்தகைய பயணங்கள் மனதிற்கு புத்துணர்ச்சியையும் புதிய அனுபவங்களையும் தரும். உங்கள் உடன் பிறந்தவர்களுடன் உறவுகளைப் பலப்படுத்திக் கொள்ள இது ஒரு நல்ல தருணம். அவர்களுடன் நல்ல புரிதலுடன் பழகுவது எதிர்காலத்திற்கு நன்மை பயக்கும். கல்வி மற்றும் ஆராய்ச்சித் துறைகளில் உள்ளவர்களுக்கு இன்று மிகவும் சாதகமான நாள். நீங்கள் ஒரு புதிய மொழியைக் கற்கத் தொடங்கலாம் அல்லது ஒரு புதிய பாடப்பிரிவில் சேரலாம். வியாபாரம் செய்பவர்களுக்கு புதிய வாடிக்கையாளர்கள் கிடைப்பார்கள், அல்லது புதிய ஒப்பந்தங்கள் கையெழுத்தாகும். உங்கள் புத்திசாலித்தனமும், விரைவான முடிவெடுக்கும் திறனும் இன்று உங்களுக்குப் பெரிய அளவில் கை கொடுக்கும். மனரீதியாக நீங்கள் மிகவும் உற்சாகமாகவும், ஆற்றலுடனும் இருப்பீர்கள். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொள்ளும் தைரியம் உங்களிடம் இருக்கும். ஆன்மீக நாட்டம் கொண்டவர்கள் புதிய ஞானத்தைப் பெறுவார்கள். பிறருக்கு அறிவுரை வழங்குவதிலும், வழி காட்டுவதிலும் நீங்கள் சிறந்து விளங்குவீர்கள். ஆனால், உங்கள் பேச்சில் மிதமும், தெளிவும் இருக்க வேண்டும். தேவையற்ற விவாதங்களைத் தவிர்த்து, ஆக்கபூர்வமான உரையாடல்களில் ஈடுபடுவது நல்லது. குடும்பத்தில் மகிழ்ச்சியும், அமைதியும் நிலவும். உறவினர்களுடன் நல்லுறவு அதிகரிக்கும். மொத்தத்தில், இன்று உங்களின் அறிவாற்றலையும், தகவல் தொடர்பு திறன்களையும் முழுமையாகப் பயன்படுத்தி முன்னேறக்கூடிய ஒரு அருமையான நாளாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு சிறப்பான பலன்களைப் பெறுங்கள்.",
    "prediction_en": "For Gemini individuals, today, being a Wednesday and a day dominated by Mercury, your ruling planet, clarity and agility will prevail in all your activities. New thoughts and fresh ideas will emerge in your mind with renewed vigor. By sharing them with others, you will receive excellent praise and good advice. This is an excellent day for discussions, debates, and intellectual exchanges. By openly expressing your plans, opportunities will arise for their successful implementation. If you wish to share your views on social media or in public, this is the best time for it. This day is suitable for learning new information and acquiring new arts. There are possibilities for short journeys, which will bring mental rejuvenation and new experiences. This is a good moment to strengthen relationships with your siblings. Interacting with them with good understanding will be beneficial for the future. Today is a very favorable day for those in education and research fields. You might start learning a new language or enroll in a new course. Business people will gain new customers, or new contracts will be signed. Your intelligence and quick decision-making ability will greatly assist you today. Mentally, you will be very enthusiastic and energetic. You will have the courage to face any challenge with confidence. Those with spiritual inclinations will acquire new wisdom. You will excel in offering advice and guidance to others. However, your speech should be moderate and clear. It is advisable to avoid unnecessary debates and engage in constructive conversations. Happiness and peace will prevail in the family. Relationships with relatives will improve. Overall, today is a wonderful day where you can fully utilize your intellect and communication skills to progress. Act with positive thoughts and achieve excellent results.",
    "career_ta": "வேலை மற்றும் தொழில் ரீதியாக இன்று மிகவும் சுறுசுறுப்பான நாள். நீங்கள் ஒரு குழுவின் தலைவராக இருந்தால், உங்கள் கீழ் உள்ளவர்களை வழிநடத்துவதிலும், அவர்களிடம் இருந்து சிறந்த செயல்திறனைப் பெறுவதிலும் சிறந்து விளங்குவீர்கள். புதிய திட்டங்களைச் செயல்படுத்துவதற்கும், மேலதிகாரிகளுடன் பேசுவதற்கும் இது உகந்த நேரம். எழுத்து, ஊடகம், கல்வி மற்றும் விற்பனை துறைகளில் பணிபுரிபவர்களுக்கு நல்ல முன்னேற்றம் உண்டு. உங்கள் படைப்புத் திறனும், புதுமையான சிந்தனைகளும் பாராட்டப்படும். வெளிநாட்டு தொடர்புகள் ஆதாயம் தரும்.",
    "career_en": "Professionally, today is a very active day. If you are a team leader, you will excel in guiding your subordinates and extracting the best performance from them. This is an opportune time to implement new projects and communicate with superiors. Those working in writing, media, education, and sales fields will see good progress. Your creativity and innovative ideas will be appreciated. Foreign contacts will bring benefits.",
    "finance_ta": "நிதிநிலைமை இன்று சாதகமாக இருக்கும். உங்கள் வருவாயைப் பெருக்கும் புதிய வழிகளைப் பற்றிச் சிந்திப்பீர்கள். புத்திசாலித்தனமான நிதி முடிவுகள் மற்றும் முதலீடுகள் நீண்ட கால ஆதாயங்களைத் தரக்கூடும். வரவு செலவு கணக்குகளைச் சீராகப் பராமரிப்பதன் மூலம் தேவையற்ற செலவுகளைக் கட்டுப்படுத்தலாம். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவது நல்லது. சிறிய அளவிலான லாபகரமான முதலீடுகளுக்கு இது உகந்த நாள். நிதி ஆலோசகர்களின் ஆலோசனையைப் பெறுவது பயன் தரும்.",
    "finance_en": "Financial conditions will be favorable today. You will think about new ways to increase your income. Intelligent financial decisions and investments could yield long-term gains. By maintaining proper income and expenditure accounts, you can control unnecessary expenses. It is good to focus on savings plans. This is a suitable day for small, profitable investments. Seeking advice from financial advisors will be beneficial.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனரீதியாக நீங்கள் மிகவும் சுறுசுறுப்பாகவும், உற்சாகமாகவும் இருப்பதால், அது உங்கள் உடல் நலனையும் மேம்படுத்தும். புத்திசார்ந்த செயல்பாடுகளில் ஈடுபடுவது மனதை ஆரோக்கியமாக வைத்திருக்க உதவும். போதுமான தூக்கம் மற்றும் சத்தான உணவு உங்கள் ஆற்றல் மட்டத்தை அதிகரிக்கும். நண்பர்களுடன் வெளியே சென்று வருவது மனதிற்கு புத்துணர்ச்சி அளிக்கும். சுவாசப் பயிற்சி மற்றும் நடைப்பயிற்சி மேற்கொள்வது நல்லது.",
    "health_en": "Physical health will be stable. As you are mentally very active and enthusiastic, it will also enhance your physical well-being. Engaging in intellectual activities will help keep your mind healthy. Adequate sleep and nutritious food will boost your energy levels. Going out with friends will refresh your mind. Practicing breathing exercises and walking is beneficial.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "11-02-2026",
    "prediction_ta": "கடக ராசிக்காரர்களுக்கு இன்று புதன்கிழமை, புதனின் செல்வாக்கு காரணமாக, உள் மனச் சிந்தனைகளும், மறைந்திருக்கும் திறமைகளும் வெளிப்படும் நாள். உங்களின் உள்ளுணர்வு இன்று மிகவும் கூர்மையாக இருக்கும், முக்கியமான முடிவுகளை எடுப்பதில் உங்களுக்கு வழிகாட்டும். உங்கள் மனதிற்குள் பல புதிய யோசனைகள் தோன்றும், அவற்றைச் சிந்திப்பதற்கும், ஆராய்வதற்கும் இது உகந்த நாள். பிறருடன் பேசும்போது மிகவும் கவனமாக இருக்க வேண்டும், ஏனெனில் உங்கள் வார்த்தைகள் ஆழமான தாக்கத்தை ஏற்படுத்தக்கூடும். இரகசியமான விஷயங்களைப் பற்றிப் பேசுவதற்கும், மனதின் ஆழத்தில் உள்ள எண்ணங்களைப் பகிர்ந்து கொள்வதற்கும் இது ஒரு நல்ல நாள். ஆன்மீக மற்றும் தத்துவ ரீதியான விஷயங்களில் உங்கள் ஆர்வம் அதிகரிக்கும். புதிய புத்தகங்களைப் படிப்பதன் மூலமோ அல்லது தியானம் செய்வதன் மூலமோ உங்கள் அறிவை வளர்த்துக் கொள்ளலாம். உங்கள் உடல் மற்றும் மன ஆரோக்கியத்திற்கு முக்கியத்துவம் கொடுங்கள். தியானம் அல்லது இயற்கை சூழலில் நேரம் செலவிடுவது மனதை அமைதிப்படுத்தும். கடந்த கால நிகழ்வுகளைப் பற்றிச் சிந்திப்பதற்கும், அதிலிருந்து கற்றுக்கொள்வதற்கும் இது ஒரு நல்ல தருணம். உங்களின் கடந்த கால அனுபவங்கள் இன்று உங்களுக்கு வழிகாட்டும். சில நேரங்களில் தனிமையில் நேரம் செலவிடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். ஆனால், தனிமையில் மூழ்கிவிடாமல், ஆக்கபூர்வமான விஷயங்களில் ஈடுபட வேண்டும். மற்றவர்களுக்கு உதவுவதிலும், ஆலோசனை வழங்குவதிலும் நீங்கள் சிறந்து விளங்குவீர்கள். உங்கள் மனதில் உள்ள விஷயங்களை எழுத்து வடிவில் வெளிப்படுத்துவது நல்ல பலனைத் தரும். கவிதை எழுதுவது, நாட்குறிப்பு எழுதுவது அல்லது ஒரு ஆய்வுக் கட்டுரை எழுதுவது போன்ற விஷயங்களில் ஈடுபடலாம். தொலைதூர தொடர்புகள் அல்லது வெளிநாட்டு தொடர்புகள் மூலம் நல்ல செய்திகள் வரலாம். பயணம் செய்ய வாய்ப்புகள் உருவாகலாம், குறிப்பாக அறிவுசார்ந்த பயணங்கள் அல்லது ஆன்மீகப் பயணங்கள். எந்தவொரு விஷயத்திலும் அவசரப்படாமல், நிதானமாகச் செயல்படுவது வெற்றியைத் தரும். உங்கள் புத்திசாலித்தனத்தையும், உள்ளுணர்வையும் பயன்படுத்தி சரியான முடிவுகளை எடுப்பீர்கள். குடும்ப உறுப்பினர்களுடன் ஆழமான உரையாடல்கள் நல்லுறவை மேம்படுத்தும். மொத்தத்தில், இன்று உங்களுக்கு மனத்தெளிவையும், ஆழமான சிந்தனைகளையும், ஆக்கபூர்வமான கருத்துப் பரிமாற்றங்களையும் வழங்கும் ஒரு சிறப்பான நாளாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு சிறப்பான பலன்களைப் பெறுங்கள்.",
    "prediction_en": "For Cancer individuals, today, being a Wednesday, influenced by Mercury, is a day when inner thoughts and hidden talents will emerge. Your intuition will be very sharp today, guiding you in making important decisions. Many new ideas will arise in your mind, and this is a suitable day for contemplating and exploring them. You should be very careful when speaking with others, as your words can have a profound impact. This is a good day for discussing confidential matters and sharing thoughts from the depths of your mind. Your interest in spiritual and philosophical matters will increase. You can enhance your knowledge by reading new books or practicing meditation. Give importance to your physical and mental health. Practicing meditation or spending time in nature will calm your mind. This is a good moment to reflect on past events and learn from them. Your past experiences will guide you today. Sometimes spending time alone will rejuvenate you. However, you should not get lost in solitude but engage in constructive activities. You will excel in helping and advising others. Expressing your thoughts in writing will yield good results. You can engage in activities such as writing poetry, journaling, or writing a research paper. Good news may come through distant contacts or foreign connections. Opportunities for travel may arise, especially intellectual or spiritual journeys. In any matter, acting calmly and patiently, without haste, will bring success. You will make the right decisions using your intelligence and intuition. Deep conversations with family members will improve relationships. Overall, today is an excellent day that offers you mental clarity, deep thoughts, and constructive exchange of ideas. Act with positive thoughts and achieve excellent results.",
    "career_ta": "வேலை மற்றும் தொழில் ரீதியாக இன்று உங்கள் பகுப்பாய்வு திறன்கள் மேம்படும். ஆராய்ச்சி, எழுத்து மற்றும் கல்வித் துறைகளில் பணிபுரிபவர்களுக்கு நல்ல முன்னேற்றம் உண்டு. இரகசியமான திட்டங்களில் வெற்றி காணலாம். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்திக் கொள்வதற்கும் இது ஒரு நல்ல நாள். மேலதிகாரிகளுடன் பேசுவதற்கு முன்னர் உங்கள் கருத்துக்களை நன்கு தயார் செய்து கொள்வது அவசியம். வெளிநாட்டுத் தொடர்புகள் மூலம் வேலை வாய்ப்புகள் உருவாகலாம்.",
    "career_en": "Professionally, your analytical skills will improve today. Those working in research, writing, and education fields will see good progress. You may succeed in confidential projects. This is a good day to learn new things and enhance your knowledge. It is essential to prepare your ideas well before speaking with superiors. Job opportunities may arise through foreign contacts.",
    "finance_ta": "நிதிநிலைமை இன்று சீராக இருக்கும். எதிர்பாராத செலவுகளைக் கட்டுப்படுத்த திட்டமிடுதல் அவசியம். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவது எதிர்காலத்திற்குப் பயன் தரும். வங்கிக்கடன்கள் அல்லது நிதி உதவி தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் காணலாம். முதலீடுகள் குறித்து நன்கு ஆராய்ந்து முடிவெடுப்பது நல்லது. மற்றவர்களுடன் நிதி விஷயங்களைப் பற்றி வெளிப்படையாகப் பேசுவதைத் தவிர்க்கவும். புத்திசாலித்தனமான முடிவுகள் நிதி ஸ்திரத்தன்மைக்கு வழிவகுக்கும்.",
    "finance_en": "Financial conditions will be stable today. Planning is essential to control unexpected expenses. Focusing on savings plans will be beneficial for the future. You may see good progress in matters related to bank loans or financial assistance. It is good to make well-researched decisions regarding investments. Avoid openly discussing financial matters with others. Intelligent decisions will lead to financial stability.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். இருப்பினும், மன அழுத்தத்தைக் குறைப்பதில் கவனம் செலுத்த வேண்டும். தியானம், யோகா மற்றும் ஆழமான சுவாசப் பயிற்சிகள் மனதை அமைதிப்படுத்தும். முறையான உணவுப் பழக்கம் மற்றும் போதுமான ஓய்வு மிகவும் அவசியம். இயற்கையான சூழலில் சிறிது நேரம் செலவிடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். மனதை ஒருமுகப்படுத்தும் விளையாட்டுகளில் ஈடுபடுவது நல்லது.",
    "health_en": "Physical health will be excellent. However, you should focus on reducing stress. Meditation, yoga, and deep breathing exercises will calm the mind. Proper eating habits and adequate rest are very important. Spending some time in a natural environment will rejuvenate you. Engaging in mind-focusing games is beneficial.",
    "lucky_number": "2",
    "lucky_color_ta": "வெள்ளி",
    "lucky_color_en": "Silver"
  },
  {
    "sign_ta": "சிம்மம்",
    "sign_en": "Leo",
    "date": "11-02-2026",
    "prediction_ta": "சிம்ம ராசிக்காரர்களுக்கு இன்று புதன்கிழமை, புதன் கிரகத்தின் ஆதிக்கம் நிறைந்த இந்த நாளில், சமூக உறவுகள், நண்பர்கள் மற்றும் கூட்டு முயற்சிகளில் சிறப்பான முன்னேற்றம் காணலாம். உங்கள் தகவல் தொடர்பு திறன்கள் இன்று பிரகாசமாக வெளிப்படும், இதன் மூலம் புதிய நண்பர்களை உருவாக்குவதற்கும், பழைய நண்பர்களுடன் நல்லுறவைப் புதுப்பிப்பதற்கும் இது ஒரு சிறந்த நாள். குழுப்பணிகளில் ஈடுபடுவதற்கும், புதிய திட்டங்களை வகுப்பதற்கும் இது உகந்த நேரமாகும். உங்களின் தலைமைப் பண்பு இன்று சிறப்பாக வெளிப்படும், குழுவை வழிநடத்தி வெற்றியை நோக்கிச் செல்வீர்கள். சமூக வலைத்தளங்களில் அல்லது பொது மேடைகளில் உங்கள் கருத்துக்களைப் பகிர இது ஒரு நல்ல வாய்ப்பு. உங்கள் கருத்துக்களுக்கு நல்ல மதிப்பும் மரியாதையும் கிடைக்கும். புதிய கூட்டாண்மைகள் அல்லது வியாபார ஒப்பந்தங்கள் உருவாக வாய்ப்புகள் உண்டு. சக ஊழியர்களுடன் அல்லது வியாபார கூட்டாளிகளுடன் நல்லிணக்கத்துடன் செயல்படுவது வெற்றியைத் தரும். நண்பர்களின் ஆதரவும் ஒத்துழைப்பும் இன்று உங்களுக்குப் பெரிய பலமாக அமையும். அவர்களுடன் ஆழமான உரையாடல்கள் மூலம் புதிய யோசனைகளையும், தீர்வுகளையும் பெறலாம். நீண்ட நாட்களாக நிறைவேறாமல் இருந்த ஆசைகள் அல்லது இலக்குகளை நோக்கிச் செயல்பட இது ஒரு நல்ல நாள். உங்கள் திட்டமிடல் திறனும், புத்திசாலித்தனமும் இன்று உங்களுக்கு வெற்றியைத் தரும். சமூக நிகழ்வுகளில் கலந்து கொள்வதன் மூலம் புதிய தொடர்புகளை ஏற்படுத்திக் கொள்ளலாம், அவை எதிர்காலத்திற்குப் பயன் தரும். மாணவர்களுக்குக் குழுப்பணி மற்றும் கல்வி சார்ந்த விவாதங்களில் நல்ல முன்னேற்றம் காணலாம். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், ஆராய்ச்சிகளில் ஈடுபடுவதற்கும் இது உகந்த நேரம். உங்கள் பேச்சில் மிதமும், தெளிவும் இருக்க வேண்டும். தேவையற்ற விவாதங்களைத் தவிர்த்து, ஆக்கபூர்வமான உரையாடல்களில் ஈடுபடுவது நல்லது. மனரீதியாக நீங்கள் மிகவும் சுறுசுறுப்பாகவும், உற்சாகமாகவும் இருப்பீர்கள். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொள்ளும் தைரியம் உங்களிடம் இருக்கும். ஆன்மீக நாட்டம் கொண்டவர்கள் புதிய ஞானத்தைப் பெறுவார்கள். பிறருக்கு அறிவுரை வழங்குவதிலும், வழி காட்டுவதிலும் நீங்கள் சிறந்து விளங்குவீர்கள். மொத்தத்தில், இன்று உங்களின் அறிவாற்றலையும், தகவல் தொடர்பு திறன்களையும் முழுமையாகப் பயன்படுத்தி முன்னேறக்கூடிய ஒரு அருமையான நாளாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு சிறப்பான பலன்களைப் பெறுங்கள்.",
    "prediction_en": "For Leo individuals, today, being a Wednesday, influenced by the planet Mercury, is a day when you can see excellent progress in social relationships, friendships, and collaborative efforts. Your communication skills will shine brightly today, making it an excellent day for forming new friendships and renewing old ones. This is an opportune time to engage in teamwork and formulate new plans. Your leadership qualities will manifest prominently today, and you will lead your team towards success. This is a good opportunity to share your views on social media or public platforms. Your opinions will receive good respect and recognition. Opportunities for new partnerships or business agreements may arise. Working in harmony with colleagues or business partners will bring success. The support and cooperation of friends will be a great strength for you today. Through deep conversations with them, you can gain new ideas and solutions. This is a good day to work towards long-pending desires or goals. Your planning skills and intelligence will bring you success today. By participating in social events, you can establish new contacts that will be beneficial for the future. Students will see good progress in teamwork and academic discussions. This is a suitable time for learning new things and engaging in research. Your speech should be moderate and clear. It is advisable to avoid unnecessary debates and engage in constructive conversations. Mentally, you will be very active and enthusiastic. You will have the courage to face any challenge with confidence. Those with spiritual inclinations will acquire new wisdom. You will excel in offering advice and guidance to others. Overall, today is a wonderful day where you can fully utilize your intellect and communication skills to progress. Act with positive thoughts and achieve excellent results.",
    "career_ta": "தொழில்ரீதியாக இன்று குழுப்பணிகளில் சிறந்து விளங்குவீர்கள். புதிய திட்டங்களைச் செயல்படுத்துவதற்கும், சக ஊழியர்களுடன் நல்லுறவை மேம்படுத்துவதற்கும் இது உகந்த நாள். மேலதிகாரிகளுடன் பேசுவதற்கு நல்ல நேரம். மார்க்கெட்டிங், விற்பனை மற்றும் மக்கள் தொடர்பு துறைகளில் பணிபுரிபவர்களுக்கு நல்ல முன்னேற்றம் உண்டு. உங்கள் புத்திசாலித்தனமும், விரைவான முடிவெடுக்கும் திறனும் அலுவலகத்தில் பாராட்டப்படும். புதிய ஒப்பந்தங்கள் கையெழுத்தாக வாய்ப்புகள் உண்டு. வெளிநாட்டு வணிக தொடர்புகள் ஆதாயம் தரும்.",
    "career_en": "Professionally, you will excel in teamwork today. This is an opportune day for implementing new projects and improving relationships with colleagues. It's a good time to speak with superiors. Those working in marketing, sales, and public relations fields will see good progress. Your intelligence and quick decision-making abilities will be appreciated in the office. There are chances for new contracts to be signed. Foreign business contacts will bring benefits.",
    "finance_ta": "நிதிநிலைமை இன்று சீராகவும், வலுவாகவும் இருக்கும். புதிய முதலீடுகள் குறித்து நண்பர்களுடன் அல்லது நிதி ஆலோசகர்களுடன் கலந்துரையாடலாம். எதிர்பாராத வகையில் புதிய வருவாய் ஆதாரங்கள் உருவாக வாய்ப்புள்ளது. நிலுவையில் உள்ள பாக்கிகளை வசூலிக்க இது உகந்த நேரம். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவது எதிர்காலத்திற்குப் பயன் தரும். வரவு செலவு கணக்குகளைச் சீராகப் பராமரிப்பதன் மூலம் தேவையற்ற செலவுகளைக் கட்டுப்படுத்தலாம். புத்திசாலித்தனமான முடிவுகள் நிதி ஸ்திரத்தன்மைக்கு வழிவகுக்கும்.",
    "finance_en": "Financial conditions will be stable and strong today. You can discuss new investments with friends or financial advisors. There is a possibility of new income sources arising unexpectedly. This is an opportune time to collect outstanding dues. Focusing on savings plans will be beneficial for the future. By maintaining proper income and expenditure accounts, you can control unnecessary expenses. Intelligent decisions will lead to financial stability.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மனரீதியாக நீங்கள் மிகவும் உற்சாகமாகவும், ஆற்றலுடனும் இருப்பதால், அது உங்கள் உடல் நலனையும் மேம்படுத்தும். சமூக நிகழ்வுகளில் கலந்து கொள்வது மனதிற்கு மகிழ்ச்சி தரும். சிரிப்பு யோகா அல்லது குழு சார்ந்த உடற்பயிற்சிகளை மேற்கொள்வது நல்லது. முறையான உணவுப் பழக்கம் மற்றும் போதுமான ஓய்வு உங்கள் ஆற்றல் மட்டத்தை அதிகரிக்கும். வெளி இடங்களுக்குச் சென்று வருவது புத்துணர்ச்சி அளிக்கும்.",
    "health_en": "Physical health will be excellent. As you are mentally very enthusiastic and energetic, it will also enhance your physical well-being. Participating in social events will bring joy to your mind. Practicing laughter yoga or group exercises is beneficial. Proper eating habits and adequate rest will boost your energy levels. Going out to different places will refresh you.",
    "lucky_number": "1",
    "lucky_color_ta": "ஆரஞ்சு",
    "lucky_color_en": "Orange"
  },
  {
    "sign_ta": "கன்னி",
    "sign_en": "Virgo",
    "date": "11-02-2026",
    "prediction_ta": "கன்னி ராசிக்காரர்களுக்கு இன்று புதன்கிழமை, உங்களின் ஆளும் கிரகமான புதனின் முழு ஆதிக்கமும் நிறைந்த நாள் என்பதால், உங்களின் தொழில், சமூக அந்தஸ்து மற்றும் பொது வாழ்வு ஆகியவற்றில் சிறப்பான முன்னேற்றம் காணலாம். உங்களின் சிந்தனைத் தெளிவும், பகுப்பாய்வு திறனும் இன்று உச்சத்தில் இருக்கும், இதன் மூலம் கடினமான பிரச்சினைகளுக்கும் எளிதாகத் தீர்வு காண்பீர்கள். பணியிடத்தில் உங்கள் திறமைகள் அங்கீகரிக்கப்படும், மேலதிகாரிகளின் பாராட்டுகளைப் பெறுவீர்கள். புதிய பொறுப்புகள் அல்லது பதவிகள் உங்களைத் தேடி வர வாய்ப்புள்ளது. புதிய திட்டங்களை வகுப்பதற்கும், அவற்றைச் செயல்படுத்துவதற்கும் இது ஒரு சிறப்பான நாள். உங்கள் பேச்சுத்திறன் மற்றும் தகவல் தொடர்பு திறன் இன்று உங்களுக்குப் பெரிய அளவில் கை கொடுக்கும். வாடிக்கையாளர்களுடனும், சக ஊழியர்களுடனும் திறம்படப் பேசுவதன் மூலம் நல்லுறவைப் பலப்படுத்திக் கொள்வீர்கள். சமூக வலைத்தளங்களில் அல்லது பொதுவெளியில் உங்களின் கருத்துக்களைப் பகிர இது ஒரு நல்ல வாய்ப்பு. உங்கள் கருத்துக்களுக்கு நல்ல மதிப்பும் மரியாதையும் கிடைக்கும். நீண்டகாலமாக நிலுவையில் உள்ள சில திட்டங்கள் இன்று செயல்பாட்டிற்கு வரும். உங்கள் கடின உழைப்புக்கும், அர்ப்பணிப்புக்கும் நல்ல பலன் கிடைக்கும். வியாபாரம் செய்பவர்களுக்கு புதிய வாடிக்கையாளர்கள் கிடைப்பார்கள், அல்லது புதிய ஒப்பந்தங்கள் கையெழுத்தாகும். உங்கள் புத்திசாலித்தனமும், விரைவான முடிவெடுக்கும் திறனும் இன்று உங்களுக்குப் பெரிய அளவில் கை கொடுக்கும். மனரீதியாக நீங்கள் மிகவும் உற்சாகமாகவும், ஆற்றலுடனும் இருப்பீர்கள். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொள்ளும் தைரியம் உங்களிடம் இருக்கும். ஆன்மீக நாட்டம் கொண்டவர்கள் புதிய ஞானத்தைப் பெறுவார்கள். பிறருக்கு அறிவுரை வழங்குவதிலும், வழி காட்டுவதிலும் நீங்கள் சிறந்து விளங்குவீர்கள். ஆனால், உங்கள் பேச்சில் மிதமும், தெளிவும் இருக்க வேண்டும். தேவையற்ற விவாதங்களைத் தவிர்த்து, ஆக்கபூர்வமான உரையாடல்களில் ஈடுபடுவது நல்லது. குடும்பத்தில் மகிழ்ச்சியும், அமைதியும் நிலவும். உறவினர்களுடன் நல்லுறவு அதிகரிக்கும். மொத்தத்தில், இன்று உங்களின் அறிவாற்றலையும், தகவல் தொடர்பு திறன்களையும் முழுமையாகப் பயன்படுத்தி முன்னேறக்கூடிய ஒரு அருமையான நாளாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு சிறப்பான பலன்களைப் பெறுங்கள்.",
    "prediction_en": "For Virgo individuals, today, being a Wednesday, with the full dominance of Mercury, your ruling planet, you can expect excellent progress in your career, social status, and public life. Your clarity of thought and analytical skills will be at their peak today, enabling you to easily solve difficult problems. Your talents will be recognized at the workplace, and you will receive praise from superiors. New responsibilities or positions may come your way. This is an excellent day for formulating new plans and implementing them. Your eloquence and communication skills will greatly assist you today. By effectively communicating with clients and colleagues, you will strengthen good relationships. This is a good opportunity to share your views on social media or public platforms. Your opinions will receive good respect and recognition. Some long-pending projects will come into action today. Your hard work and dedication will yield good results. Business people will gain new customers, or new contracts will be signed. Your intelligence and quick decision-making ability will greatly assist you today. Mentally, you will be very enthusiastic and energetic. You will have the courage to face any challenge with confidence. Those with spiritual inclinations will acquire new wisdom. You will excel in offering advice and guidance to others. However, your speech should be moderate and clear. It is advisable to avoid unnecessary debates and engage in constructive conversations. Happiness and peace will prevail in the family. Relationships with relatives will improve. Overall, today is a wonderful day where you can fully utilize your intellect and communication skills to progress. Act with positive thoughts and achieve excellent results.",
    "career_ta": "வேலை மற்றும் தொழில் ரீதியாக இன்று உங்களுக்குப் பொன்னான வாய்ப்புகள் அமையும். உங்கள் பேச்சுத்திறன் மற்றும் பகுப்பாய்வு திறன் காரணமாகப் புதிய திட்டங்களில் வெற்றி பெறுவீர்கள். மேலதிகாரிகளின் பாராட்டு கிடைக்கும். நிர்வாகம் மற்றும் ஆராய்ச்சி சார்ந்த துறைகளில் பணிபுரிபவர்களுக்கு இது ஒரு நல்ல நாள். புதிய தொழில் தொடங்க அல்லது விரிவாக்க இது உகந்த நேரம். உங்கள் திறமைகளை வெளிப்படுத்தி நற்பெயர் பெறுவீர்கள். வெளிநாட்டு தொடர்புகள் ஆதாயம் தரும்.",
    "career_en": "Professionally, today will present golden opportunities for you. You will succeed in new projects due to your eloquence and analytical skills. You will receive praise from superiors. This is a good day for those working in management and research-related fields. It is a suitable time to start or expand a new business. You will gain a good reputation by showcasing your talents. Foreign contacts will bring benefits.",
    "finance_ta": "நிதிநிலைமை இன்று மிகவும் வலுப்பெறும். புதிய முதலீடுகள் குறித்து நன்கு ஆராய்ந்து முடிவெடுக்கலாம். சேமிப்பு திட்டங்களில் கவனம் செலுத்த இது ஒரு நல்ல நாள். எதிர்பாராத ஆதாயங்கள் அல்லது பரிசுகள் கிடைக்க வாய்ப்புள்ளது. நிலுவையில் உள்ள பாக்கிகளை வசூலிக்க இது உகந்த நேரம். வரவு செலவு கணக்குகளைத் தெளிவாகப் பராமரிப்பது எதிர்காலத்திற்குப் பயன் தரும். புத்திசாலித்தனமான நிதி முடிவுகள் நீண்டகால ஸ்திரத்தன்மைக்கு வழிவகுக்கும்.",
    "finance_en": "Financial conditions will strengthen considerably today. You can make well-researched decisions regarding new investments. This is a good day to focus on savings plans. There is a possibility of unexpected gains or gifts. This is an opportune time to collect outstanding dues. Maintaining clear income and expenditure accounts will be beneficial for the future. Intelligent financial decisions will lead to long-term stability.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனரீதியாக நீங்கள் மிகவும் சுறுசுறுப்பாகவும், புத்துணர்ச்சியுடனும் இருப்பதால், அது உங்கள் உடல் நலனையும் மேம்படுத்தும். சரியான உணவுப் பழக்கம் மற்றும் போதிய ஓய்வு அவசியம். யோகா மற்றும் தியானம் மனதை அமைதிப்படுத்தும். சிறிய உடற்பயிற்சிகளை மேற்கொள்வது உங்களை நாள் முழுவதும் சுறுசுறுப்பாக வைத்திருக்கும். புத்தகம் படிப்பது அல்லது புதிய விஷயங்களைக் கற்றுக்கொள்வது மனதிற்கு புத்துணர்ச்சி அளிக்கும்.",
    "health_en": "Physical health will be stable. As you are mentally very active and refreshed, it will also enhance your physical well-being. Proper eating habits and adequate rest are essential. Yoga and meditation will calm the mind. Light exercises will keep you active throughout the day. Reading books or learning new things will refresh your mind.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "11-02-2026",
    "prediction_ta": "துலாம் ராசிக்காரர்களுக்கு இன்று புதன்கிழமை, புதனின் ஆதிக்கம் நிறைந்த இந்த நாளில், அறிவு, உயர் கல்வி மற்றும் ஆன்மீக விஷயங்களில் புதிய பரிமாணங்களை அடைவீர்கள். உங்கள் மனதில் தோன்றும் தத்துவார்த்த சிந்தனைகள் உங்களை ஒரு புதிய பாதைக்கு இட்டுச் செல்லும். புதிய தகவல்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை விரிவுபடுத்துவதற்கும் இது ஒரு அருமையான நாளாகும். உயர் கல்வி அல்லது ஆராய்ச்சி சார்ந்த முயற்சிகளில் ஈடுபடுபவர்களுக்கு நல்ல முன்னேற்றம் உண்டு. ஆசிரியர்கள், பேராசிரியர்கள், மற்றும் வழிகாட்டிகளின் ஆலோசனைகள் இன்று உங்களுக்குப் பெரும் பலமாக அமையும். தொலைதூர தொடர்புகள் அல்லது வெளிநாட்டு தொடர்புகள் மூலம் நல்ல செய்திகள் வரலாம். பயணம் செய்ய வாய்ப்புகள் உருவாகலாம், குறிப்பாக அறிவுசார்ந்த பயணங்கள் அல்லது ஆன்மீகப் பயணங்கள். ஆன்மீக நூல்களைப் படிப்பதன் மூலமோ அல்லது ஆன்மீக சொற்பொழிவுகளைக் கேட்பதன் மூலமோ உங்கள் மனம் அமைதி பெறும். வெளிநாட்டுப் பயணங்கள் அல்லது வெளிநாட்டு வணிக ஒப்பந்தங்கள் குறித்து இன்று ஆழமாகச் சிந்திப்பது நல்லது. நீண்டகால நோக்கங்களுக்காகச் செய்யப்படும் திட்டமிடல்கள் இன்று வலுப்பெறும். சமூகத்தில் உங்களின் கருத்துகளுக்கு நல்ல மதிப்பும் மரியாதையும் கிடைக்கும். தர்ம காரியங்களில் ஈடுபடுவதற்கும், பிறருக்கு உதவுவதற்கும் இது உகந்த நாள். உங்கள் பேச்சுத்திறனும், இராஜதந்திர அணுகுமுறையும் இன்று உங்களுக்குப் பெரும் பலமாக அமையும். நீங்கள் பேசும் ஒவ்வொரு வார்த்தையும் மிகவும் கவனமாகப் பேசப்பட வேண்டும், ஏனெனில் அதன் மூலம் நல்ல விளைவுகளைப் பெற முடியும். மனரீதியாக நீங்கள் மிகவும் சுறுசுறுப்பாகவும், புத்துணர்ச்சியுடனும் இருப்பீர்கள். புதிய புத்தகங்களைப் படிப்பதன் மூலமோ அல்லது புதிய கலைகளைக் கற்றுக்கொள்வதன் மூலமோ உங்கள் அறிவை வளர்த்துக் கொள்ளலாம். உங்கள் உடல் மற்றும் மனம் சீரான நிலையில் இருப்பதால், எதையும் எளிதில் எதிர்கொள்ளும் ஆற்றலைப் பெறுவீர்கள். எந்தவொரு விஷயத்திலும் அவசரப்படாமல், நிதானமாகச் செயல்படுவது வெற்றியைத் தரும். மொத்தத்தில், இன்று உங்களுக்கு மனத்தெளிவையும், புதிய வாய்ப்புகளையும், ஆக்கபூர்வமான கருத்துப் பரிமாற்றங்களையும் வழங்கும் ஒரு சிறப்பான நாளாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு சிறப்பான பலன்களைப் பெறுங்கள். உங்கள் உறவுகளில் நல்ல புரிதலை வளர்த்துக் கொள்வீர்கள். நீதி மற்றும் நியாயம் தொடர்பான விஷயங்களில் இன்று தெளிவான முடிவுகளை எடுக்க முடியும்.",
    "prediction_en": "For Libra individuals, today, being a Wednesday, influenced by Mercury, you will attain new dimensions in knowledge, higher education, and spiritual matters. The philosophical thoughts arising in your mind will lead you to a new path. This is a wonderful day for learning new information and expanding your knowledge. Those engaged in higher education or research-related endeavors will see good progress. The advice of teachers, professors, and mentors will be a great strength for you today. Good news may come through distant contacts or foreign connections. Opportunities for travel may arise, especially intellectual or spiritual journeys. Your mind will find peace by reading spiritual texts or listening to spiritual discourses. It is good to deeply contemplate foreign travels or foreign business agreements today. Long-term planning done with foresight will be strengthened today. Your opinions will gain good respect and recognition in society. This is a suitable day for engaging in charitable deeds and helping others. Your eloquence and diplomatic approach will be a great strength for you today. Every word you speak should be uttered very carefully, as you can achieve good results through it. Mentally, you will feel very active and refreshed. You can enhance your knowledge by reading new books or learning new arts. With your body and mind in a balanced state, you will gain the ability to face anything easily. In any matter, acting calmly and patiently, without haste, will bring success. Overall, today is an excellent day that offers you mental clarity, new opportunities, and constructive exchange of ideas. Act with positive thoughts and achieve excellent results. You will develop a good understanding in your relationships. Today, you will be able to make clear decisions regarding matters of justice and fairness.",
    "career_ta": "வேலை மற்றும் தொழில் ரீதியாக இன்று புதிய உயரங்களை எட்டுவீர்கள். உயர் கல்வி நிறுவனங்களில் பணிபுரிபவர்களுக்கும், ஆய்வுத் துறைகளில் உள்ளவர்களுக்கும் நல்ல முன்னேற்றம் உண்டு. வெளிநாட்டு வணிக தொடர்புகள் மற்றும் சர்வதேச திட்டங்களில் வெற்றி காணலாம். உங்கள் பேச்சுத்திறன் மற்றும் தத்துவார்த்த அணுகுமுறை சக ஊழியர்களிடமும், மேலதிகாரிகளிடமும் பாராட்டப்படும். புதிய திறன்களைக் கற்றுக்கொள்வதற்கு இது உகந்த நேரம். நீண்டகால இலக்குகளை அடைய நல்ல திட்டமிடலை மேற்கொள்வீர்கள்.",
    "career_en": "Professionally, you will reach new heights today. Those working in higher education institutions and research fields will see good progress. You may succeed in foreign business contacts and international projects. Your eloquence and philosophical approach will be appreciated by colleagues and superiors. This is a suitable time to learn new skills. You will undertake good planning to achieve long-term goals.",
    "finance_ta": "நிதிநிலைமை இன்று சீராக இருக்கும். புதிய முதலீடுகள் குறித்து நன்கு ஆராய்ந்து முடிவெடுக்கலாம், குறிப்பாக வெளிநாட்டு முதலீடுகள் அல்லது நீண்டகால திட்டங்கள். சேமிப்பு திட்டங்களில் கவனம் செலுத்த இது ஒரு நல்ல நாள். ஆன்மீக காரியங்களுக்கு செலவு செய்ய வாய்ப்புள்ளது. வரவு செலவு கணக்குகளைத் தெளிவாகப் பராமரிப்பது எதிர்காலத்திற்குப் பயன் தரும். புத்திசாலித்தனமான நிதி முடிவுகள் நீண்டகால ஸ்திரத்தன்மைக்கு வழிவகுக்கும். எதிர்பாராத ஆதாயங்கள் கிடைக்கும்.",
    "finance_en": "Financial conditions will be stable today. You can make well-researched decisions regarding new investments, especially foreign investments or long-term projects. This is a good day to focus on savings plans. There may be opportunities to spend on spiritual matters. Maintaining clear income and expenditure accounts will be beneficial for the future. Intelligent financial decisions will lead to long-term stability. Unexpected gains are possible.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மனரீதியாக நீங்கள் மிகவும் அமைதியாகவும், தத்துவார்த்த சிந்தனைகளுடனும் இருப்பதால், அது உங்கள் உடல் நலனையும் மேம்படுத்தும். தியானம், யோகா மற்றும் ஆழமான சுவாசப் பயிற்சிகள் மனதை அமைதிப்படுத்தும். முறையான உணவுப் பழக்கம் மற்றும் போதுமான ஓய்வு மிகவும் அவசியம். வெளி இடங்களுக்குச் சென்று வருவது அல்லது இயற்கையான சூழலில் நேரம் செலவிடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். ஆன்மீகப் புத்தகங்களைப் படிப்பது மனதிற்கு மகிழ்ச்சி தரும்.",
    "health_en": "Physical health will be excellent. As you are mentally very calm and philosophical in your thoughts, it will also enhance your physical well-being. Meditation, yoga, and deep breathing exercises will calm the mind. Proper eating habits and adequate rest are very important. Going out to different places or spending time in a natural environment will rejuvenate you. Reading spiritual books will bring joy to your mind.",
    "lucky_number": "6",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "விருச்சிகம்",
    "sign_en": "Scorpio",
    "date": "11-02-2026",
    "prediction_ta": "விருச்சிக ராசிக்காரர்களுக்கு இன்று புதன்கிழமை, புதனின் ஆதிக்கம் நிறைந்த இந்த நாளில், கூட்டுறவு, பங்களிப்பு மற்றும் ஆழ்ந்த தொடர்புகளில் சிறப்பான முன்னேற்றம் காணலாம். உங்களின் பேச்சுத்திறனும், இராஜதந்திர அணுகுமுறையும் இன்று உங்களுக்குப் பெரும் பலமாக அமையும். நீங்கள் பேசும் ஒவ்வொரு வார்த்தையும் மிகவும் கவனமாகப் பேசப்பட வேண்டும், ஏனெனில் அதன் மூலம் நல்ல விளைவுகளைப் பெற முடியும். கூட்டு முயற்சிகளில் ஈடுபடுவதற்கும், புதிய திட்டங்களை வகுப்பதற்கும் இது உகந்த நேரமாகும். வியாபார கூட்டாளிகளுடன் அல்லது வாழ்க்கைத் துணைவருடன் நல்லிணக்கத்துடன் செயல்படுவது வெற்றியைத் தரும். உங்கள் மனதில் தோன்றும் புதிய சிந்தனைகளையும், புதிய கருத்துக்களையும் மற்றவர்களுடன் பகிர்ந்து கொள்வதன் மூலம், சிறந்த பாராட்டுகளையும், நல்ல ஆலோசனைகளையும் பெறுவீர்கள். நீண்ட நாட்களாக நிலுவையில் உள்ள சில ஒப்பந்தங்கள் அல்லது பேச்சுவார்த்தைகள் இன்று செயல்பாட்டிற்கு வரும். புதிய கூட்டாண்மைகள் அல்லது வியாபார ஒப்பந்தங்கள் உருவாக வாய்ப்புகள் உண்டு. உங்கள் கடின உழைப்புக்கும், அர்ப்பணிப்புக்கும் நல்ல பலன் கிடைக்கும். மனரீதியாக நீங்கள் மிகவும் உற்சாகமாகவும், ஆற்றலுடனும் இருப்பீர்கள். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொள்ளும் தைரியம் உங்களிடம் இருக்கும். ஆன்மீக நாட்டம் கொண்டவர்கள் புதிய ஞானத்தைப் பெறுவார்கள். பிறருக்கு அறிவுரை வழங்குவதிலும், வழி காட்டுவதிலும் நீங்கள் சிறந்து விளங்குவீர்கள். ஆனால், உங்கள் பேச்சில் மிதமும், தெளிவும் இருக்க வேண்டும். தேவையற்ற விவாதங்களைத் தவிர்த்து, ஆக்கபூர்வமான உரையாடல்களில் ஈடுபடுவது நல்லது. குடும்பத்தில் மகிழ்ச்சியும், அமைதியும் நிலவும். உறவினர்களுடன் நல்லுறவு அதிகரிக்கும். சொத்து தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் காணலாம். புதிய சொத்துகள் வாங்குவதற்கு அல்லது பழைய சொத்துக்களை சீர் செய்வதற்கு இது உகந்த நேரம். சட்ட விஷயங்களில் சாதகமான தீர்ப்புகள் வர வாய்ப்புகள் உண்டு. உங்களின் உள்ளுணர்வு இன்று மிகவும் கூர்மையாக இருக்கும், முக்கியமான முடிவுகளை எடுப்பதில் உங்களுக்கு வழிகாட்டும். சில நேரங்களில் தனிமையில் நேரம் செலவிடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். மொத்தத்தில், இன்று உங்களின் அறிவாற்றலையும், தகவல் தொடர்பு திறன்களையும் முழுமையாகப் பயன்படுத்தி முன்னேறக்கூடிய ஒரு அருமையான நாளாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு சிறப்பான பலன்களைப் பெறுங்கள்.",
    "prediction_en": "For Scorpio individuals, today, being a Wednesday, influenced by Mercury, you can see excellent progress in cooperation, contributions, and deep connections. Your eloquence and diplomatic approach will be a great strength for you today. Every word you speak should be uttered very carefully, as you can achieve good results through it. This is an opportune time to engage in collaborative efforts and formulate new plans. Working in harmony with business partners or your spouse will bring success. By sharing the new thoughts and ideas that arise in your mind with others, you will receive excellent praise and good advice. Some long-pending agreements or negotiations will come into action today. Opportunities for new partnerships or business agreements may arise. Your hard work and dedication will yield good results. Mentally, you will be very enthusiastic and energetic. You will have the courage to face any challenge with confidence. Those with spiritual inclinations will acquire new wisdom. You will excel in helping and advising others. However, your speech should be moderate and clear. It is advisable to avoid unnecessary debates and engage in constructive conversations. Happiness and peace will prevail in the family. Relationships with relatives will improve. You can see good progress in property-related matters. This is a suitable time to purchase new properties or renovate old ones. There are chances for favorable judgments in legal matters. Your intuition will be very sharp today, guiding you in making important decisions. Sometimes spending time alone will rejuvenate you. Overall, today is a wonderful day where you can fully utilize your intellect and communication skills to progress. Act with positive thoughts and achieve excellent results.",
    "career_ta": "வேலை மற்றும் தொழில் ரீதியாக இன்று கூட்டுப்பணிகள் மற்றும் ஒப்பந்தங்களில் வெற்றி காண்பீர்கள். உங்கள் பேச்சுத்திறன் மற்றும் இராஜதந்திர அணுகுமுறை காரணமாகப் புதிய திட்டங்களில் வெற்றி பெறுவீர்கள். வணிக ஒப்பந்தங்கள் கையெழுத்தாக வாய்ப்புள்ளது. சட்டத் துறைகள், ஆராய்ச்சி மற்றும் நிதி ஆலோசனைத் துறைகளில் பணிபுரிபவர்களுக்கு நல்ல முன்னேற்றம் உண்டு. உங்கள் திறமைகளை வெளிப்படுத்தி நற்பெயர் பெறுவீர்கள். மேலதிகாரிகளுடன் நல்லுறவு மேலோங்கும்.",
    "career_en": "Professionally, you will find success in teamwork and agreements today. You will succeed in new projects due to your eloquence and diplomatic approach. There is a chance for business agreements to be signed. Those working in legal fields, research, and financial advisory sectors will see good progress. You will gain a good reputation by showcasing your talents. Good relationships with superiors will prevail.",
    "finance_ta": "நிதிநிலைமை இன்று சாதகமாக இருக்கும். கூட்டு முதலீடுகள் அல்லது கூட்டாண்மை சார்ந்த நிதி திட்டங்களில் நல்ல லாபம் காணலாம். நீண்டகால முதலீடுகள் குறித்து இன்று ஆழமாகச் சிந்திப்பது நல்லது. நிலுவையில் உள்ள பாக்கிகளை வசூலிக்க இது உகந்த நேரம். எதிர்பாராத ஆதாயங்கள் அல்லது பரிசுகள் கிடைக்க வாய்ப்புள்ளது. வரவு செலவு கணக்குகளைத் தெளிவாகப் பராமரிப்பது எதிர்காலத்திற்குப் பயன் தரும். புத்திசாலித்தனமான நிதி முடிவுகள் நீண்டகால ஸ்திரத்தன்மைக்கு வழிவகுக்கும்.",
    "finance_en": "Financial conditions will be favorable today. You can see good profits in joint investments or partnership-based financial plans. It is good to deeply contemplate long-term investments today. This is an opportune time to collect outstanding dues. There is a possibility of unexpected gains or gifts. Maintaining clear income and expenditure accounts will be beneficial for the future. Intelligent financial decisions will lead to long-term stability.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். இருப்பினும், மன அழுத்தத்தைத் தவிர்க்க, போதிய ஓய்வும் மன அமைதியும் தேவை. தியானம், யோகா மற்றும் ஆழமான சுவாசப் பயிற்சிகள் மனதை அமைதிப்படுத்தும். முறையான உணவுப் பழக்கம் மற்றும் போதுமான ஓய்வு மிகவும் அவசியம். நண்பர்களுடன் வெளியே சென்று வருவது மனதிற்கு புத்துணர்ச்சி அளிக்கும். நீர் அருந்துவதில் கவனம் செலுத்தவும்.",
    "health_en": "Physical health will be excellent. However, to avoid stress, adequate rest and mental peace are necessary. Meditation, yoga, and deep breathing exercises will calm the mind. Proper eating habits and adequate rest are very important. Going out with friends will refresh your mind. Pay attention to water intake.",
    "lucky_number": "9",
    "lucky_color_ta": "மெரூன்",
    "lucky_color_en": "Maroon"
  },
  {
    "sign_ta": "தனுசு",
    "sign_en": "Sagittarius",
    "date": "11-02-2026",
    "prediction_ta": "தனுசு ராசிக்காரர்களுக்கு இன்று புதன்கிழமை, புதனின் ஆதிக்கம் நிறைந்த இந்த நாளில், உறவுகள், கூட்டு முயற்சிகள் மற்றும் கூட்டாண்மைகளில் சிறப்பான முன்னேற்றம் காணலாம். உங்களின் பேச்சுத்திறனும், இராஜதந்திர அணுகுமுறையும் இன்று உங்களுக்குப் பெரும் பலமாக அமையும். நீங்கள் பேசும் ஒவ்வொரு வார்த்தையும் மிகவும் கவனமாகப் பேசப்பட வேண்டும், ஏனெனில் அதன் மூலம் நல்ல விளைவுகளைப் பெற முடியும். கூட்டு முயற்சிகளில் ஈடுபடுவதற்கும், புதிய திட்டங்களை வகுப்பதற்கும் இது உகந்த நேரமாகும். வியாபார கூட்டாளிகளுடன் அல்லது வாழ்க்கைத் துணைவருடன் நல்லிணக்கத்துடன் செயல்படுவது வெற்றியைத் தரும். உங்கள் மனதில் தோன்றும் புதிய சிந்தனைகளையும், புதிய கருத்துக்களையும் மற்றவர்களுடன் பகிர்ந்து கொள்வதன் மூலம், சிறந்த பாராட்டுகளையும், நல்ல ஆலோசனைகளையும் பெறுவீர்கள். நீண்ட நாட்களாக நிலுவையில் உள்ள சில ஒப்பந்தங்கள் அல்லது பேச்சுவார்த்தைகள் இன்று செயல்பாட்டிற்கு வரும். புதிய கூட்டாண்மைகள் அல்லது வியாபார ஒப்பந்தங்கள் உருவாக வாய்ப்புகள் உண்டு. உங்கள் கடின உழைப்புக்கும், அர்ப்பணிப்புக்கும் நல்ல பலன் கிடைக்கும். மனரீதியாக நீங்கள் மிகவும் உற்சாகமாகவும், ஆற்றலுடனும் இருப்பீர்கள். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொள்ளும் தைரியம் உங்களிடம் இருக்கும். ஆன்மீக நாட்டம் கொண்டவர்கள் புதிய ஞானத்தைப் பெறுவார்கள். பிறருக்கு அறிவுரை வழங்குவதிலும், வழி காட்டுவதிலும் நீங்கள் சிறந்து விளங்குவீர்கள். ஆனால், உங்கள் பேச்சில் மிதமும், தெளிவும் இருக்க வேண்டும். தேவையற்ற விவாதங்களைத் தவிர்த்து, ஆக்கபூர்வமான உரையாடல்களில் ஈடுபடுவது நல்லது. குடும்பத்தில் மகிழ்ச்சியும், அமைதியும் நிலவும். உறவினர்களுடன் நல்லுறவு அதிகரிக்கும். சட்ட விஷயங்களில் சாதகமான தீர்ப்புகள் வர வாய்ப்புகள் உண்டு. உங்களின் உள்ளுணர்வு இன்று மிகவும் கூர்மையாக இருக்கும், முக்கியமான முடிவுகளை எடுப்பதில் உங்களுக்கு வழிகாட்டும். சில நேரங்களில் தனிமையில் நேரம் செலவிடுவது உங்களுக்குப் புத்துணர்ச்சி அளிக்கும். மொத்தத்தில், இன்று உங்களின் அறிவாற்றலையும், தகவல் தொடர்பு திறன்களையும் முழுமையாகப் பயன்படுத்தி முன்னேறக்கூடிய ஒரு அருமையான நாளாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு சிறப்பான பலன்களைப் பெறுங்கள்.",
    "prediction_en": "For Sagittarius individuals, today, being a Wednesday, influenced by Mercury, you can see excellent progress in relationships, joint ventures, and partnerships. Your eloquence and diplomatic approach will be a great strength for you today. Every word you speak should be uttered very carefully, as you can achieve good results through it. This is an opportune time to engage in collaborative efforts and formulate new plans. Working in harmony with business partners or your spouse will bring success. By sharing the new thoughts and ideas that arise in your mind with others, you will receive excellent praise and good advice. Some long-pending agreements or negotiations will come into action today. Opportunities for new partnerships or business agreements may arise. Your hard work and dedication will yield good results. Mentally, you will be very enthusiastic and energetic. You will have the courage to face any challenge with confidence. Those with spiritual inclinations will acquire new wisdom. You will excel in helping and advising others. However, your speech should be moderate and clear. It is advisable to avoid unnecessary debates and engage in constructive conversations. Happiness and peace will prevail in the family. Relationships with relatives will improve. There are chances for favorable judgments in legal matters. Your intuition will be very sharp today, guiding you in making important decisions. Sometimes spending time alone will rejuvenate you. Overall, today is a wonderful day where you can fully utilize your intellect and communication skills to progress. Act with positive thoughts and achieve excellent results.",
    "career_ta": "வேலை மற்றும் தொழில் ரீதியாக இன்று கூட்டுப்பணிகளில் சிறந்து விளங்குவீர்கள். புதிய திட்டங்களைச் செயல்படுத்துவதற்கும், சக ஊழியர்களுடன் நல்லுறவை மேம்படுத்துவதற்கும் இது உகந்த நாள். வணிக ஒப்பந்தங்கள் கையெழுத்தாக வாய்ப்புள்ளது. சட்டத் துறைகள், ஆராய்ச்சி மற்றும் நிதி ஆலோசனைத் துறைகளில் பணிபுரிபவர்களுக்கு நல்ல முன்னேற்றம் உண்டு. உங்கள் திறமைகளை வெளிப்படுத்தி நற்பெயர் பெறுவீர்கள். மேலதிகாரிகளுடன் நல்லுறவு மேலோங்கும். புதிய தொழில் தொடங்க இது உகந்த நேரம்.",
    "career_en": "Professionally, you will excel in teamwork today. This is an opportune day for implementing new projects and improving relationships with colleagues. There is a chance for business agreements to be signed. Those working in legal fields, research, and financial advisory sectors will see good progress. You will gain a good reputation by showcasing your talents. Good relationships with superiors will prevail. This is a suitable time to start a new business.",
    "finance_ta": "நிதிநிலைமை இன்று சாதகமாக இருக்கும். கூட்டு முதலீடுகள் அல்லது கூட்டாண்மை சார்ந்த நிதி திட்டங்களில் நல்ல லாபம் காணலாம். நீண்டகால முதலீடுகள் குறித்து இன்று ஆழமாகச் சிந்திப்பது நல்லது. நிலுவையில் உள்ள பாக்கிகளை வசூலிக்க இது உகந்த நேரம். எதிர்பாராத ஆதாயங்கள் அல்லது பரிசுகள் கிடைக்க வாய்ப்புள்ளது. வரவு செலவு கணக்குகளைத் தெளிவாகப் பராமரிப்பது எதிர்காலத்திற்குப் பயன் தரும். புத்திசாலித்தனமான நிதி முடிவுகள் நீண்டகால ஸ்திரத்தன்மைக்கு வழிவகுக்கும்.",
    "finance_en": "Financial conditions will be favorable today. You can see good profits in joint investments or partnership-based financial plans. It is good to deeply contemplate long-term investments today. This is an opportune time to collect outstanding dues. There is a possibility of unexpected gains or gifts. Maintaining clear income and expenditure accounts will be beneficial for the future. Intelligent financial decisions will lead to long-term stability.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மனரீதியாக நீங்கள் மிகவும் உற்சாகமாகவும், ஆற்றலுடனும் இருப்பதால், அது உங்கள் உடல் நலனையும் மேம்படுத்தும். சமூக நிகழ்வுகளில் கலந்து கொள்வது மனதிற்கு மகிழ்ச்சி தரும். சிரிப்பு யோகா அல்லது குழு சார்ந்த உடற்பயிற்சிகளை மேற்கொள்வது நல்லது. முறையான உணவுப் பழக்கம் மற்றும் போதுமான ஓய்வு உங்கள் ஆற்றல் மட்டத்தை அதிகரிக்கும். வெளி இடங்களுக்குச் சென்று வருவது புத்துணர்ச்சி அளிக்கும்.",
    "health_en": "Physical health will be excellent. As you are mentally very enthusiastic and energetic, it will also enhance your physical well-being. Participating in social events will bring joy to your mind. Practicing laughter yoga or group exercises is beneficial. Proper eating habits and adequate rest will boost your energy levels. Going out to different places will refresh you.",
    "lucky_number": "3",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "மகரம்",
    "sign_en": "Capricorn",
    "date": "11-02-2026",
    "prediction_ta": "மகர ராசிக்காரர்களுக்கு இன்று புதன்கிழமை, புதனின் ஆதிக்கம் நிறைந்த இந்த நாளில், உங்களின் அன்றாடப் பணிகள், ஆரோக்கியம் மற்றும் கடமைகளில் ஒரு தெளிவான முன்னேற்றம் காணலாம். உங்கள் சிந்தனைத் தெளிவும், திட்டமிடும் திறனும் இன்று உச்சத்தில் இருக்கும், இதன் மூலம் கடினமான பணிகளையும் எளிதாகச் செய்து முடிப்பீர்கள். பணியிடத்தில் உங்கள் திறமைகள் அங்கீகரிக்கப்படும், மேலதிகாரிகளின் பாராட்டுகளைப் பெறுவீர்கள். புதிய பொறுப்புகள் அல்லது பதவிகள் உங்களைத் தேடி வர வாய்ப்புள்ளது. புதிய திட்டங்களை வகுப்பதற்கும், அவற்றைச் செயல்படுத்துவதற்கும் இது ஒரு சிறப்பான நாள். உங்கள் பேச்சுத்திறன் மற்றும் தகவல் தொடர்பு திறன் இன்று உங்களுக்குப் பெரிய அளவில் கை கொடுக்கும். வாடிக்கையாளர்களுடனும், சக ஊழியர்களுடனும் திறம்படப் பேசுவதன் மூலம் நல்லுறவைப் பலப்படுத்திக் கொள்வீர்கள். ஆரோக்கிய விஷயங்களில் இன்று கூடுதல் கவனம் செலுத்துவீர்கள். புதிய உடற்பயிற்சி திட்டங்களைத் தொடங்குவதற்கும், ஆரோக்கியமான உணவுப் பழக்கங்களை மேற்கொள்வதற்கும் இது உகந்த நாள். நீண்ட நாட்களாக நிலுவையில் உள்ள சில திட்டங்கள் இன்று செயல்பாட்டிற்கு வரும். உங்கள் கடின உழைப்புக்கும், அர்ப்பணிப்புக்கும் நல்ல பலன் கிடைக்கும். வியாபாரம் செய்பவர்களுக்கு புதிய வாடிக்கையாளர்கள் கிடைப்பார்கள், அல்லது புதிய ஒப்பந்தங்கள் கையெழுத்தாகும். உங்கள் புத்திசாலித்தனமும், விரைவான முடிவெடுக்கும் திறனும் இன்று உங்களுக்குப் பெரிய அளவில் கை கொடுக்கும். மனரீதியாக நீங்கள் மிகவும் உற்சாகமாகவும், ஆற்றலுடனும் இருப்பீர்கள். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொள்ளும் தைரியம் உங்களிடம் இருக்கும். ஆன்மீக நாட்டம் கொண்டவர்கள் புதிய ஞானத்தைப் பெறுவார்கள். பிறருக்கு அறிவுரை வழங்குவதிலும், வழி காட்டுவதிலும் நீங்கள் சிறந்து விளங்குவீர்கள். ஆனால், உங்கள் பேச்சில் மிதமும், தெளிவும் இருக்க வேண்டும். தேவையற்ற விவாதங்களைத் தவிர்த்து, ஆக்கபூர்வமான உரையாடல்களில் ஈடுபடுவது நல்லது. மொத்தத்தில், இன்று உங்களின் அறிவாற்றலையும், தகவல் தொடர்பு திறன்களையும் முழுமையாகப் பயன்படுத்தி முன்னேறக்கூடிய ஒரு அருமையான நாளாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு சிறப்பான பலன்களைப் பெறுங்கள்.",
    "prediction_en": "For Capricorn individuals, today, being a Wednesday, influenced by Mercury, you can see clear progress in your daily tasks, health, and duties. Your clarity of thought and planning skills will be at their peak today, enabling you to easily complete difficult tasks. Your talents will be recognized at the workplace, and you will receive praise from superiors. New responsibilities or positions may come your way. This is an excellent day for formulating new plans and implementing them. Your eloquence and communication skills will greatly assist you today. By effectively communicating with clients and colleagues, you will strengthen good relationships. Today, you will pay extra attention to health matters. This is a suitable day to start new exercise programs and adopt healthy eating habits. Some long-pending projects will come into action today. Your hard work and dedication will yield good results. Business people will gain new customers, or new contracts will be signed. Your intelligence and quick decision-making ability will greatly assist you today. Mentally, you will be very enthusiastic and energetic. You will have the courage to face any challenge with confidence. Those with spiritual inclinations will acquire new wisdom. You will excel in helping and advising others. However, your speech should be moderate and clear. It is advisable to avoid unnecessary debates and engage in constructive conversations. Overall, today is a wonderful day where you can fully utilize your intellect and communication skills to progress. Act with positive thoughts and achieve excellent results.",
    "career_ta": "வேலை மற்றும் தொழில் ரீதியாக இன்று உங்கள் செயல்திறன் அதிகரிக்கும். நிர்வாகம், திட்டமிடல் மற்றும் பகுப்பாய்வு சார்ந்த பணிகளில் சிறந்து விளங்குவீர்கள். புதிய திட்டங்களைச் செயல்படுத்துவதற்கும், மேலதிகாரிகளுடன் பேசுவதற்கும் இது உகந்த நேரம். உங்கள் திறமைகளை வெளிப்படுத்தி நற்பெயர் பெறுவீர்கள். புதிய தொழில் தொடங்க அல்லது விரிவாக்க இது உகந்த நேரம். சக ஊழியர்களுடன் நல்லுறவு மேலோங்கும். வெளிநாட்டு தொடர்புகள் மூலம் நல்ல வாய்ப்புகள் வரலாம்.",
    "career_en": "Professionally, your efficiency will increase today. You will excel in administrative, planning, and analytical tasks. This is an opportune time to implement new projects and communicate with superiors. You will gain a good reputation by showcasing your talents. It is a suitable time to start or expand a new business. Good relationships with colleagues will prevail. Good opportunities may arise through foreign contacts.",
    "finance_ta": "நிதிநிலைமை இன்று சீராக இருக்கும். உங்கள் வருவாயைப் பெருக்கும் புதிய வழிகளைப் பற்றிச் சிந்திப்பீர்கள். புத்திசாலித்தனமான நிதி முடிவுகள் மற்றும் முதலீடுகள் நீண்ட கால ஆதாயங்களைத் தரக்கூடும். வரவு செலவு கணக்குகளைச் சீராகப் பராமரிப்பதன் மூலம் தேவையற்ற செலவுகளைக் கட்டுப்படுத்தலாம். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவது நல்லது. சிறிய அளவிலான லாபகரமான முதலீடுகளுக்கு இது உகந்த நாள். நிதி ஆலோசகர்களின் ஆலோசனையைப் பெறுவது பயன் தரும்.",
    "finance_en": "Financial conditions will be favorable today. You will think about new ways to increase your income. Intelligent financial decisions and investments could yield long-term gains. By maintaining proper income and expenditure accounts, you can control unnecessary expenses. It is good to focus on savings plans. This is a suitable day for small, profitable investments. Seeking advice from financial advisors will be beneficial.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். அன்றாட உடற்பயிற்சிகள் மற்றும் யோகா மனதையும், உடலையும் சீராக வைத்திருக்கும். ஆரோக்கியமான உணவுப் பழக்கத்தை மேற்கொள்வது மிகவும் அவசியம். மன அழுத்தத்தைக் குறைக்க தியானம் செய்வது நல்லது. வேலைப்பளுவை நிர்வகிப்பதில் கவனம் செலுத்துங்கள். அவ்வப்போது சிறிய ஓய்வு எடுப்பது புத்துணர்ச்சி அளிக்கும். புத்தகம் படிப்பது அல்லது புதிய விஷயங்களைக் கற்றுக்கொள்வது மனதிற்கு புத்துணர்ச்சி அளிக்கும்.",
    "health_en": "Physical health will be excellent. Daily exercises and yoga will keep your mind and body stable. Adopting healthy eating habits is very important. Practicing meditation is good for reducing stress. Focus on managing your workload. Taking short breaks occasionally will rejuvenate you. Reading books or learning new things will refresh your mind.",
    "lucky_number": "8",
    "lucky_color_ta": "கருப்பு",
    "lucky_color_en": "Black"
  },
  {
    "sign_ta": "கும்பம்",
    "sign_en": "Aquarius",
    "date": "11-02-2026",
    "prediction_ta": "கும்ப ராசிக்காரர்களுக்கு இன்று புதன்கிழமை, புதன் கிரகத்தின் ஆதிக்கம் நிறைந்த இந்த நாளில், உங்களின் படைப்புத் திறன்கள், பொழுதுபோக்கு மற்றும் குழந்தைகளுக்கு தொடர்பான விஷயங்களில் சிறப்பான முன்னேற்றம் காணலாம். புதிய சிந்தனைகளும், புதிய கருத்துக்களும் உங்கள் மனதில் புத்துணர்ச்சியுடன் தோன்றும். அவற்றை மற்றவர்களுடன் பகிர்ந்து கொள்வதன் மூலம், சிறந்த பாராட்டுகளையும், நல்ல ஆலோசனைகளையும் பெறுவீர்கள். கலை மற்றும் பொழுதுபோக்கு சார்ந்த துறைகளில் ஈடுபடுபவர்களுக்கு இது ஒரு சிறந்த நாள். உங்களின் படைப்பாற்றல் இன்று உச்சத்தில் இருக்கும், இதன் மூலம் புதிய கலைப்படைப்புகளை உருவாக்கலாம். குழந்தைகளுக்கு தொடர்பான விஷயங்களில் இன்று கூடுதல் கவனம் செலுத்துவீர்கள். அவர்களுடன் நேரம் செலவிடுவது, அவர்களுக்குக் கல்வி கற்பிப்பது அல்லது அவர்களுடன் விளையாடுவது மனதிற்கு மகிழ்ச்சி தரும். உங்கள் காதல் உறவுகளில் நல்ல புரிதலும், இணக்கமும் மேலோங்கும். புதிய காதல் மலர வாய்ப்புகள் உண்டு. வியாபாரம் செய்பவர்களுக்கு புதிய வாடிக்கையாளர்கள் கிடைப்பார்கள், அல்லது புதிய ஒப்பந்தங்கள் கையெழுத்தாகும். உங்கள் புத்திசாலித்தனமும், விரைவான முடிவெடுக்கும் திறனும் இன்று உங்களுக்குப் பெரிய அளவில் கை கொடுக்கும். மனரீதியாக நீங்கள் மிகவும் உற்சாகமாகவும், ஆற்றலுடனும் இருப்பீர்கள். எந்தவொரு சவாலையும் நம்பிக்கையுடன் எதிர்கொள்ளும் தைரியம் உங்களிடம் இருக்கும். ஆன்மீக நாட்டம் கொண்டவர்கள் புதிய ஞானத்தைப் பெறுவார்கள். பிறருக்கு அறிவுரை வழங்குவதிலும், வழி காட்டுவதிலும் நீங்கள் சிறந்து விளங்குவீர்கள். ஆனால், உங்கள் பேச்சில் மிதமும், தெளிவும் இருக்க வேண்டும். தேவையற்ற விவாதங்களைத் தவிர்த்து, ஆக்கபூர்வமான உரையாடல்களில் ஈடுபடுவது நல்லது. குடும்பத்தில் மகிழ்ச்சியும், அமைதியும் நிலவும். உறவினர்களுடன் நல்லுறவு அதிகரிக்கும். மொத்தத்தில், இன்று உங்களின் அறிவாற்றலையும், தகவல் தொடர்பு திறன்களையும் முழுமையாகப் பயன்படுத்தி முன்னேறக்கூடிய ஒரு அருமையான நாளாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு சிறப்பான பலன்களைப் பெறுங்கள். உங்கள் பொழுதுபோக்குகளில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி அளிக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கு இது உகந்த நாள். கலை மற்றும் இசை சார்ந்த துறைகளில் உள்ளவர்களுக்கு இன்று மிகவும் சாதகமான நாள். உங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்புகள் கிடைக்கும்.",
    "prediction_en": "For Aquarius individuals, today, being a Wednesday, influenced by the planet Mercury, you can see excellent progress in your creative endeavors, hobbies, and matters related to children. New thoughts and fresh ideas will emerge in your mind with renewed vigor. By sharing them with others, you will receive excellent praise and good advice. This is an excellent day for those engaged in arts and entertainment fields. Your creativity will be at its peak today, enabling you to create new artworks. Today, you will pay extra attention to matters related to children. Spending time with them, educating them, or playing with them will bring joy to your mind. Good understanding and harmony will prevail in your romantic relationships. There are chances for new love to blossom. Business people will gain new customers, or new contracts will be signed. Your intelligence and quick decision-making ability will greatly assist you today. Mentally, you will be very enthusiastic and energetic. You will have the courage to face any challenge with confidence. Those with spiritual inclinations will acquire new wisdom. You will excel in helping and advising others. However, your speech should be moderate and clear. It is advisable to avoid unnecessary debates and engage in constructive conversations. Happiness and peace will prevail in the family. Relationships with relatives will improve. Overall, today is a wonderful day where you can fully utilize your intellect and communication skills to progress. Act with positive thoughts and achieve excellent results. Engaging in your hobbies will rejuvenate your mind. This is a suitable day for learning new things. Today is a very favorable day for those in arts and music-related fields. Good opportunities will arise to showcase your talents.",
    "career_ta": "வேலை மற்றும் தொழில் ரீதியாக இன்று உங்களின் படைப்புத் திறன்கள் பாராட்டப்படும். கலை, ஊடகம், கல்வி மற்றும் பொழுதுபோக்கு துறைகளில் பணிபுரிபவர்களுக்கு நல்ல முன்னேற்றம் உண்டு. புதிய திட்டங்களை முன்வைப்பதற்கும், கூட்டங்களில் உங்கள் கருத்துக்களைத் தெளிவாகப் பேசுவதற்கும் இது உகந்த நேரம். சக ஊழியர்களுடன் நல்லுறவு மேலோங்கும். புதிய திறன் மேம்பாட்டு பயிற்சிகளில் ஈடுபட இது நல்ல நேரம். உங்கள் புத்திசாலித்தனத்தால் அலுவலகத்தில் நற்பெயர் பெறுவீர்கள்.",
    "career_en": "Professionally, your creative talents will be appreciated today. Those working in arts, media, education, and entertainment fields will see good progress. It is an opportune time to propose new projects and articulate your ideas clearly in meetings. Good relationships with colleagues will prevail. This is a good time to engage in new skill development training. You will earn a good reputation in the office through your intelligence.",
    "finance_ta": "நிதிநிலைமை இன்று சாதகமாக இருக்கும். புதிய முதலீடுகள் குறித்து நன்கு ஆராய்ந்து முடிவெடுக்கலாம், குறிப்பாக கலை மற்றும் பொழுதுபோக்கு சார்ந்த துறைகளில். சேமிப்பு திட்டங்களில் கவனம் செலுத்த இது ஒரு நல்ல நாள். எதிர்பாராத ஆதாயங்கள் அல்லது பரிசுகள் கிடைக்க வாய்ப்புள்ளது. குழந்தைகளின் கல்வி அல்லது எதிர்காலத்திற்காகச் சேமிக்க இது உகந்த நேரம். வரவு செலவு கணக்குகளைத் தெளிவாகப் பராமரிப்பது எதிர்காலத்திற்குப் பயன் தரும். புத்திசாலித்தனமான நிதி முடிவுகள் நீண்டகால ஸ்திரத்தன்மைக்கு வழிவகுக்கும்.",
    "finance_en": "Financial conditions will be favorable today. You can make well-researched decisions regarding new investments, especially in arts and entertainment sectors. This is a good day to focus on savings plans. There is a possibility of unexpected gains or gifts. This is a suitable time to save for children's education or future. Maintaining clear income and expenditure accounts will be beneficial for the future. Intelligent financial decisions will lead to long-term stability.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மனரீதியாக நீங்கள் மிகவும் உற்சாகமாகவும், ஆற்றலுடனும் இருப்பதால், அது உங்கள் உடல் நலனையும் மேம்படுத்தும். கலை மற்றும் பொழுதுபோக்கு சார்ந்த விஷயங்களில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி அளிக்கும். குழந்தைகள் அல்லது அன்புக்குரியவர்களுடன் நேரம் செலவிடுவது மனதிற்கு மகிழ்ச்சி தரும். முறையான உணவுப் பழக்கம் மற்றும் போதுமான ஓய்வு உங்கள் ஆற்றல் மட்டத்தை அதிகரிக்கும். மிதமான உடற்பயிற்சிகளை மேற்கொள்வது நல்லது.",
    "health_en": "Physical health will be excellent. As you are mentally very enthusiastic and energetic, it will also enhance your physical well-being. Engaging in arts and hobbies will rejuvenate your mind. Spending time with children or loved ones will bring joy to your mind. Proper eating habits and adequate rest will boost your energy levels. Moderate exercises are beneficial.",
    "lucky_number": "4",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "11-02-2026",
    "prediction_ta": "மீன ராசிக்காரர்களுக்கு இன்று புதன்கிழமை, புதனின் ஆதிக்கம் நிறைந்த இந்த நாளில், குடும்ப உறவுகள், வீடு மற்றும் உள்நாட்டு விஷயங்களில் சிறப்பான முன்னேற்றம் காணலாம். உங்கள் மனதிற்குள் தோன்றும் நல்ல திட்டங்களைச் செயல்படுத்துவதற்கு ஏற்ற நாளாக இது அமையும். குடும்ப உறுப்பினர்களுடன் இணக்கமான உரையாடல்கள் மூலம் பழைய பிரச்சினைகளுக்குத் தீர்வு காணலாம். உங்களின் பேச்சுத்திறனும், இராஜதந்திர அணுகுமுறையும் இன்று உங்களுக்குப் பெரும் பலமாக அமையும். நீங்கள் பேசும் ஒவ்வொரு வார்த்தையும் மிகவும் கவனமாகப் பேசப்பட வேண்டும், ஏனெனில் அதன் மூலம் நல்ல விளைவுகளைப் பெற முடியும். வீட்டிற்குத் தேவையான பொருட்களை வாங்குவதற்கும், வீட்டில் சில மாற்றங்களைச் செய்வதற்கும் இது உகந்த நாளாகும். உங்கள் உடன் பிறந்தவர்கள் அல்லது நெருங்கிய உறவினர்களுடன் தகவல் பரிமாற்றம் அதிகரிக்கும். அவர்களுடன் நல்ல புரிதலுடன் பழகுவது, உறவுகளை மேலும் வலுப்படுத்தும். மன அமைதியையும், உள் திருப்தியையும் உணர்வீர்கள். உங்கள் உள்ளுணர்வு இன்று மிகவும் கூர்மையாக இருக்கும், முக்கியமான முடிவுகளை எடுப்பதில் உங்களுக்கு வழிகாட்டும். எந்தவொரு விஷயத்திலும் அவசரப்படாமல், நிதானமாகச் செயல்படுவது வெற்றியைத் தரும். உங்கள் உடல் மற்றும் மன ஆரோக்கியத்திற்கு முக்கியத்துவம் கொடுங்கள். தியானம் அல்லது இயற்கை சூழலில் நேரம் செலவிடுவது மனதை அமைதிப்படுத்தும். மாணவர்களுக்குக் கல்வி தொடர்பான ஆராய்ச்சிகளில் ஆர்வம் அதிகரிக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், நூலகங்களில் நேரம் செலவிடுவதற்கும் இது நல்ல நாள். சமுதாயத்தில் உங்களின் பங்களிப்பு நல்ல அங்கீகாரத்தைப் பெறும். புதிய நண்பர்களை உருவாக்குவதற்கும், பழைய நண்பர்களைச் சந்திப்பதற்கும் வாய்ப்புகள் உண்டு. மொத்தத்தில், இது உங்களுக்குச் சிந்தனைத் தெளிவையும், குடும்ப நல்லிணக்கத்தையும், புதிய வாய்ப்புகளையும் வழங்கும் ஒரு சிறப்பான நாளாகும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு சிறப்பான பலன்களைப் பெறுங்கள். நீண்டகாலமாகத் தீர்க்கப்படாத குடும்பச் சொத்து தொடர்பான பிரச்சனைகளில் நல்ல தீர்வு கிடைக்கும். உங்கள் இல்லத்தில் மகிழ்ச்சியும், சுபீட்சமும் நிறைந்திருக்கும். புதிய வீடுகட்டும் திட்டங்கள் அல்லது வீட்டை மேம்படுத்தும் முயற்சிகள் இன்று வெற்றியைப் பெறும். பெற்றோர்களின் ஆரோக்கியத்தில் கவனம் செலுத்துவது நல்லது, அவர்களுடன் ஆழமான உரையாடல்கள் நல்லுறவை மேம்படுத்தும். கடந்தகால நினைவுகளை அசைபோடுவதும், அதிலிருந்து நல்ல பாடங்களைக் கற்றுக்கொள்வதும் புத்துணர்ச்சி அளிக்கும்.",
    "prediction_en": "For Pisces individuals, today, being a Wednesday, influenced by Mercury, you can see excellent progress in family relationships, home, and domestic matters. This day will be suitable for implementing the good plans that come to your mind. Through harmonious conversations with family members, old issues can be resolved. Your eloquence and diplomatic approach will be a great strength for you today. Every word you speak should be uttered very carefully, as you can achieve good results through it. This is an opportune day for purchasing household items and making some changes at home. Communication with your siblings or close relatives will increase. Interacting with them with good understanding will further strengthen relationships. You will feel mental peace and inner satisfaction. Your intuition will be very sharp today, guiding you in making important decisions. Acting calmly and patiently in any matter, without haste, will bring success. Give importance to your physical and mental health. Practicing meditation or spending time in nature will calm your mind. For students, interest in academic research will increase. This is a good day for learning new things and spending time in libraries. Your contribution to society will receive good recognition. There will be opportunities to make new friends and meet old ones. Overall, this is an excellent day that offers you clarity of thought, family harmony, and new opportunities. Act with positive thoughts and achieve excellent results. Good solutions will be found for long-unresolved family property issues. Your home will be filled with happiness and prosperity. New house construction plans or home improvement efforts will succeed today. It is good to pay attention to the health of your parents; deep conversations with them will improve relationships. Reflecting on past memories and learning good lessons from them will be refreshing.",
    "career_ta": "வேலை மற்றும் தொழில் ரீதியாக இன்று குடும்பத்துடன் தொடர்புடைய தொழில்களில் நல்ல முன்னேற்றம் காணலாம். வீட்டிலிருந்து பணிபுரிபவர்களுக்கு அல்லது உள்நாட்டு சந்தையில் கவனம் செலுத்துபவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். உங்கள் பேச்சுத்திறன் மற்றும் பகுப்பாய்வு திறன் அலுவலகத்தில் பாராட்டப்படும். புதிய திட்டங்களைச் செயல்படுத்துவதற்கும், மேலதிகாரிகளுடன் பேசுவதற்கும் இது உகந்த நேரம். எழுத்து, ஊடகம், கல்வி மற்றும் விற்பனை துறைகளில் பணிபுரிபவர்களுக்கு நல்ல முன்னேற்றம் உண்டு.",
    "career_en": "Professionally, today you can see good progress in family-related businesses. Good opportunities will arise for those working from home or focusing on the domestic market. Your eloquence and analytical skills will be appreciated in the office. This is an opportune time to implement new projects and communicate with superiors. Those working in writing, media, education, and sales fields will see good progress.",
    "finance_ta": "நிதிநிலைமை இன்று சாதகமாக இருக்கும். வீட்டுத் தேவைகளுக்காக அல்லது குடும்ப உறுப்பினர்களுக்காகச் செலவு செய்ய வாய்ப்புள்ளது. புதிய முதலீடுகள் குறித்து நன்கு ஆராய்ந்து முடிவெடுக்கலாம், குறிப்பாக நிலம் அல்லது வீடு தொடர்பான முதலீடுகள். சேமிப்பு திட்டங்களில் கவனம் செலுத்த இது ஒரு நல்ல நாள். எதிர்பாராத ஆதாயங்கள் அல்லது பரிசுகள் கிடைக்க வாய்ப்புள்ளது. வரவு செலவு கணக்குகளைத் தெளிவாகப் பராமரிப்பது எதிர்காலத்திற்குப் பயன் தரும். புத்திசாலித்தனமான நிதி முடிவுகள் நீண்டகால ஸ்திரத்தன்மைக்கு வழிவகுக்கும்.",
    "finance_en": "Financial conditions will be favorable today. There may be opportunities to spend on household needs or family members. You can make well-researched decisions regarding new investments, especially those related to land or property. This is a good day to focus on savings plans. There is a possibility of unexpected gains or gifts. Maintaining clear income and expenditure accounts will be beneficial for the future. Intelligent financial decisions will lead to long-term stability.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மனரீதியாக நீங்கள் மிகவும் அமைதியாகவும், உள் திருப்தியுடனும் இருப்பதால், அது உங்கள் உடல் நலனையும் மேம்படுத்தும். தியானம், யோகா மற்றும் ஆழமான சுவாசப் பயிற்சிகள் மனதை அமைதிப்படுத்தும். முறையான உணவுப் பழக்கம் மற்றும் போதுமான ஓய்வு மிகவும் அவசியம். குடும்பத்துடன் நேரம் செலவிடுவது மனதிற்கு மகிழ்ச்சி தரும். வீட்டிலேயே உடற்பயிற்சிகளை மேற்கொள்வது நல்லது.",
    "health_en": "Physical health will be excellent. As you are mentally very calm and inwardly satisfied, it will also enhance your physical well-being. Meditation, yoga, and deep breathing exercises will calm the mind. Proper eating habits and adequate rest are very important. Spending time with family will bring joy to your mind. Exercising at home is beneficial.",
    "lucky_number": "3",
    "lucky_color_ta": "கடல்நீலம்",
    "lucky_color_en": "Sea Blue"
  }
]
