[{"content":{"parts":[{"text":"```json\n[\n  {\n    \"sign_en\": \"Aries\",\n    \"sign_ta\": \"மேஷம்\",\n    \"date\": \"2026-02-03\",\n    \"forecast_en\": \"This is a dynamic day where your energy levels are high. Focus this intensity on achieving tangible results rather than scattered activities. Personal relationships require diplomatic handling.\",\n    \"forecast_ta\": \"இந்த நாள் உங்களுக்கு ஆற்றலும் வேகமும் நிறைந்த நாளாக அமையும். உங்கள் முயற்சிகளை சிதறடிக்காமல், உறுதியான வெற்றிகளை அடைவதில் கவனத்தை செலுத்துங்கள். தனிப்பட்ட உறவுகளில் விட்டுக்கொடுக்கும் மனப்பான்மை தேவை.\",\n    \"career_en\": \"Professional initiatives taken today will yield quick benefits. Your leadership skills will be recognized. Avoid unnecessary conflicts with subordinates.\",\n    \"career_ta\": \"இன்று நீங்கள் தொடங்கும் பணியிட முயற்சிகள் விரைவான நன்மைகளைத் தரும். உங்கள் தலைமைத்துவப் பண்பு பாராட்டப்படும். கீழ் பணியாளர்களுடன் சண்டைகளைத் தவிர்ப்பது நல்லது.\",\n    \"finance_en\": \"Financial stability improves, but exercise prudence in major spending. It is a good time to review insurance or long-term savings plans.\",\n    \"finance_ta\": \"நிதி நிலைமை மேம்படும். ஆயினும், பெரிய செலவுகள் செய்வதில் எச்சரிக்கை தேவை. காப்பீடு அல்லது நீண்ட கால சேமிப்புத் திட்டங்களை மறுபரிசீலனை செய்ய இதுவே சரியான தருணம்.\",\n    \"health_en\": \"Your vitality is excellent. Channel surplus energy through physical activity. Beware of headaches or stress-related tension.\",\n    \"health_ta\": \"உங்கள் உடல் ஆரோக்கியம் சிறப்பாக உள்ளது. அதிகப்படியான ஆற்றலை உடற்பயிற்சியின் மூலம் வெளியேற்றவும். மன அழுத்தத்தால் ஏற்படும் தலைவலி அல்லது இறுக்கத்தைக் கவனிக்கவும்.\",\n    \"lucky_number\": \"9\",\n    \"lucky_color_en\": \"Scarlet\",\n    \"lucky_color_ta\": \"செந்நிறம்\"\n  },\n  {\n    \"sign_en\": \"Taurus\",\n    \"sign_ta\": \"ரிஷபம்\",\n    \"date\": \"2026-02-03\",\n    \"forecast_en\": \"A day for seeking comfort and security. You may feel drawn to matters of home and family. Progress might be slow, but it will be steady and reliable.\",\n    \"forecast_ta\": \"ஆறுதல் மற்றும் நிலையான தன்மையை நாடும் நாளாக இது அமையும். வீடு மற்றும் குடும்ப விஷயங்களில் அதிக ஈடுபாடு கொள்வீர்கள். முன்னேற்றம் மெதுவாக இருந்தாலும், அது உறுதியாகவும் நம்பகத்தன்மையுடனும் இருக்கும்.\",\n    \"career_en\": \"Stick to routines and established procedures. Colleagues rely on your dependable nature. Avoid making sudden, risky professional decisions today.\",\n    \"career_ta\": \"வழக்கமான நடைமுறைகளைக் கடைப்பிடிப்பது வெற்றியைத் தரும். உங்கள் நம்பகத்தன்மை காரணமாக உடன் பணிபுரியும் நபர்கள் உங்களை நம்புவார்கள். அவசரமான, அபாயகரமான தொழில் முடிவுகளைத் தவிர்ப்பது நல்லது.\",\n    \"finance_en\": \"Excellent period for evaluating potential long-term investments, especially real estate. Consolidate your existing debts or liabilities.\",\n    \"finance_ta\": \"நீண்ட கால முதலீடுகளை, குறிப்பாக நிலம் அல்லது வீடு தொடர்பான முதலீடுகளை மதிப்பிடுவதற்கு ஏற்ற காலம் இது. உங்கள் கடன்களை ஒருங்கிணைக்க முயற்சிக்கவும்.\",\n    \"health_en\": \"Focus on relaxation techniques. Ensure you get adequate rest to maintain balance. Heavy meals should be avoided.\",\n    \"health_ta\": \"ஆசுவாசப்படுத்தும் பயிற்சிகளில் கவனம் செலுத்துங்கள். சமநிலையை நிலைநாட்ட போதுமான ஓய்வு பெறுவதை உறுதிசெய்யவும். அதிகப்படியான உணவைத் தவிர்க்க வேண்டும்.\",\n    \"lucky_number\": \"6\",\n    \"lucky_color_en\": \"Emerald Green\",\n    \"lucky_color_ta\": \"மரகதப் பச்சை\"\n  },\n  {\n    \"sign_en\": \"Gemini\",\n    \"sign_ta\": \"மிதுனம்\",\n    \"date\": \"2026-02-03\",\n    \"forecast_en\": \"Communication flows freely, making this an ideal day for networking and information gathering. You might juggle several tasks simultaneously, requiring mental agility.\",\n    \"forecast_ta\": \"தொடர்பாடல் சிறப்பாக இருக்கும் நாள் இது. சமூக வலைப்பின்னல் மற்றும் தகவல் சேகரிப்புக்கு ஏற்ற நாளாக அமையும். நீங்கள் பல வேலைகளை ஒரே நேரத்தில் கையாள வேண்டியிருக்கும், இதற்கு மனத் திறன் தேவை.\",\n    \"career_en\": \"Meetings and presentations will be highly effective. Use your articulate nature to persuade stakeholders. Expect minor unexpected changes in your schedule.\",\n    \"career_ta\": \"கூட்டங்கள் மற்றும் விளக்கக்காட்சிகள் மிகவும் பயனுள்ளதாக இருக்கும். பங்குதாரர்களை சம்மதிக்க வைக்க உங்கள் பேச்சுத் திறனைப் பயன்படுத்துங்கள். உங்கள் கால அட்டவணையில் எதிர்பாராத சிறிய மாற்றங்களை எதிர்பார்க்கலாம்.\",\n    \"finance_en\": \"Potential for new, small income streams through intellectual pursuits or short trips. Be wary of spending too much on fleeting pleasures.\",\n    \"finance_ta\": \"அறிவுசார் முயற்சிகள் அல்லது குறுகிய பயணங்கள் மூலம் புதிய, சிறிய வருமான ஆதாரங்கள் உருவாக வாய்ப்புள்ளது. தற்காலிக மகிழ்ச்சிக்காக அதிக செலவு செய்வதில் எச்சரிக்கை தேவை.\",\n    \"health_en\": \"Mental clarity is high, but the constant activity might lead to nervous exhaustion. Take frequent short breaks to recharge your mind.\",\n    \"health_ta\": \"மனத்தெளிவு அதிகமாக இருக்கும், ஆனால் தொடர்ச்சியான செயல்பாடு மனச்சோர்வுக்கு வழிவகுக்கும். உங்கள் மனதுக்கு புத்துணர்ச்சி அளிக்க அடிக்கடி குறுகிய இடைவெளிகளை எடுத்துக்கொள்ளுங்கள்.\",\n    \"lucky_number\": \"5\",\n    \"lucky_color_en\": \"Yellow\",\n    \"lucky_color_ta\": \"மஞ்சள்\"\n  },\n  {\n    \"sign_en\": \"Cancer\",\n    \"sign_ta\": \"கடகம்\",\n    \"date\": \"2026-02-03\",\n    \"forecast_en\": \"Emotional security is paramount. You might find yourself assisting family members or focusing on home improvements. Your intuitive powers are sharp today.\",\n    \"forecast_ta\": \"உணர்ச்சிப்பூர்வமான பாதுகாப்பு இன்றியமையாதது. நீங்கள் குடும்ப உறுப்பினர்களுக்கு உதவலாம் அல்லது வீட்டை அழகுபடுத்துவதில் கவனம் செலுத்தலாம். உங்கள் உள் உணர்வு சக்தி இன்று கூர்மையாக இருக்கும்.\",\n    \"career_en\": \"A favorable day for working from home or dealing with matters related to property or real estate. You will forge a strong, supportive bond with colleagues.\",\n    \"career_ta\": \"வீட்டிலிருந்து வேலை செய்வது அல்லது சொத்து தொடர்பான விஷயங்களைக் கையாள்வதற்கு இது ஒரு சாதகமான நாள். சக ஊழியர்களுடன் வலிமையான, ஆதரவான உறவை நீங்கள் வளர்த்துக் கொள்வீர்கள்.\",\n    \"finance_en\": \"Focus on securing assets rather than immediate gains. A debt owed to you might be repaid. Avoid impulse purchases based on emotional needs.\",\n    \"finance_ta\": \"உடனடி லாபத்தை விட சொத்துக்களைப் பாதுகாப்பதில் கவனம் செலுத்துங்கள். உங்களுக்கு வரவேண்டிய கடன் இன்று திரும்ப வரக்கூடும். உணர்ச்சிப்பூர்வமான தேவைகளின் அடிப்படையில் திடீர் கொள்முதல்களைத் தவிர்க்கவும்.\",\n    \"health_en\": \"Stomach and digestive health requires attention. Emotional stress can manifest physically, so prioritize stress-reducing activities like meditation.\",\n    \"health_ta\": \"வயிறு மற்றும் செரிமான ஆரோக்கியத்தில் கவனம் தேவை. உணர்ச்சிப்பூர்வமான மன அழுத்தம் உடல் ரீதியாக வெளிப்படலாம், எனவே தியானம் போன்ற மன அழுத்தத்தைக் குறைக்கும் நடவடிக்கைகளுக்கு முன்னுரிமை கொடுங்கள்.\",\n    \"lucky_number\": \"2\",\n    \"lucky_color_en\": \"Silver\",\n    \"lucky_color_ta\": \"வெள்ளி நிறம்\"\n  },\n  {\n    \"sign_en\": \"Leo\",\n    \"sign_ta\": \"சிம்மம்\",\n    \"date\": \"2026-02-03\",\n    \"forecast_en\": \"Your confidence is high, attracting attention and opportunities. This is an excellent day to take center stage, whether professionally or socially. Express your creativity fully.\",\n    \"forecast_ta\": \"உங்கள் தன்னம்பிக்கை உயர்ந்து காணப்படும், இது கவனத்தையும் புதிய வாய்ப்புகளையும் ஈர்க்கும். தொழில் ரீதியாகவும், சமூக அளவிலும் நீங்கள் முன்னிலை வகிக்க இது ஒரு சிறந்த நாள். உங்கள் படைப்பாற்றலை முழுமையாக வெளிப்படுத்துங்கள்.\",\n    \"career_en\": \"Leadership tasks are favorable. Presentations or public speaking events will be highly successful. Delegate minor tasks to focus on strategy.\",\n    \"career_ta\": \"தலைமைப் பொறுப்புகளை ஏற்றுக்கொள்வதற்குச் சாதகமான நாள். விளக்கக்காட்சிகள் அல்லது பொதுப் பேச்சு நிகழ்வுகள் மிகவும் வெற்றிகரமாக இருக்கும். உத்தியில் கவனம் செலுத்த சிறிய பணிகளை மற்றவர்களுக்கு ஒதுக்குங்கள்.\",\n    \"finance_en\": \"Financial gains are likely through successful projects or speculation. However, avoid arrogance in financial dealings; seek expert advice if needed.\",\n    \"finance_ta\": \"வெற்றிகரமான திட்டங்கள் அல்லது ஊக வணிகம் மூலம் நிதி வரவுகள் உண்டாகும். ஆயினும், நிதி பரிவர்த்தனைகளில் ஆணவத்தைத் தவிருங்கள்; தேவைப்பட்டால் நிபுணரின் ஆலோசனையைப் பெறுங்கள்.\",\n    \"health_en\": \"Maintain heart health and circulation. Vigorous exercise is beneficial, but ensure you warm up adequately to prevent injury.\",\n    \"health_ta\": \"இதய ஆரோக்கியம் மற்றும் இரத்த ஓட்டத்தை கவனித்துக் கொள்ளுங்கள். தீவிரமான உடற்பயிற்சி பயனளிக்கும், ஆனால் காயம் ஏற்படுவதைத் தடுக்க போதுமான அளவுக்கு உடல் பயிற்சிகளை ஆரம்பத்தில் மெதுவாகச் செய்யவும்.\",\n    \"lucky_number\": \"1\",\n    \"lucky_color_en\": \"Gold\",\n    \"lucky_color_ta\": \"தங்க நிறம்\"\n  },\n  {\n    \"sign_en\": \"Virgo\",\n    \"sign_ta\": \"கன்னி\",\n    \"date\": \"2026-02-03\",\n    \"forecast_en\": \"A focus on organization and efficiency dominates your day. You will successfully tackle pending administrative tasks. Small details hold the key to major success.\",\n    \"forecast_ta\": \"அமைப்பு மற்றும் திறமையில் கவனம் செலுத்துவது உங்கள் நாளை ஆதிக்கம் செலுத்தும். நிலுவையில் உள்ள நிர்வாகப் பணிகளை நீங்கள் வெற்றிகரமாகச் செய்து முடிப்பீர்கள். சிறிய விவரங்கள் பெரிய வெற்றிக்கு வழிவகுக்கும்.\",\n    \"career_en\": \"You shine in roles requiring meticulous planning and analysis. Ensure all paperwork is accurate before submission. Service-oriented work will be deeply satisfying.\",\n    \"career_ta\": \"நுண்ணிய திட்டமிடல் மற்றும் ஆய்வு தேவைப்படும் பணிகளில் நீங்கள் சிறப்பாகச் செயல்படுவீர்கள். சமர்ப்பிக்கும் முன் அனைத்து ஆவணங்களும் துல்லியமாக இருப்பதை உறுதிப்படுத்தவும். சேவை மனப்பான்மை கொண்ட வேலை உங்களுக்கு மனநிறைவைத் தரும்.\",\n    \"finance_en\": \"Budgeting and tracking expenses are crucial today. Look for areas where you can cut minor waste. Avoid lending money unnecessarily.\",\n    \"finance_ta\": \"வரவு செலவுத் திட்டம் மற்றும் செலவுகளைக் கண்காணிப்பது இன்று மிகவும் முக்கியம். சிறிய வீணான செலவுகளைக் குறைக்கும் வழிகளைத் தேடுங்கள். தேவையற்ற முறையில் கடன் கொடுப்பதைத் தவிர்க்கவும்.\",\n    \"health_en\": \"Stress reduction is essential. Digestive issues linked to anxiety might surface. Practice mindful eating and schedule quiet time.\",\n    \"health_ta\": \"மன அழுத்தத்தைக் குறைப்பது அவசியம். பதட்டத்துடன் தொடர்புடைய செரிமான பிரச்சனைகள் ஏற்படக்கூடும். கவனத்துடன் உணவருந்துதல் மற்றும் அமைதியான நேரத்தை திட்டமிடுதல் வேண்டும்.\",\n    \"lucky_number\": \"3\",\n    \"lucky_color_en\": \"Navy Blue\",\n    \"lucky_color_ta\": \"கரும் நீலம்\"\n  },\n  {\n    \"sign_en\": \"Libra\",\n    \"sign_ta\": \"துலாம்\",\n    \"date\": \"2026-02-03\",\n    \"forecast_en\": \"Harmony in relationships is your primary concern. This is an excellent day for resolving disputes and finding common ground. Focus on balance and aesthetic endeavors.\",\n    \"forecast_ta\": \"உறவுகளில் நல்லிணக்கம் அடைவது இன்று உங்களின் முக்கியக் குறிக்கோளாகும். சச்சரவுகளைத் தீர்க்கவும், பொதுவான புரிந்துணர்வை ஏற்படுத்தவும் இது ஒரு சிறந்த நாள். சமநிலை மற்றும் அழகியல் முயற்சிகளில் கவனம் செலுத்துங்கள்.\",\n    \"career_en\": \"Partnerships and collaborations flourish. Negotiating contracts or deals will be fruitful. Be aware of the needs of your business associates.\",\n    \"career_ta\": \"கூட்டுறவுகள் மற்றும் கூட்டுப்பணிகள் இன்று செழித்து வளரும். ஒப்பந்தங்கள் அல்லது உடன்படிக்கைகளைப் பேச்சுவார்த்தை மூலம் தீர்ப்பது பயனுள்ளதாக இருக்கும். உங்கள் வணிக கூட்டாளர்களின் தேவைகளை உணர்ந்து செயல்படுங்கள்.\",\n    \"finance_en\": \"Joint financial ventures or shared resources will be favorable. You might receive financial advice from your spouse or partner. Exercise caution in large purchases related to luxury.\",\n    \"finance_ta\": \"கூட்டு நிதி முயற்சிகள் அல்லது பகிர்ந்த வளங்கள் சாதகமாக இருக்கும். உங்கள் துணை அல்லது கூட்டாளரிடமிருந்து நிதி ஆலோசனை கிடைக்கலாம். ஆடம்பரம் தொடர்பான பெரிய கொள்முதல்களில் எச்சரிக்கையுடன் செயல்படவும்.\",\n    \"health_en\": \"Focus on the lower back and kidneys. Maintaining inner peace is crucial for physical health. Gentle stretching or yoga is recommended.\",\n    \"health_ta\": \"முதுகு மற்றும் சிறுநீரகங்களில் கவனம் தேவை. மன அமைதியை நிலைநாட்டுவது உடல் ஆரோக்கியத்திற்கு முக்கியமானது. மென்மையான நீட்சிப் பயிற்சிகள் அல்லது யோகா பரிந்துரைக்கப்படுகிறது.\",\n    \"lucky_number\": \"6\",\n    \"lucky_color_en\": \"Pink\",\n    \"lucky_color_ta\": \"இளஞ்சிவப்பு\"\n  },\n  {\n    \"sign_en\": \"Scorpio\",\n    \"sign_ta\": \"விருச்சிகம்\",\n    \"date\": \"2026-02-03\",\n    \"forecast_en\": \"Intensity and deep investigation mark the day. You are ready to tackle underlying issues and facilitate necessary transformations. Be mindful of power struggles.\",\n    \"forecast_ta\": \"ஆழமான ஆய்வு மற்றும் தீவிரமான கவனம் இன்று உங்கள் நாளாக அமையும். அடிப்படைப் பிரச்சினைகளைக் கையாளவும், தேவையான மாற்றங்களை ஏற்படுத்தவும் நீங்கள் தயாராக உள்ளீர்கள். அதிகாரப் போட்டிகளில் கவனமாக இருங்கள்.\",\n    \"career_en\": \"Research, detective work, or complex technical tasks are favored. You have the persistence needed to complete difficult assignments. Avoid exposing confidential information.\",\n    \"career_ta\": \"ஆராய்ச்சி, புலனாய்வு வேலைகள் அல்லது சிக்கலான தொழில்நுட்பப் பணிகள் இன்று சாதகமாக இருக்கும். கடினமான வேலைகளை முடிப்பதற்கான விடாமுயற்சி உங்களிடம் உள்ளது. இரகசியத் தகவல்களை வெளிப்படுத்துவதைத் தவிர்க்கவும்.\",\n    \"finance_en\": \"Matters related to taxes, inheritance, or shared finances require careful review. This is a good time for debt restructuring or loan applications.\",\n    \"finance_ta\": \"வரி, பரம்பரைச் சொத்து அல்லது கூட்டு நிதி தொடர்பான விஷயங்களை கவனமாக மறுபரிசீலனை செய்ய வேண்டும். கடன் மறுசீரமைப்பு அல்லது கடன் விண்ணப்பங்களுக்கு இது ஒரு நல்ல நேரம்.\",\n    \"health_en\": \"Emotional release is vital; do not suppress feelings. Consider engaging in therapeutic activities. Pay attention to your reproductive health.\",\n    \"health_ta\": \"உணர்ச்சி வெளிப்பாடு இன்றியமையாதது; உணர்வுகளை அடக்க வேண்டாம். சிகிச்சை நடவடிக்கைகளில் ஈடுபட முயற்சிக்கவும். உங்கள் இனப்பெருக்க ஆரோக்கியத்தில் கவனம் செலுத்துங்கள்.\",\n    \"lucky_number\": \"8\",\n    \"lucky_color_en\": \"Maroon\",\n    \"lucky_color_ta\": \"சிவப்புக் கலந்த பழுப்பு\"\n  },\n  {\n    \"sign_en\": \"Sagittarius\",\n    \"sign_ta\": \"தனுசு\",\n    \"date\": \"2026-02-03\",\n    \"forecast_en\": \"Optimism prevails, and you are keen to expand your horizons through learning or travel. Long-distance communication proves beneficial. Maintain a broad, philosophical outlook.\",\n    \"forecast_ta\": \"நன்னம்பிக்கை நிறைந்த நாளாக இது இருக்கும். கற்றல் அல்லது பயணம் மூலம் உங்கள் எல்லைகளை விரிவுபடுத்த நீங்கள் ஆர்வமாக இருப்பீர்கள். தொலைதூரத் தொடர்புகள் பயனுள்ளதாக அமையும். பரந்த, தத்துவார்த்த கண்ணோட்டத்தை நிலைநாட்டுங்கள்.\",\n    \"career_en\": \"Opportunities linked to publishing, higher education, or international trade might arise. Your willingness to teach or mentor others will be appreciated.\",\n    \"career_ta\": \"வெளியீடு, உயர் கல்வி அல்லது பன்னாட்டு வணிகம் தொடர்பான வாய்ப்புகள் ஏற்படலாம். மற்றவர்களுக்குப் பயிற்றுவிக்க அல்லது வழிகாட்ட நீங்கள் காட்டும் விருப்பம் பாராட்டப்படும்.\",\n    \"finance_en\": \"Expenditure related to education or travel is likely but worthwhile. Avoid risky speculative investments based on unreliable rumors.\",\n    \"finance_ta\": \"கல்வி அல்லது பயணம் தொடர்பான செலவுகள் ஏற்பட வாய்ப்புள்ளது, ஆனால் அது பயனுள்ளதாக இருக்கும். நம்பத்தகாத வதந்திகளின் அடிப்படையில் ஆபத்தான ஊக முதலீடுகளைத் தவிர்க்கவும்.\",\n    \"health_en\": \"The hips and thighs are areas to watch. Outdoor physical activity, especially walking or running, will greatly boost your mental and physical state.\",\n    \"health_ta\": \"இடுப்பு மற்றும் தொடைகள் கவனிக்க வேண்டிய பகுதிகள். வெளிப்புற உடல் செயல்பாடு, குறிப்பாக நடைபயிற்சி அல்லது ஓட்டம், உங்கள் மன மற்றும் உடல் நிலையை பெரிதும் உயர்த்தும்.\",\n    \"lucky_number\": \"7\",\n    \"lucky_color_en\": \"Violet\",\n    \"lucky_color_ta\": \"ஊதா\"\n  },\n  {\n    \"sign_en\": \"Capricorn\",\n    \"sign_ta\": \"மகரம்\",\n    \"date\": \"2026-02-03\",\n    \"forecast_en\": \"Focus on your long-term goals and professional responsibilities. Discipline and structure bring satisfying results. You are viewed as a reliable authority figure today.\",\n    \"forecast_ta\": \"உங்கள் நீண்ட கால இலக்குகள் மற்றும் தொழில்முறைப் பொறுப்புகளில் கவனம் செலுத்துங்கள். கட்டுப்பாடு மற்றும் கட்டமைப்பு திருப்திகரமான விளைவுகளைத் தரும். நீங்கள் இன்று நம்பகமான உயர் அதிகாரியாக பார்க்கப்படுவீர்கள்.\",\n    \"career_en\": \"Interactions with superiors are favorable; you may receive recognition or a promotion. Work involving administration or structural planning is highly successful.\",\n    \"career_ta\": \"உயர் அதிகாரிகளுடனான உரையாடல்கள் சாதகமாக இருக்கும்; நீங்கள் அங்கீகாரம் அல்லது பதவி உயர்வு பெறலாம். நிர்வாகம் அல்லது கட்டமைப்புத் திட்டமிடல் தொடர்பான வேலைகள் மிகவும் வெற்றிகரமாக இருக்கும்.\",\n    \"finance_en\": \"A favorable time for long-term savings and reviewing retirement plans. Avoid borrowing money unless absolutely essential for business growth.\",\n    \"finance_ta\": \"நீண்ட கால சேமிப்பு மற்றும் ஓய்வூதியத் திட்டங்களை மறுபரிசீலனை செய்ய இது ஒரு சாதகமான நேரம். வணிக வளர்ச்சிக்கு முற்றிலும் அவசியமானாலன்றி பணம் கடன் வாங்குவதைத் தவிர்க்கவும்.\",\n    \"health_en\": \"Pay attention to your knees and joints. Ensure you maintain good posture, especially if spending long hours seated. Adequate calcium intake is advised.\",\n    \"health_ta\": \"உங்கள் முழங்கால்கள் மற்றும் மூட்டுகளில் கவனம் செலுத்துங்கள். நீண்ட நேரம் அமர்ந்திருந்தால், நல்ல தோரணையைப் பேணுவதை உறுதிசெய்யவும். போதுமான கால்சியம் உட்கொள்ள அறிவுறுத்தப்படுகிறது.\",\n    \"lucky_number\": \"4\",\n    \"lucky_color_en\": \"Black\",\n    \"lucky_color_ta\": \"கருப்பு\"\n  },\n  {\n    \"sign_en\": \"Aquarius\",\n    \"sign_ta\": \"கும்பம்\",\n    \"date\": \"2026-02-03\",\n    \"forecast_en\": \"Innovation and originality define your day. Social networking brings important contacts. Be open to unconventional ideas and humanitarian causes.\",\n    \"forecast_ta\": \"புதுமை மற்றும் தனித்தன்மை உங்கள் நாளை வரையறுக்கும். சமூக வலைப்பின்னல் முக்கியமான தொடர்புகளைக் கொண்டுவரும். வழக்கத்திற்கு மாறான கருத்துக்கள் மற்றும் மனிதநேய முயற்சிகளுக்குத் திறந்த மனதுடன் இருங்கள்.\",\n    \"career_en\": \"Team projects and collaborations with like-minded individuals are highly productive. Your unique approach to problem-solving will impress stakeholders. Do not resist necessary technological changes.\",\n    \"career_ta\": \"ஒத்த எண்ணம் கொண்டவர்களுடன் குழுத் திட்டங்கள் மற்றும் கூட்டுப்பணிகள் மிகவும் உற்பத்தி நிறைந்ததாக இருக்கும். சிக்கலைத் தீர்ப்பதற்கான உங்கள் தனித்துவமான அணுகுமுறை பங்குதாரர்களைக் கவரும். தேவையான தொழில்நுட்ப மாற்றங்களை எதிர்ப்பதைத் தவிர்க்கவும்.\",\n    \"finance_en\": \"Unexpected small expenses or gifts are possible. Maintain clarity regarding shared funds. Investing in technology or future-forward concepts could be worthwhile.\",\n    \"finance_ta\": \"எதிர்பாராத சிறிய செலவுகள் அல்லது பரிசுகள் ஏற்பட வாய்ப்புள்ளது. கூட்டு நிதி தொடர்பாகத் தெளிவைப் பேணவும். தொழில்நுட்பம் அல்லது எதிர்கால முன்னோக்கு கருத்துக்களில் முதலீடு செய்வது பயனுள்ளதாக இருக்கும்.\",\n    \"health_en\": \"The nervous system requires care. Avoid excessive stimulants like caffeine. Group exercise or engaging in hobbies provides mental release.\",\n    \"health_ta\": \"நரம்பு மண்டலத்திற்கு அக்கறை தேவை. காபி போன்ற அதிகப்படியான தூண்டுதல்களைத் தவிர்க்கவும். குழு உடற்பயிற்சி அல்லது பொழுதுபோக்குகளில் ஈடுபடுவது மன ஆறுதலைத் தரும்.\",\n    \"lucky_number\": \"11\",\n    \"lucky_color_en\": \"Electric Blue\",\n    \"lucky_color_ta\": \"மின் நீலம்\"\n  },\n  {\n    \"sign_en\": \"Pisces\",\n    \"sign_ta\": \"மீனம்\",\n    \"date\": \"2026-02-03\",\n    \"forecast_en\": \"Your intuition is highly sensitized today, guiding you toward creative and spiritual pursuits. Spend time in quiet reflection. Avoid escaping responsibility through daydreaming.\",\n    \"forecast_ta\": \"உங்கள் உள் உணர்வு இன்று மிகவும் கூர்மையாக இருக்கும், இது உங்களை படைப்பு மற்றும் ஆன்மீக முயற்சிகளுக்கு இட்டுச் செல்லும். அமைதியான சிந்தனையில் நேரத்தைச் செலவிடுங்கள். பகல் கனவு காண்பதன் மூலம் பொறுப்புகளிலிருந்து தப்பிப்பதைத் தவிர்க்கவும்.\",\n    \"career_en\": \"Creative industries, healing professions, or artistic endeavors flourish. Trust your instincts regarding complicated work dynamics. Avoid passive-aggressive behavior.\",\n    \"career_ta\": \"படைப்புத் தொழில்கள், குணப்படுத்தும் தொழில்கள் அல்லது கலை முயற்சிகள் செழிக்கும். சிக்கலான பணி இயக்கவியலைப் பற்றி உங்கள் உள்ளுணர்வை நம்புங்கள். செயலற்ற-ஆக்கிரமிப்பு நடத்தையைத் தவிர்க்கவும்.\",\n    \"finance_en\": \"Be cautious about financial decisions driven by pity or excessive generosity. Review charitable giving and ensure personal accounts are secure.\",\n    \"finance_ta\": \"பச்சாதாபம் அல்லது அதிகப்படியான தாராள மனப்பான்மையால் உந்தப்பட்ட நிதி முடிவுகளைப் பற்றி கவனமாக இருங்கள். தொண்டு அளிப்பதைப் பற்றி மறுபரிசீலனை செய்து, தனிப்பட்ட கணக்குகள் பாதுகாப்பாக இருப்பதை உறுதிசெய்யவும்.\",\n    \"health_en\": \"Ensure you get enough restful sleep. The feet and lymphatic system require attention. Water-based therapies, like a warm bath, are highly soothing.\",\n    \"health_ta\": \"நீங்கள் போதுமான அமைதியான தூக்கத்தைப் பெறுவதை உறுதிசெய்யவும். பாதங்கள் மற்றும் நிணநீர் மண்டலத்திற்கு கவனம் தேவை. வெந்நீர்க் குளியல் போன்ற நீர் சார்ந்த சிகிச்சைகள் மிகவும் ஆசுவாசப்படுத்தும்.\",\n    \"lucky_number\": \"3\",\n    \"lucky_color_en\": \"Sea Green\",\n    \"lucky_color_ta\": \"கடல் பச்சை\"\n  }\n]\n```"}],"role":"model"},"finishReason":"STOP","index":0}]