[
  {
    "sign_ta": "மேஷம்",
    "sign_en": "Aries",
    "date": "12-02-2026",
    "prediction_ta": "குரு பகவானின் ஆதிக்கம் நிறைந்த இந்த வியாழக்கிழமையில், மேஷ ராசிக்காரர்களே, உங்கள் வாழ்வில் புத்துணர்வும், புதிய ஆற்றலும் பொங்கிப் பிரவாகிக்கும். ஞானம் மற்றும் செழிப்பின் அதிபதியாகிய குருவின் அருளால், நீங்கள் எடுக்கும் ஒவ்வொரு முயற்சியிலும் தெளிவும், வெற்றியும் குடிகொள்ளும். இந்த நாள் உங்களுக்கு ஒரு வழிகாட்டும் கலங்கரை விளக்கமாக அமையும். உங்களது தலைமைத்துவப் பண்புகள் மிளிரும் வாய்ப்புகள் உருவாகும். திட்டமிட்ட செயல்களை மிகுந்த தன்னம்பிக்கையுடன் அணுகி, அவற்றை வெற்றிகரமாக முடிக்கும் ஆற்றல் உங்களுக்கு இயல்பாகவே உண்டாகும். மேலும், உங்கள் தனிப்பட்ட திறமைகளை வெளிப்படுத்தவும், புதிய சவால்களை ஏற்றுக்கொள்ளவும் இது ஒரு அற்புதமான தருணமாகும். பல ஆண்டுகளாக மனதில் இருந்த திட்டங்களை இப்போது முன்னெடுத்துச் செல்லும் நேரம் இது. குருவின் அருளால், அத்திட்டங்கள் அனைத்தும் வெற்றிகரமாக நிறைவேறும். உங்கள் உள்ளுணர்வின் வழிகாட்டுதலைப் பின்பற்றுவதன் மூலம், சரியான பாதையில் பயணிக்கலாம். சமூகத்தில் உங்கள் மதிப்பும், மரியாதையும் உயரும். புதிய பொறுப்புகள் உங்களைத் தேடி வரும். அவற்றை மிகுந்த நம்பிக்கையுடன் ஏற்றுக்கொண்டு, உங்கள் திறமையை வெளிப்படுத்துவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகளும் உண்டாகலாம், இது உங்களுக்கு மனநிறைவைத் தரும். குடும்பத்தில் அமைதியும், சுபிட்சமும் பெருகும். உறவினர்கள் மற்றும் நண்பர்களுடன் இணக்கமான சூழ்நிலை நிலவும். எந்த ஒரு மனக் கசப்புகளும் அகன்று, நல்லிணக்கம் மேலோங்கும். புதிய உறவுகள் உருவாகவும், பழைய உறவுகள் வலுப்பெறவும் வாய்ப்புகள் உண்டு. குறிப்பாக, உங்கள் சமூக வட்டாரம் விரிவடையும். புதிய நபர்களின் அறிமுகம் கிடைக்கும். அவர்களுடனான தொடர்புகள் உங்கள் எதிர்கால வளர்ச்சிக்கு உதவும். தரும சிந்தனைகள் மேலோங்கும். பிறருக்கு உதவி செய்வதில் மனநிறைவு காண்பீர்கள். உங்கள் மனதின் ஆழத்தில் உள்ள கருணையும், இரக்கமும் வெளிப்படும். இத்தகைய செயல்கள் உங்களுக்கு புண்ணியத்தையும், நற்பெயரையும் ஈட்டித் தரும். தொழில் ரீதியாகவோ அல்லது தனிப்பட்ட வாழ்க்கையிலோ ஏதேனும் முக்கியமான முடிவுகளை எடுக்க வேண்டிய சூழ்நிலை ஏற்பட்டால், குருவின் அருள் உங்களுக்கு சரியான வழிகாட்டுதலை வழங்கும். அவசரம் காட்டாமல், நிதானமாகச் சிந்தித்து முடிவெடுப்பது நன்மை பயக்கும். மூத்தவர்களின் ஆலோசனைகளைப் பெறுவது கூடுதல் பலம் சேர்க்கும். உங்கள் எதிர்காலத்திற்கான ஆழமான திட்டமிடல்களைச் செய்வதற்கு இது ஒரு சிறந்த நாளாகும். கல்வித் துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் அமையும். ஆராய்ச்சி மற்றும் உயர்கல்வித் துறைகளில் இருப்பவர்கள் சிறப்பான முன்னேற்றம் காண்பார்கள். புதிய அறிவைப் பெறுவதிலும், இருக்கும் அறிவைப் பிறருடன் பகிர்ந்து கொள்வதிலும் ஆர்வம் கொள்வீர்கள். ஆன்மீகப் பயணங்கள் அல்லது புனிதத் தலங்களுக்குச் செல்வதற்கான வாய்ப்புகள் உண்டாகலாம். இது உங்கள் மனதிற்கு அமைதியையும், புத்துணர்வையும் அளிக்கும். கடந்த காலத் தவறுகளில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவதற்கான சிந்தனைகள் மேலோங்கும். உங்களது தன்னம்பிக்கையும், மன உறுதியும் பல மடங்கு அதிகரிக்கும். ஆரோக்கியத்தின் மீது கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் மற்றும் உடற்பயிற்சிகளை மேற்கொள்வதன் மூலம் உடல் நலனைப் பேணலாம். மன அழுத்தம் இன்றி வாழ முயற்சிப்பீர்கள். நேர்மறை எண்ணங்கள் நிறைந்ததாக உங்கள் நாள் அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். குரு பகவான் உங்கள் வாழ்வில் அனைத்து செல்வங்களையும், நலன்களையும் கொண்டு வந்து சேர்ப்பார். இதனால், உங்கள் வாழ்க்கை ஒரு புதிய பரிமாணத்தை அடையும். சமூகத்தில் உங்கள் நிலை உயரும். மக்கள் மத்தியில் உங்கள் மீதான மதிப்பும் மரியாதையும் அதிகரிக்கும். உங்களின் நற்குணங்கள் எல்லோராலும் போற்றப்படும். புதிய சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். தடைகள் அனைத்தும் விலகி, வெற்றிப்பாதையில் நீங்கள் நடைபோடுவீர்கள். மொத்தத்தில், இது ஒரு அற்புதமான நாளாக அமையும்.",
    "prediction_en": "On this Thursday, ruled by Jupiter, Aries natives will experience a surge of renewed energy and vitality in your life. With the blessings of Jupiter, the lord of wisdom and prosperity, clarity and success will prevail in every endeavor you undertake. This day will serve as a guiding beacon for you. Opportunities to showcase your leadership qualities will emerge. You will inherently possess the ability to approach planned activities with immense self-confidence and successfully complete them. Furthermore, this is an excellent moment to express your unique talents and embrace new challenges. This is the time to advance plans that have been in your mind for many years. With Jupiter's grace, all these plans will be successfully realized. By following your intuition, you can journey on the right path. Your respect and standing in society will rise. New responsibilities will come seeking you. You will accept them with great confidence and demonstrate your abilities. Opportunities to engage in social service may also arise, bringing you immense satisfaction. Peace and prosperity will flourish in the family. A harmonious atmosphere will prevail among relatives and friends. Any emotional bitterness will dissipate, and goodwill will predominate. There are chances for new relationships to form and old ones to strengthen. Specifically, your social circle will expand. You will meet new people. Your connections with them will contribute to your future growth. Thoughts of charity will be prominent. You will find contentment in helping others. Your inherent kindness and compassion will be expressed. Such actions will earn you merit and a good reputation. If a situation arises where you need to make important decisions, either professionally or personally, Jupiter's grace will provide you with the right guidance. It is beneficial to make decisions calmly and thoughtfully, without haste. Seeking advice from elders will add extra strength. This is an excellent day for making profound plans for your future. Those in the field of education will find new opportunities. Individuals in research and higher education will see significant progress. You will be keen on acquiring new knowledge and sharing existing knowledge with others. Opportunities for spiritual journeys or visiting sacred places may arise. This will bring peace and rejuvenation to your mind. Thoughts of learning from past mistakes and refining the future will be prominent. Your self-confidence and mental fortitude will increase manifold. It is essential to pay attention to your health. By adopting proper eating habits and exercises, you can maintain your physical well-being. You will strive to live without stress. Your day will be filled with positive thoughts. All your efforts will be successful. Jupiter will bring all wealth and welfare into your life. Consequently, your life will enter a new dimension. Your position in society will rise. Your respect and regard among people will increase. Your good qualities will be praised by everyone. You will be ready to face new challenges. All obstacles will be removed, and you will walk on the path of victory. Overall, this will be a wonderful day.",
    "career_ta": "குரு பகவானின் ஆசியால், உங்கள் பணிச்சூழலில் முன்னேற்றத்திற்கான வாய்ப்புகள் உருவாகும். புதிய பொறுப்புகள் அல்லது தலைமைப் பதவிகள் உங்களைத் தேடி வரக்கூடும். உங்கள் கடின உழைப்பும், அர்ப்பணிப்பும் மேலதிகாரிகளால் அங்கீகரிக்கப்படும். திட்டமிட்ட செயல்களில் வெற்றியும், பணியிடத்தில் இணக்கமான சூழலும் ஏற்படும். புதிய தொழில் வாய்ப்புகளும், வணிக விரிவாக்கங்களும் சாத்தியமாகும். கூட்டு முயற்சிகளில் வெற்றி கிட்டும். உங்கள் நுண்ணறிவு சிறப்பாக செயல்படும்.",
    "career_en": "With Jupiter's blessings, opportunities for advancement will arise in your work environment. New responsibilities or leadership positions may come your way. Your hard work and dedication will be recognized by superiors. Success in planned activities and a harmonious work environment will prevail. New career opportunities and business expansions are possible. Success will be achieved in collaborative ventures. Your intuition will function exceptionally well.",
    "finance_ta": "குருவின் அருளால், உங்கள் நிதி நிலைமை வலுப்பெறும். வருமானத்திற்கான புதிய வழிகள் திறக்கப்படும். முன்னர் செய்த முதலீடுகளில் இருந்து நல்ல லாபம் கிடைக்க வாய்ப்புள்ளது. கடன் சுமை குறையும். அசையாச் சொத்துகளில் முதலீடு செய்வது நன்மை பயக்கும். நிதி சம்பந்தப்பட்ட விஷயங்களில் அறிவார்ந்த முடிவுகளை எடுப்பீர்கள். சேமிப்புகள் அதிகரிக்கும். குடும்பத்தின் நிதி நிலைமை மேம்படும்.",
    "finance_en": "With Jupiter's grace, your financial situation will strengthen. New avenues for income will open up. There is a possibility of good returns from previous investments. Debt burden will decrease. Investing in immovable properties will be beneficial. You will make wise decisions regarding financial matters. Savings will increase. The financial stability of the family will improve.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் புதிய உற்சாகமும், நேர்மறை எண்ணங்களும் நிறைந்திருக்கும். சரியான உணவுப் பழக்கவழக்கங்கள் மற்றும் மிதமான உடற்பயிற்சிகள் உங்கள் உடல் நலனை மேம்படுத்தும். நீண்ட நாட்களாக இருந்த சிறு உபாதைகள் நீங்கி புத்துணர்வு பெறுவீர்கள். யோகா மற்றும் தியானம் மேற்கொள்வது மன அமைதிக்கு வழிவகுக்கும்.",
    "health_en": "Your physical health will be stable. Your mind will be filled with new enthusiasm and positive thoughts. Proper eating habits and moderate exercises will enhance your well-being. Minor ailments that have persisted for a long time will clear up, and you will feel rejuvenated. Practicing yoga and meditation will lead to mental peace.",
    "lucky_number": "9",
    "lucky_color_ta": "சிவப்பு",
    "lucky_color_en": "Red"
  },
  {
    "sign_ta": "ரிஷபம்",
    "sign_en": "Taurus",
    "date": "12-02-2026",
    "prediction_ta": "குரு பகவானின் ஆதிக்கம் நிறைந்த இந்த வியாழக்கிழமையில், ரிஷப ராசிக்காரர்களே, உங்கள் வாழ்வில் ஸ்திரத்தன்மையும், செல்வச் செழிப்பும் மேலோங்கும். குருவின் அருளால், நீங்கள் எடுக்கும் ஒவ்வொரு செயலிலும் தீர்க்கமான முடிவுகளையும், நேர்மறையான பலன்களையும் காண்பீர்கள். உங்கள் திட்டமிடல் திறனும், கடின உழைப்பும் இத்தினத்தில் சிறப்பான பலன்களைக் கொண்டுவரும். பல ஆண்டுகளாகக் காத்திருந்த கனவுகள் நனவாகத் தொடங்கும். உங்கள் பொருளாதார நிலை மேலும் வலுவடையும். புதிய முதலீடுகளுக்கான வாய்ப்புகள் உண்டாகும். குறிப்பாக, வீடு, நிலம் போன்ற அசையாச் சொத்துகளில் முதலீடு செய்வது மிகுந்த லாபம் தரும். குடும்பத்தில் அமைதியும், சுபிட்சமும் நிறைந்து காணப்படும். கணவன் மனைவி உறவு மேம்படும். ஒருவரையொருவர் புரிந்துகொண்டு செயல்படுவீர்கள். குழந்தைகள் மூலம் மகிழ்ச்சி உண்டாகும். சுப காரியங்கள் பற்றிய பேச்சுவார்த்தைகள் தொடங்கும். புதிய உறவினர்களின் வருகை குடும்பத்தில் மகிழ்ச்சியை அதிகரிக்கும். உங்கள் சமூக வட்டாரம் விரிவடையும். புதிய நண்பர்களைச் சந்திப்பீர்கள். அவர்களின் ஆதரவு உங்களுக்குப் பல வழிகளிலும் உதவும். கலை மற்றும் கலாச்சார நிகழ்வுகளில் பங்கேற்பது மனதிற்கு உற்சாகத்தைத் தரும். குருவின் அருளால், உங்கள் சிந்தனையில் தெளிவு பிறக்கும். எந்த ஒரு செயலிலும் அவசரப்படாமல், நிதானமாகச் சிந்தித்து முடிவெடுப்பீர்கள். இது உங்களுக்குப் பல நன்மைகளைக் கொண்டுவரும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனங்கள் அல்லது புண்ணிய நதிகளில் நீராடுவதற்கான வாய்ப்புகள் உண்டாகலாம். இவை உங்கள் மனதிற்கு அமைதியையும், புத்துணர்வையும் அளிக்கும். கடந்த காலத் தவறுகளிலிருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவதற்கான சிந்தனைகள் மேலோங்கும். உங்கள் தன்னம்பிக்கையும், மன உறுதியும் பல மடங்கு அதிகரிக்கும். ஆரோக்கியத்தின் மீது கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் மற்றும் மிதமான உடற்பயிற்சிகள் உங்கள் உடல் நலனை மேம்படுத்தும். மன அழுத்தம் இன்றி வாழ முயற்சிப்பீர்கள். நேர்மறை எண்ணங்கள் நிறைந்ததாக உங்கள் நாள் அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். குரு பகவான் உங்கள் வாழ்வில் அனைத்து செல்வங்களையும், நலன்களையும் கொண்டு வந்து சேர்ப்பார். இதனால், உங்கள் வாழ்க்கை ஒரு புதிய பரிமாணத்தை அடையும். சமூகத்தில் உங்கள் நிலை உயரும். மக்கள் மத்தியில் உங்கள் மீதான மதிப்பும் மரியாதையும் அதிகரிக்கும். உங்களின் நற்குணங்கள் எல்லோராலும் போற்றப்படும். புதிய சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். தடைகள் அனைத்தும் விலகி, வெற்றிப்பாதையில் நீங்கள் நடைபோடுவீர்கள். மொத்தத்தில், இது ஒரு அற்புதமான நாளாக அமையும். நீண்டகாலமாக நிலுவையிலிருந்த சட்ட விஷயங்கள் உங்களுக்குச் சாதகமாக முடியும்.",
    "prediction_en": "On this Thursday, ruled by Jupiter, Taurus natives will experience a predominance of stability and prosperity in your life. With Jupiter's blessings, you will see decisive outcomes and positive results in every action you undertake. Your planning skills and hard work will bring excellent rewards on this day. Dreams that you have cherished for many years will begin to materialize. Your economic situation will further strengthen. Opportunities for new investments will arise. In particular, investing in immovable properties like houses and land will yield significant profits. Peace and prosperity will fill your family life. Husband-wife relationships will improve. You will act with mutual understanding. Children will bring joy. Discussions about auspicious events will begin. The arrival of new relatives will increase happiness in the family. Your social circle will expand. You will meet new friends. Their support will help you in many ways. Participating in arts and cultural events will invigorate your mind. With Jupiter's grace, clarity will emerge in your thoughts. You will make decisions calmly and thoughtfully, without haste in any matter. This will bring you many benefits. Spiritual inclination will increase. Opportunities for temple visits or bathing in sacred rivers may arise. These will bring peace and rejuvenation to your mind. Thoughts of learning from past mistakes and refining the future will be prominent. Your self-confidence and mental fortitude will increase manifold. It is essential to pay attention to your health. Proper eating habits and moderate exercises will enhance your well-being. You will strive to live without stress. Your day will be filled with positive thoughts. All your efforts will be successful. Jupiter will bring all wealth and welfare into your life. Consequently, your life will enter a new dimension. Your position in society will rise. Your respect and regard among people will increase. Your good qualities will be praised by everyone. You will be ready to face new challenges. All obstacles will be removed, and you will walk on the path of victory. Overall, this will be a wonderful day. Long-pending legal matters will conclude in your favor.",
    "career_ta": "உங்கள் பணியிடத்தில் ஸ்திரத்தன்மை மேலோங்கும். உங்கள் கடின உழைப்புக்கான அங்கீகாரம் கிடைக்கும். மேலதிகாரிகளின் ஆதரவைப் பெறுவீர்கள். புதிய பொறுப்புகளை திறம்பட கையாள்வீர்கள். வணிகத்தில் புதிய ஒப்பந்தங்கள் உருவாகும். சக ஊழியர்களுடன் நல்லுறவு நீடிக்கும். உங்கள் பொறுமையும், விடாமுயற்சியும் சிறப்பான வெற்றியைத் தேடித் தரும்.",
    "career_en": "Stability will prevail in your workplace. Your hard work will be recognized. You will receive support from superiors. You will skillfully handle new responsibilities. New contracts will emerge in business. Good relations with colleagues will continue. Your patience and perseverance will bring excellent success.",
    "finance_ta": "உங்கள் நிதி நிலைமை மிகவும் சிறப்பாக இருக்கும். சேமிப்பு அதிகரிக்கும். புதிய முதலீடுகளுக்கான வாய்ப்புகள் உண்டாகும். குறிப்பாக, நீண்ட கால முதலீடுகள் நல்ல லாபம் தரும். குடும்பத்திற்கான அத்தியாவசியத் தேவைகளை பூர்த்தி செய்வீர்கள். நிதி மேலாண்மையில் உங்கள் திறமை வெளிப்படும். எதிர்பாராத வகையில் நிதி வரவுகள் ஏற்படக்கூடும்.",
    "finance_en": "Your financial situation will be very good. Savings will increase. Opportunities for new investments will arise. In particular, long-term investments will yield good profits. You will meet essential family needs. Your expertise in financial management will be evident. Unexpected financial gains may occur.",
    "health_ta": "உங்கள் உடல் மற்றும் மன ஆரோக்கியம் சிறப்பாக இருக்கும். அன்றாட நடவடிக்கைகளில் சுறுசுறுப்புடன் ஈடுபடுவீர்கள். சத்தான உணவு மற்றும் போதுமான ஓய்வு உங்கள் ஆரோக்கியத்திற்கு மிகவும் அவசியம். மன அழுத்தத்தைக் குறைத்து, அமைதியான மனநிலையுடன் இருப்பீர்கள். யோகா மற்றும் தியானம் செய்வது நன்மை பயக்கும்.",
    "health_en": "Your physical and mental health will be excellent. You will engage in daily activities with enthusiasm. Nutritious food and adequate rest are crucial for your health. You will reduce stress and maintain a calm state of mind. Practicing yoga and meditation will be beneficial.",
    "lucky_number": "6",
    "lucky_color_ta": "வெள்ளை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "மிதுனம்",
    "sign_en": "Gemini",
    "date": "12-02-2026",
    "prediction_ta": "குரு பகவானின் ஆதிக்கம் நிறைந்த இந்த வியாழக்கிழமையில், மிதுன ராசிக்காரர்களே, உங்கள் வாழ்வில் தகவல் தொடர்பு திறன்கள் மிளிரும். குருவின் அருளால், நீங்கள் எடுக்கும் ஒவ்வொரு செயலிலும் ஞானமும், தெளிவும் நிறைந்து காணப்படும். புதிய தகவல்களைப் பெறுவதிலும், பிறருடன் பகிர்ந்து கொள்வதிலும் ஆர்வம் காட்டுவீர்கள். இத்தினம் உங்கள் அறிவாற்றல் மற்றும் சமூகத் தொடர்புகளை விரிவுபடுத்துவதற்கான சிறந்த வாய்ப்புகளை வழங்கும். புதிய நண்பர்கள் மற்றும் இணைப்பாளர்கள் மூலம் முக்கியமான செய்திகள் கிடைக்கும். சமூக ஊடகங்கள் மற்றும் தகவல் தொடர்பு சாதனங்கள் மூலம் உங்கள் கருத்துக்களை திறம்பட வெளிப்படுத்துவீர்கள். உங்கள் எழுத்து மற்றும் பேச்சுத் திறன்கள் பலரையும் ஈர்க்கும். கல்வித் துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் அமையும். ஆராய்ச்சி மற்றும் உயர்கல்வித் துறைகளில் இருப்பவர்கள் சிறப்பான முன்னேற்றம் காண்பார்கள். புதிய அறிவைப் பெறுவதிலும், இருக்கும் அறிவைப் பிறருடன் பகிர்ந்து கொள்வதிலும் ஆர்வம் கொள்வீர்கள். பயணங்கள் மேற்கொள்வதற்கான வாய்ப்புகள் உண்டாகும். குறிப்பாக, கல்வி சார்ந்த அல்லது வணிகம் சார்ந்த பயணங்கள் சிறப்பான பலன்களைக் கொண்டுவரும். புதிய இடங்களையும், மனிதர்களையும் சந்திப்பதன் மூலம் உங்கள் அனுபவம் விரிவடையும். குடும்பத்தில் அமைதியும், சுபிட்சமும் பெருகும். உறவினர்கள் மற்றும் நண்பர்களுடன் இணக்கமான சூழ்நிலை நிலவும். எந்த ஒரு மனக் கசப்புகளும் அகன்று, நல்லிணக்கம் மேலோங்கும். புதிய உறவுகள் உருவாகவும், பழைய உறவுகள் வலுப்பெறவும் வாய்ப்புகள் உண்டு. குறிப்பாக, உங்கள் சமூக வட்டாரம் விரிவடையும். புதிய நபர்களின் அறிமுகம் கிடைக்கும். அவர்களுடனான தொடர்புகள் உங்கள் எதிர்கால வளர்ச்சிக்கு உதவும். தரும சிந்தனைகள் மேலோங்கும். பிறருக்கு உதவி செய்வதில் மனநிறைவு காண்பீர்கள். உங்கள் மனதின் ஆழத்தில் உள்ள கருணையும், இரக்கமும் வெளிப்படும். இத்தகைய செயல்கள் உங்களுக்கு புண்ணியத்தையும், நற்பெயரையும் ஈட்டித் தரும். குருவின் அருளால், உங்கள் சிந்தனையில் தெளிவு பிறக்கும். எந்த ஒரு செயலிலும் அவசரப்படாமல், நிதானமாகச் சிந்தித்து முடிவெடுப்பீர்கள். இது உங்களுக்குப் பல நன்மைகளைக் கொண்டுவரும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனங்கள் அல்லது புண்ணிய நதிகளில் நீராடுவதற்கான வாய்ப்புகள் உண்டாகலாம். இவை உங்கள் மனதிற்கு அமைதியையும், புத்துணர்வையும் அளிக்கும். கடந்த காலத் தவறுகளிலிருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவதற்கான சிந்தனைகள் மேலோங்கும். உங்களது தன்னம்பிக்கையும், மன உறுதியும் பல மடங்கு அதிகரிக்கும். ஆரோக்கியத்தின் மீது கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் மற்றும் மிதமான உடற்பயிற்சிகள் உங்கள் உடல் நலனை மேம்படுத்தும். மன அழுத்தம் இன்றி வாழ முயற்சிப்பீர்கள். நேர்மறை எண்ணங்கள் நிறைந்ததாக உங்கள் நாள் அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். குரு பகவான் உங்கள் வாழ்வில் அனைத்து செல்வங்களையும், நலன்களையும் கொண்டு வந்து சேர்ப்பார். இதனால், உங்கள் வாழ்க்கை ஒரு புதிய பரிமாணத்தை அடையும். சமூகத்தில் உங்கள் நிலை உயரும். மக்கள் மத்தியில் உங்கள் மீதான மதிப்பும் மரியாதையும் அதிகரிக்கும். உங்களின் நற்குணங்கள் எல்லோராலும் போற்றப்படும். புதிய சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். தடைகள் அனைத்தும் விலகி, வெற்றிப்பாதையில் நீங்கள் நடைபோடுவீர்கள். மொத்தத்தில், இது ஒரு அற்புதமான நாளாக அமையும். பலதரப்பட்ட மக்களுடன் இனிமையான உரையாடல்கள் நிகழும்.",
    "prediction_en": "On this Thursday, ruled by Jupiter, Gemini natives will experience their communication skills shining brightly in your life. With Jupiter's blessings, wisdom and clarity will fill every action you undertake. This day will offer excellent opportunities to expand your intellect and social connections. You will receive important news through new friends and collaborators. You will effectively express your ideas through social media and communication devices. Your writing and speaking skills will attract many. Those in the field of education will find new opportunities. Individuals in research and higher education will see significant progress. You will be keen on acquiring new knowledge and sharing existing knowledge with others. Opportunities for travel will arise. In particular, education-related or business-related travels will bring excellent results. Your experience will expand by meeting new places and people. Peace and prosperity will flourish in the family. A harmonious atmosphere will prevail among relatives and friends. Any emotional bitterness will dissipate, and goodwill will predominate. There are chances for new relationships to form and old ones to strengthen. Specifically, your social circle will expand. You will meet new people. Your connections with them will contribute to your future growth. Thoughts of charity will be prominent. You will find contentment in helping others. Your inherent kindness and compassion will be expressed. Such actions will earn you merit and a good reputation. With Jupiter's grace, clarity will emerge in your thoughts. You will make decisions calmly and thoughtfully, without haste in any matter. This will bring you many benefits. Spiritual inclination will increase. Opportunities for temple visits or bathing in sacred rivers may arise. These will bring peace and rejuvenation to your mind. Thoughts of learning from past mistakes and refining the future will be prominent. Your self-confidence and mental fortitude will increase manifold. It is essential to pay attention to your health. Proper eating habits and moderate exercises will enhance your well-being. You will strive to live without stress. Your day will be filled with positive thoughts. All your efforts will be successful. Jupiter will bring all wealth and welfare into your life. Consequently, your life will enter a new dimension. Your position in society will rise. Your respect and regard among people will increase. Your good qualities will be praised by everyone. You will be ready to face new challenges. All obstacles will be removed, and you will walk on the path of victory. Overall, this will be a wonderful day. Pleasant conversations will take place with diverse people.",
    "career_ta": "உங்கள் தகவல் தொடர்புத் திறன்கள் பணியிடத்தில் சிறப்பாக வெளிப்படும். புதிய திட்டங்களில் ஈடுபடவும், கூட்டாகச் செயல்படவும் வாய்ப்புகள் கிடைக்கும். உங்கள் கருத்துக்கள் மேலதிகாரிகளால் வரவேற்கப்படும். வர்த்தகத் துறையில் இருப்பவர்களுக்கு புதிய ஒப்பந்தங்கள் உருவாகும். சக ஊழியர்களுடன் இணக்கமான உறவு நீடிக்கும். புதிய நுட்பங்களைக் கற்றுக்கொண்டு முன்னேறுவீர்கள்.",
    "career_en": "Your communication skills will be prominently displayed in the workplace. Opportunities will arise to engage in new projects and collaborate. Your ideas will be welcomed by superiors. New contracts will emerge for those in the business sector. Harmonious relationships with colleagues will continue. You will learn new techniques and progress.",
    "finance_ta": "குருவின் அருளால், உங்கள் நிதி மேலாண்மையில் தெளிவு பிறக்கும். புதிய வருமான வழிகள் உருவாகும். சிறு முதலீடுகள் நல்ல லாபம் தரும். நிதி சம்பந்தப்பட்ட விஷயங்களில் அறிவார்ந்த முடிவுகளை எடுப்பீர்கள். சேமிப்புத் திட்டங்களில் கவனம் செலுத்துவீர்கள். குடும்பத்திற்கான நிதிச் சூழல் மேம்படும். வெளிப்படையான நிதிப் பரிமாற்றங்கள் நன்மை பயக்கும்.",
    "finance_en": "With Jupiter's grace, clarity will emerge in your financial management. New income streams will develop. Small investments will yield good profits. You will make wise decisions regarding financial matters. You will focus on savings plans. The financial situation of the family will improve. Transparent financial transactions will be beneficial.",
    "health_ta": "உங்கள் மன ஆரோக்கியம் சிறப்பாக இருக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். இது உங்கள் மனதிற்கு புத்துணர்ச்சி அளிக்கும். மிதமான உடற்பயிற்சிகளையும், சரியான உணவுப் பழக்கவழக்கங்களையும் பின்பற்றுவீர்கள். மன அழுத்தத்தைக் குறைத்து, அமைதியான மனநிலையுடன் செயல்படுவீர்கள். உடல் சோர்வு நீங்கும்.",
    "health_en": "Your mental health will be excellent. You will show interest in learning new things, which will rejuvenate your mind. You will follow moderate exercises and proper eating habits. You will reduce stress and operate with a calm state of mind. Physical fatigue will dissipate.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "12-02-2026",
    "prediction_ta": "குரு பகவானின் ஆதிக்கம் நிறைந்த இந்த வியாழக்கிழமையில், கடக ராசிக்காரர்களே, உங்கள் வாழ்வில் குடும்பம் மற்றும் உணர்வுபூர்வமான விஷயங்களில் நல்லிணக்கமும், வளர்ச்சியும் மேலோங்கும். குருவின் அருளால், உங்கள் இல்லத்தில் அமைதியும், சுபிட்சமும் நிறைந்து காணப்படும். குடும்ப உறுப்பினர்களுடன் உள்ள உறவுகள் வலுப்பெறும். ஒருவருக்கொருவர் ஆதரவும், அன்பும் பெருகும். வீட்டை அழகுபடுத்துவதிலோ அல்லது புதிய பொருட்களை வாங்குவதிலோ ஆர்வம் காட்டுவீர்கள். புதிய வீடுக்கான பேச்சுவார்த்தைகள் சாதகமாக அமையும். அல்லது நீங்கள் வசிக்கும் இடத்திலேயே புதுப்பிக்கும் பணிகள் வெற்றிபெறும். கடந்த காலத்தில் ஏற்பட்ட சில மனக் கசப்புகள் நீங்கி, உறவுகளில் புதிய அத்தியாயம் தொடங்கும். குடும்பத்தில் சுப காரியங்கள் நடைபெறுவதற்கான வாய்ப்புகள் உண்டாகும். திருமணம், குழந்தைப்பேறு போன்ற மகிழ்ச்சியான செய்திகள் உங்களைத் தேடி வரலாம். உங்கள் உணர்வுகளைக் கட்டுப்படுத்தி, நேர்மறையாகச் செயல்படுவீர்கள். இது உங்களுக்கு மன அமைதியைத் தரும். தொழில் ரீதியாகவோ அல்லது தனிப்பட்ட வாழ்க்கையிலோ ஏதேனும் முக்கியமான முடிவுகளை எடுக்க வேண்டிய சூழ்நிலை ஏற்பட்டால், குருவின் அருள் உங்களுக்கு சரியான வழிகாட்டுதலை வழங்கும். அவசரம் காட்டாமல், நிதானமாகச் சிந்தித்து முடிவெடுப்பது நன்மை பயக்கும். மூத்தவர்களின் ஆலோசனைகளைப் பெறுவது கூடுதல் பலம் சேர்க்கும். உங்கள் எதிர்காலத்திற்கான ஆழமான திட்டமிடல்களைச் செய்வதற்கு இது ஒரு சிறந்த நாளாகும். கல்வித் துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் அமையும். ஆராய்ச்சி மற்றும் உயர்கல்வித் துறைகளில் இருப்பவர்கள் சிறப்பான முன்னேற்றம் காண்பார்கள். புதிய அறிவைப் பெறுவதிலும், இருக்கும் அறிவைப் பிறருடன் பகிர்ந்து கொள்வதிலும் ஆர்வம் கொள்வீர்கள். ஆன்மீகப் பயணங்கள் அல்லது புனிதத் தலங்களுக்குச் செல்வதற்கான வாய்ப்புகள் உண்டாகலாம். இது உங்கள் மனதிற்கு அமைதியையும், புத்துணர்வையும் அளிக்கும். கடந்த காலத் தவறுகளிலிருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவதற்கான சிந்தனைகள் மேலோங்கும். உங்களது தன்னம்பிக்கையும், மன உறுதியும் பல மடங்கு அதிகரிக்கும். ஆரோக்கியத்தின் மீது கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் மற்றும் மிதமான உடற்பயிற்சிகள் உங்கள் உடல் நலனை மேம்படுத்தும். மன அழுத்தம் இன்றி வாழ முயற்சிப்பீர்கள். நேர்மறை எண்ணங்கள் நிறைந்ததாக உங்கள் நாள் அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். குரு பகவான் உங்கள் வாழ்வில் அனைத்து செல்வங்களையும், நலன்களையும் கொண்டு வந்து சேர்ப்பார். இதனால், உங்கள் வாழ்க்கை ஒரு புதிய பரிமாணத்தை அடையும். சமூகத்தில் உங்கள் நிலை உயரும். மக்கள் மத்தியில் உங்கள் மீதான மதிப்பும் மரியாதையும் அதிகரிக்கும். உங்களின் நற்குணங்கள் எல்லோராலும் போற்றப்படும். புதிய சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். தடைகள் அனைத்தும் விலகி, வெற்றிப்பாதையில் நீங்கள் நடைபோடுவீர்கள். மொத்தத்தில், இது ஒரு அற்புதமான நாளாக அமையும். உங்கள் உள்ளுணர்வின் வழிகாட்டுதலைப் பின்பற்றுவதன் மூலம், சரியான பாதையில் பயணிக்கலாம்.",
    "prediction_en": "On this Thursday, ruled by Jupiter, Cancer natives will experience harmony and growth predominantly in your family and emotional matters. With Jupiter's blessings, your home will be filled with peace and prosperity. Relationships with family members will strengthen. Mutual support and love will increase. You will show interest in decorating your home or purchasing new items. Discussions for a new house will be favorable, or renovation work in your current residence will be successful. Some past emotional bitterness will dissipate, and a new chapter in relationships will begin. Opportunities for auspicious events in the family will arise. Joyful news such as marriage or childbirth may come your way. You will control your emotions and act positively, bringing you peace of mind. If a situation arises where you need to make important decisions, either professionally or personally, Jupiter's grace will provide you with the right guidance. It is beneficial to make decisions calmly and thoughtfully, without haste. Seeking advice from elders will add extra strength. This is an excellent day for making profound plans for your future. Those in the field of education will find new opportunities. Individuals in research and higher education will see significant progress. You will be keen on acquiring new knowledge and sharing existing knowledge with others. Opportunities for spiritual journeys or visiting sacred places may arise. This will bring peace and rejuvenation to your mind. Thoughts of learning from past mistakes and refining the future will be prominent. Your self-confidence and mental fortitude will increase manifold. It is essential to pay attention to your health. Proper eating habits and moderate exercises will enhance your well-being. You will strive to live without stress. Your day will be filled with positive thoughts. All your efforts will be successful. Jupiter will bring all wealth and welfare into your life. Consequently, your life will enter a new dimension. Your position in society will rise. Your respect and regard among people will increase. Your good qualities will be praised by everyone. You will be ready to face new challenges. All obstacles will be removed, and you will walk on the path of victory. Overall, this will be a wonderful day. By following your intuition, you can journey on the right path.",
    "career_ta": "உங்கள் பணியிடத்தில் இணக்கமான சூழல் உருவாகும். சக ஊழியர்களுடன் நல்லுறவு நீடிக்கும். உங்கள் மென்மையான அணுகுமுறை வெற்றியைத் தேடித் தரும். புதிய பொறுப்புகளை திறம்பட கையாள்வீர்கள். வீட்டுப் பொருட்கள் சார்ந்த வணிகம் லாபம் தரும். உங்கள் அர்ப்பணிப்பும், கடின உழைப்பும் அங்கீகரிக்கப்படும். பணியில் முன்னேற்றம் காண்பீர்கள்.",
    "career_en": "A harmonious environment will emerge in your workplace. Good relations with colleagues will continue. Your gentle approach will bring success. You will skillfully handle new responsibilities. Business related to household items will be profitable. Your dedication and hard work will be recognized. You will see progress in your work.",
    "finance_ta": "உங்கள் நிதி நிலைமை சீராக இருக்கும். குடும்பத்தின் நலனுக்காக சில முதலீடுகளைச் செய்வீர்கள். அசையாச் சொத்துகள் வாங்குவதற்கான வாய்ப்புகள் உருவாகும். சேமிப்பு அதிகரிக்கும். நிதி சம்பந்தப்பட்ட விஷயங்களில் அறிவார்ந்த முடிவுகளை எடுப்பீர்கள். குடும்ப உறுப்பினர்களின் ஆதரவு நிதி ரீதியாகப் பலன் தரும்.",
    "finance_en": "Your financial situation will be stable. You will make some investments for the well-being of your family. Opportunities to purchase immovable properties will arise. Savings will increase. You will make wise decisions regarding financial matters. The support of family members will be financially beneficial.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதிக்கு முக்கியத்துவம் கொடுப்பீர்கள். உணர்வுபூர்வமான திருப்தி உங்கள் உடல் நலனுக்கு அவசியம். சத்தான உணவு மற்றும் போதுமான ஓய்வு உங்கள் ஆற்றலை மேம்படுத்தும். யோகா, தியானம் அல்லது மனதை அமைதிப்படுத்தும் செயல்களில் ஈடுபடுவீர்கள்.",
    "health_en": "Your physical health will be excellent. You will prioritize mental peace. Emotional satisfaction is crucial for your well-being. Nutritious food and adequate rest will enhance your energy. You will engage in yoga, meditation, or activities that calm the mind.",
    "lucky_number": "2",
    "lucky_color_ta": "வெள்ளை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "சிம்மம்",
    "sign_en": "Leo",
    "date": "12-02-2026",
    "prediction_ta": "குரு பகவானின் ஆதிக்கம் நிறைந்த இந்த வியாழக்கிழமையில், சிம்ம ராசிக்காரர்களே, உங்கள் வாழ்வில் ஆக்கப்பூர்வமான வெளிப்பாடும், தலைமைத்துவப் பண்புகளும் பிரகாசிக்கும். குருவின் அருளால், நீங்கள் எடுக்கும் ஒவ்வொரு முயற்சியிலும் வெற்றி பெறுவீர்கள். உங்கள் தன்னம்பிக்கையும், தனித்துவமும் பலரையும் ஈர்க்கும். இத்தினம் உங்கள் கலைத்திறமைகளை வெளிப்படுத்தவும், புதிய படைப்புக்களை உருவாக்கவும் சிறந்த வாய்ப்புகளை வழங்கும். பொழுதுபோக்குத் துறையில் இருப்பவர்களுக்கு சிறப்பான அங்கீகாரம் கிடைக்கும். புதிய முயற்சிகளில் துணிவுடன் ஈடுபட்டு, வெற்றியைப் பெறுவீர்கள். உங்கள் தலைமைத்துவப் பண்புகள் பணியிடத்திலும், சமூகத்திலும் வெளிப்படும். மற்றவர்களுக்கு வழிகாட்டியாகச் செயல்படுவீர்கள். உங்கள் சொல்வாக்கு உயரும். புதிய பொறுப்புகள் உங்களைத் தேடி வரும். அவற்றை மிகுந்த நம்பிக்கையுடன் ஏற்றுக்கொண்டு, உங்கள் திறமையை வெளிப்படுத்துவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகளும் உண்டாகலாம், இது உங்களுக்கு மனநிறைவைத் தரும். குடும்பத்தில் அமைதியும், சுபிட்சமும் பெருகும். உறவினர்கள் மற்றும் நண்பர்களுடன் இணக்கமான சூழ்நிலை நிலவும். எந்த ஒரு மனக் கசப்புகளும் அகன்று, நல்லிணக்கம் மேலோங்கும். புதிய உறவுகள் உருவாகவும், பழைய உறவுகள் வலுப்பெறவும் வாய்ப்புகள் உண்டு. குறிப்பாக, உங்கள் சமூக வட்டாரம் விரிவடையும். புதிய நபர்களின் அறிமுகம் கிடைக்கும். அவர்களுடனான தொடர்புகள் உங்கள் எதிர்கால வளர்ச்சிக்கு உதவும். தரும சிந்தனைகள் மேலோங்கும். பிறருக்கு உதவி செய்வதில் மனநிறைவு காண்பீர்கள். உங்கள் மனதின் ஆழத்தில் உள்ள கருணையும், இரக்கமும் வெளிப்படும். இத்தகைய செயல்கள் உங்களுக்கு புண்ணியத்தையும், நற்பெயரையும் ஈட்டித் தரும். குருவின் அருளால், உங்கள் சிந்தனையில் தெளிவு பிறக்கும். எந்த ஒரு செயலிலும் அவசரப்படாமல், நிதானமாகச் சிந்தித்து முடிவெடுப்பீர்கள். இது உங்களுக்குப் பல நன்மைகளைக் கொண்டுவரும். மூத்தவர்களின் ஆலோசனைகளைப் பெறுவது கூடுதல் பலம் சேர்க்கும். உங்கள் எதிர்காலத்திற்கான ஆழமான திட்டமிடல்களைச் செய்வதற்கு இது ஒரு சிறந்த நாளாகும். கல்வித் துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் அமையும். ஆராய்ச்சி மற்றும் உயர்கல்வித் துறைகளில் இருப்பவர்கள் சிறப்பான முன்னேற்றம் காண்பார்கள். புதிய அறிவைப் பெறுவதிலும், இருக்கும் அறிவைப் பிறருடன் பகிர்ந்து கொள்வதிலும் ஆர்வம் கொள்வீர்கள். ஆன்மீகப் பயணங்கள் அல்லது புனிதத் தலங்களுக்குச் செல்வதற்கான வாய்ப்புகள் உண்டாகலாம். இது உங்கள் மனதிற்கு அமைதியையும், புத்துணர்வையும் அளிக்கும். கடந்த காலத் தவறுகளிலிருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவதற்கான சிந்தனைகள் மேலோங்கும். உங்களது தன்னம்பிக்கையும், மன உறுதியும் பல மடங்கு அதிகரிக்கும். ஆரோக்கியத்தின் மீது கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் மற்றும் மிதமான உடற்பயிற்சிகள் உங்கள் உடல் நலனை மேம்படுத்தும். மன அழுத்தம் இன்றி வாழ முயற்சிப்பீர்கள். நேர்மறை எண்ணங்கள் நிறைந்ததாக உங்கள் நாள் அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். குரு பகவான் உங்கள் வாழ்வில் அனைத்து செல்வங்களையும், நலன்களையும் கொண்டு வந்து சேர்ப்பார். இதனால், உங்கள் வாழ்க்கை ஒரு புதிய பரிமாணத்தை அடையும். சமூகத்தில் உங்கள் நிலை உயரும். மக்கள் மத்தியில் உங்கள் மீதான மதிப்பும் மரியாதையும் அதிகரிக்கும். உங்களின் நற்குணங்கள் எல்லோராலும் போற்றப்படும். புதிய சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். தடைகள் அனைத்தும் விலகி, வெற்றிப்பாதையில் நீங்கள் நடைபோடுவீர்கள். மொத்தத்தில், இது ஒரு அற்புதமான நாளாக அமையும்.",
    "prediction_en": "On this Thursday, ruled by Jupiter, Leo natives will experience creative expression and leadership qualities shining brightly in your life. With Jupiter's blessings, you will achieve success in every endeavor you undertake. Your self-confidence and uniqueness will attract many. This day will offer excellent opportunities to express your artistic talents and create new works. Those in the entertainment industry will receive special recognition. You will boldly engage in new ventures and achieve success. Your leadership qualities will be evident in the workplace and society. You will act as a guide to others. Your influence will increase. New responsibilities will come seeking you. You will accept them with great confidence and demonstrate your abilities. Opportunities to engage in social service may also arise, bringing you immense satisfaction. Peace and prosperity will flourish in the family. A harmonious atmosphere will prevail among relatives and friends. Any emotional bitterness will dissipate, and goodwill will predominate. There are chances for new relationships to form and old ones to strengthen. Specifically, your social circle will expand. You will meet new people. Your connections with them will contribute to your future growth. Thoughts of charity will be prominent. You will find contentment in helping others. Your inherent kindness and compassion will be expressed. Such actions will earn you merit and a good reputation. With Jupiter's grace, clarity will emerge in your thoughts. You will make decisions calmly and thoughtfully, without haste in any matter. This will bring you many benefits. Seeking advice from elders will add extra strength. This is an excellent day for making profound plans for your future. Those in the field of education will find new opportunities. Individuals in research and higher education will see significant progress. You will be keen on acquiring new knowledge and sharing existing knowledge with others. Opportunities for spiritual journeys or visiting sacred places may arise. This will bring peace and rejuvenation to your mind. Thoughts of learning from past mistakes and refining the future will be prominent. Your self-confidence and mental fortitude will increase manifold. It is essential to pay attention to your health. Proper eating habits and moderate exercises will enhance your well-being. You will strive to live without stress. Your day will be filled with positive thoughts. All your efforts will be successful. Jupiter will bring all wealth and welfare into your life. Consequently, your life will enter a new dimension. Your position in society will rise. Your respect and regard among people will increase. Your good qualities will be praised by everyone. You will be ready to face new challenges. All obstacles will be removed, and you will walk on the path of victory. Overall, this will be a wonderful day.",
    "career_ta": "உங்கள் தலைமைத்துவப் பண்புகள் பணியிடத்தில் வெளிப்படும். புதிய திட்டங்களில் முன்முயற்சி எடுத்துச் செயல்படுவீர்கள். மேலதிகாரிகளால் உங்கள் திறமைகள் அங்கீகரிக்கப்படும். கலை மற்றும் ஆக்கப்பூர்வமான துறைகளில் இருப்பவர்களுக்கு சிறப்பான வாய்ப்புகள் கிடைக்கும். உங்கள் தன்னம்பிக்கையும், உத்வேகமும் வெற்றியைத் தேடித் தரும். பதவி உயர்வு கிடைக்க வாய்ப்புண்டு.",
    "career_en": "Your leadership qualities will be evident in the workplace. You will take initiative in new projects. Your talents will be recognized by superiors. Those in artistic and creative fields will find excellent opportunities. Your self-confidence and motivation will bring success. There is a chance for promotion.",
    "finance_ta": "உங்கள் நிதி நிலைமை சிறப்பாக இருக்கும். புதிய முதலீடுகள் நல்ல லாபம் தரும். குறிப்பாக, பொழுதுபோக்கு அல்லது கலை சார்ந்த முதலீடுகள் பலனளிக்கும். எதிர்பாராத நிதி வரவுகள் கிடைக்க வாய்ப்புண்டு. உங்கள் நிதி மேலாண்மையில் அறிவார்ந்த முடிவுகளை எடுப்பீர்கள். சேமிப்புகள் அதிகரிக்கும். ஆடம்பரச் செலவுகளைத் தவிர்த்து, நீண்டகால திட்டங்களில் கவனம் செலுத்துவீர்கள்.",
    "finance_en": "Your financial situation will be excellent. New investments will yield good profits. In particular, entertainment or art-related investments will be beneficial. There is a possibility of unexpected financial gains. You will make wise decisions in your financial management. Savings will increase. You will avoid luxury expenses and focus on long-term plans.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் மகிழ்ச்சியும், உற்சாகமும் நிறைந்திருக்கும். சுறுசுறுப்புடன் அன்றாடப் பணிகளில் ஈடுபடுவீர்கள். சத்தான உணவு மற்றும் போதுமான ஓய்வு உங்கள் ஆற்றலை மேம்படுத்தும். மன அழுத்தத்தைக் குறைத்து, நேர்மறை எண்ணங்களுடன் செயல்படுவீர்கள். உடல் சோர்வு நீங்கி, புத்துணர்வு பெறுவீர்கள்.",
    "health_en": "Your physical health will be stable. Your mind will be filled with joy and enthusiasm. You will engage in daily tasks with agility. Nutritious food and adequate rest will enhance your energy. You will reduce stress and act with positive thoughts. Physical fatigue will dissipate, and you will feel rejuvenated.",
    "lucky_number": "1",
    "lucky_color_ta": "பொன்நிறம்",
    "lucky_color_en": "Golden"
  },
  {
    "sign_ta": "கன்னி",
    "sign_en": "Virgo",
    "date": "12-02-2026",
    "prediction_ta": "குரு பகவானின் ஆதிக்கம் நிறைந்த இந்த வியாழக்கிழமையில், கன்னி ராசிக்காரர்களே, உங்கள் வாழ்வில் ஒழுங்குமுறையும், சேவையுணர்வும் மேலோங்கும். குருவின் அருளால், நீங்கள் எடுக்கும் ஒவ்வொரு செயலிலும் துல்லியமும், வெற்றியும் குடிகொள்ளும். உங்கள் பகுப்பாய்வுத் திறனும், விவரங்களை கவனிக்கும் ஆற்றலும் இத்தினத்தில் சிறப்பாக வெளிப்படும். பணியிடத்தில் உங்கள் பங்களிப்பு மேலதிகாரிகளால் பாராட்டப்படும். புதிய பொறுப்புகளை திறம்பட கையாள்வீர்கள். உங்களின் துல்லியமான அணுகுமுறை பல சிக்கல்களைத் தீர்க்க உதவும். சக ஊழியர்களுடன் இணக்கமான உறவு நீடிக்கும். புதிய நுட்பங்களைக் கற்றுக்கொண்டு முன்னேறுவீர்கள். உங்கள் சேவை மனப்பான்மை சமூகத்தில் நல்ல பெயரை ஈட்டித் தரும். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகளும் உண்டாகலாம், இது உங்களுக்கு மனநிறைவைத் தரும். கல்வித் துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் அமையும். ஆராய்ச்சி மற்றும் உயர்கல்வித் துறைகளில் இருப்பவர்கள் சிறப்பான முன்னேற்றம் காண்பார்கள். புதிய அறிவைப் பெறுவதிலும், இருக்கும் அறிவைப் பிறருடன் பகிர்ந்து கொள்வதிலும் ஆர்வம் கொள்வீர்கள். உங்கள் அன்றாட வாழ்க்கை மற்றும் ஆரோக்கியத்தில் கவனம் செலுத்துவீர்கள். புதிய சுகாதாரப் பழக்கவழக்கங்களை அறிமுகப்படுத்துவீர்கள். சரியான உணவு மற்றும் உடற்பயிற்சிகளை மேற்கொள்வதன் மூலம் உடல் நலனை மேம்படுத்துவீர்கள். மன அழுத்தத்தைக் குறைத்து, அமைதியான மனநிலையுடன் செயல்படுவீர்கள். கடந்த காலத்தில் ஏற்பட்ட சில மனக் கசப்புகள் நீங்கி, உறவுகளில் புதிய அத்தியாயம் தொடங்கும். குடும்பத்தில் சுப காரியங்கள் நடைபெறுவதற்கான வாய்ப்புகள் உண்டாகும். திருமணம், குழந்தைப்பேறு போன்ற மகிழ்ச்சியான செய்திகள் உங்களைத் தேடி வரலாம். உங்கள் சமூக வட்டாரம் விரிவடையும். புதிய நண்பர்களைச் சந்திப்பீர்கள். அவர்களின் ஆதரவு உங்களுக்குப் பல வழிகளிலும் உதவும். கலை மற்றும் கலாச்சார நிகழ்வுகளில் பங்கேற்பது மனதிற்கு உற்சாகத்தைத் தரும். குருவின் அருளால், உங்கள் சிந்தனையில் தெளிவு பிறக்கும். எந்த ஒரு செயலிலும் அவசரப்படாமல், நிதானமாகச் சிந்தித்து முடிவெடுப்பீர்கள். இது உங்களுக்குப் பல நன்மைகளைக் கொண்டுவரும். மூத்தவர்களின் ஆலோசனைகளைப் பெறுவது கூடுதல் பலம் சேர்க்கும். உங்கள் எதிர்காலத்திற்கான ஆழமான திட்டமிடல்களைச் செய்வதற்கு இது ஒரு சிறந்த நாளாகும். ஆன்மீகப் பயணங்கள் அல்லது புனிதத் தலங்களுக்குச் செல்வதற்கான வாய்ப்புகள் உண்டாகலாம். இது உங்கள் மனதிற்கு அமைதியையும், புத்துணர்வையும் அளிக்கும். கடந்த காலத் தவறுகளிலிருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவதற்கான சிந்தனைகள் மேலோங்கும். உங்களது தன்னம்பிக்கையும், மன உறுதியும் பல மடங்கு அதிகரிக்கும். ஆரோக்கியத்தின் மீது கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் மற்றும் மிதமான உடற்பயிற்சிகள் உங்கள் உடல் நலனை மேம்படுத்தும். மன அழுத்தம் இன்றி வாழ முயற்சிப்பீர்கள். நேர்மறை எண்ணங்கள் நிறைந்ததாக உங்கள் நாள் அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். குரு பகவான் உங்கள் வாழ்வில் அனைத்து செல்வங்களையும், நலன்களையும் கொண்டு வந்து சேர்ப்பார். இதனால், உங்கள் வாழ்க்கை ஒரு புதிய பரிமாணத்தை அடையும். சமூகத்தில் உங்கள் நிலை உயரும். மக்கள் மத்தியில் உங்கள் மீதான மதிப்பும் மரியாதையும் அதிகரிக்கும். உங்களின் நற்குணங்கள் எல்லோராலும் போற்றப்படும். புதிய சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். தடைகள் அனைத்தும் விலகி, வெற்றிப்பாதையில் நீங்கள் நடைபோடுவீர்கள். மொத்தத்தில், இது ஒரு அற்புதமான நாளாக அமையும்.",
    "prediction_en": "On this Thursday, ruled by Jupiter, Virgo natives will experience a predominance of order and service-mindedness in your life. With Jupiter's blessings, precision and success will prevail in every action you undertake. Your analytical skills and attention to detail will be prominently displayed on this day. Your contributions in the workplace will be appreciated by superiors. You will skillfully handle new responsibilities. Your meticulous approach will help solve many problems. Harmonious relationships with colleagues will continue. You will learn new techniques and progress. Your service-oriented attitude will earn you a good name in society. Opportunities to engage in social service may also arise, bringing you immense satisfaction. Those in the field of education will find new opportunities. Individuals in research and higher education will see significant progress. You will be keen on acquiring new knowledge and sharing existing knowledge with others. You will focus on your daily life and health. You will introduce new health habits. You will improve your well-being by adopting proper eating habits and exercises. You will reduce stress and act with a calm state of mind. Some past emotional bitterness will dissipate, and a new chapter in relationships will begin. Opportunities for auspicious events in the family will arise. Joyful news such as marriage or childbirth may come your way. Your social circle will expand. You will meet new friends. Their support will help you in many ways. Participating in arts and cultural events will invigorate your mind. With Jupiter's grace, clarity will emerge in your thoughts. You will make decisions calmly and thoughtfully, without haste in any matter. This will bring you many benefits. Seeking advice from elders will add extra strength. This is an excellent day for making profound plans for your future. Opportunities for spiritual journeys or visiting sacred places may arise. This will bring peace and rejuvenation to your mind. Thoughts of learning from past mistakes and refining the future will be prominent. Your self-confidence and mental fortitude will increase manifold. It is essential to pay attention to your health. Proper eating habits and moderate exercises will enhance your well-being. You will strive to live without stress. Your day will be filled with positive thoughts. All your efforts will be successful. Jupiter will bring all wealth and welfare into your life. Consequently, your life will enter a new dimension. Your position in society will rise. Your respect and regard among people will increase. Your good qualities will be praised by everyone. You will be ready to face new challenges. All obstacles will be removed, and you will walk on the path of victory. Overall, this will be a wonderful day.",
    "career_ta": "உங்கள் பணியில் துல்லியமும், அர்ப்பணிப்பும் மேலோங்கும். புதிய திட்டங்களில் நுணுக்கமான பகுப்பாய்வு மூலம் வெற்றியடைவீர்கள். உங்கள் சேவை மனப்பான்மை அங்கீகரிக்கப்படும். சக ஊழியர்களுடன் இணக்கமான உறவு நீடிக்கும். புதிய திறன்களைக் கற்றுக்கொண்டு உங்கள் வேலையை மேம்படுத்துவீர்கள். பணியிடத்தில் உங்கள் மதிப்பு உயரும். உற்பத்தித்திறன் அதிகரிக்கும்.",
    "career_en": "Precision and dedication will prevail in your work. You will succeed in new projects through meticulous analysis. Your service-oriented attitude will be recognized. Harmonious relationships with colleagues will continue. You will learn new skills and improve your work. Your value in the workplace will increase. Productivity will rise.",
    "finance_ta": "உங்கள் நிதி மேலாண்மையில் நிதானமும், கவனமும் மேலோங்கும். செலவுகளைக் கட்டுப்படுத்தி, சேமிப்பை அதிகரிப்பீர்கள். சிறு முதலீடுகள் நல்ல பலன் தரும். நிதி சம்பந்தப்பட்ட விஷயங்களில் அறிவார்ந்த முடிவுகளை எடுப்பீர்கள். நீண்டகால நிதித் திட்டங்களில் கவனம் செலுத்துவீர்கள். எதிர்பாராத நிதி வரவுகள் கிடைக்க வாய்ப்புண்டு.",
    "finance_en": "Prudence and attention will prevail in your financial management. You will control expenses and increase savings. Small investments will yield good results. You will make wise decisions regarding financial matters. You will focus on long-term financial plans. There is a possibility of unexpected financial gains.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். புதிய சுகாதாரப் பழக்கவழக்கங்களை அறிமுகப்படுத்துவீர்கள். சரியான உணவு மற்றும் உடற்பயிற்சிகளை மேற்கொள்வதன் மூலம் உடல் நலனை மேம்படுத்துவீர்கள். மன அழுத்தத்தைக் குறைத்து, அமைதியான மனநிலையுடன் செயல்படுவீர்கள். உடல் சோர்வு நீங்கி, புத்துணர்வு பெறுவீர்கள். தினசரி நடைப்பயிற்சி நன்மை பயக்கும்.",
    "health_en": "Your physical health will be excellent. You will introduce new health habits. You will improve your well-being by adopting proper eating habits and exercises. You will reduce stress and act with a calm state of mind. Physical fatigue will dissipate, and you will feel rejuvenated. Daily walks will be beneficial.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "12-02-2026",
    "prediction_ta": "குரு பகவானின் ஆதிக்கம் நிறைந்த இந்த வியாழக்கிழமையில், துலாம் ராசிக்காரர்களே, உங்கள் வாழ்வில் சமநிலையும், இணக்கமான உறவுகளும் மேலோங்கும். குருவின் அருளால், நீங்கள் எடுக்கும் ஒவ்வொரு செயலிலும் நீதியும், நேர்மையும் குடிகொள்ளும். உறவுகளிலும், சமூகத் தொடர்புகளிலும் புதிய பரிமாணங்களைக் காண்பீர்கள். இத்தினம் உங்கள் இணக்கமான அணுகுமுறையையும், அனைவரையும் அரவணைத்துச் செல்லும் பண்பையும் வெளிப்படுத்தும். புதிய கூட்டாண்மைகள் உருவாகும். தற்போதுள்ள உறவுகள் மேலும் வலுப்பெறும். திருமணமானவர்களுக்குள் புரிதல் அதிகரிக்கும். சமூகத்தில் உங்கள் மதிப்பும், மரியாதையும் உயரும். புதிய பொறுப்புகள் உங்களைத் தேடி வரும். அவற்றை மிகுந்த நம்பிக்கையுடன் ஏற்றுக்கொண்டு, உங்கள் திறமையை வெளிப்படுத்துவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகளும் உண்டாகலாம், இது உங்களுக்கு மனநிறைவைத் தரும். கல்வித் துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் அமையும். ஆராய்ச்சி மற்றும் உயர்கல்வித் துறைகளில் இருப்பவர்கள் சிறப்பான முன்னேற்றம் காண்பார்கள். புதிய அறிவைப் பெறுவதிலும், இருக்கும் அறிவைப் பிறருடன் பகிர்ந்து கொள்வதிலும் ஆர்வம் கொள்வீர்கள். உங்கள் உள்ளுணர்வின் வழிகாட்டுதலைப் பின்பற்றுவதன் மூலம், சரியான பாதையில் பயணிக்கலாம். குடும்பத்தில் அமைதியும், சுபிட்சமும் பெருகும். உறவினர்கள் மற்றும் நண்பர்களுடன் இணக்கமான சூழ்நிலை நிலவும். எந்த ஒரு மனக் கசப்புகளும் அகன்று, நல்லிணக்கம் மேலோங்கும். புதிய உறவுகள் உருவாகவும், பழைய உறவுகள் வலுப்பெறவும் வாய்ப்புகள் உண்டு. குறிப்பாக, உங்கள் சமூக வட்டாரம் விரிவடையும். புதிய நபர்களின் அறிமுகம் கிடைக்கும். அவர்களுடனான தொடர்புகள் உங்கள் எதிர்கால வளர்ச்சிக்கு உதவும். தரும சிந்தனைகள் மேலோங்கும். பிறருக்கு உதவி செய்வதில் மனநிறைவு காண்பீர்கள். உங்கள் மனதின் ஆழத்தில் உள்ள கருணையும், இரக்கமும் வெளிப்படும். இத்தகைய செயல்கள் உங்களுக்கு புண்ணியத்தையும், நற்பெயரையும் ஈட்டித் தரும். குருவின் அருளால், உங்கள் சிந்தனையில் தெளிவு பிறக்கும். எந்த ஒரு செயலிலும் அவசரப்படாமல், நிதானமாகச் சிந்தித்து முடிவெடுப்பீர்கள். இது உங்களுக்குப் பல நன்மைகளைக் கொண்டுவரும். மூத்தவர்களின் ஆலோசனைகளைப் பெறுவது கூடுதல் பலம் சேர்க்கும். உங்கள் எதிர்காலத்திற்கான ஆழமான திட்டமிடல்களைச் செய்வதற்கு இது ஒரு சிறந்த நாளாகும். ஆன்மீகப் பயணங்கள் அல்லது புனிதத் தலங்களுக்குச் செல்வதற்கான வாய்ப்புகள் உண்டாகலாம். இது உங்கள் மனதிற்கு அமைதியையும், புத்துணர்வையும் அளிக்கும். கடந்த காலத் தவறுகளிலிருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவதற்கான சிந்தனைகள் மேலோங்கும். உங்களது தன்னம்பிக்கையும், மன உறுதியும் பல மடங்கு அதிகரிக்கும். ஆரோக்கியத்தின் மீது கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் மற்றும் மிதமான உடற்பயிற்சிகள் உங்கள் உடல் நலனை மேம்படுத்தும். மன அழுத்தம் இன்றி வாழ முயற்சிப்பீர்கள். நேர்மறை எண்ணங்கள் நிறைந்ததாக உங்கள் நாள் அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். குரு பகவான் உங்கள் வாழ்வில் அனைத்து செல்வங்களையும், நலன்களையும் கொண்டு வந்து சேர்ப்பார். இதனால், உங்கள் வாழ்க்கை ஒரு புதிய பரிமாணத்தை அடையும். மக்கள் மத்தியில் உங்கள் மீதான மதிப்பும் மரியாதையும் அதிகரிக்கும். உங்களின் நற்குணங்கள் எல்லோராலும் போற்றப்படும். புதிய சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். தடைகள் அனைத்தும் விலகி, வெற்றிப்பாதையில் நீங்கள் நடைபோடுவீர்கள். மொத்தத்தில், இது ஒரு அற்புதமான நாளாக அமையும்.",
    "prediction_en": "On this Thursday, ruled by Jupiter, Libra natives will experience a predominance of balance and harmonious relationships in your life. With Jupiter's blessings, justice and integrity will prevail in every action you undertake. You will see new dimensions in relationships and social connections. This day will highlight your harmonious approach and your ability to embrace everyone. New partnerships will form. Existing relationships will strengthen further. Understanding among married couples will increase. Your respect and standing in society will rise. New responsibilities will come seeking you. You will accept them with great confidence and demonstrate your abilities. Opportunities to engage in social service may also arise, bringing you immense satisfaction. Those in the field of education will find new opportunities. Individuals in research and higher education will see significant progress. You will be keen on acquiring new knowledge and sharing existing knowledge with others. By following your intuition, you can journey on the right path. Peace and prosperity will flourish in the family. A harmonious atmosphere will prevail among relatives and friends. Any emotional bitterness will dissipate, and goodwill will predominate. There are chances for new relationships to form and old ones to strengthen. Specifically, your social circle will expand. You will meet new people. Your connections with them will contribute to your future growth. Thoughts of charity will be prominent. You will find contentment in helping others. Your inherent kindness and compassion will be expressed. Such actions will earn you merit and a good reputation. With Jupiter's grace, clarity will emerge in your thoughts. You will make decisions calmly and thoughtfully, without haste in any matter. This will bring you many benefits. Seeking advice from elders will add extra strength. This is an excellent day for making profound plans for your future. Opportunities for spiritual journeys or visiting sacred places may arise. This will bring peace and rejuvenation to your mind. Thoughts of learning from past mistakes and refining the future will be prominent. Your self-confidence and mental fortitude will increase manifold. It is essential to pay attention to your health. Proper eating habits and moderate exercises will enhance your well-being. You will strive to live without stress. Your day will be filled with positive thoughts. All your efforts will be successful. Jupiter will bring all wealth and welfare into your life. Consequently, your life will enter a new dimension. Your respect and regard among people will increase. Your good qualities will be praised by everyone. You will be ready to face new challenges. All obstacles will be removed, and you will walk on the path of victory. Overall, this will be a wonderful day.",
    "career_ta": "உங்கள் பணியிடத்தில் இணக்கமான சூழல் உருவாகும். கூட்டாண்மை முயற்சிகள் வெற்றி பெறும். சக ஊழியர்களுடன் நல்லுறவு நீடிக்கும். உங்கள் சமாதான அணுகுமுறை பல சிக்கல்களைத் தீர்க்க உதவும். புதிய ஒப்பந்தங்கள் உருவாகும். உங்கள் திறமைகள் அங்கீகரிக்கப்படும். கலை மற்றும் வடிவமைப்புத் துறைகளில் இருப்பவர்களுக்கு சிறப்பான வாய்ப்புகள் கிடைக்கும்.",
    "career_en": "A harmonious environment will emerge in your workplace. Partnership ventures will succeed. Good relations with colleagues will continue. Your conciliatory approach will help resolve many issues. New contracts will emerge. Your talents will be recognized. Those in art and design fields will find excellent opportunities.",
    "finance_ta": "உங்கள் நிதி நிலைமை சீராக இருக்கும். கூட்டு முதலீடுகள் அல்லது கூட்டாண்மை மூலம் நிதி ஆதாயம் கிடைக்கும். செலவுகளைக் கட்டுப்படுத்தி, சேமிப்பை அதிகரிப்பீர்கள். நிதி சம்பந்தப்பட்ட விஷயங்களில் அறிவார்ந்த முடிவுகளை எடுப்பீர்கள். குடும்பத்தின் நிதிச் சூழல் மேம்படும். வெளிப்படையான நிதிப் பரிமாற்றங்கள் நன்மை பயக்கும்.",
    "finance_en": "Your financial situation will be stable. Financial gains will come through joint investments or partnerships. You will control expenses and increase savings. You will make wise decisions regarding financial matters. The financial situation of the family will improve. Transparent financial transactions will be beneficial.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதிக்கு முக்கியத்துவம் கொடுப்பீர்கள். சரியான உணவுப் பழக்கவழக்கங்கள் மற்றும் மிதமான உடற்பயிற்சிகள் உங்கள் உடல் நலனை மேம்படுத்தும். சமூக நடவடிக்கைகள் மற்றும் நல்லுறவுகள் மனதிற்குப் புத்துணர்ச்சி அளிக்கும். மன அழுத்தம் குறைந்து, உற்சாகத்துடன் இருப்பீர்கள்.",
    "health_en": "Your physical health will be excellent. You will prioritize mental peace. Proper eating habits and moderate exercises will enhance your well-being. Social activities and good relationships will rejuvenate your mind. Stress will reduce, and you will be enthusiastic.",
    "lucky_number": "6",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "விருச்சிகம்",
    "sign_en": "Scorpio",
    "date": "12-02-2026",
    "prediction_ta": "குரு பகவானின் ஆதிக்கம் நிறைந்த இந்த வியாழக்கிழமையில், விருச்சிக ராசிக்காரர்களே, உங்கள் வாழ்வில் ஆழ்ந்த மாற்றங்களும், உள்ளுணர்வு சார்ந்த முன்னேற்றங்களும் மேலோங்கும். குருவின் அருளால், நீங்கள் எடுக்கும் ஒவ்வொரு செயலிலும் ஞானமும், தெளிவும் நிறைந்து காணப்படும். மறைந்திருக்கும் உண்மைகளைக் கண்டறியும் ஆற்றல் உங்களுக்கு அதிகரிக்கும். இத்தினம் உங்கள் தனிப்பட்ட மற்றும் தொழில் வாழ்க்கையில் புதிய பரிணாமங்களைக் கொண்டுவரும். ஆராய்ச்சிகள் மற்றும் சிக்கலான விஷயங்களில் ஈடுபட இது ஒரு சிறந்த நாளாகும். உங்கள் உள்ளுணர்வின் வழிகாட்டுதலைப் பின்பற்றுவதன் மூலம், சரியான பாதையில் பயணிக்கலாம். புதிய சவால்களை ஏற்றுக்கொள்ளவும், அவற்றிலிருந்து கற்றுக்கொண்டு வளரவும் இது ஒரு அற்புதமான தருணமாகும். குடும்பத்தில் அமைதியும், சுபிட்சமும் பெருகும். உறவினர்கள் மற்றும் நண்பர்களுடன் இணக்கமான சூழ்நிலை நிலவும். எந்த ஒரு மனக் கசப்புகளும் அகன்று, நல்லிணக்கம் மேலோங்கும். புதிய உறவுகள் உருவாகவும், பழைய உறவுகள் வலுப்பெறவும் வாய்ப்புகள் உண்டு. குறிப்பாக, உங்கள் சமூக வட்டாரம் விரிவடையும். புதிய நபர்களின் அறிமுகம் கிடைக்கும். அவர்களுடனான தொடர்புகள் உங்கள் எதிர்கால வளர்ச்சிக்கு உதவும். தரும சிந்தனைகள் மேலோங்கும். பிறருக்கு உதவி செய்வதில் மனநிறைவு காண்பீர்கள். உங்கள் மனதின் ஆழத்தில் உள்ள கருணையும், இரக்கமும் வெளிப்படும். இத்தகைய செயல்கள் உங்களுக்கு புண்ணியத்தையும், நற்பெயரையும் ஈட்டித் தரும். குருவின் அருளால், உங்கள் சிந்தனையில் தெளிவு பிறக்கும். எந்த ஒரு செயலிலும் அவசரப்படாமல், நிதானமாகச் சிந்தித்து முடிவெடுப்பீர்கள். இது உங்களுக்குப் பல நன்மைகளைக் கொண்டுவரும். மூத்தவர்களின் ஆலோசனைகளைப் பெறுவது கூடுதல் பலம் சேர்க்கும். உங்கள் எதிர்காலத்திற்கான ஆழமான திட்டமிடல்களைச் செய்வதற்கு இது ஒரு சிறந்த நாளாகும். கல்வித் துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் அமையும். ஆராய்ச்சி மற்றும் உயர்கல்வித் துறைகளில் இருப்பவர்கள் சிறப்பான முன்னேற்றம் காண்பார்கள். புதிய அறிவைப் பெறுவதிலும், இருக்கும் அறிவைப் பிறருடன் பகிர்ந்து கொள்வதிலும் ஆர்வம் கொள்வீர்கள். ஆன்மீகப் பயணங்கள் அல்லது புனிதத் தலங்களுக்குச் செல்வதற்கான வாய்ப்புகள் உண்டாகலாம். இது உங்கள் மனதிற்கு அமைதியையும், புத்துணர்வையும் அளிக்கும். கடந்த காலத் தவறுகளிலிருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவதற்கான சிந்தனைகள் மேலோங்கும். உங்களது தன்னம்பிக்கையும், மன உறுதியும் பல மடங்கு அதிகரிக்கும். ஆரோக்கியத்தின் மீது கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் மற்றும் மிதமான உடற்பயிற்சிகள் உங்கள் உடல் நலனை மேம்படுத்தும். மன அழுத்தம் இன்றி வாழ முயற்சிப்பீர்கள். நேர்மறை எண்ணங்கள் நிறைந்ததாக உங்கள் நாள் அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். குரு பகவான் உங்கள் வாழ்வில் அனைத்து செல்வங்களையும், நலன்களையும் கொண்டு வந்து சேர்ப்பார். இதனால், உங்கள் வாழ்க்கை ஒரு புதிய பரிமாணத்தை அடையும். சமூகத்தில் உங்கள் நிலை உயரும். மக்கள் மத்தியில் உங்கள் மீதான மதிப்பும் மரியாதையும் அதிகரிக்கும். உங்களின் நற்குணங்கள் எல்லோராலும் போற்றப்படும். புதிய சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். தடைகள் அனைத்தும் விலகி, வெற்றிப்பாதையில் நீங்கள் நடைபோடுவீர்கள். மொத்தத்தில், இது ஒரு அற்புதமான நாளாக அமையும்.",
    "prediction_en": "On this Thursday, ruled by Jupiter, Scorpio natives will experience profound transformations and intuitive progress predominantly in your life. With Jupiter's blessings, wisdom and clarity will fill every action you undertake. Your ability to uncover hidden truths will increase. This day will bring new dimensions to your personal and professional life. This is an excellent day to engage in research and complex matters. By following your intuition, you can journey on the right path. This is a wonderful moment to accept new challenges, learn from them, and grow. Peace and prosperity will flourish in the family. A harmonious atmosphere will prevail among relatives and friends. Any emotional bitterness will dissipate, and goodwill will predominate. There are chances for new relationships to form and old ones to strengthen. Specifically, your social circle will expand. You will meet new people. Your connections with them will contribute to your future growth. Thoughts of charity will be prominent. You will find contentment in helping others. Your inherent kindness and compassion will be expressed. Such actions will earn you merit and a good reputation. With Jupiter's grace, clarity will emerge in your thoughts. You will make decisions calmly and thoughtfully, without haste in any matter. This will bring you many benefits. Seeking advice from elders will add extra strength. This is an excellent day for making profound plans for your future. Those in the field of education will find new opportunities. Individuals in research and higher education will see significant progress. You will be keen on acquiring new knowledge and sharing existing knowledge with others. Opportunities for spiritual journeys or visiting sacred places may arise. This will bring peace and rejuvenation to your mind. Thoughts of learning from past mistakes and refining the future will be prominent. Your self-confidence and mental fortitude will increase manifold. It is essential to pay attention to your health. Proper eating habits and moderate exercises will enhance your well-being. You will strive to live without stress. Your day will be filled with positive thoughts. All your efforts will be successful. Jupiter will bring all wealth and welfare into your life. Consequently, your life will enter a new dimension. Your position in society will rise. Your respect and regard among people will increase. Your good qualities will be praised by everyone. You will be ready to face new challenges. All obstacles will be removed, and you will walk on the path of victory. Overall, this will be a wonderful day.",
    "career_ta": "உங்கள் பணியில் ஆழ்ந்த ஆராய்ச்சியும், மூலோபாயத் திட்டமிடலும் மேலோங்கும். புதிய திட்டங்களில் உங்கள் உள்ளுணர்வின் வழிகாட்டுதலைப் பின்பற்றி வெற்றியடைவீர்கள். சிக்கலான பிரச்சனைகளுக்குத் தீர்வு காண்பதில் உங்கள் திறமை வெளிப்படும். மேலதிகாரிகள் உங்கள் திறமைகளை அங்கீகரிப்பார்கள். புதிய வாய்ப்புகள் உங்களைத் தேடி வரும். கூட்டு முயற்சிகளில் வெற்றி கிட்டும். உங்கள் நுண்ணறிவு சிறப்பாக செயல்படும்.",
    "career_en": "Deep research and strategic planning will prevail in your work. You will succeed in new projects by following your intuition. Your ability to solve complex problems will be evident. Superiors will recognize your talents. New opportunities will come your way. Success will be achieved in collaborative ventures. Your intuition will function exceptionally well.",
    "finance_ta": "உங்கள் நிதி நிலைமை மேம்படும். மறைமுக வருமான வழிகள் உருவாக வாய்ப்புள்ளது. புதிய முதலீடுகளில் அறிவார்ந்த முடிவுகளை எடுப்பீர்கள். சேமிப்புகள் அதிகரிக்கும். கூட்டாண்மை மூலம் நிதி ஆதாயம் கிடைக்கும். சொத்து சம்பந்தப்பட்ட விஷயங்களில் லாபம் உண்டாகும். நிதானமான அணுகுமுறை நிதிச் செழிப்பை உறுதி செய்யும்.",
    "finance_en": "Your financial situation will improve. Hidden income streams may emerge. You will make wise decisions in new investments. Savings will increase. Financial gains will come through partnerships. Profits will arise in property-related matters. A measured approach will ensure financial prosperity.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் புதிய உற்சாகமும், நேர்மறை எண்ணங்களும் நிறைந்திருக்கும். சரியான உணவுப் பழக்கவழக்கங்கள் மற்றும் மிதமான உடற்பயிற்சிகள் உங்கள் உடல் நலனை மேம்படுத்தும். மன அழுத்தத்தைக் குறைத்து, அமைதியான மனநிலையுடன் செயல்படுவீர்கள். உடல் சோர்வு நீங்கி, புத்துணர்வு பெறுவீர்கள். தியானம் செய்வது நன்மை பயக்கும்.",
    "health_en": "Your physical health will be stable. Your mind will be filled with new enthusiasm and positive thoughts. Proper eating habits and moderate exercises will enhance your well-being. You will reduce stress and operate with a calm state of mind. Physical fatigue will dissipate, and you will feel rejuvenated. Meditation will be beneficial.",
    "lucky_number": "9",
    "lucky_color_ta": "சிவப்பு",
    "lucky_color_en": "Red"
  },
  {
    "sign_ta": "தனுசு",
    "sign_en": "Sagittarius",
    "date": "12-02-2026",
    "prediction_ta": "குரு பகவானின் ஆதிக்கம் நிறைந்த இந்த வியாழக்கிழமையில், தனுசு ராசிக்காரர்களே, உங்கள் வாழ்வில் அறிவு, ஆன்மீகம் மற்றும் பயணங்கள் சார்ந்த முன்னேற்றங்கள் மேலோங்கும். குருவின் அருளால், நீங்கள் எடுக்கும் ஒவ்வொரு முயற்சியிலும் தெளிவும், வெற்றியும் குடிகொள்ளும். புதிய இடங்களுக்குப் பயணம் செய்வதற்கான வாய்ப்புகள் உண்டாகும். இது உங்கள் அறிவையும், அனுபவத்தையும் விரிவுபடுத்தும். உயர்கல்வி மற்றும் ஆராய்ச்சிக் கல்வித் துறைகளில் இருப்பவர்களுக்கு சிறப்பான அங்கீகாரம் கிடைக்கும். புதிய அறிவைப் பெறுவதிலும், இருக்கும் அறிவைப் பிறருடன் பகிர்ந்து கொள்வதிலும் ஆர்வம் கொள்வீர்கள். ஆன்மீகப் பயணங்கள் அல்லது புனிதத் தலங்களுக்குச் செல்வதற்கான வாய்ப்புகள் உண்டாகலாம். இது உங்கள் மனதிற்கு அமைதியையும், புத்துணர்வையும் அளிக்கும். தத்துவார்த்த சிந்தனைகள் மேலோங்கும். வாழ்க்கையின் அர்த்தம் குறித்த தேடல்கள் அதிகரிக்கும். இதன் மூலம் புதிய புரிதல்களைப் பெறுவீர்கள். புதிய சவால்களை ஏற்றுக்கொள்ளவும், அவற்றிலிருந்து கற்றுக்கொண்டு வளரவும் இது ஒரு அற்புதமான தருணமாகும். உங்கள் தன்னம்பிக்கையும், மன உறுதியும் பல மடங்கு அதிகரிக்கும். சமூகத்தில் உங்கள் மதிப்பும், மரியாதையும் உயரும். புதிய பொறுப்புகள் உங்களைத் தேடி வரும். அவற்றை மிகுந்த நம்பிக்கையுடன் ஏற்றுக்கொண்டு, உங்கள் திறமையை வெளிப்படுத்துவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகளும் உண்டாகலாம், இது உங்களுக்கு மனநிறைவைத் தரும். குடும்பத்தில் அமைதியும், சுபிட்சமும் பெருகும். உறவினர்கள் மற்றும் நண்பர்களுடன் இணக்கமான சூழ்நிலை நிலவும். எந்த ஒரு மனக் கசப்புகளும் அகன்று, நல்லிணக்கம் மேலோங்கும். புதிய உறவுகள் உருவாகவும், பழைய உறவுகள் வலுப்பெறவும் வாய்ப்புகள் உண்டு. குறிப்பாக, உங்கள் சமூக வட்டாரம் விரிவடையும். புதிய நபர்களின் அறிமுகம் கிடைக்கும். அவர்களுடனான தொடர்புகள் உங்கள் எதிர்கால வளர்ச்சிக்கு உதவும். தரும சிந்தனைகள் மேலோங்கும். பிறருக்கு உதவி செய்வதில் மனநிறைவு காண்பீர்கள். உங்கள் மனதின் ஆழத்தில் உள்ள கருணையும், இரக்கமும் வெளிப்படும். இத்தகைய செயல்கள் உங்களுக்கு புண்ணியத்தையும், நற்பெயரையும் ஈட்டித் தரும். குருவின் அருளால், உங்கள் சிந்தனையில் தெளிவு பிறக்கும். எந்த ஒரு செயலிலும் அவசரப்படாமல், நிதானமாகச் சிந்தித்து முடிவெடுப்பீர்கள். இது உங்களுக்குப் பல நன்மைகளைக் கொண்டுவரும். மூத்தவர்களின் ஆலோசனைகளைப் பெறுவது கூடுதல் பலம் சேர்க்கும். உங்கள் எதிர்காலத்திற்கான ஆழமான திட்டமிடல்களைச் செய்வதற்கு இது ஒரு சிறந்த நாளாகும். கடந்த காலத் தவறுகளிலிருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவதற்கான சிந்தனைகள் மேலோங்கும். ஆரோக்கியத்தின் மீது கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் மற்றும் மிதமான உடற்பயிற்சிகள் உங்கள் உடல் நலனை மேம்படுத்தும். மன அழுத்தம் இன்றி வாழ முயற்சிப்பீர்கள். நேர்மறை எண்ணங்கள் நிறைந்ததாக உங்கள் நாள் அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். குரு பகவான் உங்கள் வாழ்வில் அனைத்து செல்வங்களையும், நலன்களையும் கொண்டு வந்து சேர்ப்பார். இதனால், உங்கள் வாழ்க்கை ஒரு புதிய பரிமாணத்தை அடையும். மக்கள் மத்தியில் உங்கள் மீதான மதிப்பும் மரியாதையும் அதிகரிக்கும். உங்களின் நற்குணங்கள் எல்லோராலும் போற்றப்படும். தடைகள் அனைத்தும் விலகி, வெற்றிப்பாதையில் நீங்கள் நடைபோடுவீர்கள். மொத்தத்தில், இது ஒரு அற்புதமான நாளாக அமையும்.",
    "prediction_en": "On this Thursday, ruled by Jupiter, Sagittarius natives will experience a predominance of advancements related to knowledge, spirituality, and travel in your life. With Jupiter's blessings, clarity and success will prevail in every endeavor you undertake. Opportunities for traveling to new places will arise, which will expand your knowledge and experience. Those in higher education and research fields will receive special recognition. You will be keen on acquiring new knowledge and sharing existing knowledge with others. Opportunities for spiritual journeys or visiting sacred places may arise, bringing peace and rejuvenation to your mind. Philosophical thoughts will be prominent. The quest for the meaning of life will increase, leading to new understandings. This is a wonderful moment to accept new challenges, learn from them, and grow. Your self-confidence and mental fortitude will increase manifold. Your respect and standing in society will rise. New responsibilities will come seeking you. You will accept them with great confidence and demonstrate your abilities. Opportunities to engage in social service may also arise, bringing you immense satisfaction. Peace and prosperity will flourish in the family. A harmonious atmosphere will prevail among relatives and friends. Any emotional bitterness will dissipate, and goodwill will predominate. There are chances for new relationships to form and old ones to strengthen. Specifically, your social circle will expand. You will meet new people. Your connections with them will contribute to your future growth. Thoughts of charity will be prominent. You will find contentment in helping others. Your inherent kindness and compassion will be expressed. Such actions will earn you merit and a good reputation. With Jupiter's grace, clarity will emerge in your thoughts. You will make decisions calmly and thoughtfully, without haste in any matter. This will bring you many benefits. Seeking advice from elders will add extra strength. This is an excellent day for making profound plans for your future. Thoughts of learning from past mistakes and refining the future will be prominent. It is essential to pay attention to your health. Proper eating habits and moderate exercises will enhance your well-being. You will strive to live without stress. Your day will be filled with positive thoughts. All your efforts will be successful. Jupiter will bring all wealth and welfare into your life. Consequently, your life will enter a new dimension. Your respect and regard among people will increase. Your good qualities will be praised by everyone. All obstacles will be removed, and you will walk on the path of victory. Overall, this will be a wonderful day.",
    "career_ta": "உங்கள் பணியில் புதிய வாய்ப்புகள் உருவாகும். பயணங்கள் சார்ந்த அல்லது வெளிநாட்டுத் தொடர்புகள் கொண்ட தொழில்களில் சிறப்பான முன்னேற்றம் காண்பீர்கள். புதிய திட்டங்களில் ஈடுபடவும், விரிவுபடுத்தவும் இது ஒரு நல்ல நேரம். ஆசிரியர்கள், ஆலோசகர்கள் மற்றும் வழிகாட்டிகளுக்கு சிறப்பான அங்கீகாரம் கிடைக்கும். உங்கள் நேர்மறையான அணுகுமுறை வெற்றியைத் தேடித் தரும்.",
    "career_en": "New opportunities will arise in your career. You will see significant progress in travel-related or international business. This is a good time to engage in new projects and expand. Teachers, consultants, and mentors will receive special recognition. Your positive approach will bring success.",
    "finance_ta": "உங்கள் நிதி நிலைமை சிறப்பாக இருக்கும். வெளிநாட்டுத் தொடர்புகள் மூலமாகவோ அல்லது புதிய முதலீடுகள் மூலமாகவோ நிதி ஆதாயம் கிடைக்கும். தர்ம காரியங்களுக்காகவும், கல்விக்காகவும் செலவு செய்வீர்கள். சேமிப்புகள் அதிகரிக்கும். நிதி சம்பந்தப்பட்ட விஷயங்களில் அறிவார்ந்த முடிவுகளை எடுப்பீர்கள். நீண்டகால முதலீடுகள் நன்மை பயக்கும்.",
    "finance_en": "Your financial situation will be excellent. Financial gains will come through international connections or new investments. You will spend on charitable causes and education. Savings will increase. You will make wise decisions regarding financial matters. Long-term investments will be beneficial.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் மகிழ்ச்சியும், உற்சாகமும் நிறைந்திருக்கும். புதிய இடங்களுக்குப் பயணம் செய்வது உங்கள் மனதிற்குப் புத்துணர்ச்சி அளிக்கும். சத்தான உணவு மற்றும் மிதமான உடற்பயிற்சிகள் உங்கள் ஆற்றலை மேம்படுத்தும். மன அழுத்தத்தைக் குறைத்து, நேர்மறை எண்ணங்களுடன் செயல்படுவீர்கள்.",
    "health_en": "Your physical health will be stable. Your mind will be filled with joy and enthusiasm. Traveling to new places will rejuvenate your mind. Nutritious food and moderate exercises will enhance your energy. You will reduce stress and act with positive thoughts.",
    "lucky_number": "3",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "மகரம்",
    "sign_en": "Capricorn",
    "date": "12-02-2026",
    "prediction_ta": "குரு பகவானின் ஆதிக்கம் நிறைந்த இந்த வியாழக்கிழமையில், மகர ராசிக்காரர்களே, உங்கள் வாழ்வில் ஒழுங்குமுறையும், லட்சியங்களும் மேலோங்கும். குருவின் அருளால், நீங்கள் எடுக்கும் ஒவ்வொரு செயலிலும் ஸ்திரத்தன்மையும், வெற்றியும் குடிகொள்ளும். உங்களது கடின உழைப்பும், அர்ப்பணிப்பும் இத்தினத்தில் சிறப்பான பலன்களைக் கொண்டுவரும். பல ஆண்டுகளாகக் காத்திருந்த கனவுகள் நனவாகத் தொடங்கும். உங்கள் பொருளாதார நிலை மேலும் வலுவடையும். புதிய முதலீடுகளுக்கான வாய்ப்புகள் உண்டாகும். குறிப்பாக, வீடு, நிலம் போன்ற அசையாச் சொத்துகளில் முதலீடு செய்வது மிகுந்த லாபம் தரும். குடும்பத்தில் அமைதியும், சுபிட்சமும் நிறைந்து காணப்படும். கணவன் மனைவி உறவு மேம்படும். ஒருவரையொருவர் புரிந்துகொண்டு செயல்படுவீர்கள். குழந்தைகள் மூலம் மகிழ்ச்சி உண்டாகும். சுப காரியங்கள் பற்றிய பேச்சுவார்த்தைகள் தொடங்கும். புதிய உறவினர்களின் வருகை குடும்பத்தில் மகிழ்ச்சியை அதிகரிக்கும். உங்கள் சமூக வட்டாரம் விரிவடையும். புதிய நண்பர்களைச் சந்திப்பீர்கள். அவர்களின் ஆதரவு உங்களுக்குப் பல வழிகளிலும் உதவும். கலை மற்றும் கலாச்சார நிகழ்வுகளில் பங்கேற்பது மனதிற்கு உற்சாகத்தைத் தரும். குருவின் அருளால், உங்கள் சிந்தனையில் தெளிவு பிறக்கும். எந்த ஒரு செயலிலும் அவசரப்படாமல், நிதானமாகச் சிந்தித்து முடிவெடுப்பீர்கள். இது உங்களுக்குப் பல நன்மைகளைக் கொண்டுவரும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனங்கள் அல்லது புண்ணிய நதிகளில் நீராடுவதற்கான வாய்ப்புகள் உண்டாகலாம். இவை உங்கள் மனதிற்கு அமைதியையும், புத்துணர்வையும் அளிக்கும். கடந்த காலத் தவறுகளிலிருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவதற்கான சிந்தனைகள் மேலோங்கும். உங்கள் தன்னம்பிக்கையும், மன உறுதியும் பல மடங்கு அதிகரிக்கும். ஆரோக்கியத்தின் மீது கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் மற்றும் மிதமான உடற்பயிற்சிகள் உங்கள் உடல் நலனை மேம்படுத்தும். மன அழுத்தம் இன்றி வாழ முயற்சிப்பீர்கள். நேர்மறை எண்ணங்கள் நிறைந்ததாக உங்கள் நாள் அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். குரு பகவான் உங்கள் வாழ்வில் அனைத்து செல்வங்களையும், நலன்களையும் கொண்டு வந்து சேர்ப்பார். இதனால், உங்கள் வாழ்க்கை ஒரு புதிய பரிமாணத்தை அடையும். சமூகத்தில் உங்கள் நிலை உயரும். மக்கள் மத்தியில் உங்கள் மீதான மதிப்பும் மரியாதையும் அதிகரிக்கும். உங்களின் நற்குணங்கள் எல்லோராலும் போற்றப்படும். புதிய சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். தடைகள் அனைத்தும் விலகி, வெற்றிப்பாதையில் நீங்கள் நடைபோடுவீர்கள். மொத்தத்தில், இது ஒரு அற்புதமான நாளாக அமையும். நீண்டகாலமாக நிலுவையிலிருந்த சட்ட விஷயங்கள் உங்களுக்குச் சாதகமாக முடியும். உங்கள் லட்சியங்களை நோக்கி உறுதியுடன் பயணிப்பீர்கள்.",
    "prediction_en": "On this Thursday, ruled by Jupiter, Capricorn natives will experience a predominance of order and ambitions in your life. With Jupiter's blessings, stability and success will prevail in every action you undertake. Your hard work and dedication will bring excellent results on this day. Dreams that you have cherished for many years will begin to materialize. Your economic situation will further strengthen. Opportunities for new investments will arise. In particular, investing in immovable properties like houses and land will yield significant profits. Peace and prosperity will fill your family life. Husband-wife relationships will improve. You will act with mutual understanding. Children will bring joy. Discussions about auspicious events will begin. The arrival of new relatives will increase happiness in the family. Your social circle will expand. You will meet new friends. Their support will help you in many ways. Participating in arts and cultural events will invigorate your mind. With Jupiter's grace, clarity will emerge in your thoughts. You will make decisions calmly and thoughtfully, without haste in any matter. This will bring you many benefits. Spiritual inclination will increase. Opportunities for temple visits or bathing in sacred rivers may arise. These will bring peace and rejuvenation to your mind. Thoughts of learning from past mistakes and refining the future will be prominent. Your self-confidence and mental fortitude will increase manifold. It is essential to pay attention to your health. Proper eating habits and moderate exercises will enhance your well-being. You will strive to live without stress. Your day will be filled with positive thoughts. All your efforts will be successful. Jupiter will bring all wealth and welfare into your life. Consequently, your life will enter a new dimension. Your position in society will rise. Your respect and regard among people will increase. Your good qualities will be praised by everyone. You will be ready to face new challenges. All obstacles will be removed, and you will walk on the path of victory. Overall, this will be a wonderful day. Long-pending legal matters will conclude in your favor. You will firmly proceed towards your ambitions.",
    "career_ta": "உங்கள் பணியில் ஸ்திரத்தன்மை மேலோங்கும். மேலதிகாரிகளால் உங்கள் கடின உழைப்பு அங்கீகரிக்கப்படும். புதிய பொறுப்புகள் உங்களைத் தேடி வரக்கூடும். திட்டமிட்ட செயல்களில் வெற்றியும், பணியிடத்தில் இணக்கமான சூழலும் ஏற்படும். வணிகத்தில் புதிய ஒப்பந்தங்கள் உருவாகும். உங்கள் பொறுமையும், விடாமுயற்சியும் சிறப்பான வெற்றியைத் தேடித் தரும். பதவி உயர்வு கிடைக்க வாய்ப்புண்டு.",
    "career_en": "Stability will prevail in your work. Your hard work will be recognized by superiors. New responsibilities may come your way. Success in planned activities and a harmonious work environment will prevail. New contracts will emerge in business. Your patience and perseverance will bring excellent success. There is a chance for promotion.",
    "finance_ta": "உங்கள் நிதி நிலைமை மிகவும் சிறப்பாக இருக்கும். சேமிப்பு அதிகரிக்கும். புதிய முதலீடுகளுக்கான வாய்ப்புகள் உண்டாகும். குறிப்பாக, நீண்ட கால முதலீடுகள் நல்ல லாபம் தரும். குடும்பத்திற்கான அத்தியாவசியத் தேவைகளை பூர்த்தி செய்வீர்கள். நிதி மேலாண்மையில் உங்கள் திறமை வெளிப்படும். எதிர்பாராத வகையில் நிதி வரவுகள் ஏற்படக்கூடும்.",
    "finance_en": "Your financial situation will be very good. Savings will increase. Opportunities for new investments will arise. In particular, long-term investments will yield good profits. You will meet essential family needs. Your expertise in financial management will be evident. Unexpected financial gains may occur.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் சீராக இருக்கும். புதிய சுகாதாரப் பழக்கவழக்கங்களை அறிமுகப்படுத்துவீர்கள். சரியான உணவு மற்றும் உடற்பயிற்சிகளை மேற்கொள்வதன் மூலம் உடல் நலனை மேம்படுத்துவீர்கள். மன அழுத்தத்தைக் குறைத்து, அமைதியான மனநிலையுடன் செயல்படுவீர்கள். உடல் சோர்வு நீங்கி, புத்துணர்வு பெறுவீர்கள். தினசரி நடைப்பயிற்சி நன்மை பயக்கும்.",
    "health_en": "Your physical health will be excellent. You will introduce new health habits. You will improve your well-being by adopting proper eating habits and exercises. You will reduce stress and act with a calm state of mind. Physical fatigue will dissipate, and you will feel rejuvenated. Daily walks will be beneficial.",
    "lucky_number": "8",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "கும்பம்",
    "sign_en": "Aquarius",
    "date": "12-02-2026",
    "prediction_ta": "குரு பகவானின் ஆதிக்கம் நிறைந்த இந்த வியாழக்கிழமையில், கும்ப ராசிக்காரர்களே, உங்கள் வாழ்வில் புதுமைகளும், சமூகத் தொடர்புகளும் மேலோங்கும். குருவின் அருளால், நீங்கள் எடுக்கும் ஒவ்வொரு முயற்சியிலும் புதிய சிந்தனைகளும், வெற்றியும் குடிகொள்ளும். சமூகப் பணிகளிலும், குழு நடவடிக்கைகளிலும் ஆர்வம் காட்டுவீர்கள். புதிய நண்பர்கள் மற்றும் இணைப்பாளர்கள் மூலம் முக்கியமான செய்திகள் கிடைக்கும். சமூக ஊடகங்கள் மற்றும் தகவல் தொடர்பு சாதனங்கள் மூலம் உங்கள் கருத்துக்களை திறம்பட வெளிப்படுத்துவீர்கள். உங்கள் எழுத்து மற்றும் பேச்சுத் திறன்கள் பலரையும் ஈர்க்கும். கல்வித் துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் அமையும். ஆராய்ச்சி மற்றும் உயர்கல்வித் துறைகளில் இருப்பவர்கள் சிறப்பான முன்னேற்றம் காண்பார்கள். புதிய அறிவைப் பெறுவதிலும், இருக்கும் அறிவைப் பிறருடன் பகிர்ந்து கொள்வதிலும் ஆர்வம் கொள்வீர்கள். பயணங்கள் மேற்கொள்வதற்கான வாய்ப்புகள் உண்டாகும். குறிப்பாக, கல்வி சார்ந்த அல்லது வணிகம் சார்ந்த பயணங்கள் சிறப்பான பலன்களைக் கொண்டுவரும். புதிய இடங்களையும், மனிதர்களையும் சந்திப்பதன் மூலம் உங்கள் அனுபவம் விரிவடையும். குடும்பத்தில் அமைதியும், சுபிட்சமும் பெருகும். உறவினர்கள் மற்றும் நண்பர்களுடன் இணக்கமான சூழ்நிலை நிலவும். எந்த ஒரு மனக் கசப்புகளும் அகன்று, நல்லிணக்கம் மேலோங்கும். புதிய உறவுகள் உருவாகவும், பழைய உறவுகள் வலுப்பெறவும் வாய்ப்புகள் உண்டு. குறிப்பாக, உங்கள் சமூக வட்டாரம் விரிவடையும். புதிய நபர்களின் அறிமுகம் கிடைக்கும். அவர்களுடனான தொடர்புகள் உங்கள் எதிர்கால வளர்ச்சிக்கு உதவும். தரும சிந்தனைகள் மேலோங்கும். பிறருக்கு உதவி செய்வதில் மனநிறைவு காண்பீர்கள். உங்கள் மனதின் ஆழத்தில் உள்ள கருணையும், இரக்கமும் வெளிப்படும். இத்தகைய செயல்கள் உங்களுக்கு புண்ணியத்தையும், நற்பெயரையும் ஈட்டித் தரும். குருவின் அருளால், உங்கள் சிந்தனையில் தெளிவு பிறக்கும். எந்த ஒரு செயலிலும் அவசரப்படாமல், நிதானமாகச் சிந்தித்து முடிவெடுப்பீர்கள். இது உங்களுக்குப் பல நன்மைகளைக் கொண்டுவரும். மூத்தவர்களின் ஆலோசனைகளைப் பெறுவது கூடுதல் பலம் சேர்க்கும். உங்கள் எதிர்காலத்திற்கான ஆழமான திட்டமிடல்களைச் செய்வதற்கு இது ஒரு சிறந்த நாளாகும். ஆன்மீகப் பயணங்கள் அல்லது புனிதத் தலங்களுக்குச் செல்வதற்கான வாய்ப்புகள் உண்டாகலாம். இது உங்கள் மனதிற்கு அமைதியையும், புத்துணர்வையும் அளிக்கும். கடந்த காலத் தவறுகளிலிருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவதற்கான சிந்தனைகள் மேலோங்கும். உங்களது தன்னம்பிக்கையும், மன உறுதியும் பல மடங்கு அதிகரிக்கும். ஆரோக்கியத்தின் மீது கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் மற்றும் மிதமான உடற்பயிற்சிகள் உங்கள் உடல் நலனை மேம்படுத்தும். மன அழுத்தம் இன்றி வாழ முயற்சிப்பீர்கள். நேர்மறை எண்ணங்கள் நிறைந்ததாக உங்கள் நாள் அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். குரு பகவான் உங்கள் வாழ்வில் அனைத்து செல்வங்களையும், நலன்களையும் கொண்டு வந்து சேர்ப்பார். இதனால், உங்கள் வாழ்க்கை ஒரு புதிய பரிமாணத்தை அடையும். சமூகத்தில் உங்கள் நிலை உயரும். மக்கள் மத்தியில் உங்கள் மீதான மதிப்பும் மரியாதையும் அதிகரிக்கும். உங்களின் நற்குணங்கள் எல்லோராலும் போற்றப்படும். புதிய சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். தடைகள் அனைத்தும் விலகி, வெற்றிப்பாதையில் நீங்கள் நடைபோடுவீர்கள். மொத்தத்தில், இது ஒரு அற்புதமான நாளாக அமையும். புதுமையான யோசனைகள் உங்களை முன்னேற்றப் பாதையில் இட்டுச் செல்லும்.",
    "prediction_en": "On this Thursday, ruled by Jupiter, Aquarius natives will experience a predominance of innovations and social connections in your life. With Jupiter's blessings, new ideas and success will prevail in every endeavor you undertake. You will show interest in social work and group activities. You will receive important news through new friends and collaborators. You will effectively express your ideas through social media and communication devices. Your writing and speaking skills will attract many. Those in the field of education will find new opportunities. Individuals in research and higher education will see significant progress. You will be keen on acquiring new knowledge and sharing existing knowledge with others. Opportunities for travel will arise. In particular, education-related or business-related travels will bring excellent results. Your experience will expand by meeting new places and people. Peace and prosperity will flourish in the family. A harmonious atmosphere will prevail among relatives and friends. Any emotional bitterness will dissipate, and goodwill will predominate. There are chances for new relationships to form and old ones to strengthen. Specifically, your social circle will expand. You will meet new people. Your connections with them will contribute to your future growth. Thoughts of charity will be prominent. You will find contentment in helping others. Your inherent kindness and compassion will be expressed. Such actions will earn you merit and a good reputation. With Jupiter's grace, clarity will emerge in your thoughts. You will make decisions calmly and thoughtfully, without haste in any matter. This will bring you many benefits. Seeking advice from elders will add extra strength. This is an excellent day for making profound plans for your future. Opportunities for spiritual journeys or visiting sacred places may arise. This will bring peace and rejuvenation to your mind. Thoughts of learning from past mistakes and refining the future will be prominent. Your self-confidence and mental fortitude will increase manifold. It is essential to pay attention to your health. Proper eating habits and moderate exercises will enhance your well-being. You will strive to live without stress. Your day will be filled with positive thoughts. All your efforts will be successful. Jupiter will bring all wealth and welfare into your life. Consequently, your life will enter a new dimension. Your position in society will rise. Your respect and regard among people will increase. Your good qualities will be praised by everyone. You will be ready to face new challenges. All obstacles will be removed, and you will walk on the path of victory. Overall, this will be a wonderful day. Innovative ideas will lead you on the path of progress.",
    "career_ta": "உங்கள் பணியில் புதுமையான யோசனைகள் உருவாகும். புதிய தொழில்நுட்பம் சார்ந்த துறைகளில் சிறப்பான முன்னேற்றம் காண்பீர்கள். குழுவாகச் செயல்படும் திட்டங்களில் வெற்றியடைவீர்கள். உங்கள் தலைமைத்துவப் பண்புகள் அங்கீகரிக்கப்படும். சமூகப் பணியில் ஈடுபடும் வாய்ப்புகள் கிடைக்கும். புதிய வாய்ப்புகள் உங்களைத் தேடி வரும். கூட்டு முயற்சிகளில் வெற்றி கிட்டும்.",
    "career_en": "Innovative ideas will emerge in your work. You will see significant progress in technology-related fields. You will succeed in team-based projects. Your leadership qualities will be recognized. Opportunities to engage in social work will arise. New opportunities will come your way. Success will be achieved in collaborative ventures.",
    "finance_ta": "உங்கள் நிதி நிலைமை சிறப்பாக இருக்கும். புதிய வருமான வழிகள் உருவாகும். குறிப்பாக, தொழில்நுட்பம் சார்ந்த முதலீடுகள் நல்ல லாபம் தரும். சமூகக் காரணங்களுக்காக செலவு செய்வீர்கள். சேமிப்புகள் அதிகரிக்கும். நிதி சம்பந்தப்பட்ட விஷயங்களில் அறிவார்ந்த முடிவுகளை எடுப்பீர்கள். நண்பர்கள் மூலம் நிதி உதவி கிடைக்க வாய்ப்புண்டு.",
    "finance_en": "Your financial situation will be excellent. New income streams will develop. In particular, technology-related investments will yield good profits. You will spend on social causes. Savings will increase. You will make wise decisions regarding financial matters. There is a possibility of financial assistance through friends.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் புதிய உற்சாகமும், நேர்மறை எண்ணங்களும் நிறைந்திருக்கும். சமூக நடவடிக்கைகளில் ஈடுபடுவது உங்கள் மனதிற்குப் புத்துணர்ச்சி அளிக்கும். சத்தான உணவு மற்றும் மிதமான உடற்பயிற்சிகள் உங்கள் ஆற்றலை மேம்படுத்தும். மன அழுத்தத்தைக் குறைத்து, அமைதியான மனநிலையுடன் செயல்படுவீர்கள்.",
    "health_en": "Your physical health will be excellent. Your mind will be filled with new enthusiasm and positive thoughts. Engaging in social activities will rejuvenate your mind. Nutritious food and moderate exercises will enhance your energy. You will reduce stress and act with a calm state of mind.",
    "lucky_number": "4",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "12-02-2026",
    "prediction_ta": "குரு பகவானின் ஆதிக்கம் நிறைந்த இந்த வியாழக்கிழமையில், மீன ராசிக்காரர்களே, உங்கள் வாழ்வில் உள்ளுணர்வு, கருணை மற்றும் ஆன்மீக வளர்ச்சி மேலோங்கும். குருவின் அருளால், நீங்கள் எடுக்கும் ஒவ்வொரு செயலிலும் தெளிவும், வெற்றியும் குடிகொள்ளும். உங்கள் படைப்பாற்றலும், கற்பனைத் திறனும் இத்தினத்தில் சிறப்பாக வெளிப்படும். கலைத் துறைகளில் இருப்பவர்களுக்கு சிறப்பான அங்கீகாரம் கிடைக்கும். புதிய படைப்புக்களை உருவாக்கவும், உங்களின் தனித்துவமான திறமைகளை வெளிப்படுத்தவும் இது ஒரு சிறந்த நாளாகும். பிறருக்கு உதவி செய்வதில் மனநிறைவு காண்பீர்கள். உங்கள் மனதின் ஆழத்தில் உள்ள கருணையும், இரக்கமும் வெளிப்படும். இத்தகைய செயல்கள் உங்களுக்கு புண்ணியத்தையும், நற்பெயரையும் ஈட்டித் தரும். ஆன்மீகப் பயணங்கள் அல்லது புனிதத் தலங்களுக்குச் செல்வதற்கான வாய்ப்புகள் உண்டாகலாம். இது உங்கள் மனதிற்கு அமைதியையும், புத்துணர்வையும் அளிக்கும். தியானம் மற்றும் யோகா போன்ற பயிற்சிகளில் ஈடுபடுவது மன அமைதிக்கு வழிவகுக்கும். உங்கள் உள்ளுணர்வின் வழிகாட்டுதலைப் பின்பற்றுவதன் மூலம், சரியான பாதையில் பயணிக்கலாம். புதிய சவால்களை ஏற்றுக்கொள்ளவும், அவற்றிலிருந்து கற்றுக்கொண்டு வளரவும் இது ஒரு அற்புதமான தருணமாகும். உங்கள் தன்னம்பிக்கையும், மன உறுதியும் பல மடங்கு அதிகரிக்கும். சமூகத்தில் உங்கள் மதிப்பும், மரியாதையும் உயரும். புதிய பொறுப்புகள் உங்களைத் தேடி வரும். அவற்றை மிகுந்த நம்பிக்கையுடன் ஏற்றுக்கொண்டு, உங்கள் திறமையை வெளிப்படுத்துவீர்கள். சமூக சேவைகளில் ஈடுபடுவதற்கான வாய்ப்புகளும் உண்டாகலாம், இது உங்களுக்கு மனநிறைவைத் தரும். குடும்பத்தில் அமைதியும், சுபிட்சமும் பெருகும். உறவினர்கள் மற்றும் நண்பர்களுடன் இணக்கமான சூழ்நிலை நிலவும். எந்த ஒரு மனக் கசப்புகளும் அகன்று, நல்லிணக்கம் மேலோங்கும். புதிய உறவுகள் உருவாகவும், பழைய உறவுகள் வலுப்பெறவும் வாய்ப்புகள் உண்டு. குறிப்பாக, உங்கள் சமூக வட்டாரம் விரிவடையும். புதிய நபர்களின் அறிமுகம் கிடைக்கும். அவர்களுடனான தொடர்புகள் உங்கள் எதிர்கால வளர்ச்சிக்கு உதவும். குருவின் அருளால், உங்கள் சிந்தனையில் தெளிவு பிறக்கும். எந்த ஒரு செயலிலும் அவசரப்படாமல், நிதானமாகச் சிந்தித்து முடிவெடுப்பீர்கள். இது உங்களுக்குப் பல நன்மைகளைக் கொண்டுவரும். மூத்தவர்களின் ஆலோசனைகளைப் பெறுவது கூடுதல் பலம் சேர்க்கும். உங்கள் எதிர்காலத்திற்கான ஆழமான திட்டமிடல்களைச் செய்வதற்கு இது ஒரு சிறந்த நாளாகும். கல்வித் துறையில் இருப்பவர்களுக்கு புதிய வாய்ப்புகள் அமையும். ஆராய்ச்சி மற்றும் உயர்கல்வித் துறைகளில் இருப்பவர்கள் சிறப்பான முன்னேற்றம் காண்பார்கள். புதிய அறிவைப் பெறுவதிலும், இருக்கும் அறிவைப் பிறருடன் பகிர்ந்து கொள்வதிலும் ஆர்வம் கொள்வீர்கள். கடந்த காலத் தவறுகளிலிருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவதற்கான சிந்தனைகள் மேலோங்கும். ஆரோக்கியத்தின் மீது கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் மற்றும் மிதமான உடற்பயிற்சிகள் உங்கள் உடல் நலனை மேம்படுத்தும். மன அழுத்தம் இன்றி வாழ முயற்சிப்பீர்கள். நேர்மறை எண்ணங்கள் நிறைந்ததாக உங்கள் நாள் அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். குரு பகவான் உங்கள் வாழ்வில் அனைத்து செல்வங்களையும், நலன்களையும் கொண்டு வந்து சேர்ப்பார். இதனால், உங்கள் வாழ்க்கை ஒரு புதிய பரிமாணத்தை அடையும். மக்கள் மத்தியில் உங்கள் மீதான மதிப்பும் மரியாதையும் அதிகரிக்கும். உங்களின் நற்குணங்கள் எல்லோராலும் போற்றப்படும். தடைகள் அனைத்தும் விலகி, வெற்றிப்பாதையில் நீங்கள் நடைபோடுவீர்கள். மொத்தத்தில், இது ஒரு அற்புதமான நாளாக அமையும்.",
    "prediction_en": "On this Thursday, ruled by Jupiter, Pisces natives will experience a predominance of intuition, compassion, and spiritual growth in your life. With Jupiter's blessings, clarity and success will prevail in every endeavor you undertake. Your creativity and imagination will be prominently displayed on this day. Those in artistic fields will receive special recognition. This is an excellent day to create new works and express your unique talents. You will find contentment in helping others. Your inherent kindness and compassion will be expressed. Such actions will earn you merit and a good reputation. Opportunities for spiritual journeys or visiting sacred places may arise, bringing peace and rejuvenation to your mind. Engaging in practices like meditation and yoga will lead to mental peace. By following your intuition, you can journey on the right path. This is a wonderful moment to accept new challenges, learn from them, and grow. Your self-confidence and mental fortitude will increase manifold. Your respect and standing in society will rise. New responsibilities will come seeking you. You will accept them with great confidence and demonstrate your abilities. Opportunities to engage in social service may also arise, bringing you immense satisfaction. Peace and prosperity will flourish in the family. A harmonious atmosphere will prevail among relatives and friends. Any emotional bitterness will dissipate, and goodwill will predominate. There are chances for new relationships to form and old ones to strengthen. Specifically, your social circle will expand. You will meet new people. Your connections with them will contribute to your future growth. With Jupiter's grace, clarity will emerge in your thoughts. You will make decisions calmly and thoughtfully, without haste in any matter. This will bring you many benefits. Seeking advice from elders will add extra strength. This is an excellent day for making profound plans for your future. Those in the field of education will find new opportunities. Individuals in research and higher education will see significant progress. You will be keen on acquiring new knowledge and sharing existing knowledge with others. Thoughts of learning from past mistakes and refining the future will be prominent. It is essential to pay attention to your health. Proper eating habits and moderate exercises will enhance your well-being. You will strive to live without stress. Your day will be filled with positive thoughts. All your efforts will be successful. Jupiter will bring all wealth and welfare into your life. Consequently, your life will enter a new dimension. Your respect and regard among people will increase. Your good qualities will be praised by everyone. All obstacles will be removed, and you will walk on the path of victory. Overall, this will be a wonderful day.",
    "career_ta": "உங்கள் பணியில் படைப்பாற்றலும், உள்ளுணர்வும் மேலோங்கும். கலை, மருத்துவம், மற்றும் சேவைத் துறைகளில் இருப்பவர்களுக்கு சிறப்பான அங்கீகாரம் கிடைக்கும். புதிய திட்டங்களில் உங்கள் கற்பனைத் திறனைப் பயன்படுத்தி வெற்றியடைவீர்கள். சக ஊழியர்களுடன் இணக்கமான உறவு நீடிக்கும். புதிய வாய்ப்புகள் உங்களைத் தேடி வரும். உங்கள் தலைமைத்துவப் பண்புகள் அங்கீகரிக்கப்படும்.",
    "career_en": "Creativity and intuition will prevail in your work. Those in art, medicine, and service sectors will receive special recognition. You will succeed in new projects by utilizing your imagination. Harmonious relationships with colleagues will continue. New opportunities will come your way. Your leadership qualities will be recognized.",
    "finance_ta": "உங்கள் நிதி நிலைமை சீராக இருக்கும். கலை சார்ந்த அல்லது ஆன்மீகம் சார்ந்த முதலீடுகள் நல்ல லாபம் தரும். தர்ம காரியங்களுக்காகவும், பிறருக்கு உதவி செய்வதற்காகவும் செலவு செய்வீர்கள். சேமிப்புகள் அதிகரிக்கும். நிதி சம்பந்தப்பட்ட விஷயங்களில் உள்ளுணர்வின் வழிகாட்டுதலைப் பின்பற்றுவீர்கள். எதிர்பாராத நிதி வரவுகள் கிடைக்க வாய்ப்புண்டு.",
    "finance_en": "Your financial situation will be stable. Art-related or spiritual investments will yield good profits. You will spend on charitable causes and helping others. Savings will increase. You will follow your intuition regarding financial matters. There is a possibility of unexpected financial gains.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதிக்கு முக்கியத்துவம் கொடுப்பீர்கள். உணர்வுபூர்வமான திருப்தி உங்கள் உடல் நலனுக்கு அவசியம். சத்தான உணவு மற்றும் போதுமான ஓய்வு உங்கள் ஆற்றலை மேம்படுத்தும். யோகா, தியானம் அல்லது மனதை அமைதிப்படுத்தும் செயல்களில் ஈடுபடுவீர்கள். உடல் சோர்வு நீங்கும், புத்துணர்வு பெறுவீர்கள்.",
    "health_en": "Your physical health will be excellent. You will prioritize mental peace. Emotional satisfaction is crucial for your well-being. Nutritious food and adequate rest will enhance your energy. You will engage in yoga, meditation, or activities that calm the mind. Physical fatigue will dissipate, and you will feel rejuvenated.",
    "lucky_number": "3",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  }
]
