[{"content":{"parts":[{"text":"```json\n[\n  {\n    \"sign_en\": \"Aries\",\n    \"sign_ta\": \"மேஷம்\",\n    \"date\": \"2026-01-30\",\n    \"forecast_en\": \"Your energy levels are high, making this an excellent day for initiation and taking the lead. Career: Bold decisions at work lead to successful outcomes and recognition. Finance: Your financial stability improves, benefiting from previously made disciplined choices. Health: Channel your physical energy productively but ensure you allow time for complete rest to prevent burnout. Focus on high-intensity workouts.\",\n    \"forecast_ta\": \"இன்றைய நாள் உங்களுக்கு மிகச் சிறந்த நாளாக அமையும். ஆற்றல் மட்டம் உயர்ந்து காணப்படுவதால், புதிய முயற்சிகளையும் தலைமைப் பொறுப்புகளையும் ஏற்க ஏற்ற நாள் இது. பணித்துறை: பணியிடத்தில் தைரியமான முடிவுகள் வெற்றிக்கும் பாராட்டிற்கும் வழிவகுக்கும். நிதிநிலை: கடந்த காலத்தில் நீங்கள் எடுத்த திட்டமிட்ட முடிவுகளின் பலனாக உங்கள் நிதிநிலை உறுதிப்படும். நலன்: உங்களின் அதிகப்படியான உடல் ஆற்றலை ஆக்கப்பூர்வமாகச் செலவிடுங்கள். அதே சமயம், சோர்வுறாமல் இருக்க போதுமான ஓய்வை உறுதிப்படுத்துங்கள்.\",\n    \"lucky_number\": \"9\",\n    \"lucky_color_en\": \"Scarlet Red\",\n    \"lucky_color_ta\": \"செந்நிறம்\"\n  },\n  {\n    \"sign_en\": \"Taurus\",\n    \"sign_ta\": \"ரிஷபம்\",\n    \"date\": \"2026-01-30\",\n    \"forecast_en\": \"Focus on stability and comfort today. It’s a good time to consolidate gains and enjoy peaceful moments. Career: Patience is essential when dealing with professional hurdles. Slow, steady progress will yield better results than rushing. Finance: This is an important day for practical financial planning and budgeting. Avoid impulsive purchases. Health: Prioritize mental peace; yoga or gardening can help reduce internal stress and promote well-being.\",\n    \"forecast_ta\": \"இன்று நிலைத்தன்மைக்கும் மன அமைதிக்கும் முக்கியத்துவம் கொடுங்கள். நீங்கள் அடைந்த வெற்றிகளை உறுதியாக்கிக் கொள்ள இது சிறந்த நேரமாகும். பணித்துறை: பணியிடத்தில் ஏற்படும் தடைகளைச் சமாளிக்க பொறுமை மிகவும் அவசியம். அவசரப்படுவதை விட நிதானமான முன்னேற்றம் சிறந்த பலனை அளிக்கும். நிதிநிலை: நிதி திட்டமிடலுக்கும் வரவு செலவு கணக்கிற்கும் முக்கியத்துவம் கொடுங்கள். தூண்டுதலின் பேரில் செலவு செய்வதைத் தவிர்க்கவும். நலன்: மன ஆரோக்கியமே முக்கியம்; தியானம் அல்லது தோட்டக்கலை போன்ற செயல்பாடுகளில் ஈடுபடுவது மன அழுத்தத்தைக் குறைக்கும்.\",\n    \"lucky_number\": \"6\",\n    \"lucky_color_en\": \"Emerald Green\",\n    \"lucky_color_ta\": \"மரகதப் பச்சை\"\n  },\n  {\n    \"sign_en\": \"Gemini\",\n    \"sign_ta\": \"மிதுனம்\",\n    \"date\": \"2026-01-30\",\n    \"forecast_en\": \"Communication flows freely, making this a highly productive day for networking, learning, and sharing ideas. Career: Your ability to articulate complex concepts effectively will lead to professional success in meetings and presentations. Finance: Minor financial gains or beneficial information regarding an investment may surface. Be open to new ideas. Health: Guard against nervous energy. Ensure your mind gets adequate rest by limiting screen time late in the evening.\",\n    \"forecast_ta\": \"தகவல் பரிமாற்றம் தடையின்றி நடக்கும் நாள் இது. சமூகத் தொடர்பு, கற்றல் மற்றும் கருத்துக்களைப் பகிர்வதற்கு மிகவும் ஆக்கபூர்வமான நாளாகும். பணித்துறை: சிக்கலான கருத்துக்களைத் தெளிவாக வெளிப்படுத்தும் உங்களின் திறன் பணியிடக் கூட்டங்களில் வெற்றி தேடித்தரும். நிதிநிலை: சிறிய நிதி ஆதாயங்கள் அல்லது முதலீடு தொடர்பான பயனுள்ள தகவல்கள் உங்களுக்குக் கிடைக்கும். புதிய சிந்தனைகளை ஏற்கத் தயாராக இருங்கள். நலன்: நரம்பு தளர்ச்சியைத் தவிர்க்க, இரவு நேரத்தில் திரை நேரத்தைக் குறைத்து உங்கள் மூளைக்கு ஓய்வு கொடுப்பது அவசியம்.\",\n    \"lucky_number\": \"5\",\n    \"lucky_color_en\": \"Yellow\",\n    \"lucky_color_ta\": \"மஞ்சள்\"\n  },\n  {\n    \"sign_en\": \"Cancer\",\n    \"sign_ta\": \"கடகம்\",\n    \"date\": \"2026-01-30\",\n    \"forecast_en\": \"The focus shifts to home life and emotional security. Nurturing relationships provides deep satisfaction. Career: Success is found through cooperation and supporting team members. Your empathetic nature strengthens professional bonds. Finance: Focus on enhancing long-term financial security through meticulous saving and budgeting. Health: Emotional well-being is tied to physical health. Spend time in comfortable, familiar surroundings to recharge your energy.\",\n    \"forecast_ta\": \"இன்று உங்கள் கவனம் வீடு மற்றும் உணர்ச்சிசார் பாதுகாப்பு நோக்கி திரும்பும். உறவுகளைப் பேணுவது மனதிற்கு ஆழ்ந்த நிறைவைத் தரும். பணித்துறை: குழு உறுப்பினர்களை ஆதரிப்பதன் மூலமும் ஒத்துழைப்பதன் மூலமும் வெற்றி கிடைக்கும். உங்களின் கனிவான குணம் பணியிட உறவுகளை பலப்படுத்தும். நிதிநிலை: நீண்ட கால நிதிப் பாதுகாப்பை மேம்படுத்த, கச்சிதமான சேமிப்பு மற்றும் வரவு செலவு திட்டமிடலில் கவனம் செலுத்துங்கள். நலன்: உணர்ச்சிசார் நல்வாழ்வே உடல் நலத்துடன் பிணைக்கப்பட்டுள்ளது. ஆற்றலை மீட்டெடுக்க வசதியான, பழக்கமான சூழலில் நேரத்தைச் செலவிடுங்கள்.\",\n    \"lucky_number\": \"2\",\n    \"lucky_color_en\": \"Pearl White\",\n    \"lucky_color_ta\": \"வெண்முத்து நிறம்\"\n  },\n  {\n    \"sign_en\": \"Leo\",\n    \"sign_ta\": \"சிம்மம்\",\n    \"date\": \"2026-01-30\",\n    \"forecast_en\": \"Your confidence shines today, attracting attention and opportunities. Embrace your role as a leader. Career: Creative projects will see significant progress. Take the initiative and present your boldest ideas to senior management. Finance: Calculated risks in investment may prove beneficial. Avoid unnecessary extravagance, but enjoy rewards for hard work. Health: Maintain cardiovascular health through regular, energetic physical activity. Stay hydrated.\",\n    \"forecast_ta\": \"இன்று உங்கள் தன்னம்பிக்கை பிரகாசிக்கும். இது புதிய வாய்ப்புகளையும் கவனத்தையும் ஈர்க்கும். தலைமைப் பண்பை மனமுவந்து ஏற்றுக்கொள்ளுங்கள். பணித்துறை: ஆக்கப்பூர்வமான திட்டங்கள் இன்று குறிப்பிடத்தக்க முன்னேற்றத்தைக் காணும். மூத்த அதிகாரிகளிடம் உங்களின் துணிச்சலான கருத்துக்களை முன்வையுங்கள். நிதிநிலை: முதலீட்டில் கணக்கிடப்பட்ட அபாயங்கள் லாபகரமாக அமையலாம். தேவையற்ற ஆடம்பரத்தைத் தவிர்த்து, கடின உழைப்பிற்கான பலனை அனுபவிக்கவும். நலன்: வழக்கமான, ஆற்றல்மிக்க உடல் செயல்பாடுகளின் மூலம் உங்கள் இதய ஆரோக்கியத்தைப் பேணுங்கள்.\",\n    \"lucky_number\": \"1\",\n    \"lucky_color_en\": \"Gold\",\n    \"lucky_color_ta\": \"பொன்நிறம்\"\n  },\n  {\n    \"sign_en\": \"Virgo\",\n    \"sign_ta\": \"கன்னி\",\n    \"date\": \"2026-01-30\",\n    \"forecast_en\": \"Attention to detail is your superpower today. Focus on organizing, refining, and completing long-pending tasks. Career: Professional advancement comes through meticulous planning and exceeding expectations in quality. Your diligence is noticed. Finance: Though stable, managing small, recurring expenses carefully will significantly improve your balance sheet. Health: Pay close attention to your diet and digestive health. Stress management techniques are also highly beneficial.\",\n    \"forecast_ta\": \"நுண்ணிய விவரங்களில் கவனம் செலுத்துவது இன்று உங்களின் பலமாகும். நீண்ட நாட்களாக நிலுவையில் உள்ள பணிகளை ஒழுங்கமைத்து முடிக்க கவனம் செலுத்துங்கள். பணித்துறை: நுணுக்கமான திட்டமிடல் மற்றும் தரமான பணியின் மூலம் தொழில்முறை முன்னேற்றம் ஏற்படும். உங்கள் விடாமுயற்சி கவனிக்கப்படும். நிதிநிலை: நிலையான நிதிநிலை இருந்தாலும், சிறிய, தொடர்ச்சியான செலவுகளை கவனமாகக் கையாள்வது உங்கள் நிதிநிலையை கணிசமாக மேம்படுத்தும். நலன்: உணவு மற்றும் செரிமான ஆரோக்கியத்தில் கவனம் செலுத்துங்கள். மன அழுத்தத்தைக் கையாளுதல் நுட்பங்கள் மிகவும் பயனுள்ளதாக இருக்கும்.\",\n    \"lucky_number\": \"5\",\n    \"lucky_color_en\": \"Navy Blue\",\n    \"lucky_color_ta\": \"கரும் நீலம்\"\n  },\n  {\n    \"sign_en\": \"Libra\",\n    \"sign_ta\": \"துலாம்\",\n    \"date\": \"2026-01-30\",\n    \"forecast_en\": \"Harmony in personal and professional relationships is paramount. Seek balance and fairness in all interactions. Career: Negotiations and partnership discussions are highly favored. You possess the ability to mediate conflicts effectively, leading to positive outcomes. Finance: Your budget requires balancing income and expenditure carefully. Avoid lending or borrowing money if possible. Health: Focus on mental peace and aesthetic surroundings. Meditation will help maintain equilibrium.\",\n    \"forecast_ta\": \"தனிப்பட்ட மற்றும் தொழில்முறை உறவுகளில் இணக்கமே இன்று முதன்மையானது. அனைத்து தொடர்புகளிலும் சமநிலையையும் நேர்மையையும் நாடுங்கள். பணித்துறை: பேச்சுவார்த்தைகள் மற்றும் கூட்டுறவு விவாதங்களுக்கு மிகவும் சாதகமான நாள். மோதல்களை திறம்படத் தீர்க்கும் திறன் உங்களிடம் உள்ளது, இது நேர்மறையான பலன்களை அளிக்கும். நிதிநிலை: உங்கள் வரவு செலவுத் திட்டத்தில் வருமானம் மற்றும் செலவினங்களைச் சமநிலைப்படுத்துவது அவசியம். கடன் கொடுப்பதையோ வாங்குவதையோ முடிந்தவரைத் தவிர்க்கவும். நலன்: மன அமைதிக்கு முக்கியத்துவம் கொடுங்கள். தியானம் உங்கள் சமநிலையைப் பேணுவதற்கு உதவும்.\",\n    \"lucky_number\": \"6\",\n    \"lucky_color_en\": \"Rose Pink\",\n    \"lucky_color_ta\": \"இளஞ்சிவப்பு\"\n  },\n  {\n    \"sign_en\": \"Scorpio\",\n    \"sign_ta\": \"விருச்சிகம்\",\n    \"date\": \"2026-01-30\",\n    \"forecast_en\": \"This is a day for deep introspection and transformation. You have the power to uncover hidden truths and make necessary changes. Career: Strategic planning and research behind the scenes will be more productive than public presentations. Maintain discretion. Finance: Unexpected financial insights or opportunities for debt repayment may surface. Handle joint finances with transparency. Health: Ensure adequate hydration and prioritize emotional release to prevent intensity from becoming stress.\",\n    \"forecast_ta\": \"இது ஆழ்ந்த உள்நோக்கம் மற்றும் மாற்றத்திற்கான நாள். மறைந்திருக்கும் உண்மைகளைக் கண்டறியவும், தேவையான மாற்றங்களைச் செய்யவும் உங்களுக்கு ஆற்றல் உண்டு. பணித்துறை: பொதுவான பேச்சுக்களை விட, திரைமறைவில் செய்யும் மூலோபாயத் திட்டமிடலும் ஆராய்ச்சியும் அதிகப் பலனளிக்கும். ரகசியம் காப்பது நல்லது. நிதிநிலை: கடன் அடைப்பதற்கான எதிர்பாராத நிதி நுண்ணறிவுகள் அல்லது வாய்ப்புகள் தோன்றலாம். கூட்டு நிதிநிலையைத் வெளிப்படைத்தன்மையுடன் கையாளவும். நலன்: போதுமான நீரேற்றத்தை உறுதிப்படுத்திக் கொள்ளுங்கள். உணர்ச்சி அழுத்தத்தைத் தவிர்க்க, மனதின் பாரங்களை இறக்கி வைக்க நேரம் ஒதுக்குங்கள்.\",\n    \"lucky_number\": \"9\",\n    \"lucky_color_en\": \"Maroon\",\n    \"lucky_color_ta\": \"பழுப்பு சிவப்பு\"\n  },\n  {\n    \"sign_en\": \"Sagittarius\",\n    \"sign_ta\": \"தனுசு\",\n    \"date\": \"2026-01-30\",\n    \"forecast_en\": \"Your optimistic outlook and desire for expansion are strong. This is an excellent time for learning, travel planning, or philosophical exploration. Career: New ventures, collaborations with international partners, or advanced studies will benefit your professional path. Finance: Gains from previous long-term investments are likely to materialize. Trust your intuition regarding larger purchases. Health: Stay active and spend time outdoors. Your mental well-being is enhanced by physical freedom.\",\n    \"forecast_ta\": \"உங்களின் நம்பிக்கையான கண்ணோட்டமும் விரிவாக்கத்திற்கான விருப்பமும் இன்று வலுவாக இருக்கும். கற்றல், பயணத் திட்டமிடல் அல்லது தத்துவ விசாரணைகளுக்கு இது சிறந்த நேரமாகும். பணித்துறை: புதிய முயற்சிகள், பன்னாட்டுப் பங்காளிகளுடனான கூட்டுறவுகள் அல்லது உயர் கல்வி ஆகியவை உங்களின் தொழில் பாதையை மேம்படுத்தும். நிதிநிலை: கடந்தகால நீண்ட கால முதலீடுகளில் இருந்து லாபம் கிடைக்கும் வாய்ப்புள்ளது. பெரிய கொள்முதல் குறித்து உங்கள் உள்ளுணர்வை நம்புங்கள். நலன்: வெளியில் நேரத்தைச் செலவிடுங்கள். உடல் சுதந்திரத்தின் மூலம் உங்கள் மன ஆரோக்கியம் மேம்படும்.\",\n    \"lucky_number\": \"3\",\n    \"lucky_color_en\": \"Purple\",\n    \"lucky_color_ta\": \"ஊதா\"\n  },\n  {\n    \"sign_en\": \"Capricorn\",\n    \"sign_ta\": \"மகரம்\",\n    \"date\": \"2026-01-30\",\n    \"forecast_en\": \"Focus on responsibility, long-term goals, and building solid structures in both your professional and personal life. Career: Progress requires sustained, disciplined effort. Authority figures notice your reliability and commitment, which could lead to promotion or increased responsibilities. Finance: Now is the time to solidify financial structures, pay off debts, and plan for retirement. Health: Watch out for stiffness in joints. Regular stretching and maintaining posture are crucial for physical well-being.\",\n    \"forecast_ta\": \"இன்று பொறுப்பு, நீண்ட கால இலக்குகள் மற்றும் தொழில்முறை மற்றும் தனிப்பட்ட வாழ்க்கையில் உறுதியான கட்டமைப்புகளை உருவாக்குவதில் கவனம் செலுத்துங்கள். பணித்துறை: முன்னேற்றத்திற்கு தொடர்ந்து, ஒழுக்கமான முயற்சி தேவை. உங்கள் நம்பகத்தன்மை உயர் அதிகாரிகளின் கவனத்தை ஈர்க்கும், இது பதவி உயர்வு அல்லது பொறுப்புகளை அதிகரிக்கும். நிதிநிலை: நிதி கட்டமைப்பை உறுதிப்படுத்தவும், கடன்களை அடைக்கவும், ஓய்வூதியத்திற்காகத் திட்டமிடவும் இதுவே சரியான நேரம். நலன்: மூட்டுப் பிடிப்பு குறித்து கவனமாக இருங்கள். வழக்கமான நீட்சிப் பயிற்சிகள் மற்றும் சரியான உடல் தோரணையைப் பேணுவது உங்கள் உடல் நலத்திற்கு அவசியம்.\",\n    \"lucky_number\": \"8\",\n    \"lucky_color_en\": \"Charcoal Gray\",\n    \"lucky_color_ta\": \"கரிச்சாம்பல்\"\n  },\n  {\n    \"sign_en\": \"Aquarius\",\n    \"sign_ta\": \"கும்பம்\",\n    \"date\": \"2026-01-30\",\n    \"forecast_en\": \"Innovation and unconventional thinking will lead the way today. Connect with your community and embrace new, futuristic ideas. Career: Your unique perspective brings valuable solutions to long-standing problems. Collaboration in group projects is highlighted. Finance: Unexpected sources of income or a financial breakthrough related to technology or group efforts may occur. Health: Focus on stimulating your mind and ensuring you balance social activity with necessary solitude for reflection. Avoid emotional overstimulation.\",\n    \"forecast_ta\": \"புதுமைகளும் மரபுசாரா சிந்தனைகளும் இன்று உங்களுக்கு வழிகாட்டும். சமூகத்துடன் இணையுங்கள். புதிய, எதிர்கால யோசனைகளை ஏற்றுக்கொள்ளுங்கள். பணித்துறை: உங்களின் தனித்துவமான பார்வை நீண்டகாலப் பிரச்சினைகளுக்கு மதிப்புமிக்க தீர்வுகளைக் கொண்டுவரும். குழு திட்டங்களில் ஒத்துழைப்பு சிறப்படையும். நிதிநிலை: தொழில்நுட்பம் அல்லது கூட்டு முயற்சிகள் மூலம் எதிர்பாராத நிதி ஆதாரம் அல்லது நிதி முன்னேற்றம் ஏற்படலாம். நலன்: உங்கள் மனதைத் தூண்டுவதில் கவனம் செலுத்துங்கள். சமூக செயல்பாடுகளுக்கும் தனிமைக்கும் இடையே சமநிலையைப் பேணுங்கள். அதிகப்படியான உணர்ச்சித் தூண்டுதலைத் தவிர்க்கவும்.\",\n    \"lucky_number\": \"4\",\n    \"lucky_color_en\": \"Electric Blue\",\n    \"lucky_color_ta\": \"மின் நீலம்\"\n  },\n  {\n    \"sign_en\": \"Pisces\",\n    \"sign_ta\": \"மீனம்\",\n    \"date\": \"2026-01-30\",\n    \"forecast_en\": \"Your intuition is remarkably strong today; trust your inner voice, especially in complex situations. Career: Creative pursuits and roles requiring empathy thrive. You may feel drawn to helping others in your workplace. Finance: Be cautious with complex financial agreements or loans. Seek professional advice before making major commitments. Health: Prioritize emotional boundaries and restful sleep. Spending time near water or engaging in peaceful artistic pursuits is restorative.\",\n    \"forecast_ta\": \"இன்று உங்களின் உள்ளுணர்வு மிகவும் வலுவாக உள்ளது; குறிப்பாகச் சிக்கலான சூழ்நிலைகளில் உங்கள் மனதின் குரலை நம்புங்கள். பணித்துறை: ஆக்கப்பூர்வமான முயற்சிகளும் பரிவு தேவைப்படும் பணிகளும் செழிக்கும். பணியிடத்தில் மற்றவர்களுக்கு உதவுவதில் உங்களுக்கு ஆர்வம் பிறக்கும். நிதிநிலை: சிக்கலான நிதி ஒப்பந்தங்கள் அல்லது கடன்களில் எச்சரிக்கையாக இருங்கள். பெரிய உறுதிப்பாடுகளைச் செய்வதற்கு முன் தொழில்முறை ஆலோசனையைப் பெறுங்கள். நலன்: உணர்ச்சிசார் எல்லைகளுக்கும் போதுமான ஓய்விற்கும் முக்கியத்துவம் கொடுங்கள். நீர்நிலைகளுக்கு அருகில் நேரம் செலவிடுவது புத்துணர்ச்சி அளிக்கும்.\",\n    \"lucky_number\": \"7\",\n    \"lucky_color_en\": \"Sea Green\",\n    \"lucky_color_ta\": \"கடல் பச்சை\"\n  }\n]\n```","thoughtSignature":"CvIrAXLI2nx0pLOw72KqZueX68XOqWKQxMfb4K2iF5U7oZdNbFwfbay5I+BArCzjO6E6nvrdtGq6O6DRHZL5KX3d0GtdAeWYdXXwf+ptUFVgnqdRElgWYRZMqHw0nAhWQz/BajKXU2y1KUA//KQI/W6yl7dhztHRTU6ASKRWePnn6BP5uLfneAo3Bk8oJmwUrQILs+K2j47yoZeuf7n/Cwp4g8ETzwZx1uX0kp1CwmMyNS4T57NOXOqiaK7SqJcz1BtA/zRGTcJD2zEKhq+OnOpZz3W9f1Vy5cnK+xrQmc4W4xWaxkSVaeKGE8wjPXFaRUMdJp2+1qgdaLJ+zb4HRBFonp8YhZ+w741D9FTH7G34Re1TBU4lAhOXB7VdlTD61r5eAj2K6VdMD9DjR5Wl/nAa0oEaGbJYf4C5vKlhjh6yXmf84Xb0mbWWOa/2YlWosPMz0+I1BJUr4FojHqGPiZtOwg46mTbrIZW3cmFuZklgqY3z6WrGK6kgus+KWKqXDlKbyFN7RVTRD6BH8h4c1MBUSB5885UzKxxs/NPi4bnRuMUCnC2Ln7uVWy+gf5csaMx87WVLdf6b+HoRRjWriPww6TxXZrctY1cTsIvVR1jLEXUGAAdt6wmU6I2u9EymAwhC3sLrSws8Wq2oQJyfXyr9ImySWTt0+sNmuLJTbBYjPmznVzeo6ZPpMpbPQQhoniyos/6my+VzPSLx54jwDh8Fd2awZrAPqB0TxkYZ4trw70gohUeBoEke4iHJ89RkHIOxGPPa7GTi9bbxdzB4JkqiG08tNkn9XflEK9Dhz1TJhplT9s6ErkvCWiP2sy2SA4Daf5hes/BGcmncgmeAcqZPoCA+FIHQp/8a2MQANY1CwuV/RrMMskVkhtfBRbBNM6b7x14F+j+zOEJoU58z0ysOUGsGmozSSyZRiteEyvRtUhIWhqaYdXBPNI/cjDybjvIHyEx4+sCAdqGJ3IBBeG3aOPP8nyCjH/Ead+shQZjWIWa+p2YPO8nUVzv4hniCHx31QX32qTkxJ6MQcUsW444m5JrzOXGaMjtydAuRqn8KFrQtcpGa4bT9s44qsoUWe66kMNZidE1wXIArKJdzWQ2hvO//8wBbp8W0G1lJowj9YxOPXVZaPRpcwrbIrPu+c2e32eJByMWntmUpwBW0VICQ4V6QaNUy3PhJK8eo/CdbzQ1nfC8K+3AkpzOLph1BncN9SiBcZYHt6nXk6m69FDWVJttd2eOUBdatqBqU/Y89FJEouachwCS/QDQfe5iIJOfU3IBqU1dcRE50Z27uv1XEqgqkQAzgsB7fIhO49uhCAdh1O8IUUmYVNJdffLmSsutdfOvKiKyvkK+I5+tJ9WhI2UQKlmouJmWbouCk/AF0Xq632J+sK/WrdUyDITdoZDda6JHi1x4Fn4KUQ+DEv+ejvLCpRZPq840Fz7mj/HPh9UpvXiOg3/vlZXDm2ygHVhLvt4HF8sFF9vReYAvJNKYYSMUDEJq1rw7IyAHU8YENLS23VLoFiA/cQgmb+RKZmkQkaFn/ap3YVH0+tdJr1d46i3d4TknJU3JtraEo4Xm3ytT5qQG3Eh1c3p4W520rkyzxZi0rK2r4CPu38SN7h70rxdJtw1UTJOONlSc+HfSL3FeP/q82/9gLUNnnu0sMr06SKGDxKv6w7k3tPvwTb93m2lp7LitZfTJsilVeLOcXXXoF2gno/qfkcdqVxDub4QZR/82i6G1+QQEQMpC+JE6PYqPDSGvzJd63seQK+AYW+ec3g4o26/jO/hAO9Fs4aXZySsjKkPpSu1V8YAuiWGdGMpEJDQgBm7Q+j3pEKU5tGfIRaILY3ihBZPb4JycMq8Ka+LJeJn4VOz/8zZgpeF59AmA0Je0183W1NgBnnC04+6Q6KjELzIzewBZy5ghJqbEhBKs8uCFI+k4uz41AGnMeDsWV9CFQgBxrqlm9oZlhh3DyoKcJH+rkdxCvBtxt3H71mT4RwEQnpWsKc6sJrWZNG0FRdcas+/ZwRb9uOueIYLfVTXLmd0g+ScYfN3xTtckjOI8FEgafQ/uV+Y7GtoC/5B5sRP1U6j8fi1LAg0vqYZkOzdMIF0wsZ+es+0m7mAVfJtP4a9BdN1EVpnNvG7LfdX7XzLaZjFKCAXJrLNmGBmfZAddWMocD7I3IFEIkDv3D1mq+IG0Wmq9PQ7Q7VePA6grrEelNGSnQIdSaorHjk17iBDmL9jh9xHNveBcAU1GeDKkett4Pvhkl5wuzZefy2rx5BtWz0MHKNwe3RB8WPpQPC8W/HXeOBSPVkGnSKjPCuMB/cZPoXAMa1/ETIHOWsHkNctLKy7aURAWyKHlGndczJ1RaNTXrX3hzdPLxYYLtaQrx9yH2HNmCxTWY5MFrUPsTpe2EwQVP3b9UpQFyMLkbmFyCO7P2F5JHjbcizurMTeIIeCBKWL+mhs6zPolhwXeFFgYrp7KduVIv3HbL68jPqpk1suGmycOv7qRly7XUVIWrJTu9sgUrsFazcyWazCTzvFGYPPaDPANzUnjwgpnWvVqsz0iMdEcjNjpQkBN225CWTz5tx+EtjrtXZnml9/h1Ee9xR+v2pJ0j5nFxL42O4G7yCfe3tJUZ5KqajgSIwAfQpJNTKtqfrOY+MJGix9GbsXRcI4GWNIpG+VCgQEO0kFDpNktl5HpmS4vkVfG8R2Y+M9azv2dc27p95hKq44IbKUGHDswC+9XGUwOqIMJYsS/Iik1+nuQQxz1DmNK33Vosuq4i821rh3CNe44UmxMd0VOQTxEWpba9d7dwarmtQ4uWycHi/IDc5bgB2NWN05/V7Tc6OU8vBuH4Cr0KeyTHKdiQ5lDf9X3bsctvNcvCxvFEOLA7MeOSuE3wSHsHa0XqSjcHcrQFFtgM0HpBen87+Hj/8S40n62J/ckJZEznJzHst/+ld4LflggkkjyjWT/OPHbI7gEsc8Yu0Hm5fDyEdxBzZLBZKyW2Ci4LcFgT+HZJmqAbtgo/zmXao91dNgrVwTALXKWKgXbF72CWkQpVNyWOLJU68JWUp5DfLhQ4cT0n1ruaChUDbt6CrpSL/5+LZ9s9ZJP4jZResDmKgAbwOIoDEXO+f7yDkgLUwtsetx8bmz+z+yC6utIwe3EPty8uKu6rXCE4J3nMDeJUV7za951Wt+BCh6+sAgTvWh+X5+4o3FISzpbreCsdzH8JngqVL3zv36Nf4MNpADveg+jDbOgfOomrh4awEjNcgD1v3+Cojo6Y6Hseth4R/m2zUc9B3ouZZp9OzRhyV1VbDX19/eY08sJsbPgQ91vofuqT2FABdtTuo14uB3JVN52GGm372x9UxtczXtQ1HJCD08k4n2YlCWZGXAxcouVGmz3j1YBNMNjky6ZIGVfWqabl8qUBhrYFe3fVZ74D54vQBnLyYhhAFHYrpxRgKA9x7JZ0PULhSW7kNTuhkv6B5AmF4laRJqp9NLaV+aM5zFogsESsx55iz8dg/Lg1cSrq6q1vy/nWEP4YLW9paUPUV9qrZAAWrntWszgVipt5CuhV9DJtoj24kWxmzOaVNqcuYoJGFyMETF3KsFVvdy2pvwMCkWucKLhDyOar2DCjF63SrLRy/gEZdUZHc8ihRKA/Y1XA+iNhjW8G02JoiE8g58DD355+RpBaRFfDiXeI9XZ/drJq09hhUNso6rV581/AI1cV5rB+LOWKkyp8fgtFyxDv3rvRgwbOPJcyzRCxtrDh8DbIiw9XMCYNkcuL0WwAo2v+V2A46WvG6+Nr3ExGsZMELOpfx+YM+mXRFFuazk7Lq2dK9Vw0EKnxc2xy9PHCSYgI9vKRkKOjBjElDoDxYjWb3oliMVB975YP6XW9oYuWw4GRM9i5PQo0J/O3zVAMgJ+sXSa95J1YNSryhCxFdG9wklbEeRGvHQUzUf+bcNhUfPkStIsfVY6Fjcc3ivE9eTDjfH+rJP9T9ECdu+kH5psybk9z+nOHxNvdJpXYM/4OlF1JWxKuaFmiiBUr1toe986Smy59vc7XLnXs1b5bBpntw6vT0y7v5jM9/uwf4o6VLXVIVDMlFOdASee/boI1tzbXhtw9/NIOv9Hj2VN6y33GJ722cYZz0Ch75ra/XavEBffh17qrS9aqsp+mGJer08o40weFEj5/9pumuxkbznG/vG3UcBDK74PfSY8uIITMjAzMZPRqmB2AFTzBG8CB2GVdDw/By4gFnlC9+FxUmZnCXXzTFV+i7zijmBYmXwFSTew7jpC399X4ydO2GK7LxOYIXNHDchu35/6kX44Mp3sDC4nkO3z9pSpG/ys3Z6WejFtCjBI7V/a3WNIwqpGmCpOeM0F3bqTWnfdZ1E6feiLTsoafGdeTuBy/fgq8SPE06u8PVjSGild7loXcMpJikFMNuMIUAgC85TzwbIGsOBSamyu9iPZS51njKVBoaYjKYR9uTsgyzSNzbEeEQ1abK+4PVz6rtMyVbnuYbIc4wPFBgmgf1CVelioirJsG/X7/jkNk0uF02EBHSao+9kfzSP9pXWM2cbolBQalE7Ym1qz2QkquJ9wUqWvzDGHq2IJtRZZ85b69oqve7WHKLzdjyzhOJklFpH1dpSf81PEHs1U2zO9QQ6lqYGV+Qgj3UoNIP3uZV4UbNPz4uzMfDM8FB/R89RaniYT0b9QsIXznpR9rvz9+7p4g/Wr/INv8ZYCOfQHzRQjMfq+5afchawZQZu0/F6/iFqhN6+Q+x5tK3qroZC1grzxFzohl5PzkppOXvTH95yAOtjyVVg1EkoIH/qlwn4z+EmaHUSTSWUTac4itbT49zGa+13l0SrEwaDw57i1JrR7ciu8avhHBMLjbA9pM/1ATG2NNapE/p8nGi57qwxzjA+wuxeEfWe/YNz1+hy4KUW0SArDFK4tZnyr7Jo1eXsZSdOpdzTN6+hi+JqIURH16Qs14TihEdC5taz3wKWNhxxTWKTyu3Rm646lO1DgrmRB5JMkPiWMmMvYsm1FoSgG4G6ULu50xFhX5of6qqGRhXq3sDKvMWTJXTjTvKR7+mn6CZsW4AqcP8A29OAxGkBWHlMAJY1MvOIcq8PMeLGp/fjewuh1tsILFhqnhOqCwolog9FXRFmPJnI6gI5qhFHDDGsjapEKo2du+HVV3liOfmj9AOxIzZqGRqBm08DM2TuNDC5ALuSv4x/IvjHi0mVQ/rponCZMRA8BJKuXAPMWa/o3lCQvlKieVZRTNlvXZ0LFXmVTJxQZQLn1p2mkG3vpnzhjqGFLtzqKKGqLC9fojfCAMMS2KagUjj03kFayfBV5IewFF77JH/lhvOYl/4g5WBA0M8F3Ik1g+iz6ljjEW2TXE0l2daZM1RV9Pv8FK+OFnFe5z908GYnEJGrqSAqdi3MNsatV5KhBkPBarDmSgXP/mUGcuwfPFJwka86ac1+LSBxjRpVwBMf1IOnH4yVAHlyX5URX7A0uJkw9Jd1ZXupNzKjobPSc8EYI48BnaVnzwfT10mesJSzATxb54tRH7s6jmMu57rTwHSrja8FvU+QVEPA+DJfsKT78AIE2QUEHtWkbNfD09dxMi+MWBTv+OpcXNUwGAKcex0H0Y6R7kI/Nwu6W4jCz4kuKKqtRaOSrMLu+IDwkGr1rggY+8V4CGWTflKVVi2NiBMDpTyOOAxivVu+fRoOY41dFbyMPa5xY8wL9UJNdnwi6dLASsNfsfxDzZO8h0wnICXJ+6ip7XDK2B0ao1TjwuvMhxCKi2ZHFlKd9T5B8Ka8MZhg40f8Hjj5B5d9RDGlKW9aeHqCieAT2hq1G7kgNbIVz71BLqLqAZ9UsmxNApH+rt2qQOdus3OUtCRJ/S7zHI9a3CahTVMmZhs+jyBEh9ejqeNwKb3rDVSjDYDsIRKlasUehJaZ6wxM3yyWLZ36L3pla+cECZTlPNP8tW3uHOUKh8etPmXYDeQhpcGBFSY9YgyaL+h5qUeRX49vduZfRYF7iY2vT15U3U3+ncKrgIMy5Y22rzzYvSqjfZ6OCg88W6HhnQe+D9+Jj+ZoVEnSOGkE9eY+hKzF546rGMpgcAFcYNKLlSZHK94pg4t27HRmRCqnJT2gpzSgwLlvptNJ61zhZwvjZSA9yQDo3DtMEqMd0UbAQy7HSU2AH0wfDcLixC2M+xqk2nrKgGAgFhBwH34Wt2mgOo4vLXiu4FGwWT/dfMdPN3GDj1d/l2TFMWBubyxH/tfktOWnTTBvmJOilBEOCYhphx30D/NfhrhbxoUe+otJV4LMww0pTARHb1SlFHZE/67thFL4l70QcTSAdH5lmta5ZfppL8eXXgvRMrRAP07OZrQ82or0JfFI67FjHYGhWGJFNd9c8FpKXBI90LNqsj0BGLUS5y4AT4h+opbJ1lIjsU0+2nOcNNEykt78ZGDBRe+GyLcRTXV984HxukfFE3ByB5PeizvNBtcTDUIB0ZR4gNOoTrYgohpLDGLe5lwX3gXXrj3P8ONhTtr6/MG8RPBPuXYhXtCg9E+zlC+atAiu16NCHcY2yRZDqUhpU+lKSK1k97t680CRCi8aPp9mCYohmmADAosA0f5CubsEl83lwSxPTNPkME62itXOQjk/V94cEFC7tI5ewpDbJQoL2qqxTywCRD4mM/9hpeaWTIt9eFv4g9jk7QABlBjLF3mDsN5fPOXJK9n3FCAuQR0HzQ9iuq/NlOkriRodsKRFpsCuaiEr91dJR4r7q1syjDzTPUhmBkzjbtG5aSSv5HNeSEl+NNbfbiK1Idqg+d9gSwT1F9lV6GmvGq7aeKpm3+nfZJs2A5SljIlpWeIZiUFf43lF+AQy81hnBf87TaoReTMiSL5eXkZr1e4VUMec7l7Mto51P8CA+BD85XLw+S6hN7Dq+Qmf4/M+NBE+Ljt7B3+oO5eNwe7GGJaZ7Y8yjIkyYkV/yJ2CFua/b99XfEhVa93503e67KnIe7no/Lp7DW6QkaW6qJ6YYZrPcbJge/pKa2bhWcY+uyCLoFK+0c/GLb20etVctG63Bz5Meyx0zt/yNusox+LlWMZH3WezvQjPN6J/1u7OyQYO0CUWUI83AKRcOOfU7oediphbYUsbL3Rx7V5csq7XP1BWtAMZ5+xlCJ3/or7/777M2NyZjJMVWbYGZn0x06AnZiLRDj0C76O8yXiLKV6n9WEIzhN/fll749UDasu2Fn/Fd+gFgyrabeJPk/ei5IQHhCRuLJJBaV91f/pVSy6MFcKxYw86dUUIzscO3o/U7CxzGTrReinjD9yu+b1MdhqXq59TdbVSb+q/6s0tBGR8TQ1vDb06/QgZSVLH3arB/J04TRC7UvH5a7K4JHzWTjF2WGXaajsOooLCXq21T5StOQPk+IFEJcQJ+781Jxoz5gYSnFBdCop23TUYYhGi1QRmfJurgWlBezMTKACXMN8bJg0bSt/3ofSAIC8iga0JCaSkhQHcNMOV8S+BfDf/VMx8M9rXATo8PHQtRnwsS9ujpTDRFUk8/Ly5fhaWk="}],"role":"model"},"finishReason":"STOP","index":0}]