[
  {
    "sign_ta": "மேஷம்",
    "sign_en": "Aries",
    "date": "02-03-2026",
    "prediction_ta": "இன்று சந்திரனின் ஆதிக்கம் நிறைந்த திங்கட்கிழமை. மேஷ ராசிக்காரர்களே, உங்கள் மன அமைதிக்கும், உள் உணர்வுக்கும் இன்று நீங்கள் அதிக முக்கியத்துவம் கொடுப்பீர்கள். உங்கள் உணர்ச்சிபூர்வமான உலகம் இன்று பிரகாசமாக இருக்கும். வீட்டைச் சார்ந்த விஷயங்களிலும், குடும்ப உறவுகளிலும் மகிழ்ச்சியும் அமைதியும் பெருகும். தாயின் ஆரோக்கியத்தில் கவனம் செலுத்தவும், அவருடன் நேரம் செலவிடுவது உங்களுக்கு மன அமைதியைக் கொடுக்கும். உங்கள் உள்ளுணர்வு இன்று மிகவும் சக்தி வாய்ந்ததாக இருக்கும், முக்கிய முடிவுகள் எடுக்கும்போது உங்கள் மனதின் குரலுக்கு செவிசாய்ப்பது நல்ல பலனைத் தரும். கடந்த காலங்களில் ஏற்பட்ட சில மன வருத்தங்கள் நீங்கி, புதிய நேர்மறை எண்ணங்கள் மனதில் குடிகொள்ளும். இன்று நீங்கள் பொறுமையுடனும், அன்புடனும் செயல்பட வேண்டும். அவசர முடிவுகளைத் தவிர்ப்பது நல்லது. குடும்ப உறுப்பினர்களுடன் இணக்கமாகச் செயல்படுவது மகிழ்ச்சியை அதிகரிக்கும். சிறுசிறு கருத்து வேறுபாடுகள் ஏற்பட்டாலும், அவற்றை சாதுரியமாக கையாண்டு சுமூகமான சூழலை உருவாக்குவீர்கள். இன்று உங்கள் படைப்பாற்றல் மேம்படும், கலை சார்ந்த துறைகளில் ஆர்வம் உள்ளவர்கள் புதிய முயற்சிகளை மேற்கொள்ளலாம். அது நல்ல பலனைத் தரும். வீட்டிற்குத் தேவையான பொருட்களை வாங்குவதற்கோ, வீட்டை அழகுபடுத்துவதற்கோ இது ஒரு சிறந்த நாளாகும். உங்கள் சமூக வட்டாரத்தில் சில புதிய தொடர்புகள் உருவாகலாம், அவை எதிர்காலத்தில் உங்களுக்கு பல வழிகளில் உதவக்கூடும். ஆன்மீக நாட்டம் அதிகரிக்கும், தியானம், யோகா போன்ற அமைதியான செயல்பாடுகளில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி தரும். உங்கள் உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது மிக அவசியம். சத்தான உணவையும், போதுமான ஓய்வையும் எடுத்துக்கொள்ள வேண்டும். உடல் ரீதியாகவும், மன ரீதியாகவும் உங்களை நீங்கள் வலுப்படுத்திக் கொள்ள இது ஒரு நல்ல வாய்ப்பு. இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி ஒரு படி முன்னேறுவீர்கள். உங்கள் மனதில் உள்ள நேர்மறை எண்ணங்கள், உங்களை சூழ்ந்திருப்பவர்களுக்கும் பரவும். சுற்றிலும் ஒரு மகிழ்ச்சியான சூழல் உருவாகும். தன்னம்பிக்கையுடன் செயல்பட்டால் வெற்றி நிச்சயம். புதிய திட்டங்களை இப்போதே தொடங்கலாம், அவை நீண்ட காலத்திற்கு நல்ல பலன்களைக் கொடுக்கும். உங்கள் முயற்சிகளுக்கு நல்ல ஆதரவு கிடைக்கும். குடும்பத்தில் மூத்தவர்களின் ஆசீர்வாதம் உங்களுக்கு ஒரு பெரிய பலமாக அமையும். மற்றவர்களுக்கு உதவ வாய்ப்பு கிடைத்தால், தயங்காமல் உதவுங்கள், அது உங்களுக்கு மன நிறைவைத் தரும். உங்கள் அன்றாட பணிகளை சீராக முடிக்க முடியும். நிதி ரீதியாக திட்டமிடுவதற்கு இது ஒரு சிறந்த நாளாகும். எதிர்பாராத ஆதாயங்கள் வர வாய்ப்புள்ளது. இன்று நீங்கள் உங்களின் சுய முன்னேற்றத்தில் கவனம் செலுத்துவீர்கள். உங்கள் திறமைகளை வளர்த்துக்கொள்ள புதிய வழிகளை ஆராய்வீர்கள். மொத்தத்தில், இன்று ஒரு மன அமைதி நிறைந்த, குடும்ப மகிழ்ச்சி பெருகும் நாளாக அமையும்.",
    "prediction_en": "Today, being Monday under the influence of the Moon, Aries natives, you will give great importance to your mental peace and inner feelings. Your emotional world will be bright today. Happiness and peace will abound in home-related matters and family relationships. Pay attention to your mother's health; spending time with her will bring you mental peace. Your intuition will be very powerful today, and listening to your inner voice when making important decisions will yield good results. Some past emotional grievances will disappear, and new positive thoughts will take root in your mind. Today you should act with patience and love. It is good to avoid hasty decisions. Working harmoniously with family members will increase happiness. Even if minor disagreements arise, you will skillfully handle them and create a harmonious environment. Your creativity will improve today; those interested in artistic fields can undertake new ventures, which will yield good results. This is an excellent day to buy household items or beautify your home. Some new contacts may form in your social circle, which could help you in many ways in the future. Spiritual inclination will increase; engaging in peaceful activities like meditation and yoga will rejuvenate your mind. It is very important to pay attention to your physical health. You must take nutritious food and adequate rest. This is a good opportunity to strengthen yourself physically and mentally. Today you will take a step forward towards your goals. The positive thoughts in your mind will spread to those around you, creating a joyful atmosphere. Success is certain if you act with self-confidence. You can start new projects now, and they will yield good results in the long run. You will receive good support for your endeavors. The blessings of elders in the family will be a great strength to you. If you get an opportunity to help others, do not hesitate; it will give you mental satisfaction. You will be able to complete your daily tasks smoothly. This is an excellent day for financial planning. Unexpected gains are likely. Today you will focus on your self-improvement and explore new ways to develop your skills. Overall, today will be a day filled with mental peace and increased family happiness.",
    "career_ta": "வேலையில் மன அமைதியுடன் செயல்படுவீர்கள். சகாக்களுடன் நல்லுறவு மேலோங்கும். புதிய திட்டங்களில் ஈடுபடும்போது, உங்கள் உள்ளுணர்வை நம்பி செயல்படுவது நல்ல பலனைத் தரும். உங்கள் திறமைகளை வெளிப்படுத்த இது ஒரு சிறந்த வாய்ப்பு.",
    "career_en": "You will work with mental peace in your job. Good relationships with colleagues will prevail. When engaging in new projects, trusting your intuition will yield good results. This is an excellent opportunity to showcase your talents.",
    "finance_ta": "நிதி மேலாண்மையில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் தேவைகளுக்காக செலவுகள் ஏற்படலாம். சேமிப்பை அதிகரிப்பதற்கான வழிகளை ஆராய்வீர்கள். புத்திசாலித்தனமான முதலீடுகள் நல்ல பலனைத் தரும்.",
    "finance_en": "You will focus on financial management. Expenses may arise for family needs. You will explore ways to increase savings. Wise investments will yield good returns.",
    "health_ta": "உடல் மற்றும் மன ஆரோக்கியத்தில் அதிக கவனம் செலுத்துவீர்கள். மன அழுத்தத்தைக் குறைப்பதற்கான செயல்பாடுகளில் ஈடுபடுவீர்கள். போதுமான ஓய்வும், சத்தான உணவும் இன்றியமையாதது. அமைதியான சூழல் உங்களுக்கு நன்மை பயக்கும்.",
    "health_en": "You will pay more attention to physical and mental health. You will engage in activities to reduce stress. Adequate rest and nutritious food are essential. A peaceful environment will benefit you.",
    "lucky_number": "9",
    "lucky_color_ta": "சிவப்பு",
    "lucky_color_en": "Red"
  },
  {
    "sign_ta": "ரிஷபம்",
    "sign_en": "Taurus",
    "date": "02-03-2026",
    "prediction_ta": "இன்று சந்திரனின் ஆதிக்கம் நிறைந்த திங்கட்கிழமை, ரிஷப ராசிக்காரர்களே, உங்கள் மனதின் ஆழமான உணர்வுகளை வெளிப்படுத்துவதற்கும், உள் அமைதியை அடைவதற்கும் இன்று மிகவும் சாதகமான நாளாகும். நீங்கள் வழக்கமாக நாடும் நிலைத்தன்மையும், பாதுகாப்பும் இன்று குடும்பம் மற்றும் நெருங்கிய உறவுகளில் இருந்து வரும். சந்திரனின் தாக்கம் உங்கள் பேச்சுத் திறனையும், தகவல் பரிமாற்றத்தையும் மேம்படுத்தும். இதனால் உங்கள் எண்ணங்களை தெளிவாகவும், உணர்வுபூர்வமாகவும் வெளிப்படுத்த முடியும். சகோதர சகோதரிகளுடன் உறவுகள் வலுப்பெறும். அவர்களுடன் இணைந்து புதிய காரியங்களைச் செய்ய திட்டமிடலாம். குறுகிய தூரப் பயணங்கள் அல்லது அக்கம் பக்கத்தினருடன் தொடர்புகள் இன்று இனிமையாக அமையும். வீட்டில் ஒரு மகிழ்ச்சியான சூழல் நிலவும். குடும்ப உறுப்பினர்களுடன் மனம் விட்டுப் பேசுவதன் மூலம் உங்கள் உறவுகளில் புரிதல் அதிகரிக்கும். உங்கள் திறமைகளை வெளிப்படுத்தவும், உங்கள் கருத்துக்களை மற்றவர்களுடன் பகிர்ந்து கொள்ளவும் இது ஒரு நல்ல வாய்ப்பாகும். நிதி விஷயங்களில் கவனமாக செயல்படுவீர்கள். சேமிப்பை அதிகரிப்பதற்கான வழிகளை ஆராய்வீர்கள். நீங்கள் மேற்கொள்ளும் முயற்சிகளுக்கு நல்ல பலன் கிடைக்கும். உங்கள் கடின உழைப்பு அங்கீகரிக்கப்படும். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும். மன அமைதிக்கு உதவும் தியானம் அல்லது யோகா போன்ற பயிற்சிகளில் ஈடுபடலாம். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்துவதற்கும் இது ஒரு சிறந்த நாளாகும். நீங்கள் படிக்கும் மாணவர்கள் என்றால், இன்று உங்கள் கல்வி முயற்சிகளில் நல்ல முன்னேற்றத்தைக் காண்பீர்கள். ஆசிரியர்களின் வழிகாட்டுதல் உங்களுக்கு பெரிதும் உதவும். அலுவலகத்தில் உங்கள் பணிகள் சீராக நடைபெறும், சகாக்களின் ஒத்துழைப்பு கிடைக்கும். நீண்ட நாட்களாக தடைபட்டிருந்த சில காரியங்கள் இன்று முடிவுக்கு வரும். சமூகத்தில் உங்கள் மதிப்பு உயரும். தொண்டு நிறுவனங்களுக்கு உதவுவதன் மூலம் உங்களுக்கு மன நிறைவு கிடைக்கும். உங்கள் படைப்பாற்றல் இன்று மேம்படும், புதிய கலை முயற்சிகளை மேற்கொள்ளலாம். நீங்கள் உணர்வுபூர்வமாக வெளிப்படையாக இருப்பதன் மூலம், உங்கள் உறவுகள் மேலும் வலுப்பெறும். உங்கள் மனதில் உள்ள நல்ல எண்ணங்களை வெளிப்படுத்துங்கள். நேர்மறை சிந்தனைகள் உங்களை சூழ்ந்திருக்கும். மொத்தத்தில், இன்று ஒரு மனநிறைவான மற்றும் உறவுகள் வலுப்பெறும் நாளாக அமையும்.",
    "prediction_en": "Today, being Monday under the influence of the Moon, Taurus natives, it is a very favorable day for expressing your deep inner feelings and achieving inner peace. The stability and security you usually seek will come from family and close relationships today. The Moon's influence will enhance your communication skills and ability to express your thoughts clearly and emotionally. Relationships with siblings will strengthen, and you may plan new ventures with them. Short trips or interactions with neighbors will be pleasant today. A joyful atmosphere will prevail at home. Open conversations with family members will increase understanding in your relationships. This is a good opportunity to showcase your talents and share your views with others. You will act carefully in financial matters and explore ways to increase savings. Your endeavors will yield good results, and your hard work will be recognized. You should pay attention to your health. You can engage in practices like meditation or yoga to aid mental peace. This is an excellent day for learning new things and enhancing your knowledge. If you are a student, you will see good progress in your academic pursuits today. Guidance from teachers will be very helpful. Your tasks at the office will proceed smoothly, and you will receive cooperation from colleagues. Some long-delayed tasks will come to an end today. Your reputation in society will increase. Helping charitable organizations will bring you mental satisfaction. Your creativity will improve today, and you can undertake new artistic endeavors. By being emotionally expressive, your relationships will strengthen further. Express the good thoughts in your mind. Positive thoughts will surround you. Overall, today will be a day of contentment and strengthening relationships.",
    "career_ta": "வேலையில் உங்கள் கருத்துக்களை தெளிவாக எடுத்துரைப்பீர்கள். சக ஊழியர்களுடன் இணக்கமாகப் பணியாற்றுவீர்கள். புதிய திட்டங்களில் உங்கள் பங்களிப்பு பாராட்டப்படும். தகவல் பரிமாற்ற திறன்கள் இன்று நன்மை பயக்கும்.",
    "career_en": "You will clearly articulate your ideas at work. You will work harmoniously with colleagues. Your contribution to new projects will be appreciated. Communication skills will be beneficial today.",
    "finance_ta": "நிதி நிலையை மேம்படுத்த புதிய வாய்ப்புகள் உருவாகும். சேமிப்பு மற்றும் முதலீடுகளில் கவனம் செலுத்துவீர்கள். குடும்பத்திற்கான செலவுகளை திறம்பட நிர்வகிப்பீர்கள். எதிர்பாராத சிறு ஆதாயங்கள் கிடைக்கலாம்.",
    "finance_en": "New opportunities to improve financial status will arise. You will focus on savings and investments. You will effectively manage expenses for the family. Minor unexpected gains may occur.",
    "health_ta": "உடல்நலனில் நல்ல முன்னேற்றம் காண்பீர்கள். மன அமைதி உங்கள் ஆரோக்கியத்திற்கு உதவும். நீர்ச்சத்து மிகுந்த உணவுகளை எடுத்துக்கொள்வது நல்லது. போதுமான ஓய்வு புத்துணர்ச்சி அளிக்கும்.",
    "health_en": "You will see good progress in your health. Mental peace will aid your well-being. Consuming water-rich foods is beneficial. Adequate rest will bring rejuvenation.",
    "lucky_number": "6",
    "lucky_color_ta": "வெளிர் நீலம்",
    "lucky_color_en": "Light Blue"
  },
  {
    "sign_ta": "மிதுனம்",
    "sign_en": "Gemini",
    "date": "02-03-2026",
    "prediction_ta": "இன்று சந்திரனின் ஆதிக்கம் நிறைந்த திங்கட்கிழமை, மிதுன ராசிக்காரர்களே, உங்கள் நிதி நிலைமையிலும், குடும்ப வருமானத்திலும் இன்று நல்ல முன்னேற்றம் காண்பீர்கள். சந்திரனின் தாக்கம் உங்கள் மன அமைதியையும், பாதுகாப்பு உணர்வையும் அதிகரிக்கும். உங்கள் பேச்சுத்திறன் இன்று வழக்கத்தை விட அதிகமாகவே பளிச்சிடும். எனவே, உங்கள் எண்ணங்களை தெளிவாகவும், உறுதியாகவும் வெளிப்படுத்த முடியும். இது நிதி தொடர்பான பேச்சுவார்த்தைகளிலும், முதலீடுகளைப் பற்றிய முடிவுகளிலும் உங்களுக்கு சாதகமாக அமையும். குடும்பத்தில் மகிழ்ச்சி நிலவும். உறவினர்களுடன் நல்லுறவு மேம்படும். நீண்ட நாட்களாக சந்திக்காத பழைய நண்பர்களை சந்திக்கும் வாய்ப்பு கிட்டும், அது உங்களுக்கு மன மகிழ்ச்சியைத் தரும். வீட்டில் சுப காரியங்கள் பற்றி பேசலாம் அல்லது புதிய திட்டங்களை தீட்டலாம். இன்று உங்கள் திறமைகளை பயன்படுத்தி வருமானத்தை அதிகரிப்பதற்கான வழிகளை ஆராய்வீர்கள். புதிய முயற்சிகளில் ஈடுபடுவதற்கு இது ஒரு சிறந்த நாளாகும். உங்கள் கடின உழைப்புக்கு ஏற்ற பலன் கிடைக்கும். உங்கள் சேமிப்பை அதிகரிப்பதற்கான ஆலோசனைகளை இன்று கேட்கலாம். புத்திசாலித்தனமான முடிவுகள் உங்களுக்கு நீண்ட கால ஆதாயங்களைத் தரும். ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும். மன அமைதிக்கு தியானம் அல்லது யோகா போன்ற பயிற்சிகளில் ஈடுபடலாம். இது உங்கள் மன அழுத்தத்தை குறைத்து, தெளிவான சிந்தனையை ஏற்படுத்தும். உங்கள் அன்றாட வேலைகளை திட்டமிட்டு செய்வதன் மூலம், நல்ல பலன்களை அடைய முடியும். கல்வித் துறையில் இருப்பவர்கள் நல்ல முன்னேற்றத்தைக் காண்பார்கள். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கு இது ஒரு சிறந்த நாளாகும். அலுவலகத்தில் உங்கள் பணிகள் சீராக நடைபெறும், சக ஊழியர்களின் ஒத்துழைப்பு கிடைக்கும். உங்கள் தலைமைத்துவப் பண்புகள் இன்று வெளிப்படும். சமூகத்தில் உங்கள் மதிப்பு உயரும். மற்றவர்களுக்கு உதவ வாய்ப்பு கிடைத்தால், தயங்காமல் உதவுங்கள், அது உங்களுக்கு மன நிறைவைத் தரும். உங்கள் உள்ளுணர்வை நம்பி செயல்படுங்கள். இன்று நீங்கள் உணர்வுபூர்வமாக வெளிப்படையாக இருப்பதன் மூலம், உங்கள் உறவுகள் மேலும் வலுப்பெறும். உங்கள் மனதில் உள்ள நல்ல எண்ணங்களை வெளிப்படுத்துங்கள். நேர்மறை சிந்தனைகள் உங்களை சூழ்ந்திருக்கும். மொத்தத்தில், இன்று ஒரு மனநிறைவான மற்றும் நிதி ரீதியாக நல்ல நாளாக அமையும்.",
    "prediction_en": "Today, being Monday under the influence of the Moon, Gemini natives, you will see good progress in your financial situation and family income. The Moon's influence will increase your mental peace and sense of security. Your communication skills will shine more than usual today, allowing you to express your thoughts clearly and decisively. This will be favorable in financial negotiations and investment decisions. Happiness will prevail in the family, and good relationships with relatives will improve. You may get an opportunity to meet old friends whom you haven't met for a long time, which will bring you joy. You can discuss auspicious events at home or plan new projects. Today, you will explore ways to increase your income by utilizing your talents. This is an excellent day to engage in new ventures. You will receive rewards commensurate with your hard work. You can seek advice today on increasing your savings. Wise decisions will bring you long-term gains. You should pay attention to your health. You can engage in practices like meditation or yoga for mental peace. This will reduce your stress and lead to clear thinking. By planning your daily tasks, you can achieve good results. Those in the education sector will see good progress. This is an excellent day for learning new things. Your tasks at the office will proceed smoothly, and you will receive cooperation from colleagues. Your leadership qualities will emerge today. Your reputation in society will increase. If you get an opportunity to help others, do not hesitate; it will bring you mental satisfaction. Trust your intuition. Today, by being emotionally open, your relationships will strengthen further. Express the good thoughts in your mind. Positive thoughts will surround you. Overall, today will be a day of contentment and financial well-being.",
    "career_ta": "வேலையில் புதிய வாய்ப்புகள் உருவாகும். உங்கள் திறமைகளை வெளிப்படுத்தி பாராட்டு பெறுவீர்கள். பேச்சுவார்த்தைகள் சாதகமாக அமையும். குழுப்பணிகளில் உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும்.",
    "career_en": "New opportunities will arise at work. You will showcase your talents and receive appreciation. Negotiations will be favorable. Your contribution to teamwork will gain importance.",
    "finance_ta": "நிதி நிலைமை சிறப்பாக இருக்கும். புதிய வருமான வழிகள் உருவாகலாம். சேமிப்பு அதிகரிக்கும். முதலீடுகள் குறித்து நிதானமாக முடிவெடுப்பது நல்லது. எதிர்பாராத ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது.",
    "finance_en": "Financial situation will be good. New sources of income may emerge. Savings will increase. It is good to make investment decisions carefully. Unexpected gains are likely.",
    "health_ta": "மன அழுத்தம் குறையும். உற்சாகமாக உணர்வீர்கள். சீரான உணவு முறையும், உடற்பயிற்சியும் அவசியம். ஆழ்ந்த உறக்கம் உங்கள் ஆரோக்கியத்திற்கு உதவும். இயற்கையுடன் நேரம் செலவிடுவது நல்லது.",
    "health_en": "Stress will reduce. You will feel energetic. A balanced diet and exercise are essential. Deep sleep will aid your health. Spending time with nature is beneficial.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "02-03-2026",
    "prediction_ta": "இன்று சந்திரனின் ஆதிக்கம் நிறைந்த திங்கட்கிழமை, கடக ராசிக்காரர்களே, சந்திரன் உங்களின் ராசி நாதன் என்பதால், இன்று உங்களுக்கு மிகவும் சாதகமான நாளாகும். மன அமைதி, குடும்ப மகிழ்ச்சி, உள் உணர்வு மேம்பாடு ஆகிய அனைத்தும் இன்று உங்களுக்கு சிறப்பாக அமையும். உங்கள் உணர்வுகள் தெளிவுடனும், நேர்மறையாகவும் இருக்கும். உங்கள் மனதில் உள்ள திட்டங்களை செயல்படுத்துவதற்கான நல்ல வாய்ப்புகள் இன்று உருவாகும். குடும்ப உறுப்பினர்களுடன் உறவுகள் மேலும் வலுப்பெறும். குறிப்பாக தாயின் ஆதரவும், ஆலோசனையும் உங்களுக்கு பெரிய பலமாக அமையும். வீட்டைச் சார்ந்த விஷயங்களில் மகிழ்ச்சியும், அமைதியும் பெருகும். நீண்ட நாட்களாக தடைபட்டிருந்த சுப காரியங்களை இன்று தொடங்கலாம் அல்லது அதற்கான திட்டங்களை தீட்டலாம். உங்கள் இயல்பான உதவும் மனப்பான்மை இன்று வெளிப்படும், மற்றவர்களுக்கு உதவுவதன் மூலம் உங்களுக்கு மன நிறைவு கிடைக்கும். உங்கள் படைப்பாற்றல் மேம்படும், கலை மற்றும் பொழுதுபோக்கு துறைகளில் உள்ளவர்கள் நல்ல முன்னேற்றத்தைக் காண்பார்கள். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் திறமைகளை வளர்த்துக்கொள்வதற்கும் இது ஒரு சிறந்த நாளாகும். இன்று நீங்கள் மேற்கொள்ளும் முயற்சிகளுக்கு நல்ல பலன்கள் கிடைக்கும். தன்னம்பிக்கையுடன் செயல்பட்டால் வெற்றி நிச்சயம். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும். மன அமைதிக்கு உதவும் தியானம் அல்லது யோகா போன்ற பயிற்சிகளில் ஈடுபடலாம். இது உங்கள் மன அழுத்தத்தை குறைத்து, தெளிவான சிந்தனையை ஏற்படுத்தும். நிதி ரீதியாக திட்டமிடுவதற்கு இது ஒரு சிறந்த நாளாகும். எதிர்பாராத ஆதாயங்கள் வர வாய்ப்புள்ளது. உங்கள் கடின உழைப்பு அங்கீகரிக்கப்படும். அலுவலகத்தில் உங்கள் பணிகள் சீராக நடைபெறும், சகாக்களின் ஒத்துழைப்பு கிடைக்கும். புதிய திட்டங்களில் உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். சமூகத்தில் உங்கள் மதிப்பு உயரும். நீண்ட நாட்களாக நிறைவேறாத ஆசைகள் இன்று நிறைவேற வாய்ப்புள்ளது. உங்கள் உள்ளுணர்வை நம்பி செயல்படுங்கள். இன்று நீங்கள் உணர்வுபூர்வமாக வெளிப்படையாக இருப்பதன் மூலம், உங்கள் உறவுகள் மேலும் வலுப்பெறும். உங்கள் மனதில் உள்ள நல்ல எண்ணங்களை வெளிப்படுத்துங்கள். நேர்மறை சிந்தனைகள் உங்களை சூழ்ந்திருக்கும். மொத்தத்தில், இன்று ஒரு மனநிறைவான மற்றும் உணர்வுபூர்வமாக சிறந்த நாளாக அமையும்.",
    "prediction_en": "Today, being Monday under the influence of the Moon, Cancer natives, as the Moon is your ruling planet, today is a very favorable day for you. Mental peace, family happiness, and enhanced intuition will all be excellent for you today. Your feelings will be clear and positive. Good opportunities will arise today to implement the plans in your mind. Relationships with family members will strengthen further. Especially, your mother's support and advice will be a great strength to you. Happiness and peace will abound in home-related matters. You can start long-delayed auspicious events today or plan for them. Your natural helpfulness will emerge today, and helping others will bring you mental satisfaction. Your creativity will improve, and those in arts and entertainment fields will see good progress. This is an excellent day for learning new things and developing your skills. Your endeavors today will yield good results. Success is certain if you act with self-confidence. You should pay attention to your health. You can engage in practices like meditation or yoga for mental peace. This will reduce your stress and lead to clear thinking. This is an excellent day for financial planning. Unexpected gains are likely. Your hard work will be recognized. Your tasks at the office will proceed smoothly, and you will receive cooperation from colleagues. Your contribution to new projects will gain importance. Your reputation in society will increase. Long-unfulfilled desires are likely to be realized today. Trust your intuition. Today, by being emotionally open, your relationships will strengthen further. Express the good thoughts in your mind. Positive thoughts will surround you. Overall, today will be a day of contentment and emotional excellence.",
    "career_ta": "வேலையில் புதிய பொறுப்புகள் கிடைக்கும். உங்கள் திறமைகளை வெளிப்படுத்தி பாராட்டு பெறுவீர்கள். சகாக்களுடன் நல்லுறவு மேலோங்கும். புதிய திட்டங்களில் உங்கள் பங்களிப்பு முக்கியமானதாகக் கருதப்படும். உங்கள் தலைமைத்துவப் பண்புகள் வெளிப்படும்.",
    "career_en": "You will get new responsibilities at work. You will showcase your talents and receive appreciation. Good relationships with colleagues will prevail. Your contribution to new projects will be considered important. Your leadership qualities will emerge.",
    "finance_ta": "நிதி நிலைமை சிறப்பாக இருக்கும். எதிர்பாராத ஆதாயங்கள் வர வாய்ப்புள்ளது. சேமிப்பு மற்றும் முதலீடுகளில் கவனம் செலுத்துவீர்கள். குடும்பத்திற்கான செலவுகளை திறம்பட நிர்வகிப்பீர்கள். புதிய வருமான வழிகளை ஆராய்வீர்கள்.",
    "finance_en": "Financial situation will be good. Unexpected gains are likely. You will focus on savings and investments. You will effectively manage expenses for the family. You will explore new sources of income.",
    "health_ta": "உடல் மற்றும் மன ஆரோக்கியத்தில் நல்ல முன்னேற்றம் காண்பீர்கள். மன அமைதி உங்கள் ஆரோக்கியத்திற்கு உதவும். சத்தான உணவையும், போதுமான ஓய்வையும் எடுத்துக்கொள்ள வேண்டும். நீர்ச்சத்து மிகுந்த உணவுகள் நன்மை பயக்கும்.",
    "health_en": "You will see good progress in physical and mental health. Mental peace will aid your well-being. You must take nutritious food and adequate rest. Water-rich foods will be beneficial.",
    "lucky_number": "2",
    "lucky_color_ta": "வெள்ளை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "சிம்மம்",
    "sign_en": "Leo",
    "date": "02-03-2026",
    "prediction_ta": "இன்று சந்திரனின் ஆதிக்கம் நிறைந்த திங்கட்கிழமை, சிம்ம ராசிக்காரர்களே, உங்கள் உள் உணர்வுக்கும், ஆன்மீக விஷயங்களுக்கும் இன்று நீங்கள் அதிக முக்கியத்துவம் கொடுப்பீர்கள். சந்திரனின் தாக்கம் உங்கள் மன அமைதியையும், உள்முக சிந்தனையையும் மேம்படுத்தும். பொதுவாகவே நீங்கள் வெளிப்படையாக செயல்படுபவர் என்றாலும், இன்று சற்று அமைதியாகவும், சிந்தித்தும் செயல்படுவீர்கள். உங்கள் மனதில் சில புதிய எண்ணங்கள் உருவாகலாம், அவற்றை சீராக செயல்படுத்துவதற்கு நேரம் ஒதுக்குவீர்கள். கடந்த காலங்களில் ஏற்பட்ட சில மன வருத்தங்கள் நீங்கி, புதிய நேர்மறை எண்ணங்கள் மனதில் குடிகொள்ளும். இன்று நீங்கள் பொறுமையுடனும், அன்புடனும் செயல்பட வேண்டும். அவசர முடிவுகளைத் தவிர்ப்பது நல்லது. குடும்ப உறுப்பினர்களுடன் இணக்கமாகச் செயல்படுவது மகிழ்ச்சியை அதிகரிக்கும். சிறுசிறு கருத்து வேறுபாடுகள் ஏற்பட்டாலும், அவற்றை சாதுரியமாக கையாண்டு சுமூகமான சூழலை உருவாக்குவீர்கள். உங்கள் படைப்பாற்றல் மேம்படும், கலை சார்ந்த துறைகளில் ஆர்வம் உள்ளவர்கள் புதிய முயற்சிகளை மேற்கொள்ளலாம், அது நல்ல பலனைத் தரும். ஆன்மீக நாட்டம் அதிகரிக்கும், தியானம், யோகா போன்ற அமைதியான செயல்பாடுகளில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி தரும். உங்கள் உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது மிக அவசியம். சத்தான உணவையும், போதுமான ஓய்வையும் எடுத்துக்கொள்ள வேண்டும். உடல் ரீதியாகவும், மன ரீதியாகவும் உங்களை நீங்கள் வலுப்படுத்திக் கொள்ள இது ஒரு நல்ல வாய்ப்பு. இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி ஒரு படி முன்னேறுவீர்கள். உங்கள் மனதில் உள்ள நேர்மறை எண்ணங்கள், உங்களை சூழ்ந்திருப்பவர்களுக்கும் பரவும். சுற்றிலும் ஒரு மகிழ்ச்சியான சூழல் உருவாகும். தன்னம்பிக்கையுடன் செயல்பட்டால் வெற்றி நிச்சயம். புதிய திட்டங்களை இப்போதே தொடங்கலாம், அவை நீண்ட காலத்திற்கு நல்ல பலன்களைக் கொடுக்கும். உங்கள் முயற்சிகளுக்கு நல்ல ஆதரவு கிடைக்கும். குடும்பத்தில் மூத்தவர்களின் ஆசீர்வாதம் உங்களுக்கு ஒரு பெரிய பலமாக அமையும். மற்றவர்களுக்கு உதவ வாய்ப்பு கிடைத்தால், தயங்காமல் உதவுங்கள், அது உங்களுக்கு மன நிறைவைத் தரும். உங்கள் அன்றாட பணிகளை சீராக முடிக்க முடியும். நிதி ரீதியாக திட்டமிடுவதற்கு இது ஒரு சிறந்த நாளாகும். எதிர்பாராத ஆதாயங்கள் வர வாய்ப்புள்ளது. இன்று நீங்கள் உங்களின் சுய முன்னேற்றத்தில் கவனம் செலுத்துவீர்கள். உங்கள் திறமைகளை வளர்த்துக்கொள்ள புதிய வழிகளை ஆராய்வீர்கள். மொத்தத்தில், இன்று ஒரு மன அமைதி நிறைந்த, உள்முக சிந்தனை மேம்படும் நாளாக அமையும்.",
    "prediction_en": "Today, being Monday under the influence of the Moon, Leo natives, you will give great importance to your inner feelings and spiritual matters. The Moon's influence will enhance your mental peace and introspection. Although you are usually an outspoken person, today you will act a little more calmly and thoughtfully. Some new ideas may emerge in your mind, and you will dedicate time to implement them smoothly. Some past emotional grievances will disappear, and new positive thoughts will take root in your mind. Today you should act with patience and love. It is good to avoid hasty decisions. Working harmoniously with family members will increase happiness. Even if minor disagreements arise, you will skillfully handle them and create a harmonious environment. Your creativity will improve; those interested in artistic fields can undertake new ventures, which will yield good results. Spiritual inclination will increase; engaging in peaceful activities like meditation and yoga will rejuvenate your mind. It is very important to pay attention to your physical health. You must take nutritious food and adequate rest. This is a good opportunity to strengthen yourself physically and mentally. Today you will take a step forward towards your goals. The positive thoughts in your mind will spread to those around you, creating a joyful atmosphere. Success is certain if you act with self-confidence. You can start new projects now, and they will yield good results in the long run. You will receive good support for your endeavors. The blessings of elders in the family will be a great strength to you. If you get an opportunity to help others, do not hesitate; it will give you mental satisfaction. You will be able to complete your daily tasks smoothly. This is an excellent day for financial planning. Unexpected gains are likely. Today you will focus on your self-improvement and explore new ways to develop your skills. Overall, today will be a day filled with mental peace and enhanced introspection.",
    "career_ta": "வேலையில் அமைதியாகவும், சிந்தித்தும் செயல்படுவீர்கள். உங்கள் முடிவுகள் தெளிவாக இருக்கும். சகாக்களின் ஒத்துழைப்பு கிடைக்கும். புதிய திட்டங்களில் ஈடுபடும்போது, உங்கள் உள்மனது சொல்வதைக் கேட்பது நல்லது.",
    "career_en": "You will work calmly and thoughtfully in your job. Your decisions will be clear. You will receive cooperation from colleagues. When engaging in new projects, it is good to listen to your inner voice.",
    "finance_ta": "நிதி விஷயங்களில் நிதானமாக முடிவெடுப்பீர்கள். எதிர்பாராத சிறு ஆதாயங்கள் கிடைக்கலாம். சேமிப்பை அதிகரிப்பதற்கான வழிகளை ஆராய்வீர்கள். குடும்பத்தின் தேவைகளுக்காக செலவுகள் ஏற்படலாம், அவற்றை திறம்பட நிர்வகிப்பீர்கள்.",
    "finance_en": "You will make financial decisions calmly. Minor unexpected gains may occur. You will explore ways to increase savings. Expenses may arise for family needs, which you will manage effectively.",
    "health_ta": "உடல் மற்றும் மன ஆரோக்கியத்தில் கவனம் செலுத்துவீர்கள். மன அமைதிக்கு உதவும் தியானம், யோகா போன்ற பயிற்சிகளில் ஈடுபடுவீர்கள். போதுமான ஓய்வும், சத்தான உணவும் அவசியம். இயற்கையுடன் நேரம் செலவிடுவது நல்லது.",
    "health_en": "You will pay attention to physical and mental health. You will engage in practices like meditation and yoga to aid mental peace. Adequate rest and nutritious food are essential. Spending time with nature is beneficial.",
    "lucky_number": "1",
    "lucky_color_ta": "ஆரஞ்சு",
    "lucky_color_en": "Orange"
  },
  {
    "sign_ta": "கன்னி",
    "sign_en": "Virgo",
    "date": "02-03-2026",
    "prediction_ta": "இன்று சந்திரனின் ஆதிக்கம் நிறைந்த திங்கட்கிழமை, கன்னி ராசிக்காரர்களே, உங்கள் சமூக வட்டாரம் இன்று உங்களுக்கு மிகுந்த மகிழ்ச்சியையும், ஆதரவையும் தரும். சந்திரனின் தாக்கம் உங்கள் மன அமைதியையும், குழுப்பணிகளில் இணக்கத்தையும் மேம்படுத்தும். நண்பர்களுடனும், சமூக குழுக்களுடனும் நல்லுறவு மேம்படும். அவர்களுடன் இணைந்து புதிய திட்டங்களைச் செய்ய திட்டமிடலாம். நீண்ட நாட்களாக சந்திக்காத பழைய நண்பர்களை சந்திக்கும் வாய்ப்பு கிட்டும், அது உங்களுக்கு மன மகிழ்ச்சியைத் தரும். உங்கள் இலக்குகளை அடைய நண்பர்கள் மற்றும் சமூக வலைப்பின்னல்கள் உங்களுக்கு பெரிதும் உதவும். உங்கள் திறமைகளை வெளிப்படுத்தவும், உங்கள் கருத்துக்களை மற்றவர்களுடன் பகிர்ந்து கொள்ளவும் இது ஒரு நல்ல வாய்ப்பாகும். நிதி விஷயங்களில் கவனமாக செயல்படுவீர்கள். சேமிப்பை அதிகரிப்பதற்கான வழிகளை ஆராய்வீர்கள். நீங்கள் மேற்கொள்ளும் முயற்சிகளுக்கு நல்ல பலன் கிடைக்கும். உங்கள் கடின உழைப்பு அங்கீகரிக்கப்படும். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும். மன அமைதிக்கு உதவும் தியானம் அல்லது யோகா போன்ற பயிற்சிகளில் ஈடுபடலாம். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்துவதற்கும் இது ஒரு சிறந்த நாளாகும். நீங்கள் படிக்கும் மாணவர்கள் என்றால், இன்று உங்கள் கல்வி முயற்சிகளில் நல்ல முன்னேற்றத்தைக் காண்பீர்கள். ஆசிரியர்களின் வழிகாட்டுதல் உங்களுக்கு பெரிதும் உதவும். அலுவலகத்தில் உங்கள் பணிகள் சீராக நடைபெறும், சகாக்களின் ஒத்துழைப்பு கிடைக்கும். நீண்ட நாட்களாக தடைபட்டிருந்த சில காரியங்கள் இன்று முடிவுக்கு வரும். சமூகத்தில் உங்கள் மதிப்பு உயரும். தொண்டு நிறுவனங்களுக்கு உதவுவதன் மூலம் உங்களுக்கு மன நிறைவு கிடைக்கும். உங்கள் படைப்பாற்றல் இன்று மேம்படும், புதிய கலை முயற்சிகளை மேற்கொள்ளலாம். நீங்கள் உணர்வுபூர்வமாக வெளிப்படையாக இருப்பதன் மூலம், உங்கள் உறவுகள் மேலும் வலுப்பெறும். உங்கள் மனதில் உள்ள நல்ல எண்ணங்களை வெளிப்படுத்துங்கள். நேர்மறை சிந்தனைகள் உங்களை சூழ்ந்திருக்கும். மொத்தத்தில், இன்று ஒரு மனநிறைவான மற்றும் உறவுகள் வலுப்பெறும் நாளாக அமையும்.",
    "prediction_en": "Today, being Monday under the influence of the Moon, Virgo natives, your social circle will bring you great joy and support today. The Moon's influence will enhance your mental peace and harmony in teamwork. Good relationships with friends and social groups will improve. You may plan new projects with them. You may get an opportunity to meet old friends whom you haven't met for a long time, which will bring you joy. Friends and social networks will greatly help you achieve your goals. This is a good opportunity to showcase your talents and share your views with others. You will act carefully in financial matters and explore ways to increase savings. Your endeavors will yield good results, and your hard work will be recognized. You should pay attention to your health. You can engage in practices like meditation or yoga to aid mental peace. This is an excellent day for learning new things and enhancing your knowledge. If you are a student, you will see good progress in your academic pursuits today. Guidance from teachers will be very helpful. Your tasks at the office will proceed smoothly, and you will receive cooperation from colleagues. Some long-delayed tasks will come to an end today. Your reputation in society will increase. Helping charitable organizations will bring you mental satisfaction. Your creativity will improve today, and you can undertake new artistic endeavors. By being emotionally expressive, your relationships will strengthen further. Express the good thoughts in your mind. Positive thoughts will surround you. Overall, today will be a day of contentment and strengthening relationships.",
    "career_ta": "வேலையில் குழுப்பணிகள் சாதகமாக அமையும். சகாக்களுடன் இணக்கமாகப் பணியாற்றுவீர்கள். புதிய யோசனைகள் பாராட்டு பெறும். உங்கள் தகவல் தொடர்பு திறன்கள் இன்று நன்மை பயக்கும். புதிய வாய்ப்புகள் உருவாகும்.",
    "career_en": "Teamwork will be favorable at work. You will work harmoniously with colleagues. New ideas will receive appreciation. Your communication skills will be beneficial today. New opportunities will arise.",
    "finance_ta": "நிதி நிலைமை மேம்படும். நண்பர்கள் மூலம் நல்ல முதலீட்டு ஆலோசனைகள் கிடைக்கும். சேமிப்பை அதிகரிக்க நல்ல திட்டங்களை வகுப்பீர்கள். எதிர்பாராத ஆதாயங்கள் வர வாய்ப்புள்ளது. புத்திசாலித்தனமான முடிவுகள் எடுப்பீர்கள்.",
    "finance_en": "Financial situation will improve. You will receive good investment advice through friends. You will make good plans to increase savings. Unexpected gains are likely. You will make wise decisions.",
    "health_ta": "உடல்நலனில் நல்ல முன்னேற்றம் காண்பீர்கள். மன அமைதி உங்கள் ஆரோக்கியத்திற்கு உதவும். ஆரோக்கியமான உணவு முறையை பின்பற்றுவீர்கள். சமூக செயல்பாடுகளில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி அளிக்கும்.",
    "health_en": "You will see good progress in your health. Mental peace will aid your well-being. You will follow a healthy diet. Engaging in social activities will rejuvenate your mind.",
    "lucky_number": "5",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "02-03-2026",
    "prediction_ta": "இன்று சந்திரனின் ஆதிக்கம் நிறைந்த திங்கட்கிழமை, துலாம் ராசிக்காரர்களே, உங்கள் தொழில் மற்றும் சமூக அந்தஸ்தில் இன்று நல்ல முன்னேற்றம் காண்பீர்கள். சந்திரனின் தாக்கம் உங்கள் மன அமைதியையும், பொது வாழ்க்கையில் உங்கள் கவர்ச்சியையும் மேம்படுத்தும். உங்கள் தலைமைத்துவப் பண்புகள் இன்று வெளிப்படும், புதிய பொறுப்புகளை ஏற்று திறம்பட செயல்படுவீர்கள். அலுவலகத்தில் உங்கள் பணிகள் சீராக நடைபெறும், சகாக்களின் ஒத்துழைப்பு கிடைக்கும். நீண்ட நாட்களாக தடைபட்டிருந்த சில காரியங்கள் இன்று முடிவுக்கு வரும். சமூகத்தில் உங்கள் மதிப்பு உயரும். புதிய திட்டங்களில் உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். உங்கள் உழைப்புக்கு ஏற்ற அங்கீகாரம் கிடைக்கும். குடும்பத்தில் மகிழ்ச்சி நிலவும். உறவினர்களுடன் நல்லுறவு மேம்படும். சுப காரியங்கள் பற்றி பேசலாம் அல்லது புதிய திட்டங்களை தீட்டலாம். இன்று நீங்கள் பொறுமையுடனும், அன்புடனும் செயல்பட வேண்டும். அவசர முடிவுகளைத் தவிர்ப்பது நல்லது. நிதி ரீதியாக திட்டமிடுவதற்கு இது ஒரு சிறந்த நாளாகும். எதிர்பாராத ஆதாயங்கள் வர வாய்ப்புள்ளது. உங்கள் கடின உழைப்பு அங்கீகரிக்கப்படும். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும். மன அமைதிக்கு உதவும் தியானம் அல்லது யோகா போன்ற பயிற்சிகளில் ஈடுபடலாம். இது உங்கள் மன அழுத்தத்தை குறைத்து, தெளிவான சிந்தனையை ஏற்படுத்தும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்துவதற்கும் இது ஒரு சிறந்த நாளாகும். நீங்கள் படிக்கும் மாணவர்கள் என்றால், இன்று உங்கள் கல்வி முயற்சிகளில் நல்ல முன்னேற்றத்தைக் காண்பீர்கள். ஆசிரியர்களின் வழிகாட்டுதல் உங்களுக்கு பெரிதும் உதவும். மற்றவர்களுக்கு உதவ வாய்ப்பு கிடைத்தால், தயங்காமல் உதவுங்கள், அது உங்களுக்கு மன நிறைவைத் தரும். உங்கள் உள்ளுணர்வை நம்பி செயல்படுங்கள். இன்று நீங்கள் உணர்வுபூர்வமாக வெளிப்படையாக இருப்பதன் மூலம், உங்கள் உறவுகள் மேலும் வலுப்பெறும். உங்கள் மனதில் உள்ள நல்ல எண்ணங்களை வெளிப்படுத்துங்கள். நேர்மறை சிந்தனைகள் உங்களை சூழ்ந்திருக்கும். மொத்தத்தில், இன்று ஒரு மனநிறைவான மற்றும் தொழில் ரீதியாக நல்ல நாளாக அமையும்.",
    "prediction_en": "Today, being Monday under the influence of the Moon, Libra natives, you will see good progress in your career and social status. The Moon's influence will enhance your mental peace and charisma in public life. Your leadership qualities will emerge today, and you will take on new responsibilities and perform effectively. Your tasks at the office will proceed smoothly, and you will receive cooperation from colleagues. Some long-delayed tasks will come to an end today. Your reputation in society will increase. Your contribution to new projects will gain importance. You will receive recognition for your hard work. Happiness will prevail in the family. Good relationships with relatives will improve. You can discuss auspicious events or plan new projects. Today you should act with patience and love. It is good to avoid hasty decisions. This is an excellent day for financial planning. Unexpected gains are likely. Your hard work will be recognized. You should pay attention to your health. You can engage in practices like meditation or yoga for mental peace. This will reduce your stress and lead to clear thinking. This is an excellent day for learning new things and enhancing your knowledge. If you are a student, you will see good progress in your academic pursuits today. Guidance from teachers will be very helpful. If you get an opportunity to help others, do not hesitate; it will bring you mental satisfaction. Trust your intuition. Today, by being emotionally open, your relationships will strengthen further. Express the good thoughts in your mind. Positive thoughts will surround you. Overall, today will be a day of contentment and good professional progress.",
    "career_ta": "தொழிலில் நல்ல வளர்ச்சி காண்பீர்கள். புதிய பொறுப்புகள் கிடைக்கும். தலைமைத்துவப் பண்புகள் வெளிப்படும். சகாக்கள் மற்றும் மேலதிகாரிகளின் ஆதரவு கிடைக்கும். உங்கள் முயற்சிகள் வெற்றி பெறும்.",
    "career_en": "You will see good growth in your career. You will get new responsibilities. Leadership qualities will emerge. You will receive support from colleagues and superiors. Your efforts will succeed.",
    "finance_ta": "நிதி நிலைமை சிறப்பாக இருக்கும். புதிய வருமான வழிகள் உருவாகலாம். சேமிப்பு அதிகரிக்கும். முதலீடுகள் குறித்து நிதானமாக முடிவெடுப்பது நல்லது. எதிர்பாராத ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது.",
    "finance_en": "Financial situation will be good. New sources of income may emerge. Savings will increase. It is good to make investment decisions carefully. Unexpected gains are likely.",
    "health_ta": "மன அமைதி உங்கள் ஆரோக்கியத்திற்கு உதவும். உற்சாகமாக உணர்வீர்கள். சீரான உணவு முறையும், உடற்பயிற்சியும் அவசியம். ஆழ்ந்த உறக்கம் உங்கள் ஆரோக்கியத்திற்கு உதவும். தியானம் நன்மை பயக்கும்.",
    "health_en": "Mental peace will aid your health. You will feel energetic. A balanced diet and exercise are essential. Deep sleep will aid your health. Meditation is beneficial.",
    "lucky_number": "6",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "விருச்சிகம்",
    "sign_en": "Scorpio",
    "date": "02-03-2026",
    "prediction_ta": "இன்று சந்திரனின் ஆதிக்கம் நிறைந்த திங்கட்கிழமை, விருச்சிக ராசிக்காரர்களே, உங்கள் ஆன்மீக உணர்வுகளும், ஆழமான சிந்தனைகளும் இன்று மேம்படும். சந்திரனின் தாக்கம் உங்கள் மன அமைதியையும், ஞானத்தையும் அதிகரிக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்துவதற்கும் இது ஒரு சிறந்த நாளாகும். நீங்கள் படிக்கும் மாணவர்கள் என்றால், இன்று உங்கள் கல்வி முயற்சிகளில் நல்ல முன்னேற்றத்தைக் காண்பீர்கள். ஆசிரியர்களின் வழிகாட்டுதல் உங்களுக்கு பெரிதும் உதவும். நீண்ட தூரப் பயணங்கள் அல்லது ஆன்மீக தலங்களுக்குச் செல்லும் வாய்ப்புகள் இன்று உருவாகலாம். தந்தை வழி உறவுகள் வலுப்பெறும். அவர்களுடன் இணைந்து புதிய காரியங்களைச் செய்ய திட்டமிடலாம். பொதுவாகவே நீங்கள் ஆழ்ந்த சிந்தனை கொண்டவர் என்றாலும், இன்று மேலும் தத்துவ ரீதியான சிந்தனைகளில் ஈடுபடுவீர்கள். உங்கள் மனதில் சில புதிய எண்ணங்கள் உருவாகலாம், அவற்றை சீராக செயல்படுத்துவதற்கு நேரம் ஒதுக்குவீர்கள். கடந்த காலங்களில் ஏற்பட்ட சில மன வருத்தங்கள் நீங்கி, புதிய நேர்மறை எண்ணங்கள் மனதில் குடிகொள்ளும். இன்று நீங்கள் பொறுமையுடனும், அன்புடனும் செயல்பட வேண்டும். அவசர முடிவுகளைத் தவிர்ப்பது நல்லது. குடும்ப உறுப்பினர்களுடன் இணக்கமாகச் செயல்படுவது மகிழ்ச்சியை அதிகரிக்கும். சிறுசிறு கருத்து வேறுபாடுகள் ஏற்பட்டாலும், அவற்றை சாதுரியமாக கையாண்டு சுமூகமான சூழலை உருவாக்குவீர்கள். உங்கள் படைப்பாற்றல் மேம்படும், கலை சார்ந்த துறைகளில் ஆர்வம் உள்ளவர்கள் புதிய முயற்சிகளை மேற்கொள்ளலாம், அது நல்ல பலனைத் தரும். ஆன்மீக நாட்டம் அதிகரிக்கும், தியானம், யோகா போன்ற அமைதியான செயல்பாடுகளில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி தரும். உங்கள் உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது மிக அவசியம். சத்தான உணவையும், போதுமான ஓய்வையும் எடுத்துக்கொள்ள வேண்டும். உடல் ரீதியாகவும், மன ரீதியாகவும் உங்களை நீங்கள் வலுப்படுத்திக் கொள்ள இது ஒரு நல்ல வாய்ப்பு. இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி ஒரு படி முன்னேறுவீர்கள். உங்கள் மனதில் உள்ள நேர்மறை எண்ணங்கள், உங்களை சூழ்ந்திருப்பவர்களுக்கும் பரவும். சுற்றிலும் ஒரு மகிழ்ச்சியான சூழல் உருவாகும். தன்னம்பிக்கையுடன் செயல்பட்டால் வெற்றி நிச்சயம். புதிய திட்டங்களை இப்போதே தொடங்கலாம், அவை நீண்ட காலத்திற்கு நல்ல பலன்களைக் கொடுக்கும். உங்கள் முயற்சிகளுக்கு நல்ல ஆதரவு கிடைக்கும். மொத்தத்தில், இன்று ஒரு மன அமைதி நிறைந்த, ஆன்மீக முன்னேற்றம் அடையும் நாளாக அமையும்.",
    "prediction_en": "Today, being Monday under the influence of the Moon, Scorpio natives, your spiritual feelings and deep thoughts will be enhanced. The Moon's influence will increase your mental peace and wisdom. This is an excellent day for learning new things and enhancing your knowledge. If you are a student, you will see good progress in your academic pursuits today. Guidance from teachers will be very helpful. Opportunities for long-distance travel or visiting spiritual places may arise today. Paternal relationships will strengthen, and you may plan new ventures with them. Although you are generally a deep thinker, today you will engage in more philosophical reflections. Some new ideas may emerge in your mind, and you will dedicate time to implement them smoothly. Some past emotional grievances will disappear, and new positive thoughts will take root in your mind. Today you should act with patience and love. It is good to avoid hasty decisions. Working harmoniously with family members will increase happiness. Even if minor disagreements arise, you will skillfully handle them and create a harmonious environment. Your creativity will improve; those interested in artistic fields can undertake new ventures, which will yield good results. Spiritual inclination will increase; engaging in peaceful activities like meditation and yoga will rejuvenate your mind. It is very important to pay attention to your physical health. You must take nutritious food and adequate rest. This is a good opportunity to strengthen yourself physically and mentally. Today you will take a step forward towards your goals. The positive thoughts in your mind will spread to those around you, creating a joyful atmosphere. Success is certain if you act with self-confidence. You can start new projects now, and they will yield good results in the long run. You will receive good support for your endeavors. Overall, today will be a day filled with mental peace and spiritual progress.",
    "career_ta": "வேலையில் புதிய விஷயங்களைக் கற்றுக்கொள்வீர்கள். உங்கள் அறிவுத்திறன் பாராட்டு பெறும். வெளிநாட்டு வாய்ப்புகள் குறித்து ஆராயலாம். உயர் அதிகாரிகளின் ஆதரவு கிடைக்கும். நீண்ட கால திட்டங்களுக்கு இது ஒரு நல்ல நாள்.",
    "career_en": "You will learn new things at work. Your intellectual ability will be appreciated. You can explore overseas opportunities. You will receive support from higher authorities. This is a good day for long-term plans.",
    "finance_ta": "நிதி நிலைமை சிறப்பாக இருக்கும். தந்தையிடமிருந்து நல்ல ஆலோசனைகள் கிடைக்கும். சேமிப்பு மற்றும் முதலீடுகளில் கவனம் செலுத்துவீர்கள். நீண்ட கால ஆதாயங்களுக்கு திட்டமிடுவீர்கள். நிதி திட்டமிடுவதற்கு இது ஒரு சிறந்த நாள்.",
    "finance_en": "Financial situation will be good. You will receive good advice from your father. You will focus on savings and investments. You will plan for long-term gains. This is an excellent day for financial planning.",
    "health_ta": "உடல் மற்றும் மன ஆரோக்கியத்தில் நல்ல முன்னேற்றம் காண்பீர்கள். மன அமைதி உங்கள் ஆரோக்கியத்திற்கு உதவும். ஆன்மீக பயிற்சிகளில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி அளிக்கும். சத்தான உணவை எடுத்துக்கொள்வது நல்லது.",
    "health_en": "You will see good progress in physical and mental health. Mental peace will aid your well-being. Engaging in spiritual practices will rejuvenate your mind. Consuming nutritious food is beneficial.",
    "lucky_number": "9",
    "lucky_color_ta": "பழுப்பு",
    "lucky_color_en": "Brown"
  },
  {
    "sign_ta": "தனுசு",
    "sign_en": "Sagittarius",
    "date": "02-03-2026",
    "prediction_ta": "இன்று சந்திரனின் ஆதிக்கம் நிறைந்த திங்கட்கிழமை, தனுசு ராசிக்காரர்களே, உங்கள் மனதின் ஆழமான உணர்வுகளை வெளிப்படுத்துவதற்கும், உள் அமைதியை அடைவதற்கும் இன்று மிகவும் சாதகமான நாளாகும். சந்திரனின் தாக்கம் உங்கள் மன அமைதியையும், ஆழ்ந்த சிந்தனையையும் மேம்படுத்தும். பொதுவாகவே நீங்கள் வெளிப்படையாக செயல்படுபவர் என்றாலும், இன்று சற்று அமைதியாகவும், சிந்தித்தும் செயல்படுவீர்கள். உங்கள் மனதில் சில புதிய எண்ணங்கள் உருவாகலாம், அவற்றை சீராக செயல்படுத்துவதற்கு நேரம் ஒதுக்குவீர்கள். கடந்த காலங்களில் ஏற்பட்ட சில மன வருத்தங்கள் நீங்கி, புதிய நேர்மறை எண்ணங்கள் மனதில் குடிகொள்ளும். இன்று நீங்கள் பொறுமையுடனும், அன்புடனும் செயல்பட வேண்டும். அவசர முடிவுகளைத் தவிர்ப்பது நல்லது. குடும்ப உறுப்பினர்களுடன் இணக்கமாகச் செயல்படுவது மகிழ்ச்சியை அதிகரிக்கும். சிறுசிறு கருத்து வேறுபாடுகள் ஏற்பட்டாலும், அவற்றை சாதுரியமாக கையாண்டு சுமூகமான சூழலை உருவாக்குவீர்கள். உங்கள் படைப்பாற்றல் மேம்படும், கலை சார்ந்த துறைகளில் ஆர்வம் உள்ளவர்கள் புதிய முயற்சிகளை மேற்கொள்ளலாம், அது நல்ல பலனைத் தரும். ஆன்மீக நாட்டம் அதிகரிக்கும், தியானம், யோகா போன்ற அமைதியான செயல்பாடுகளில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி தரும். உங்கள் உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது மிக அவசியம். சத்தான உணவையும், போதுமான ஓய்வையும் எடுத்துக்கொள்ள வேண்டும். உடல் ரீதியாகவும், மன ரீதியாகவும் உங்களை நீங்கள் வலுப்படுத்திக் கொள்ள இது ஒரு நல்ல வாய்ப்பு. இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி ஒரு படி முன்னேறுவீர்கள். உங்கள் மனதில் உள்ள நேர்மறை எண்ணங்கள், உங்களை சூழ்ந்திருப்பவர்களுக்கும் பரவும். சுற்றிலும் ஒரு மகிழ்ச்சியான சூழல் உருவாகும். தன்னம்பிக்கையுடன் செயல்பட்டால் வெற்றி நிச்சயம். புதிய திட்டங்களை இப்போதே தொடங்கலாம், அவை நீண்ட காலத்திற்கு நல்ல பலன்களைக் கொடுக்கும். உங்கள் முயற்சிகளுக்கு நல்ல ஆதரவு கிடைக்கும். குடும்பத்தில் மூத்தவர்களின் ஆசீர்வாதம் உங்களுக்கு ஒரு பெரிய பலமாக அமையும். மற்றவர்களுக்கு உதவ வாய்ப்பு கிடைத்தால், தயங்காமல் உதவுங்கள், அது உங்களுக்கு மன நிறைவைத் தரும். உங்கள் அன்றாட பணிகளை சீராக முடிக்க முடியும். நிதி ரீதியாக திட்டமிடுவதற்கு இது ஒரு சிறந்த நாளாகும். எதிர்பாராத ஆதாயங்கள் வர வாய்ப்புள்ளது. இன்று நீங்கள் உங்களின் சுய முன்னேற்றத்தில் கவனம் செலுத்துவீர்கள். உங்கள் திறமைகளை வளர்த்துக்கொள்ள புதிய வழிகளை ஆராய்வீர்கள். மொத்தத்தில், இன்று ஒரு மன அமைதி நிறைந்த, உள்முக சிந்தனை மேம்படும் நாளாக அமையும்.",
    "prediction_en": "Today, being Monday under the influence of the Moon, Sagittarius natives, it is a very favorable day for expressing your deep inner feelings and achieving inner peace. The Moon's influence will enhance your mental peace and deep contemplation. Although you are generally an outspoken person, today you will act a little more calmly and thoughtfully. Some new ideas may emerge in your mind, and you will dedicate time to implement them smoothly. Some past emotional grievances will disappear, and new positive thoughts will take root in your mind. Today you should act with patience and love. It is good to avoid hasty decisions. Working harmoniously with family members will increase happiness. Even if minor disagreements arise, you will skillfully handle them and create a harmonious environment. Your creativity will improve; those interested in artistic fields can undertake new ventures, which will yield good results. Spiritual inclination will increase; engaging in peaceful activities like meditation and yoga will rejuvenate your mind. It is very important to pay attention to your physical health. You must take nutritious food and adequate rest. This is a good opportunity to strengthen yourself physically and mentally. Today you will take a step forward towards your goals. The positive thoughts in your mind will spread to those around you, creating a joyful atmosphere. Success is certain if you act with self-confidence. You can start new projects now, and they will yield good results in the long run. You will receive good support for your endeavors. The blessings of elders in the family will be a great strength to you. If you get an opportunity to help others, do not hesitate; it will give you mental satisfaction. You will be able to complete your daily tasks smoothly. This is an excellent day for financial planning. Unexpected gains are likely. Today you will focus on your self-improvement and explore new ways to develop your skills. Overall, today will be a day filled with mental peace and enhanced introspection.",
    "career_ta": "வேலையில் உங்கள் உள்ளுணர்வை நம்பி செயல்படுவீர்கள். புதிய திட்டங்களில் ஈடுபடும்போது, உங்கள் மனதின் குரலுக்கு செவிசாய்ப்பது நல்லது. மறைமுகமான உதவிகள் கிடைக்கலாம். சகாக்களுடன் நல்லுறவு மேலோங்கும்.",
    "career_en": "You will trust your intuition at work. When engaging in new projects, it is good to listen to your inner voice. You may receive indirect help. Good relationships with colleagues will prevail.",
    "finance_ta": "நிதி மேலாண்மையில் கவனம் செலுத்துவீர்கள். எதிர்பாராத ஆதாயங்கள் வர வாய்ப்புள்ளது. சேமிப்பை அதிகரிப்பதற்கான வழிகளை ஆராய்வீர்கள். நிதி விஷயங்களில் புத்திசாலித்தனமான முடிவுகள் எடுப்பீர்கள். குடும்பத்தின் ஆதரவு கிடைக்கும்.",
    "finance_en": "You will focus on financial management. Unexpected gains are likely. You will explore ways to increase savings. You will make wise decisions in financial matters. You will receive family support.",
    "health_ta": "உடல் மற்றும் மன ஆரோக்கியத்தில் கவனம் செலுத்துவீர்கள். மன அமைதிக்கு உதவும் தியானம், யோகா போன்ற பயிற்சிகளில் ஈடுபடுவீர்கள். போதுமான ஓய்வும், சத்தான உணவும் அவசியம். நீர்ச்சத்து மிகுந்த உணவுகள் நன்மை பயக்கும்.",
    "health_en": "You will pay attention to physical and mental health. You will engage in practices like meditation and yoga to aid mental peace. Adequate rest and nutritious food are essential. Water-rich foods will be beneficial.",
    "lucky_number": "3",
    "lucky_color_ta": "இளஞ்சிவப்பு",
    "lucky_color_en": "Pink"
  },
  {
    "sign_ta": "மகரம்",
    "sign_en": "Capricorn",
    "date": "02-03-2026",
    "prediction_ta": "இன்று சந்திரனின் ஆதிக்கம் நிறைந்த திங்கட்கிழமை, மகர ராசிக்காரர்களே, உங்கள் கூட்டுறவு முயற்சிகளிலும், சமூக தொடர்புகளிலும் இன்று நல்ல முன்னேற்றம் காண்பீர்கள். சந்திரனின் தாக்கம் உங்கள் மன அமைதியையும், சமூக இணக்கத்தையும் மேம்படுத்தும். நண்பர்களுடனும், சமூக குழுக்களுடனும் நல்லுறவு மேம்படும். அவர்களுடன் இணைந்து புதிய திட்டங்களைச் செய்ய திட்டமிடலாம். நீண்ட நாட்களாக சந்திக்காத பழைய நண்பர்களை சந்திக்கும் வாய்ப்பு கிட்டும், அது உங்களுக்கு மன மகிழ்ச்சியைத் தரும். உங்கள் இலக்குகளை அடைய நண்பர்கள் மற்றும் சமூக வலைப்பின்னல்கள் உங்களுக்கு பெரிதும் உதவும். உங்கள் திறமைகளை வெளிப்படுத்தவும், உங்கள் கருத்துக்களை மற்றவர்களுடன் பகிர்ந்து கொள்ளவும் இது ஒரு நல்ல வாய்ப்பாகும். நிதி விஷயங்களில் கவனமாக செயல்படுவீர்கள். சேமிப்பை அதிகரிப்பதற்கான வழிகளை ஆராய்வீர்கள். நீங்கள் மேற்கொள்ளும் முயற்சிகளுக்கு நல்ல பலன் கிடைக்கும். உங்கள் கடின உழைப்பு அங்கீகரிக்கப்படும். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும். மன அமைதிக்கு உதவும் தியானம் அல்லது யோகா போன்ற பயிற்சிகளில் ஈடுபடலாம். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவை மேம்படுத்துவதற்கும் இது ஒரு சிறந்த நாளாகும். நீங்கள் படிக்கும் மாணவர்கள் என்றால், இன்று உங்கள் கல்வி முயற்சிகளில் நல்ல முன்னேற்றத்தைக் காண்பீர்கள். ஆசிரியர்களின் வழிகாட்டுதல் உங்களுக்கு பெரிதும் உதவும். அலுவலகத்தில் உங்கள் பணிகள் சீராக நடைபெறும், சகாக்களின் ஒத்துழைப்பு கிடைக்கும். நீண்ட நாட்களாக தடைபட்டிருந்த சில காரியங்கள் இன்று முடிவுக்கு வரும். சமூகத்தில் உங்கள் மதிப்பு உயரும். தொண்டு நிறுவனங்களுக்கு உதவுவதன் மூலம் உங்களுக்கு மன நிறைவு கிடைக்கும். உங்கள் படைப்பாற்றல் இன்று மேம்படும், புதிய கலை முயற்சிகளை மேற்கொள்ளலாம். நீங்கள் உணர்வுபூர்வமாக வெளிப்படையாக இருப்பதன் மூலம், உங்கள் உறவுகள் மேலும் வலுப்பெறும். உங்கள் மனதில் உள்ள நல்ல எண்ணங்களை வெளிப்படுத்துங்கள். நேர்மறை சிந்தனைகள் உங்களை சூழ்ந்திருக்கும். மொத்தத்தில், இன்று ஒரு மனநிறைவான மற்றும் உறவுகள் வலுப்பெறும் நாளாக அமையும்.",
    "prediction_en": "Today, being Monday under the influence of the Moon, Capricorn natives, you will see good progress in your cooperative endeavors and social connections. The Moon's influence will enhance your mental peace and social harmony. Good relationships with friends and social groups will improve. You may plan new projects with them. You may get an opportunity to meet old friends whom you haven't met for a long time, which will bring you joy. Friends and social networks will greatly help you achieve your goals. This is a good opportunity to showcase your talents and share your views with others. You will act carefully in financial matters and explore ways to increase savings. Your endeavors will yield good results, and your hard work will be recognized. You should pay attention to your health. You can engage in practices like meditation or yoga to aid mental peace. This is an excellent day for learning new things and enhancing your knowledge. If you are a student, you will see good progress in your academic pursuits today. Guidance from teachers will be very helpful. Your tasks at the office will proceed smoothly, and you will receive cooperation from colleagues. Some long-delayed tasks will come to an end today. Your reputation in society will increase. Helping charitable organizations will bring you mental satisfaction. Your creativity will improve today, and you can undertake new artistic endeavors. By being emotionally expressive, your relationships will strengthen further. Express the good thoughts in your mind. Positive thoughts will surround you. Overall, today will be a day of contentment and strengthening relationships.",
    "career_ta": "வேலையில் குழுப்பணிகள் சாதகமாக அமையும். சகாக்களின் ஒத்துழைப்பு கிடைக்கும். உங்கள் தலைமைத்துவப் பண்புகள் வெளிப்படும். புதிய திட்டங்களில் உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். சமூக தொடர்புகள் நன்மை பயக்கும்.",
    "career_en": "Teamwork will be favorable at work. You will receive cooperation from colleagues. Your leadership qualities will emerge. Your contribution to new projects will gain importance. Social connections will be beneficial.",
    "finance_ta": "நிதி நிலைமை மேம்படும். கூட்டுறவு முதலீடுகள் நல்ல பலனைத் தரும். சேமிப்பை அதிகரிக்க நல்ல திட்டங்களை வகுப்பீர்கள். எதிர்பாராத ஆதாயங்கள் வர வாய்ப்புள்ளது. நிதி திட்டமிடுவதற்கு இது ஒரு சிறந்த நாள்.",
    "finance_en": "Financial situation will improve. Cooperative investments will yield good results. You will make good plans to increase savings. Unexpected gains are likely. This is an excellent day for financial planning.",
    "health_ta": "உடல்நலனில் நல்ல முன்னேற்றம் காண்பீர்கள். மன அமைதி உங்கள் ஆரோக்கியத்திற்கு உதவும். சீரான உணவு முறையும், உடற்பயிற்சியும் அவசியம். சமூக செயல்பாடுகளில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி அளிக்கும்.",
    "health_en": "You will see good progress in your health. Mental peace will aid your well-being. A balanced diet and exercise are essential. Engaging in social activities will rejuvenate your mind.",
    "lucky_number": "8",
    "lucky_color_ta": "கருப்பு",
    "lucky_color_en": "Black"
  },
  {
    "sign_ta": "கும்பம்",
    "sign_en": "Aquarius",
    "date": "02-03-2026",
    "prediction_ta": "இன்று சந்திரனின் ஆதிக்கம் நிறைந்த திங்கட்கிழமை, கும்ப ராசிக்காரர்களே, உங்கள் மன அமைதிக்கும், உள் உணர்வுக்கும் இன்று நீங்கள் அதிக முக்கியத்துவம் கொடுப்பீர்கள். சந்திரனின் தாக்கம் உங்கள் உணர்ச்சிபூர்வமான உலகத்தை மேம்படுத்தும். வீட்டைச் சார்ந்த விஷயங்களிலும், குடும்ப உறவுகளிலும் மகிழ்ச்சியும் அமைதியும் பெருகும். தாயின் ஆரோக்கியத்தில் கவனம் செலுத்தவும், அவருடன் நேரம் செலவிடுவது உங்களுக்கு மன அமைதியைக் கொடுக்கும். உங்கள் உள்ளுணர்வு இன்று மிகவும் சக்தி வாய்ந்ததாக இருக்கும், முக்கிய முடிவுகள் எடுக்கும்போது உங்கள் மனதின் குரலுக்கு செவிசாய்ப்பது நல்ல பலனைத் தரும். கடந்த காலங்களில் ஏற்பட்ட சில மன வருத்தங்கள் நீங்கி, புதிய நேர்மறை எண்ணங்கள் மனதில் குடிகொள்ளும். இன்று நீங்கள் பொறுமையுடனும், அன்புடனும் செயல்பட வேண்டும். அவசர முடிவுகளைத் தவிர்ப்பது நல்லது. குடும்ப உறுப்பினர்களுடன் இணக்கமாகச் செயல்படுவது மகிழ்ச்சியை அதிகரிக்கும். சிறுசிறு கருத்து வேறுபாடுகள் ஏற்பட்டாலும், அவற்றை சாதுரியமாக கையாண்டு சுமூகமான சூழலை உருவாக்குவீர்கள். இன்று உங்கள் படைப்பாற்றல் மேம்படும், கலை சார்ந்த துறைகளில் ஆர்வம் உள்ளவர்கள் புதிய முயற்சிகளை மேற்கொள்ளலாம். அது நல்ல பலனைத் தரும். வீட்டிற்குத் தேவையான பொருட்களை வாங்குவதற்கோ, வீட்டை அழகுபடுத்துவதற்கோ இது ஒரு சிறந்த நாளாகும். உங்கள் சமூக வட்டாரத்தில் சில புதிய தொடர்புகள் உருவாகலாம், அவை எதிர்காலத்தில் உங்களுக்கு பல வழிகளில் உதவக்கூடும். ஆன்மீக நாட்டம் அதிகரிக்கும், தியானம், யோகா போன்ற அமைதியான செயல்பாடுகளில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி தரும். உங்கள் உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது மிக அவசியம். சத்தான உணவையும், போதுமான ஓய்வையும் எடுத்துக்கொள்ள வேண்டும். உடல் ரீதியாகவும், மன ரீதியாகவும் உங்களை நீங்கள் வலுப்படுத்திக் கொள்ள இது ஒரு நல்ல வாய்ப்பு. இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி ஒரு படி முன்னேறுவீர்கள். உங்கள் மனதில் உள்ள நேர்மறை எண்ணங்கள், உங்களை சூழ்ந்திருப்பவர்களுக்கும் பரவும். சுற்றிலும் ஒரு மகிழ்ச்சியான சூழல் உருவாகும். தன்னம்பிக்கையுடன் செயல்பட்டால் வெற்றி நிச்சயம். புதிய திட்டங்களை இப்போதே தொடங்கலாம், அவை நீண்ட காலத்திற்கு நல்ல பலன்களைக் கொடுக்கும். உங்கள் முயற்சிகளுக்கு நல்ல ஆதரவு கிடைக்கும். குடும்பத்தில் மூத்தவர்களின் ஆசீர்வாதம் உங்களுக்கு ஒரு பெரிய பலமாக அமையும். மற்றவர்களுக்கு உதவ வாய்ப்பு கிடைத்தால், தயங்காமல் உதவுங்கள், அது உங்களுக்கு மன நிறைவைத் தரும். உங்கள் அன்றாட பணிகளை சீராக முடிக்க முடியும். நிதி ரீதியாக திட்டமிடுவதற்கு இது ஒரு சிறந்த நாளாகும். எதிர்பாராத ஆதாயங்கள் வர வாய்ப்புள்ளது. இன்று நீங்கள் உங்களின் சுய முன்னேற்றத்தில் கவனம் செலுத்துவீர்கள். உங்கள் திறமைகளை வளர்த்துக்கொள்ள புதிய வழிகளை ஆராய்வீர்கள். மொத்தத்தில், இன்று ஒரு மன அமைதி நிறைந்த, குடும்ப மகிழ்ச்சி பெருகும் நாளாக அமையும்.",
    "prediction_en": "Today, being Monday under the influence of the Moon, Aquarius natives, you will give great importance to your mental peace and inner feelings. The Moon's influence will enhance your emotional world. Happiness and peace will abound in home-related matters and family relationships. Pay attention to your mother's health; spending time with her will bring you mental peace. Your intuition will be very powerful today, and listening to your inner voice when making important decisions will yield good results. Some past emotional grievances will disappear, and new positive thoughts will take root in your mind. Today you should act with patience and love. It is good to avoid hasty decisions. Working harmoniously with family members will increase happiness. Even if minor disagreements arise, you will skillfully handle them and create a harmonious environment. Your creativity will improve; those interested in artistic fields can undertake new ventures, which will yield good results. This is an excellent day to buy household items or beautify your home. Some new contacts may form in your social circle, which could help you in many ways in the future. Spiritual inclination will increase; engaging in peaceful activities like meditation and yoga will rejuvenate your mind. It is very important to pay attention to your physical health. You must take nutritious food and adequate rest. This is a good opportunity to strengthen yourself physically and mentally. Today you will take a step forward towards your goals. The positive thoughts in your mind will spread to those around you, creating a joyful atmosphere. Success is certain if you act with self-confidence. You can start new projects now, and they will yield good results in the long run. You will receive good support for your endeavors. The blessings of elders in the family will be a great strength to you. If you get an opportunity to help others, do not hesitate; it will give you mental satisfaction. You will be able to complete your daily tasks smoothly. This is an excellent day for financial planning. Unexpected gains are likely. Today you will focus on your self-improvement and explore new ways to develop your skills. Overall, today will be a day filled with mental peace and increased family happiness.",
    "career_ta": "வேலையில் மன அமைதியுடன் செயல்படுவீர்கள். சகாக்களுடன் நல்லுறவு மேலோங்கும். புதிய திட்டங்களில் ஈடுபடும்போது, உங்கள் உள்ளுணர்வை நம்பி செயல்படுவது நல்ல பலனைத் தரும். உங்கள் திறமைகளை வெளிப்படுத்த இது ஒரு சிறந்த வாய்ப்பு.",
    "career_en": "You will work with mental peace in your job. Good relationships with colleagues will prevail. When engaging in new projects, trusting your intuition will yield good results. This is an excellent opportunity to showcase your talents.",
    "finance_ta": "நிதி மேலாண்மையில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் தேவைகளுக்காக செலவுகள் ஏற்படலாம். சேமிப்பை அதிகரிப்பதற்கான வழிகளை ஆராய்வீர்கள். புத்திசாலித்தனமான முதலீடுகள் நல்ல பலனைத் தரும்.",
    "finance_en": "You will focus on financial management. Expenses may arise for family needs. You will explore ways to increase savings. Wise investments will yield good returns.",
    "health_ta": "உடல் மற்றும் மன ஆரோக்கியத்தில் அதிக கவனம் செலுத்துவீர்கள். மன அழுத்தத்தைக் குறைப்பதற்கான செயல்பாடுகளில் ஈடுபடுவீர்கள். போதுமான ஓய்வும், சத்தான உணவும் இன்றியமையாதது. அமைதியான சூழல் உங்களுக்கு நன்மை பயக்கும்.",
    "health_en": "You will pay more attention to physical and mental health. You will engage in activities to reduce stress. Adequate rest and nutritious food are essential. A peaceful environment will benefit you.",
    "lucky_number": "4",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "02-03-2026",
    "prediction_ta": "இன்று சந்திரனின் ஆதிக்கம் நிறைந்த திங்கட்கிழமை, மீன ராசிக்காரர்களே, உங்கள் மன அமைதிக்கும், உள் உணர்வுக்கும் இன்று நீங்கள் அதிக முக்கியத்துவம் கொடுப்பீர்கள். சந்திரனின் தாக்கம் உங்கள் உணர்ச்சிபூர்வமான உலகத்தை மேம்படுத்தும். வீட்டைச் சார்ந்த விஷயங்களிலும், குடும்ப உறவுகளிலும் மகிழ்ச்சியும் அமைதியும் பெருகும். தாயின் ஆரோக்கியத்தில் கவனம் செலுத்தவும், அவருடன் நேரம் செலவிடுவது உங்களுக்கு மன அமைதியைக் கொடுக்கும். உங்கள் உள்ளுணர்வு இன்று மிகவும் சக்தி வாய்ந்ததாக இருக்கும், முக்கிய முடிவுகள் எடுக்கும்போது உங்கள் மனதின் குரலுக்கு செவிசாய்ப்பது நல்ல பலனைத் தரும். கடந்த காலங்களில் ஏற்பட்ட சில மன வருத்தங்கள் நீங்கி, புதிய நேர்மறை எண்ணங்கள் மனதில் குடிகொள்ளும். இன்று நீங்கள் பொறுமையுடனும், அன்புடனும் செயல்பட வேண்டும். அவசர முடிவுகளைத் தவிர்ப்பது நல்லது. குடும்ப உறுப்பினர்களுடன் இணக்கமாகச் செயல்படுவது மகிழ்ச்சியை அதிகரிக்கும். சிறுசிறு கருத்து வேறுபாடுகள் ஏற்பட்டாலும், அவற்றை சாதுரியமாக கையாண்டு சுமூகமான சூழலை உருவாக்குவீர்கள். இன்று உங்கள் படைப்பாற்றல் மேம்படும், கலை சார்ந்த துறைகளில் ஆர்வம் உள்ளவர்கள் புதிய முயற்சிகளை மேற்கொள்ளலாம். அது நல்ல பலனைத் தரும். வீட்டிற்குத் தேவையான பொருட்களை வாங்குவதற்கோ, வீட்டை அழகுபடுத்துவதற்கோ இது ஒரு சிறந்த நாளாகும். உங்கள் சமூக வட்டாரத்தில் சில புதிய தொடர்புகள் உருவாகலாம், அவை எதிர்காலத்தில் உங்களுக்கு பல வழிகளில் உதவக்கூடும். ஆன்மீக நாட்டம் அதிகரிக்கும், தியானம், யோகா போன்ற அமைதியான செயல்பாடுகளில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி தரும். உங்கள் உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது மிக அவசியம். சத்தான உணவையும், போதுமான ஓய்வையும் எடுத்துக்கொள்ள வேண்டும். உடல் ரீதியாகவும், மன ரீதியாகவும் உங்களை நீங்கள் வலுப்படுத்திக் கொள்ள இது ஒரு நல்ல வாய்ப்பு. இன்று நீங்கள் உங்கள் இலக்குகளை நோக்கி ஒரு படி முன்னேறுவீர்கள். உங்கள் மனதில் உள்ள நேர்மறை எண்ணங்கள், உங்களை சூழ்ந்திருப்பவர்களுக்கும் பரவும். சுற்றிலும் ஒரு மகிழ்ச்சியான சூழல் உருவாகும். தன்னம்பிக்கையுடன் செயல்பட்டால் வெற்றி நிச்சயம். புதிய திட்டங்களை இப்போதே தொடங்கலாம், அவை நீண்ட காலத்திற்கு நல்ல பலன்களைக் கொடுக்கும். உங்கள் முயற்சிகளுக்கு நல்ல ஆதரவு கிடைக்கும். குடும்பத்தில் மூத்தவர்களின் ஆசீர்வாதம் உங்களுக்கு ஒரு பெரிய பலமாக அமையும். மற்றவர்களுக்கு உதவ வாய்ப்பு கிடைத்தால், தயங்காமல் உதவுங்கள், அது உங்களுக்கு மன நிறைவைத் தரும். உங்கள் அன்றாட பணிகளை சீராக முடிக்க முடியும். நிதி ரீதியாக திட்டமிடுவதற்கு இது ஒரு சிறந்த நாளாகும். எதிர்பாராத ஆதாயங்கள் வர வாய்ப்புள்ளது. இன்று நீங்கள் உங்களின் சுய முன்னேற்றத்தில் கவனம் செலுத்துவீர்கள். உங்கள் திறமைகளை வளர்த்துக்கொள்ள புதிய வழிகளை ஆராய்வீர்கள். மொத்தத்தில், இன்று ஒரு மன அமைதி நிறைந்த, குடும்ப மகிழ்ச்சி பெருகும் நாளாக அமையும்.",
    "prediction_en": "Today, being Monday under the influence of the Moon, Pisces natives, you will give great importance to your mental peace and inner feelings. The Moon's influence will enhance your emotional world. Happiness and peace will abound in home-related matters and family relationships. Pay attention to your mother's health; spending time with her will bring you mental peace. Your intuition will be very powerful today, and listening to your inner voice when making important decisions will yield good results. Some past emotional grievances will disappear, and new positive thoughts will take root in your mind. Today you should act with patience and love. It is good to avoid hasty decisions. Working harmoniously with family members will increase happiness. Even if minor disagreements arise, you will skillfully handle them and create a harmonious environment. Your creativity will improve; those interested in artistic fields can undertake new ventures, which will yield good results. This is an excellent day to buy household items or beautify your home. Some new contacts may form in your social circle, which could help you in many ways in the future. Spiritual inclination will increase; engaging in peaceful activities like meditation and yoga will rejuvenate your mind. It is very important to pay attention to your physical health. You must take nutritious food and adequate rest. This is a good opportunity to strengthen yourself physically and mentally. Today you will take a step forward towards your goals. The positive thoughts in your mind will spread to those around you, creating a joyful atmosphere. Success is certain if you act with self-confidence. You can start new projects now, and they will yield good results in the long run. You will receive good support for your endeavors. The blessings of elders in the family will be a great strength to you. If you get an opportunity to help others, do not hesitate; it will give you mental satisfaction. You will be able to complete your daily tasks smoothly. This is an excellent day for financial planning. Unexpected gains are likely. Today you will focus on your self-improvement and explore new ways to develop your skills. Overall, today will be a day filled with mental peace and increased family happiness.",
    "career_ta": "வேலையில் உங்கள் உள்ளுணர்வை நம்பி செயல்படுவீர்கள். புதிய திட்டங்களில் ஈடுபடும்போது, உங்கள் மனதின் குரலுக்கு செவிசாய்ப்பது நல்லது. மறைமுகமான உதவிகள் கிடைக்கலாம். சகாக்களுடன் நல்லுறவு மேலோங்கும்.",
    "career_en": "You will trust your intuition at work. When engaging in new projects, it is good to listen to your inner voice. You may receive indirect help. Good relationships with colleagues will prevail.",
    "finance_ta": "நிதி மேலாண்மையில் கவனம் செலுத்துவீர்கள். எதிர்பாராத ஆதாயங்கள் வர வாய்ப்புள்ளது. சேமிப்பை அதிகரிப்பதற்கான வழிகளை ஆராய்வீர்கள். நிதி விஷயங்களில் புத்திசாலித்தனமான முடிவுகள் எடுப்பீர்கள். குடும்பத்தின் ஆதரவு கிடைக்கும்.",
    "finance_en": "You will focus on financial management. Unexpected gains are likely. You will explore ways to increase savings. You will make wise decisions in financial matters. You will receive family support.",
    "health_ta": "உடல் மற்றும் மன ஆரோக்கியத்தில் கவனம் செலுத்துவீர்கள். மன அமைதிக்கு உதவும் தியானம், யோகா போன்ற பயிற்சிகளில் ஈடுபடுவீர்கள். போதுமான ஓய்வும், சத்தான உணவும் அவசியம். நீர்ச்சத்து மிகுந்த உணவுகள் நன்மை பயக்கும்.",
    "health_en": "You will pay attention to physical and mental health. You will engage in practices like meditation and yoga to aid mental peace. Adequate rest and nutritious food are essential. Water-rich foods will be beneficial.",
    "lucky_number": "3",
    "lucky_color_ta": "வெளிர் பச்சை",
    "lucky_color_en": "Light Green"
  }
]
