[
  {
    "sign_ta": "மேஷம்",
    "sign_en": "Aries",
    "date": "10-02-2026",
    "prediction_ta": "பெப்ரவரி 10, 2026, செவ்வாய்க்கிழமை. இன்றைய செவ்வாயின் ஆதிக்கம் மேஷ ராசிக்காரர்களுக்கு அபாரமான தைரியத்தையும், துணிச்சலான செயல்பாடுகளையும், புதிய முயற்சிகளை மேற்கொள்ளும் ஆர்வத்தையும் அளிக்கும். உங்கள் உள்ளுணர்வின் குரலுக்கு செவிமடுத்து, அதனைப் பின்பற்றுவதன் மூலம் எதிர்பாராத வெற்றிகளை ஈட்ட முடியும். நீண்ட நாட்களாகத் திட்டமிட்டிருந்த காரியங்களை இன்று துணிவுடன் முன்னெடுத்துச் செல்லும் வாய்ப்புகள் அமையும். சவால்களைக் கண்டு அஞ்சாமல், அவற்றை ஒரு வாய்ப்பாகக் கருதி செயல்படுவீர்கள். மனதிலுள்ள தயக்கங்களை நீக்கி, உங்கள் இலக்குகளை நோக்கி உறுதியாக நடைபோடுவீர்கள். இன்று நீங்கள் எடுக்கும் துணிச்சலான முடிவுகள் எதிர்காலத்தில் பெரும் ஆதாயங்களைத் தரும் என்பதை நினைவில் கொள்ளுங்கள். எந்தவொரு சூழ்நிலையிலும் உங்கள் மன உறுதியை இழக்காமல் இருப்பது மிக முக்கியம். நீங்கள் வெளிப்படுத்தும் நேர்மையான எண்ணங்களும், உறுதியான செயல்பாடுகளும் உங்களைச் சுற்றியுள்ளோரின் நம்பிக்கையை ஈர்க்கும். அநீதிக்கு எதிராகக் குரல் கொடுக்கவும், தர்மத்தை நிலைநாட்டவும் நீங்கள் தயங்க மாட்டீர்கள். இது உங்கள் சமூக மதிப்பையும், கௌரவத்தையும் உயர்த்தும். இக்காலகட்டத்தில் ஆற்றல் பெருகி காணப்படும், அதை சரியாக பயன்படுத்திக்கொள்வது அவசியம். உங்கள் திறமைகளை வெளிக்கொணர புதிய வாய்ப்புகள் கிடைக்கும். சமூகத்தில் உங்கள் கருத்துக்களுக்கு மதிப்பு கிடைக்கும். குடும்பத்திலும், பணியிடத்திலும் உங்கள் முடிவுகள் வரவேற்கப்படும். சொத்து சம்பந்தமான விஷயங்களில் நேர்மறையான நகர்வுகளைக் காணலாம். நிலம் வாங்குவது, விற்பது அல்லது பழுதுபார்ப்பது போன்ற காரியங்களில் சாதகமான முடிவுகள் கிடைக்கும். நீண்டகால முதலீடுகள் குறித்து சிந்திப்பதற்கு இது ஒரு நல்ல தருணம். உங்கள் முன்னோர்களின் சொத்து சம்பந்தமான பிரச்சினைகள் இருந்தால், இன்று அதற்கான ஒரு சுமுகமான தீர்வைக் காண முயற்சி செய்யலாம். சட்டப்பூர்வமான ஆலோசனைகளைப் பெற்று செயல்படுவது நல்ல பலனைத் தரும். உங்கள் வீட்டிற்குத் தேவையான புதிய பொருட்களை வாங்குவதற்கு அல்லது வீட்டை அழகுபடுத்துவதற்கு இன்று சிறந்த நாளாகும். பழைய உறவுகளை புதுப்பிக்க இன்று நல்லதொரு வாய்ப்பு அமையும். சமூக வலைத்தளங்கள் மூலம் பழைய நண்பர்களுடன் மீண்டும் இணைவீர்கள். உங்கள் ஆற்றலை ஆக்கப்பூர்வமான திசையில் பயன்படுத்துவது அவசியம். வீண் விவாதங்களில் ஈடுபடுவதைத் தவிர்த்து, உங்கள் கவனத்தை பயனுள்ள காரியங்களில் செலுத்துங்கள். உடற்பயிற்சி, யோகா போன்ற செயல்பாடுகளில் ஈடுபடுவது உங்கள் உடல் மற்றும் மன ஆரோக்கியத்திற்கு நன்மை பயக்கும். பழைய நண்பர்களைச் சந்திப்பதன் மூலம் புத்துணர்ச்சி பெறுவீர்கள். புதிய உறவுகளைத் தொடங்குவதற்கும், ஏற்கனவே உள்ள உறவுகளை பலப்படுத்துவதற்கும் இது ஒரு சிறப்பான நாளாகும். உங்கள் துணையுடன் இனிமையான தருணங்களை செலவிடுவீர்கள். காதல் உறவுகளில் புதிய அத்தியாயம் தொடங்கும். திருமணமானவர்களுக்கு கணவன் மனைவி இடையே அன்னியோன்னியம் அதிகரிக்கும். சிறு சிறு கருத்து வேறுபாடுகள் இருந்தாலும், அதனைப் பேசித் தீர்த்துக்கொண்டு ஒற்றுமையுடன் வாழ்வீர்கள். பிள்ளைகளின் எதிர்காலம் குறித்த விஷயங்களில் இன்று ஒரு நல்ல முடிவை எடுக்கலாம். குடும்பத்தில் சுபகாரியங்கள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். கலை மற்றும் கலாச்சாரத் துறைகளில் ஆர்வம் கொண்டவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் அமையலாம். உங்கள் படைப்பாற்றலை வெளிப்படுத்துவதற்கான தளங்கள் கிடைக்கும். மாணவர்கள் கல்வி தொடர்பான விஷயங்களில் அதிக கவனம் செலுத்தி, விடாமுயற்சியுடன் செயல்படுவார்கள். போட்டித் தேர்வுகளுக்குத் தயாராகும் மாணவர்களுக்கு இன்று நல்ல முன்னேற்றம் காண முடியும். பெரியவர்களின் ஆலோசனையைப் பெற்று செயல்படுவது மேலும் நன்மையை விளைவிக்கும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் மூலம் மன அமைதி பெறுவீர்கள். உங்கள் விருப்ப தெய்வத்தை வணங்குவது மனதில் நிம்மதியைத் தரும். சமூக சேவை நடவடிக்கைகளில் ஈடுபட ஆர்வம் காட்டுவீர்கள். இதன் மூலம் மனநிறைவும், சமூக அங்கீகாரமும் கிடைக்கும். பயணங்கள் மேற்கொள்ள நேரிட்டால், அது புதிய அனுபவங்களையும், நன்மைகளையும் தரும். மொத்தத்தில், இன்று உங்களுக்கு சாதகமான நாளாக அமையும். உங்கள் துணிச்சலான அணுகுமுறையாலும், நேர்மறையான சிந்தனையாலும் எதிலும் வெற்றி பெறுவீர்கள். தடங்கல்கள் ஏற்பட்டாலும், அதனைத் தாண்டிச் செல்லும் மன உறுதி உங்களுக்கு உண்டு. உங்கள் இலக்குகளை நோக்கி உறுதியாகச் செயல்பட்டு, வெற்றியின் உச்சத்தை அடைவீர்கள். குடும்ப உறுப்பினர்களுடன் இணக்கமாகப் பழகுவதன் மூலம் மகிழ்ச்சி பெருகும். இன்று நீங்கள் மேற்கொள்ளும் முயற்சிகள் எதிர்காலத்தில் பெரிய வெற்றிகளுக்கு வழிவகுக்கும் என்பதில் சந்தேகமில்லை. தன்னம்பிக்கையுடன் செயல்படுங்கள், வெற்றி உங்களுக்கே. உங்கள் தனிப்பட்ட திறமைகளை வளர்த்துக்கொள்ள புதிய விஷயங்களைக் கற்கத் தொடங்குவதற்கு இது உகந்த நேரம். கற்றல் தொடர்பான முயற்சிகள் யாவும் வெற்றி பெறும். உங்கள் ஆரோக்கியத்தின் மீது கூடுதல் கவனம் செலுத்துவது எதிர்காலத்திற்கு நல்லது. புதிய தொழில் வாய்ப்புகள் தேடுபவர்களுக்கு இன்று நல்ல செய்திகள் காத்திருக்கின்றன. சவால்களை துணிவுடன் எதிர்கொண்டு, முன்னேற்றப் பாதையில் நடைபோடுங்கள்.",
    "prediction_en": "February 10, 2026, Tuesday. Today's strong influence of Mars will imbue Aries natives with immense courage, decisive actions, and an eagerness to undertake new ventures. By listening to and following your intuition, you can achieve unexpected successes. Opportunities will arise to bravely pursue long-planned endeavors today. You will face challenges not with fear, but by seeing them as opportunities. You will shed hesitation and firmly walk towards your goals. Remember that the brave decisions you make today will yield significant gains in the future. It is crucial not to lose your determination in any situation. Your honest intentions and firm actions will earn the trust of those around you. You will not hesitate to raise your voice against injustice and uphold righteousness, which will elevate your social standing and honor. During this period, your energy will be abundant, and it is essential to utilize it properly. New opportunities will emerge to showcase your talents. Your opinions will be valued in society. Your decisions will be welcomed both at home and in the workplace. You may observe positive movements in property-related matters. Favorable outcomes are likely in buying, selling, or repairing land. This is a good time to consider long-term investments. If there are any ancestral property issues, you can try to find an amicable solution today. Seeking legal advice will yield good results. Today is an excellent day to purchase new items for your home or to decorate it. Today also presents a good opportunity to rekindle old relationships. You will reconnect with old friends through social media. It is essential to channel your energy in a constructive direction. Avoid engaging in trivial arguments and focus your attention on productive tasks. Engaging in physical exercise, yoga, and similar activities will benefit your physical and mental health. Meeting old friends will bring rejuvenation. This is an excellent day to initiate new relationships and strengthen existing ones. You will spend pleasant moments with your partner. A new chapter will begin in romantic relationships. For married couples, intimacy will increase between spouses. Despite minor differences of opinion, you will resolve them through discussion and live in harmony. Today, you can make a good decision regarding your children's future. Discussions about auspicious events will take place within the family. Those interested in arts and culture may find excellent opportunities today. Platforms will be available to express your creativity. Students will focus more on their education and work diligently. Students preparing for competitive exams can see good progress today. Acting on the advice of elders will bring further benefits. Spiritual inclination will increase. You will find mental peace through temple visits or meditation. Worshipping your chosen deity will bring peace of mind. You will show interest in engaging in social service activities, which will bring self-satisfaction and social recognition. If you undertake journeys, they will bring new experiences and benefits. Overall, today will be a favorable day for you. With your courageous approach and positive thinking, you will succeed in everything. Even if obstacles arise, you possess the mental strength to overcome them. You will firmly work towards your goals and reach the pinnacle of success. Happiness will increase by interacting harmoniously with family members. There is no doubt that the efforts you undertake today will lead to great successes in the future. Act with self-confidence, and success will be yours. This is a suitable time to start learning new things to develop your personal skills. All efforts related to learning will be successful. Paying extra attention to your health is good for the future. Good news awaits those seeking new career opportunities. Bravely face challenges and advance on the path of progress.",
    "career_ta": "இன்று உங்களின் துணிச்சலான அணுகுமுறை பணியிடத்தில் சிறப்பான வெற்றியைத் தேடித்தரும். புதிய திட்டங்களை முன்னெடுப்பதில் தயக்கம் காட்ட மாட்டீர்கள். சக ஊழியர்களிடம் உங்கள் தலைமைப் பண்புகள் வெளிப்படும். பணியிடத்தில் ஒரு புதிய பொறுப்பை ஏற்கும் வாய்ப்பு அமையலாம். வணிகர்களுக்கு புதிய ஒப்பந்தங்கள் ஏற்பட வாய்ப்புகள் உண்டு. சவாலான பணிகளை திறம்பட முடித்து, நற்பெயர் பெறுவீர்கள். அரசுத் துறையில் உள்ளவர்களுக்கு பதவி உயர்வுக்கான பேச்சுவார்த்தைகள் சாதகமாக இருக்கும். உங்கள் தொழில் திறனை மேம்படுத்திக்கொள்ள புதிய பயிற்சிகளில் ஈடுபடுவீர்கள். சுயதொழில் செய்பவர்களுக்கு இன்று வியாபாரம் பெருகும்.",
    "career_en": "Today, your courageous approach will bring excellent success in the workplace. You will not hesitate to take on new projects. Your leadership qualities will shine among colleagues. There may be an opportunity to take on a new responsibility at work. Business owners may find opportunities for new contracts. You will efficiently complete challenging tasks and earn a good reputation. For those in government sectors, promotion discussions will be favorable. You will engage in new training to enhance your professional skills. Self-employed individuals will see their business flourish today.",
    "finance_ta": "பொருளாதார ரீதியாக இன்று உங்களுக்கு நல்ல முன்னேற்றம் ஏற்படும். நீண்ட நாட்களாக எதிர்பார்த்திருந்த நிதி ஆதாயம் இன்று கிடைக்கப் பெறும். சொத்து சம்பந்தமான முதலீடுகளில் நல்ல பலன் கிடைக்கும். நிலம் வாங்குவது, விற்பது போன்ற விஷயங்களில் சாதகமான முடிவுகள் வரும். பழைய கடன்களை அடைப்பதற்கு நல்ல வாய்ப்புகள் அமையும். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதி நிலைமையை மேம்படுத்த புதிய வழிகளைக் கண்டுபிடிப்பீர்கள். ஒரு சிலருக்கு எதிர்பாராத பொருள் வரவு மனமகிழ்ச்சியைத் தரும்.",
    "finance_en": "Financially, you will experience good progress today. Long-awaited financial gains will be received today. Investments related to property will yield good returns. Favorable decisions will come in matters of buying and selling land. Good opportunities will arise to repay old debts. You will focus on savings plans. You will discover new ways to improve your family's financial situation. Unexpected financial inflow will bring joy to some.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் இன்று சிறப்பாக இருக்கும். மனதில் புதிய உற்சாகமும், ஆற்றலும் பெருகும். உடற்பயிற்சி, நடைபயிற்சி போன்றவற்றை மேற்கொள்வதன் மூலம் ஆரோக்கியத்தை மேலும் மேம்படுத்தலாம். மன அமைதிக்கு தியானம் செய்வது நன்மை பயக்கும். இன்று நீங்கள் உணவு விஷயத்தில் சரியான கவனம் செலுத்துவீர்கள். சிறுசிறு உடல் உபாதைகள் ஏற்பட்டாலும், விரைந்து குணமடைவீர்கள். புதிய விளையாட்டு நடவடிக்கைகளில் ஈடுபட ஆர்வம் காட்டுவீர்கள். நோயெதிர்ப்பு சக்தி அதிகரிக்கும்.",
    "health_en": "Your physical health will be excellent today. New enthusiasm and energy will flow in your mind. You can further improve your health by engaging in exercises like walking. Meditation will be beneficial for mental peace. Today, you will pay proper attention to your diet. Even if minor ailments occur, you will recover quickly. You will show interest in engaging in new sports activities. Your immunity will increase.",
    "lucky_number": "9",
    "lucky_color_ta": "செந்நிறம்",
    "lucky_color_en": "Red"
  },
  {
    "sign_ta": "ரிஷபம்",
    "sign_en": "Taurus",
    "date": "10-02-2026",
    "prediction_ta": "பெப்ரவரி 10, 2026, செவ்வாய்க்கிழமை. இன்றைய செவ்வாயின் ஆதிக்கம் ரிஷப ராசிக்காரர்களுக்கு திட்டமிட்ட காரியங்களை நிறைவேற்றுவதில் கூடுதல் பலத்தையும், மன உறுதியையும் அளிக்கும். பொறுமையுடன் செயல்பட்டு, உங்கள் இலக்குகளை அடைவதில் வெற்றி காண்பீர்கள். உங்களின் கடின உழைப்பும், விடாமுயற்சியும் இன்று நல்ல பலனைத் தரும். மனதிலுள்ள குழப்பங்கள் நீங்கி தெளிவு பிறக்கும். எந்தவொரு சவாலையும் எதிர்கொள்ளும் துணிவு உங்களுக்கு உண்டாகும். இன்று நீங்கள் மேற்கொள்ளும் முயற்சிகள் அனைத்தும் வெற்றி பெறும் என்பதில் சந்தேகமில்லை. உங்கள் உள்மனதின் குரலுக்கு செவிமடுத்து செயல்படுவது உங்களுக்கு நன்மை பயக்கும். கடந்தகால அனுபவங்களில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செதுக்குவீர்கள். உங்கள் நேர்மையான அணுகுமுறையால் பிறரின் நம்பிக்கையைப் பெறுவீர்கள். சமூகத்தில் உங்கள் கருத்துக்களுக்கு மதிப்பு கூடும். தலைமைப் பண்புகள் வெளிப்படும். குடும்பத்தில் உங்கள் அறிவுரைகள் ஏற்றுக்கொள்ளப்படும். சகோதர உறவுகள் பலப்படும். சொத்து சம்பந்தமான விஷயங்களில் இன்று நேர்மறையான முடிவுகளைக் காணலாம். நிலம் வாங்குவது, விற்பது அல்லது பழைய சொத்துக்களை பழுதுபார்ப்பது போன்ற காரியங்களில் நல்ல முன்னேற்றம் ஏற்படும். நீண்டகாலமாக நிலுவையிலிருந்த சொத்து பிரச்சனைகளுக்குத் தீர்வு கிடைக்கும் வாய்ப்புகள் உண்டு. சட்டப்பூர்வமான விஷயங்களில் நிதானமாக செயல்படுவது நல்லது. உங்கள் வீட்டிற்குத் தேவையான பொருட்களை வாங்க அல்லது வீட்டிற்கு புதிய அலங்காரப் பொருட்கள் சேர்ப்பதற்கு இன்று சிறப்பான நாளாகும். உறவினர்களுடன் இணைந்து சுபகாரியங்களை பற்றிப் பேசலாம். இன்று உங்கள் மனதில் ஒருவித அமைதியும், தன்னம்பிக்கையும் குடிகொண்டிருக்கும். உங்கள் ஆற்றலை ஆக்கப்பூர்வமான வழிகளில் பயன்படுத்த வேண்டும். வீண் விவாதங்களில் ஈடுபடுவதைத் தவிர்த்து, உங்கள் கவனத்தை பயனுள்ள காரியங்களில் செலுத்துங்கள். கலை மற்றும் இசை போன்ற பொழுதுபோக்குகளில் ஈடுபடுவது மனதை ஒருமுகப்படுத்த உதவும். நண்பர்களுடன் இனிமையான பொழுதைச் செலவிடுவதன் மூலம் புத்துணர்ச்சி பெறுவீர்கள். புதிய உறவுகளைத் தொடங்குவதற்கும், ஏற்கனவே உள்ள உறவுகளை வலுப்படுத்துவதற்கும் இன்று ஒரு நல்ல வாய்ப்பாகும். உங்கள் துணையுடன் நீங்கள் எதிர்பார்க்கும் அளவிற்கு நல்லுறவு அமையும். திருமணமானவர்களுக்கு கணவன் மனைவி இடையே அன்பு அதிகரிக்கும். குழந்தைகளுடன் நேரம் செலவிடுவது மகிழ்ச்சியைத் தரும். மாணவர்களுக்கு இன்று கல்வி தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். ஆசிரியர்களின் பாராட்டைப் பெறுவீர்கள். புதிய விஷயங்களைக் கற்க ஆர்வம் காட்டுவீர்கள். போட்டித் தேர்வுகளுக்குத் தயாராகும் மாணவர்களுக்கு இன்று நல்ல முன்னேற்றம் காண முடியும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் மூலம் மன அமைதி பெறுவீர்கள். தர்ம காரியங்களில் ஈடுபடுவது மனநிறைவைத் தரும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் மகிழ்ச்சி தருவதோடு, புதிய அனுபவங்களையும் கற்றுத்தரும். இன்று உங்கள் தன்னம்பிக்கை அதிகரிக்கும். எந்த ஒரு புதிய காரியத்தையும் தொடங்க இது ஒரு நல்ல நாளாகும். உங்கள் திறமைகளை முழுமையாகப் பயன்படுத்தி, உங்கள் இலக்குகளை நோக்கி உறுதியாகச் செயல்படுவீர்கள். சமூகத்தில் நற்பெயர் கிடைக்கும். உங்கள் விடாமுயற்சியால் சிறப்பான பலன்களைப் பெறுவீர்கள். மொத்தத்தில், இன்று ரிஷப ராசிக்காரர்களுக்கு நல்ல முன்னேற்றம் தரக்கூடிய ஒரு நாளாக அமையும். தடங்கல்கள் ஏற்பட்டாலும், அதனைத் துணிவுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். குடும்ப உறவுகள் பலப்படும். இன்று நீங்கள் எடுக்கும் முடிவுகள் எதிர்காலத்திற்கு நன்மை பயக்கும்.",
    "prediction_en": "February 10, 2026, Tuesday. Today's strong influence of Mars will grant Taurus natives additional strength and determination to accomplish planned tasks. You will succeed in achieving your goals by acting patiently. Your hard work and perseverance will yield good results today. Mental confusion will clear, leading to clarity. You will possess the courage to face any challenge. There is no doubt that all your efforts today will succeed. Acting by listening to your inner voice will benefit you. You will learn from past experiences and shape your future. Through your honest approach, you will gain the trust of others. Your opinions will gain value in society. Leadership qualities will emerge. Your advice will be accepted in the family. Sibling relationships will strengthen. You may see positive outcomes in property-related matters today. Good progress will be made in buying, selling land, or repairing old properties. Opportunities may arise to resolve long-standing property issues. It is advisable to act calmly in legal matters. Today is an excellent day to purchase items for your home or to add new decorative elements. You can discuss auspicious events with relatives. Today, a sense of peace and self-confidence will prevail in your mind. You must channel your energy constructively. Avoid engaging in trivial arguments and focus your attention on productive tasks. Engaging in hobbies like art and music will help in mental concentration. Spending pleasant time with friends will bring rejuvenation. Today is a good opportunity to start new relationships and strengthen existing ones. You will enjoy a good relationship with your partner as expected. For married couples, love between spouses will increase. Spending time with children will bring joy. Students will experience good progress in educational matters today. You will receive praise from teachers. You will show interest in learning new things. Students preparing for competitive exams can see good progress today. Spiritual inclination will increase. You will find mental peace through temple visits or meditation. Engaging in charitable deeds will bring self-satisfaction. Any journeys you undertake today will bring joy and new experiences. Today, your self-confidence will increase. This is a good day to start any new endeavor. You will fully utilize your talents and firmly work towards your goals. You will gain a good reputation in society. Your perseverance will bring excellent results. Overall, today will be a day of good progress for Taurus natives. Even if obstacles arise, you will face them bravely and succeed. Family relationships will strengthen. The decisions you make today will benefit your future.",
    "career_ta": "பணியிடத்தில் உங்கள் கடின உழைப்பு அங்கீகரிக்கப்படும். புதிய பொறுப்புகளை ஏற்கும் வாய்ப்புகள் அமையும். சவாலான திட்டங்களை கையாளும் துணிச்சல் பிறக்கும். சக ஊழியர்களின் ஒத்துழைப்பு கிடைக்கும். வியாபாரத்தில் புதிய வாடிக்கையாளர்களை ஈர்ப்பீர்கள். நீண்டகாலமாக நிலுவையிலுள்ள ஒப்பந்தங்கள் இன்று கையெழுத்தாகலாம். அரசு ஊழியர்களுக்கு பதவி உயர்வு அல்லது இடமாற்றம் தொடர்பான நல்ல செய்திகள் வந்து சேரும். சுயதொழில் செய்பவர்கள் தங்கள் வணிகத்தை விரிவுபடுத்த சாதகமான வாய்ப்புகளைப் பெறுவார்கள்.",
    "career_en": "Your hard work will be recognized in the workplace. Opportunities to take on new responsibilities will arise. You will gain the courage to handle challenging projects. Cooperation from colleagues will be available. In business, you will attract new customers. Long-pending contracts may be signed today. Government employees will receive good news regarding promotions or transfers. Self-employed individuals will get favorable opportunities to expand their business.",
    "finance_ta": "நிதி நிலைமை மேம்படும். எதிர்பார்த்த நிதி ஆதாயங்கள் இன்று கிடைக்கும். சேமிப்பு மற்றும் முதலீடுகளில் நல்ல முடிவுகளை எடுப்பீர்கள். நீண்டகாலமாக நிலுவையிலுள்ள கடன்களை அடைப்பதற்கான வழிகள் பிறக்கும். சொத்து சம்பந்தமான விஷயங்களில் ஆதாயம் உண்டு. வாரிசு சொத்து தொடர்பான பிரச்சனைகள் சுமுகமாக தீர்க்கப்படும். உங்கள் குடும்பத்தின் நிதி நிலைமையை வலுப்படுத்த திட்டமிடுவீர்கள். திடீர் பண வரவுகள் மகிழ்ச்சியைத் தரும். கடன் கொடுத்தவர்கள் பணத்தை வசூலிப்பதில் வெற்றி பெறுவார்கள்.",
    "finance_en": "The financial situation will improve. Expected financial gains will be received today. You will make good decisions regarding savings and investments. Ways to repay long-pending debts will emerge. There will be gains in property-related matters. Heirloom property issues will be resolved amicably. You will plan to strengthen your family's financial situation. Sudden inflows of cash will bring joy. Lenders will succeed in collecting money.",
    "health_ta": "உங்கள் ஆரோக்கியம் இன்று ஸ்திரமாக இருக்கும். மனஅழுத்தம் குறைந்து மன அமைதி நிலவும். உடற்பயிற்சி மற்றும் யோகா போன்றவற்றை தொடர்ந்து செய்வதன் மூலம் உடல் நலத்தை பாதுகாக்கலாம். சுறுசுறுப்புடன் செயல்படுவீர்கள். சரியான உணவுப் பழக்கங்களை கடைபிடிப்பது அவசியம். சிறிய அளவிலான உடற்பயிற்சிகளை மேற்கொள்வது அன்றாட ஆற்றலை அதிகரிக்கும். நோயெதிர்ப்பு சக்தி வலுப்பெறும். போதுமான ஓய்வு எடுப்பது முக்கியம்.",
    "health_en": "Your health will be stable today. Mental stress will reduce, and peace of mind will prevail. You can maintain your health by continuously practicing exercise and yoga. You will act with agility. Adhering to proper eating habits is essential. Engaging in minor physical exercises will increase daily energy. Your immunity will strengthen. Taking adequate rest is important.",
    "lucky_number": "6",
    "lucky_color_ta": "வெண்மை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "மிதுனம்",
    "sign_en": "Gemini",
    "date": "10-02-2026",
    "prediction_ta": "பெப்ரவரி 10, 2026, செவ்வாய்க்கிழமை. இன்றைய செவ்வாயின் ஆதிக்கம் மிதுன ராசிக்காரர்களுக்கு புதிய யோசனைகளை செயல்படுத்தவும், சவால்களை துணிவுடன் எதிர்கொள்ளவும் ஊக்கமளிக்கும். உங்கள் மனதில் உள்ள திட்டங்களை வெளிப்படையாகப் பேசவும், அவற்றை செயல்படுத்துவதற்கான நடவடிக்கைகளை மேற்கொள்ளவும் இன்று சிறந்த நாளாகும். உங்களின் தொடர்புத் திறன் இன்று சிறப்பாக செயல்படும். குடும்பத்தினர் மற்றும் நண்பர்களுடன் சுமுகமான உறவைப் பேணுவீர்கள். எந்த ஒரு சூழ்நிலையிலும் மனதை தளரவிடாமல், தன்னம்பிக்கையுடன் செயல்படுவீர்கள். ஒரு சில புதிய வாய்ப்புகள் தேடி வரும். அதனை சரியாகப் பயன்படுத்திக் கொள்வது உங்கள் பொறுப்பு. நேர்மறையான சிந்தனையுடன் செயல்பட்டால், எதிர்பார்த்த வெற்றியை விட மேலான பலனைப் பெறுவீர்கள். கடந்த கால தவறுகளில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவீர்கள். சமூகத்தில் உங்களது பேச்சுக்கு மரியாதை கிடைக்கும். தலைமைப் பொறுப்புகளை ஏற்கும் வாய்ப்புகள் அமையும். உங்கள் முடிவுகளுக்கு ஆதரவு கிடைக்கும். இன்று சொத்து சம்பந்தமான விஷயங்களில் சாதகமான முடிவுகள் கிடைக்கும். நீண்ட நாட்களாக நிலுவையிலுள்ள சொத்து விவகாரங்கள் இன்று தீர்க்கப்படலாம். நிலம் வாங்குவது, விற்பது அல்லது புதிய வீடு கட்டுவது போன்ற காரியங்களில் நல்ல முன்னேற்றம் ஏற்படும். உங்கள் வீட்டிற்குத் தேவையான பொருட்களை வாங்குவதற்கும், பழுதுபார்ப்பதற்கும் இன்று சிறந்த நாளாகும். சட்டப்பூர்வமான ஆலோசனைகளைப் பெற்று செயல்படுவது மேலும் நன்மையை விளைவிக்கும். குடும்ப உறுப்பினர்களுடன் இணைந்து புதிய முதலீடுகள் குறித்து ஆலோசிக்கலாம். இன்று உங்கள் மனதினில் ஒருவித தைரியமும், சுறுசுறுப்பும் குடிகொண்டிருக்கும். உங்கள் ஆற்றலை சரியான வழியில் பயன்படுத்த வேண்டும். வீண் விவாதங்கள், வாக்குவாதங்களைத் தவிர்ப்பது நல்லது. கலை, இலக்கியம் மற்றும் எழுத்துத் துறைகளில் ஆர்வம் கொண்டவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் கிடைக்கும். உங்கள் படைப்பாற்றலை வெளிப்படுத்த நல்லதொரு தளம் அமையும். நண்பர்களுடன் இனிமையான பொழுதைச் செலவிடுவீர்கள். புதிய உறவுகளைத் தொடங்குவதற்கும், ஏற்கனவே உள்ள உறவுகளை வலுப்படுத்துவதற்கும் இன்று ஒரு நல்ல வாய்ப்பாகும். உங்கள் துணையுடன் நீங்கள் எதிர்பார்க்கும் அளவிற்கு நல்லுறவு அமையும். திருமணமானவர்களுக்கு கணவன் மனைவி இடையே அன்னியோன்னியம் அதிகரிக்கும். குழந்தைகளுடன் நேரம் செலவிடுவது மகிழ்ச்சியைத் தரும். மாணவர்களுக்கு இன்று கல்வி தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். போட்டித் தேர்வுகளுக்குத் தயாராகும் மாணவர்களுக்கு இன்று நல்ல முன்னேற்றம் காண முடியும். புதிய விஷயங்களைக் கற்க ஆர்வம் காட்டுவீர்கள். ஆசிரியர்களின் பாராட்டைப் பெறுவீர்கள். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் மூலம் மன அமைதி பெறுவீர்கள். தர்ம காரியங்களில் ஈடுபடுவது மனநிறைவைத் தரும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் மகிழ்ச்சி தருவதோடு, புதிய அனுபவங்களையும் கற்றுத்தரும். உங்கள் விருப்ப தெய்வத்தை வணங்குவது மனதில் நிம்மதியைத் தரும். சமூக சேவை நடவடிக்கைகளில் ஈடுபட ஆர்வம் காட்டுவீர்கள். இதன் மூலம் மனநிறைவும், சமூக அங்கீகாரமும் கிடைக்கும். மொத்தத்தில், இன்று மிதுன ராசிக்காரர்களுக்கு நல்ல முன்னேற்றம் தரக்கூடிய ஒரு நாளாக அமையும். தடங்கல்கள் ஏற்பட்டாலும், அதனைத் துணிவுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். குடும்ப உறவுகள் பலப்படும். இன்று நீங்கள் எடுக்கும் முடிவுகள் எதிர்காலத்திற்கு நன்மை பயக்கும். உங்கள் தனிப்பட்ட திறமைகளை வளர்த்துக்கொள்ள புதிய விஷயங்களைக் கற்கத் தொடங்குவதற்கு இது உகந்த நேரம். கற்றல் தொடர்பான முயற்சிகள் யாவும் வெற்றி பெறும்.",
    "prediction_en": "February 10, 2026, Tuesday. Today's strong influence of Mars will encourage Gemini natives to implement new ideas and bravely face challenges. Today is an excellent day to openly discuss your plans and take steps to implement them. Your communication skills will be excellent today. You will maintain harmonious relationships with family and friends. You will act with self-confidence in any situation, without letting your spirits dampen. Some new opportunities will come your way. It is your responsibility to utilize them properly. If you act with positive thinking, you will achieve results greater than expected. You will learn from past mistakes and refine your future. Your words will be respected in society. Opportunities to take on leadership roles will arise. Your decisions will receive support. Today, favorable outcomes will be seen in property-related matters. Long-pending property issues may be resolved today. Good progress will be made in buying, selling land, or building a new house. Today is an excellent day to purchase items for your home and to undertake repairs. Seeking legal advice will bring further benefits. You can consult with family members about new investments. Today, a sense of courage and agility will reside in your mind. You must channel your energy in the right direction. It is advisable to avoid trivial arguments and debates. Those interested in arts, literature, and writing will find excellent opportunities today. A good platform will emerge to express your creativity. You will spend pleasant time with friends. Today is a good opportunity to start new relationships and strengthen existing ones. You will enjoy a good relationship with your partner as expected. For married couples, intimacy will increase between spouses. Spending time with children will bring joy. Students will experience good progress in educational matters today. Students preparing for competitive exams can see good progress today. You will show interest in learning new things. You will receive praise from teachers. Spiritual inclination will increase. You will find mental peace through temple visits or meditation. Engaging in charitable deeds will bring self-satisfaction. Any journeys you undertake today will bring joy and new experiences. Worshipping your chosen deity will bring peace of mind. You will show interest in engaging in social service activities, which will bring self-satisfaction and social recognition. Overall, today will be a day of good progress for Gemini natives. Even if obstacles arise, you will face them bravely and succeed. Family relationships will strengthen. The decisions you make today will benefit your future. This is a suitable time to start learning new things to develop your personal skills. All efforts related to learning will be successful.",
    "career_ta": "பணியிடத்தில் உங்கள் கருத்துக்களுக்கு மதிப்பு கிடைக்கும். புதிய யோசனைகளை முன்வைத்து, அதனை செயல்படுத்துவதற்கான துணிச்சல் பிறக்கும். சக ஊழியர்களுடன் இணைந்து செயல்படுவீர்கள். தகவல் தொடர்பு சார்ந்த பணிகளில் சிறந்து விளங்குவீர்கள். வணிகர்களுக்கு புதிய வாய்ப்புகள் தேடி வரும். பேச்சுவார்த்தைகளில் வெற்றி பெறுவீர்கள். அரசுத் துறையில் உள்ளவர்களுக்கு புதிய பொறுப்புகள் அமையலாம். சுயதொழில் செய்பவர்கள் இன்று தங்கள் வணிகத்தை விரிவாக்குவதற்கான திட்டங்களில் வெற்றி பெறுவார்கள்.",
    "career_en": "Your opinions will be valued in the workplace. You will gain the courage to propose new ideas and implement them. You will work collaboratively with colleagues. You will excel in communication-related tasks. New opportunities will come to business owners. You will succeed in negotiations. Government employees may take on new responsibilities. Self-employed individuals will succeed in their plans to expand their business today.",
    "finance_ta": "நிதி நிலைமை இன்று சாதகமாக இருக்கும். எதிர்பார்த்த பண வரவுகள் கிடைக்கும். புத்திசாலித்தனமான முதலீடுகளை மேற்கொள்வீர்கள். பழைய கடன்களை அடைப்பதற்கான வழிகள் பிறக்கும். சொத்து சம்பந்தமான விஷயங்களில் நல்ல முடிவுகளை எடுப்பீர்கள். குறிப்பாக, புதிய சொத்து வாங்குவதற்கு இன்று நல்ல நாளாகும். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதி நிலைமையை மேம்படுத்த புதிய வழிகளைக் கண்டுபிடிப்பீர்கள். ஒரு சிலருக்கு எதிர்பாராத பொருள் வரவு மனமகிழ்ச்சியைத் தரும்.",
    "finance_en": "The financial situation will be favorable today. Expected financial inflows will be received. You will make smart investments. Ways to repay old debts will emerge. You will make good decisions in property-related matters. Especially, today is a good day to buy new property. You will focus on savings plans. You will discover new ways to improve your family's financial situation. Unexpected financial inflow will bring joy to some.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் இன்று நன்றாக இருக்கும். மனது லேசாகவும், உற்சாகமாகவும் இருக்கும். சுவாசப் பயிற்சி, நடைபயிற்சி போன்றவற்றை மேற்கொள்வது நன்மை பயக்கும். மனதை ஒருமுகப்படுத்த தியானம் செய்யலாம். நல்ல உணவுப் பழக்கவழக்கங்களை கடைபிடிப்பது அவசியம். சிறிய அளவிலான மன அழுத்தத்தைக் கையாளும் திறன் அதிகரிக்கும். புதிய உற்சாகத்துடன் செயல்படுவீர்கள். நோயெதிர்ப்பு சக்தி வலுப்பெறும்.",
    "health_en": "Your physical health will be good today. Your mind will be light and enthusiastic. Practicing breathing exercises and walking will be beneficial. You can meditate to focus your mind. Adhering to good eating habits is essential. Your ability to handle minor stress will increase. You will act with new enthusiasm. Your immunity will strengthen.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "10-02-2026",
    "prediction_ta": "பெப்ரவரி 10, 2026, செவ்வாய்க்கிழமை. இன்றைய செவ்வாயின் ஆதிக்கம் கடக ராசிக்காரர்களுக்கு குடும்பத்திலும், சமூகத்திலும் பொறுப்புணர்வை அதிகரிக்கச் செய்யும். உங்கள் உள்ளுணர்வின் அடிப்படையில் தைரியமான முடிவுகளை எடுப்பீர்கள். வீட்டின் பாதுகாப்பிலும், குடும்ப உறுப்பினர்களின் நலனிலும் கூடுதல் கவனம் செலுத்துவீர்கள். சவால்களை துணிவுடன் எதிர்கொண்டு, அவற்றை சாதகமாக மாற்றும் திறமை உங்களுக்கு உண்டு. நீண்ட நாட்களாக நிலுவையிலுள்ள வீட்டு வேலைகளை இன்று முன்னெடுத்துச் செல்வீர்கள். உறவினர்களுடன் சுமூகமான உறவைப் பேணுவீர்கள். கடந்த கால அனுபவங்களில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவீர்கள். சமூகத்தில் உங்களது நேர்மையான அணுகுமுறைக்கு நல்ல அங்கீகாரம் கிடைக்கும். தலைமைப் பண்புகள் வெளிப்படும். உங்கள் முடிவுகளுக்கு குடும்பத்திலும், பணியிடத்திலும் ஆதரவு கிடைக்கும். இன்று சொத்து சம்பந்தமான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். வீடு கட்டுவது, வாங்குவது அல்லது பழுதுபார்ப்பது போன்ற காரியங்களில் சாதகமான முடிவுகள் கிடைக்கும். நீண்டகாலமாக நிலுவையிலுள்ள சொத்து பிரச்சனைகளுக்குத் தீர்வு கிடைக்கும் வாய்ப்புகள் உண்டு. சட்டப்பூர்வமான ஆலோசனைகளைப் பெற்று செயல்படுவது நல்ல பலனைத் தரும். உங்கள் வீட்டிற்குத் தேவையான புதிய பொருட்களை வாங்குவதற்கு அல்லது வீட்டை அழகுபடுத்துவதற்கு இன்று சிறந்த நாளாகும். குடும்பத்தில் சுபகாரியங்கள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். குழந்தைகள் தொடர்பான விஷயங்களில் நல்ல முடிவுகளை எடுப்பீர்கள். இன்று உங்கள் மனதில் ஒருவித அமைதியும், தன்னம்பிக்கையும் குடிகொண்டிருக்கும். உங்கள் ஆற்றலை ஆக்கப்பூர்வமான வழிகளில் பயன்படுத்த வேண்டும். வீண் விவாதங்கள், வாக்குவாதங்களைத் தவிர்ப்பது நல்லது. கலை, இசை மற்றும் வீட்டு அலங்காரம் போன்ற பொழுதுபோக்குகளில் ஈடுபடுவது மனதை ஒருமுகப்படுத்த உதவும். நண்பர்களுடன் இனிமையான பொழுதைச் செலவிடுவதன் மூலம் புத்துணர்ச்சி பெறுவீர்கள். புதிய உறவுகளைத் தொடங்குவதற்கும், ஏற்கனவே உள்ள உறவுகளை வலுப்படுத்துவதற்கும் இன்று ஒரு நல்ல வாய்ப்பாகும். உங்கள் துணையுடன் நீங்கள் எதிர்பார்க்கும் அளவிற்கு நல்லுறவு அமையும். திருமணமானவர்களுக்கு கணவன் மனைவி இடையே அன்னியோன்னியம் அதிகரிக்கும். குழந்தைகளுடன் நேரம் செலவிடுவது மகிழ்ச்சியைத் தரும். மாணவர்களுக்கு இன்று கல்வி தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். ஆசிரியர்களின் பாராட்டைப் பெறுவீர்கள். புதிய விஷயங்களைக் கற்க ஆர்வம் காட்டுவீர்கள். போட்டித் தேர்வுகளுக்குத் தயாராகும் மாணவர்களுக்கு இன்று நல்ல முன்னேற்றம் காண முடியும். பெரியவர்களின் ஆலோசனையைப் பெற்று செயல்படுவது மேலும் நன்மையை விளைவிக்கும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் மூலம் மன அமைதி பெறுவீர்கள். தர்ம காரியங்களில் ஈடுபடுவது மனநிறைவைத் தரும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் மகிழ்ச்சி தருவதோடு, புதிய அனுபவங்களையும் கற்றுத்தரும். உங்கள் விருப்ப தெய்வத்தை வணங்குவது மனதில் நிம்மதியைத் தரும். சமூக சேவை நடவடிக்கைகளில் ஈடுபட ஆர்வம் காட்டுவீர்கள். இதன் மூலம் மனநிறைவும், சமூக அங்கீகாரமும் கிடைக்கும். மொத்தத்தில், இன்று கடக ராசிக்காரர்களுக்கு நல்ல முன்னேற்றம் தரக்கூடிய ஒரு நாளாக அமையும். தடங்கல்கள் ஏற்பட்டாலும், அதனைத் துணிவுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். குடும்ப உறவுகள் பலப்படும். இன்று நீங்கள் எடுக்கும் முடிவுகள் எதிர்காலத்திற்கு நன்மை பயக்கும். உங்கள் தனிப்பட்ட திறமைகளை வளர்த்துக்கொள்ள புதிய விஷயங்களைக் கற்கத் தொடங்குவதற்கு இது உகந்த நேரம். கற்றல் தொடர்பான முயற்சிகள் யாவும் வெற்றி பெறும்.",
    "prediction_en": "February 10, 2026, Tuesday. Today's strong influence of Mars will increase the sense of responsibility for Cancer natives both in family and society. You will make courageous decisions based on your intuition. You will pay extra attention to the safety of your home and the well-being of family members. You have the ability to bravely face challenges and turn them into advantages. You will advance long-pending household tasks today. You will maintain harmonious relationships with relatives. You will learn from past experiences and refine your future. Your honest approach will receive good recognition in society. Leadership qualities will emerge. Your decisions will receive support both in the family and at work. Today, good progress will be made in property-related matters. Favorable outcomes will be seen in building, buying, or repairing a house. Opportunities may arise to resolve long-standing property issues. Seeking legal advice will bring further benefits. Today is an excellent day to purchase new items for your home or to decorate it. Discussions about auspicious events will take place within the family. You will make good decisions regarding matters related to children. Today, a sense of peace and self-confidence will prevail in your mind. You must channel your energy in constructive ways. It is advisable to avoid trivial arguments and debates. Those interested in arts, music, and home decor will find excellent opportunities today. Engaging in such hobbies will help in mental concentration. You will spend pleasant time with friends, which will bring rejuvenation. Today is a good opportunity to start new relationships and strengthen existing ones. You will enjoy a good relationship with your partner as expected. For married couples, intimacy will increase between spouses. Spending time with children will bring joy. Students will experience good progress in educational matters today. You will receive praise from teachers. You will show interest in learning new things. Students preparing for competitive exams can see good progress today. Acting on the advice of elders will bring further benefits. Spiritual inclination will increase. You will find mental peace through temple visits or meditation. Engaging in charitable deeds will bring self-satisfaction. Any journeys you undertake today will bring joy and new experiences. Worshipping your chosen deity will bring peace of mind. You will show interest in engaging in social service activities, which will bring self-satisfaction and social recognition. Overall, today will be a day of good progress for Cancer natives. Even if obstacles arise, you will face them bravely and succeed. Family relationships will strengthen. The decisions you make today will benefit your future. This is a suitable time to start learning new things to develop your personal skills. All efforts related to learning will be successful.",
    "career_ta": "பணியிடத்தில் உங்கள் அர்ப்பணிப்பு பாராட்டப்படும். குழுப்பணிகளில் உங்கள் தலைமைப் பண்புகள் வெளிப்படும். புதிய திட்டங்களை முன்னெடுப்பதில் துணிச்சல் பிறக்கும். வீட்டு வணிகத்தில் ஈடுபட்டுள்ளவர்களுக்கு இன்று நல்ல ஆதாயம் கிடைக்கும். வணிகர்களுக்கு புதிய வாடிக்கையாளர்கள் கிடைப்பார்கள். சவாலான பணிகளை திறம்பட முடித்து, நற்பெயர் பெறுவீர்கள். அரசுத் துறையில் உள்ளவர்களுக்கு பதவி உயர்வுக்கான வாய்ப்புகள் பிரகாசமாக இருக்கும். சுயதொழில் செய்பவர்கள் தங்கள் வணிகத்தை விரிவுபடுத்துவதற்கான திட்டங்களில் வெற்றி பெறுவார்கள்.",
    "career_en": "Your dedication will be appreciated in the workplace. Your leadership qualities will shine in teamwork. You will gain courage to initiate new projects. Those involved in home-based businesses will gain good profits today. Business owners will acquire new customers. You will efficiently complete challenging tasks and earn a good reputation. Opportunities for promotion are bright for those in government sectors. Self-employed individuals will succeed in their plans to expand their business.",
    "finance_ta": "நிதி நிலைமை ஸ்திரமாக இருக்கும். குடும்பத்தின் நிதி நலனுக்காக சில முக்கிய முடிவுகளை எடுப்பீர்கள். சொத்து சம்பந்தமான முதலீடுகளில் நல்ல பலன் கிடைக்கும். நிலம் வாங்குவது, விற்பது அல்லது வீட்டைப் புதுப்பிப்பது போன்ற காரியங்களில் ஆதாயம் உண்டு. சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். நீண்டகாலமாக நிலுவையிலுள்ள கடன்களை அடைப்பதற்கான வழிகள் பிறக்கும். குடும்பத்தில் சுபகாரியங்களுக்காக செலவுகள் ஏற்பட்டாலும், அதற்கேற்ற வரவுகளும் இருக்கும்.",
    "finance_en": "The financial situation will be stable. You will make some important decisions for the financial well-being of your family. Investments related to property will yield good returns. There will be gains in matters of buying, selling land, or renovating a house. You will focus on savings plans. Ways to repay long-pending debts will emerge. Even if expenses occur for auspicious events in the family, there will be corresponding inflows.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் இன்று திருப்திகரமாக இருக்கும். மன அமைதி நிலவும். மனஅழுத்தம் குறைந்து, புத்துணர்ச்சியுடன் செயல்படுவீர்கள். வீட்டிலேயே உடற்பயிற்சிகளை மேற்கொள்வது நன்மை பயக்கும். யோகா மற்றும் தியானம் உங்கள் மன ஆரோக்கியத்தை மேம்படுத்தும். சரியான உணவுப் பழக்கவழக்கங்களை கடைபிடிப்பது அவசியம். குழந்தைகளுடன் விளையாடுவது மனதிற்கு மகிழ்ச்சி தரும். நோயெதிர்ப்பு சக்தி வலுப்பெறும்.",
    "health_en": "Your physical health will be satisfactory today. Peace of mind will prevail. Mental stress will reduce, and you will act with renewed vigor. Exercising at home will be beneficial. Yoga and meditation will improve your mental health. Adhering to proper eating habits is essential. Playing with children will bring joy to your mind. Your immunity will strengthen.",
    "lucky_number": "2",
    "lucky_color_ta": "ஆரஞ்சு",
    "lucky_color_en": "Orange"
  },
  {
    "sign_ta": "சிம்மம்",
    "sign_en": "Leo",
    "date": "10-02-2026",
    "prediction_ta": "பெப்ரவரி 10, 2026, செவ்வாய்க்கிழமை. இன்றைய செவ்வாயின் ஆதிக்கம் சிம்ம ராசிக்காரர்களுக்கு தலைமைப் பண்புகளை வெளிப்படுத்தவும், துணிச்சலான முடிவுகளை எடுக்கவும் ஊக்கமளிக்கும். உங்கள் மனதில் உள்ள திட்டங்களை தைரியமாக முன்வைத்து, அவற்றை செயல்படுத்துவதில் வெற்றி காண்பீர்கள். உங்களின் தன்னம்பிக்கையும், விடாமுயற்சியும் இன்று நல்ல பலனைத் தரும். எந்தவொரு சவாலையும் எதிர்கொள்ளும் துணிவு உங்களுக்கு உண்டாகும். சமூகத்தில் உங்கள் கருத்துக்களுக்கு நல்ல மதிப்பு கிடைக்கும். தலைமைப் பொறுப்புகளை ஏற்கும் வாய்ப்புகள் அமையும். உங்கள் முடிவுகளுக்கு ஆதரவு கிடைக்கும். கடந்த கால அனுபவங்களில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவீர்கள். உங்கள் நேர்மையான அணுகுமுறையால் பிறரின் நம்பிக்கையைப் பெறுவீர்கள். இன்று சொத்து சம்பந்தமான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். நீண்ட நாட்களாக நிலுவையிலுள்ள சொத்து விவகாரங்கள் இன்று தீர்க்கப்படலாம். நிலம் வாங்குவது, விற்பது அல்லது புதிய வீடு கட்டுவது போன்ற காரியங்களில் நல்ல முன்னேற்றம் ஏற்படும். உங்கள் வீட்டிற்குத் தேவையான பொருட்களை வாங்குவதற்கும், பழுதுபார்ப்பதற்கும் இன்று சிறந்த நாளாகும். சட்டப்பூர்வமான ஆலோசனைகளைப் பெற்று செயல்படுவது மேலும் நன்மையை விளைவிக்கும். குடும்ப உறுப்பினர்களுடன் இணைந்து புதிய முதலீடுகள் குறித்து ஆலோசிக்கலாம். உங்கள் ஆற்றலை ஆக்கப்பூர்வமான வழிகளில் பயன்படுத்த வேண்டும். வீண் விவாதங்கள், வாக்குவாதங்களைத் தவிர்ப்பது நல்லது. கலை, இலக்கியம் மற்றும் மேடைப் பேச்சு போன்ற பொழுதுபோக்குகளில் ஈடுபடுவது மனதை ஒருமுகப்படுத்த உதவும். நண்பர்களுடன் இனிமையான பொழுதைச் செலவிடுவீர்கள். புதிய உறவுகளைத் தொடங்குவதற்கும், ஏற்கனவே உள்ள உறவுகளை வலுப்படுத்துவதற்கும் இன்று ஒரு நல்ல வாய்ப்பாகும். உங்கள் துணையுடன் நீங்கள் எதிர்பார்க்கும் அளவிற்கு நல்லுறவு அமையும். திருமணமானவர்களுக்கு கணவன் மனைவி இடையே அன்னியோன்னியம் அதிகரிக்கும். குழந்தைகளுடன் நேரம் செலவிடுவது மகிழ்ச்சியைத் தரும். மாணவர்களுக்கு இன்று கல்வி தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். போட்டித் தேர்வுகளுக்குத் தயாராகும் மாணவர்களுக்கு இன்று நல்ல முன்னேற்றம் காண முடியும். புதிய விஷயங்களைக் கற்க ஆர்வம் காட்டுவீர்கள். ஆசிரியர்களின் பாராட்டைப் பெறுவீர்கள். பெரியவர்களின் ஆலோசனையைப் பெற்று செயல்படுவது மேலும் நன்மையை விளைவிக்கும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் மூலம் மன அமைதி பெறுவீர்கள். தர்ம காரியங்களில் ஈடுபடுவது மனநிறைவைத் தரும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் மகிழ்ச்சி தருவதோடு, புதிய அனுபவங்களையும் கற்றுத்தரும். உங்கள் விருப்ப தெய்வத்தை வணங்குவது மனதில் நிம்மதியைத் தரும். சமூக சேவை நடவடிக்கைகளில் ஈடுபட ஆர்வம் காட்டுவீர்கள். இதன் மூலம் மனநிறைவும், சமூக அங்கீகாரமும் கிடைக்கும். மொத்தத்தில், இன்று சிம்ம ராசிக்காரர்களுக்கு நல்ல முன்னேற்றம் தரக்கூடிய ஒரு நாளாக அமையும். தடங்கல்கள் ஏற்பட்டாலும், அதனைத் துணிவுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். குடும்ப உறவுகள் பலப்படும். இன்று நீங்கள் எடுக்கும் முடிவுகள் எதிர்காலத்திற்கு நன்மை பயக்கும். உங்கள் தனிப்பட்ட திறமைகளை வளர்த்துக்கொள்ள புதிய விஷயங்களைக் கற்கத் தொடங்குவதற்கு இது உகந்த நேரம். கற்றல் தொடர்பான முயற்சிகள் யாவும் வெற்றி பெறும். உங்கள் ஆரோக்கியத்தின் மீது கூடுதல் கவனம் செலுத்துவது எதிர்காலத்திற்கு நல்லது. புதிய தொழில் வாய்ப்புகள் தேடுபவர்களுக்கு இன்று நல்ல செய்திகள் காத்திருக்கின்றன. சவால்களை துணிவுடன் எதிர்கொண்டு, முன்னேற்றப் பாதையில் நடைபோடுங்கள். உங்கள் முயற்சிகளுக்கு இன்று நல்ல ஆதரவு கிடைக்கும்.",
    "prediction_en": "February 10, 2026, Tuesday. Today's strong influence of Mars will encourage Leo natives to express leadership qualities and make courageous decisions. You will bravely present your plans and succeed in implementing them. Your self-confidence and perseverance will yield good results today. You will possess the courage to face any challenge. Your opinions will be well-regarded in society. Opportunities to take on leadership roles will arise. Your decisions will receive support. You will learn from past experiences and refine your future. Through your honest approach, you will gain the trust of others. Today, good progress will be made in property-related matters. Long-pending property issues may be resolved today. Good progress will be made in buying, selling land, or building a new house. Today is an excellent day to purchase items for your home and to undertake repairs. Seeking legal advice will bring further benefits. You can consult with family members about new investments. You must channel your energy in constructive ways. It is advisable to avoid trivial arguments and debates. Engaging in hobbies like art, literature, and public speaking will help in mental concentration. You will spend pleasant time with friends, which will bring rejuvenation. Today is a good opportunity to start new relationships and strengthen existing ones. You will enjoy a good relationship with your partner as expected. For married couples, intimacy will increase between spouses. Spending time with children will bring joy. Students will experience good progress in educational matters today. Students preparing for competitive exams can see good progress today. You will show interest in learning new things. You will receive praise from teachers. Acting on the advice of elders will bring further benefits. Spiritual inclination will increase. You will find mental peace through temple visits or meditation. Engaging in charitable deeds will bring self-satisfaction. Any journeys you undertake today will bring joy and new experiences. Worshipping your chosen deity will bring peace of mind. You will show interest in engaging in social service activities, which will bring self-satisfaction and social recognition. Overall, today will be a day of good progress for Leo natives. Even if obstacles arise, you will face them bravely and succeed. Family relationships will strengthen. The decisions you make today will benefit your future. This is a suitable time to start learning new things to develop your personal skills. All efforts related to learning will be successful. Paying extra attention to your health is good for the future. Good news awaits those seeking new career opportunities. Bravely face challenges and advance on the path of progress. Your efforts will receive good support today.",
    "career_ta": "பணியிடத்தில் உங்களின் தலைமைப் பண்பு வெளிப்படும். புதிய திட்டங்களை முன்னெடுத்து, அதில் வெற்றி பெறுவீர்கள். சக ஊழியர்களின் முழு ஒத்துழைப்பும் கிடைக்கும். வணிகர்களுக்கு புதிய ஒப்பந்தங்கள் ஏற்பட்டு, ஆதாயம் பெருகும். சவாலான பணிகளை திறம்பட முடித்து, நற்பெயர் பெறுவீர்கள். கலை மற்றும் மேலாண்மைத் துறையில் உள்ளவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் அமையும். அரசுத் துறையில் உள்ளவர்களுக்கு பதவி உயர்வுக்கான வாய்ப்புகள் பிரகாசமாக இருக்கும். சுயதொழில் செய்பவர்கள் இன்று தங்கள் வணிகத்தை விரிவாக்குவதற்கான துணிச்சலான முடிவுகளை எடுப்பார்கள்.",
    "career_en": "Your leadership quality will be evident in the workplace. You will initiate new projects and succeed in them. Full cooperation from colleagues will be available. Business owners will secure new contracts and increase profits. You will efficiently complete challenging tasks and earn a good reputation. Those in arts and management fields will find excellent opportunities today. Opportunities for promotion are bright for those in government sectors. Self-employed individuals will make courageous decisions to expand their business today.",
    "finance_ta": "நிதி நிலைமை இன்று வலுவாக இருக்கும். எதிர்பார்த்த நிதி ஆதாயங்கள் இன்று கிடைக்கும். நீண்டகால முதலீடுகளில் நல்ல பலன் கிடைக்கும். சொத்து சம்பந்தமான விஷயங்களில் ஆதாயம் உண்டு. நிலம் வாங்குவது, விற்பது அல்லது பழைய சொத்துக்களை பழுதுபார்ப்பது போன்ற காரியங்களில் நல்ல முன்னேற்றம் ஏற்படும். பழைய கடன்களை அடைப்பதற்கு நல்ல வாய்ப்புகள் அமையும். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதி நிலைமையை மேம்படுத்த புதிய வழிகளைக் கண்டுபிடிப்பீர்கள்.",
    "finance_en": "The financial situation will be strong today. Expected financial gains will be received today. Long-term investments will yield good returns. There will be gains in property-related matters. Good progress will be made in buying, selling land, or repairing old properties. Good opportunities will arise to repay old debts. You will focus on savings plans. You will discover new ways to improve your family's financial situation.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் இன்று சிறப்பாக இருக்கும். மனதில் உற்சாகமும், புத்துணர்ச்சியும் பெருகும். உடற்பயிற்சி, நடைபயிற்சி போன்றவற்றை மேற்கொள்வதன் மூலம் ஆரோக்கியத்தை மேலும் மேம்படுத்தலாம். மன அமைதிக்கு தியானம் செய்வது நன்மை பயக்கும். இன்று நீங்கள் உணவு விஷயத்தில் சரியான கவனம் செலுத்துவீர்கள். நோயெதிர்ப்பு சக்தி அதிகரிக்கும். வெளிநடவடிக்கைகளில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி தரும்.",
    "health_en": "Your physical health will be excellent today. Enthusiasm and rejuvenation will fill your mind. You can further improve your health by engaging in exercises like walking. Meditation will be beneficial for mental peace. Today, you will pay proper attention to your diet. Your immunity will increase. Engaging in outdoor activities will refresh your mind.",
    "lucky_number": "1",
    "lucky_color_ta": "பொன்நிறம்",
    "lucky_color_en": "Golden"
  },
  {
    "sign_ta": "கன்னி",
    "sign_en": "Virgo",
    "date": "10-02-2026",
    "prediction_ta": "பெப்ரவரி 10, 2026, செவ்வாய்க்கிழமை. இன்றைய செவ்வாயின் ஆதிக்கம் கன்னி ராசிக்காரர்களுக்கு திட்டமிட்ட காரியங்களை நிறைவேற்றுவதில் கூடுதல் பலத்தையும், மன உறுதியையும் அளிக்கும். உங்கள் நுட்பமான திட்டமிடல் இன்று நல்ல பலனைத் தரும். சவால்களை துணிவுடன் எதிர்கொண்டு, அவற்றை சாதகமாக மாற்றும் திறமை உங்களுக்கு உண்டு. நீண்ட நாட்களாக நிலுவையிலுள்ள பணிகளை இன்று முன்னெடுத்துச் செல்வீர்கள். உறவினர்களுடன் சுமூகமான உறவைப் பேணுவீர்கள். கடந்த கால அனுபவங்களில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவீர்கள். உங்கள் நேர்மையான அணுகுமுறைக்கு நல்ல அங்கீகாரம் கிடைக்கும். தலைமைப் பண்புகள் வெளிப்படும். உங்கள் முடிவுகளுக்கு குடும்பத்திலும், பணியிடத்திலும் ஆதரவு கிடைக்கும். இன்று சொத்து சம்பந்தமான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். வீடு கட்டுவது, வாங்குவது அல்லது பழுதுபார்ப்பது போன்ற காரியங்களில் சாதகமான முடிவுகள் கிடைக்கும். நீண்டகாலமாக நிலுவையிலுள்ள சொத்து பிரச்சனைகளுக்குத் தீர்வு கிடைக்கும் வாய்ப்புகள் உண்டு. சட்டப்பூர்வமான ஆலோசனைகளைப் பெற்று செயல்படுவது நல்ல பலனைத் தரும். உங்கள் வீட்டிற்குத் தேவையான புதிய பொருட்களை வாங்குவதற்கு அல்லது வீட்டை அழகுபடுத்துவதற்கு இன்று சிறந்த நாளாகும். குடும்பத்தில் சுபகாரியங்கள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். குழந்தைகள் தொடர்பான விஷயங்களில் நல்ல முடிவுகளை எடுப்பீர்கள். இன்று உங்கள் மனதில் ஒருவித அமைதியும், தன்னம்பிக்கையும் குடிகொண்டிருக்கும். உங்கள் ஆற்றலை ஆக்கப்பூர்வமான வழிகளில் பயன்படுத்த வேண்டும். வீண் விவாதங்கள், வாக்குவாதங்களைத் தவிர்ப்பது நல்லது. கலை, இசை மற்றும் எழுத்துத் துறைகளில் ஆர்வம் கொண்டவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் கிடைக்கும். உங்கள் படைப்பாற்றலை வெளிப்படுத்த நல்லதொரு தளம் அமையும். நண்பர்களுடன் இனிமையான பொழுதைச் செலவிடுவீர்கள். புதிய உறவுகளைத் தொடங்குவதற்கும், ஏற்கனவே உள்ள உறவுகளை வலுப்படுத்துவதற்கும் இன்று ஒரு நல்ல வாய்ப்பாகும். உங்கள் துணையுடன் நீங்கள் எதிர்பார்க்கும் அளவிற்கு நல்லுறவு அமையும். திருமணமானவர்களுக்கு கணவன் மனைவி இடையே அன்னியோன்னியம் அதிகரிக்கும். குழந்தைகளுடன் நேரம் செலவிடுவது மகிழ்ச்சியைத் தரும். மாணவர்களுக்கு இன்று கல்வி தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். ஆசிரியர்களின் பாராட்டைப் பெறுவீர்கள். புதிய விஷயங்களைக் கற்க ஆர்வம் காட்டுவீர்கள். போட்டித் தேர்வுகளுக்குத் தயாராகும் மாணவர்களுக்கு இன்று நல்ல முன்னேற்றம் காண முடியும். பெரியவர்களின் ஆலோசனையைப் பெற்று செயல்படுவது மேலும் நன்மையை விளைவிக்கும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் மூலம் மன அமைதி பெறுவீர்கள். தர்ம காரியங்களில் ஈடுபடுவது மனநிறைவைத் தரும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் மகிழ்ச்சி தருவதோடு, புதிய அனுபவங்களையும் கற்றுத்தரும். உங்கள் விருப்ப தெய்வத்தை வணங்குவது மனதில் நிம்மதியைத் தரும். சமூக சேவை நடவடிக்கைகளில் ஈடுபட ஆர்வம் காட்டுவீர்கள். இதன் மூலம் மனநிறைவும், சமூக அங்கீகாரமும் கிடைக்கும். மொத்தத்தில், இன்று கன்னி ராசிக்காரர்களுக்கு நல்ல முன்னேற்றம் தரக்கூடிய ஒரு நாளாக அமையும். தடங்கல்கள் ஏற்பட்டாலும், அதனைத் துணிவுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். குடும்ப உறவுகள் பலப்படும். இன்று நீங்கள் எடுக்கும் முடிவுகள் எதிர்காலத்திற்கு நன்மை பயக்கும். உங்கள் தனிப்பட்ட திறமைகளை வளர்த்துக்கொள்ள புதிய விஷயங்களைக் கற்கத் தொடங்குவதற்கு இது உகந்த நேரம். கற்றல் தொடர்பான முயற்சிகள் யாவும் வெற்றி பெறும். உங்கள் ஆரோக்கியத்தின் மீது கூடுதல் கவனம் செலுத்துவது எதிர்காலத்திற்கு நல்லது.",
    "prediction_en": "February 10, 2026, Tuesday. Today's strong influence of Mars will grant Virgo natives additional strength and determination to accomplish planned tasks. Your meticulous planning will yield good results today. You have the ability to bravely face challenges and turn them into advantages. You will advance long-pending tasks today. You will maintain harmonious relationships with relatives. You will learn from past experiences and refine your future. Your honest approach will receive good recognition. Leadership qualities will emerge. Your decisions will receive support both in the family and at work. Today, good progress will be made in property-related matters. Favorable outcomes will be seen in building, buying, or repairing a house. Opportunities may arise to resolve long-standing property issues. Seeking legal advice will bring further benefits. Today is an excellent day to purchase new items for your home or to decorate it. Discussions about auspicious events will take place within the family. You will make good decisions regarding matters related to children. Today, a sense of peace and self-confidence will prevail in your mind. You must channel your energy in constructive ways. It is advisable to avoid trivial arguments and debates. Those interested in arts, music, and writing will find excellent opportunities today. A good platform will emerge to express your creativity. You will spend pleasant time with friends, which will bring rejuvenation. Today is a good opportunity to start new relationships and strengthen existing ones. You will enjoy a good relationship with your partner as expected. For married couples, intimacy will increase between spouses. Spending time with children will bring joy. Students will experience good progress in educational matters today. You will receive praise from teachers. You will show interest in learning new things. Students preparing for competitive exams can see good progress today. Acting on the advice of elders will bring further benefits. Spiritual inclination will increase. You will find mental peace through temple visits or meditation. Engaging in charitable deeds will bring self-satisfaction. Any journeys you undertake today will bring joy and new experiences. Worshipping your chosen deity will bring peace of mind. You will show interest in engaging in social service activities, which will bring self-satisfaction and social recognition. Overall, today will be a day of good progress for Virgo natives. Even if obstacles arise, you will face them bravely and succeed. Family relationships will strengthen. The decisions you make today will benefit your future. This is a suitable time to start learning new things to develop your personal skills. All efforts related to learning will be successful. Paying extra attention to your health is good for the future.",
    "career_ta": "பணியிடத்தில் உங்கள் திறமையும், உழைப்பும் அங்கீகரிக்கப்படும். புதிய பொறுப்புகளை ஏற்கும் வாய்ப்புகள் அமையும். சவாலான திட்டங்களை கையாளும் துணிச்சல் பிறக்கும். சக ஊழியர்களின் ஒத்துழைப்பு கிடைக்கும். வணிகர்களுக்கு புதிய ஒப்பந்தங்கள் ஏற்பட்டு, ஆதாயம் பெருகும். கடினமான வேலைகளில் துணிவுடன் ஈடுபடுவீர்கள். அரசு ஊழியர்களுக்கு பதவி உயர்வு அல்லது இடமாற்றம் தொடர்பான நல்ல செய்திகள் வந்து சேரும். சுயதொழில் செய்பவர்கள் தங்கள் வணிகத்தை விரிவுபடுத்த சாதகமான வாய்ப்புகளைப் பெறுவார்கள். திட்டமிட்டு செயல்பட்டு வெற்றி பெறுவீர்கள்.",
    "career_en": "Your skill and hard work will be recognized in the workplace. Opportunities to take on new responsibilities will arise. You will gain the courage to handle challenging projects. Cooperation from colleagues will be available. Business owners will secure new contracts and increase profits. You will bravely engage in difficult tasks. Government employees will receive good news regarding promotions or transfers. Self-employed individuals will get favorable opportunities to expand their business. You will plan and succeed.",
    "finance_ta": "நிதி நிலைமை இன்று வலுவாக இருக்கும். எதிர்பார்த்த நிதி ஆதாயங்கள் இன்று கிடைக்கும். நீண்டகால முதலீடுகளில் நல்ல பலன் கிடைக்கும். சொத்து சம்பந்தமான விஷயங்களில் ஆதாயம் உண்டு. நிலம் வாங்குவது, விற்பது அல்லது பழைய சொத்துக்களை பழுதுபார்ப்பது போன்ற காரியங்களில் நல்ல முன்னேற்றம் ஏற்படும். பழைய கடன்களை அடைப்பதற்கு நல்ல வாய்ப்புகள் அமையும். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதி நிலைமையை மேம்படுத்த புதிய வழிகளைக் கண்டுபிடிப்பீர்கள்.",
    "finance_en": "The financial situation will be strong today. Expected financial gains will be received today. Long-term investments will yield good returns. There will be gains in property-related matters. Good progress will be made in buying, selling land, or repairing old properties. Good opportunities will arise to repay old debts. You will focus on savings plans. You will discover new ways to improve your family's financial situation.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் இன்று சிறப்பாக இருக்கும். மனதில் உற்சாகமும், புத்துணர்ச்சியும் பெருகும். உடற்பயிற்சி, நடைபயிற்சி போன்றவற்றை மேற்கொள்வதன் மூலம் ஆரோக்கியத்தை மேலும் மேம்படுத்தலாம். மன அமைதிக்கு தியானம் செய்வது நன்மை பயக்கும். இன்று நீங்கள் உணவு விஷயத்தில் சரியான கவனம் செலுத்துவீர்கள். நோயெதிர்ப்பு சக்தி அதிகரிக்கும். இயற்கை சூழலில் நேரம் செலவிடுவது மனதிற்கு புத்துணர்ச்சி தரும்.",
    "health_en": "Your physical health will be excellent today. Enthusiasm and rejuvenation will fill your mind. You can further improve your health by engaging in exercises like walking. Meditation will be beneficial for mental peace. Today, you will pay proper attention to your diet. Your immunity will increase. Spending time in natural surroundings will refresh your mind.",
    "lucky_number": "5",
    "lucky_color_ta": "வெள்ளி",
    "lucky_color_en": "Silver"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "10-02-2026",
    "prediction_ta": "பெப்ரவரி 10, 2026, செவ்வாய்க்கிழமை. இன்றைய செவ்வாயின் ஆதிக்கம் துலாம் ராசிக்காரர்களுக்கு உறவுகளில் நேர்மறையான மாற்றங்களை கொண்டு வரும். சமாதானம் மற்றும் நியாயம் காக்கும் உங்கள் குணம் இன்று வெளிப்படும். சவால்களை துணிவுடன் எதிர்கொண்டு, அவற்றை சாதகமாக மாற்றும் திறமை உங்களுக்கு உண்டு. நீண்ட நாட்களாக நிலுவையிலுள்ள பேச்சுவார்த்தைகள் இன்று சுமுகமாக முடிவடையும். உறவினர்களுடன் சுமூகமான உறவைப் பேணுவீர்கள். கடந்த கால அனுபவங்களில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவீர்கள். உங்கள் நேர்மையான அணுகுமுறைக்கு நல்ல அங்கீகாரம் கிடைக்கும். தலைமைப் பண்புகள் வெளிப்படும். உங்கள் முடிவுகளுக்கு குடும்பத்திலும், பணியிடத்திலும் ஆதரவு கிடைக்கும். இன்று சொத்து சம்பந்தமான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். வீடு கட்டுவது, வாங்குவது அல்லது பழுதுபார்ப்பது போன்ற காரியங்களில் சாதகமான முடிவுகள் கிடைக்கும். நீண்டகாலமாக நிலுவையிலுள்ள சொத்து பிரச்சனைகளுக்குத் தீர்வு கிடைக்கும் வாய்ப்புகள் உண்டு. சட்டப்பூர்வமான ஆலோசனைகளைப் பெற்று செயல்படுவது நல்ல பலனைத் தரும். உங்கள் வீட்டிற்குத் தேவையான புதிய பொருட்களை வாங்குவதற்கு அல்லது வீட்டை அழகுபடுத்துவதற்கு இன்று சிறந்த நாளாகும். குடும்பத்தில் சுபகாரியங்கள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். குழந்தைகள் தொடர்பான விஷயங்களில் நல்ல முடிவுகளை எடுப்பீர்கள். இன்று உங்கள் மனதில் ஒருவித அமைதியும், தன்னம்பிக்கையும் குடிகொண்டிருக்கும். உங்கள் ஆற்றலை ஆக்கப்பூர்வமான வழிகளில் பயன்படுத்த வேண்டும். வீண் விவாதங்கள், வாக்குவாதங்களைத் தவிர்ப்பது நல்லது. கலை, இசை மற்றும் அழகு சார்ந்த பொழுதுபோக்குகளில் ஈடுபடுவது மனதை ஒருமுகப்படுத்த உதவும். நண்பர்களுடன் இனிமையான பொழுதைச் செலவிடுவதன் மூலம் புத்துணர்ச்சி பெறுவீர்கள். புதிய உறவுகளைத் தொடங்குவதற்கும், ஏற்கனவே உள்ள உறவுகளை வலுப்படுத்துவதற்கும் இன்று ஒரு நல்ல வாய்ப்பாகும். உங்கள் துணையுடன் நீங்கள் எதிர்பார்க்கும் அளவிற்கு நல்லுறவு அமையும். திருமணமானவர்களுக்கு கணவன் மனைவி இடையே அன்னியோன்னியம் அதிகரிக்கும். குழந்தைகளுடன் நேரம் செலவிடுவது மகிழ்ச்சியைத் தரும். மாணவர்களுக்கு இன்று கல்வி தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். ஆசிரியர்களின் பாராட்டைப் பெறுவீர்கள். புதிய விஷயங்களைக் கற்க ஆர்வம் காட்டுவீர்கள். போட்டித் தேர்வுகளுக்குத் தயாராகும் மாணவர்களுக்கு இன்று நல்ல முன்னேற்றம் காண முடியும். பெரியவர்களின் ஆலோசனையைப் பெற்று செயல்படுவது மேலும் நன்மையை விளைவிக்கும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் மூலம் மன அமைதி பெறுவீர்கள். தர்ம காரியங்களில் ஈடுபடுவது மனநிறைவைத் தரும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் மகிழ்ச்சி தருவதோடு, புதிய அனுபவங்களையும் கற்றுத்தரும். உங்கள் விருப்ப தெய்வத்தை வணங்குவது மனதில் நிம்மதியைத் தரும். சமூக சேவை நடவடிக்கைகளில் ஈடுபட ஆர்வம் காட்டுவீர்கள். இதன் மூலம் மனநிறைவும், சமூக அங்கீகாரமும் கிடைக்கும். மொத்தத்தில், இன்று துலாம் ராசிக்காரர்களுக்கு நல்ல முன்னேற்றம் தரக்கூடிய ஒரு நாளாக அமையும். தடங்கல்கள் ஏற்பட்டாலும், அதனைத் துணிவுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். குடும்ப உறவுகள் பலப்படும். இன்று நீங்கள் எடுக்கும் முடிவுகள் எதிர்காலத்திற்கு நன்மை பயக்கும். உங்கள் தனிப்பட்ட திறமைகளை வளர்த்துக்கொள்ள புதிய விஷயங்களைக் கற்கத் தொடங்குவதற்கு இது உகந்த நேரம். கற்றல் தொடர்பான முயற்சிகள் யாவும் வெற்றி பெறும். உங்கள் ஆரோக்கியத்தின் மீது கூடுதல் கவனம் செலுத்துவது எதிர்காலத்திற்கு நல்லது.",
    "prediction_en": "February 10, 2026, Tuesday. Today's strong influence of Mars will bring positive changes in relationships for Libra natives. Your nature of upholding peace and justice will manifest today. You have the ability to bravely face challenges and turn them into advantages. Long-pending negotiations will conclude amicably today. You will maintain harmonious relationships with relatives. You will learn from past experiences and refine your future. Your honest approach will receive good recognition. Leadership qualities will emerge. Your decisions will receive support both in the family and at work. Today, good progress will be made in property-related matters. Favorable outcomes will be seen in building, buying, or repairing a house. Opportunities may arise to resolve long-standing property issues. Seeking legal advice will bring further benefits. Today is an excellent day to purchase new items for your home or to decorate it. Discussions about auspicious events will take place within the family. You will make good decisions regarding matters related to children. Today, a sense of peace and self-confidence will prevail in your mind. You must channel your energy in constructive ways. It is advisable to avoid trivial arguments and debates. Engaging in hobbies like art, music, and beauty will help in mental concentration. You will spend pleasant time with friends, which will bring rejuvenation. Today is a good opportunity to start new relationships and strengthen existing ones. You will enjoy a good relationship with your partner as expected. For married couples, intimacy will increase between spouses. Spending time with children will bring joy. Students will experience good progress in educational matters today. You will receive praise from teachers. You will show interest in learning new things. Students preparing for competitive exams can see good progress today. Acting on the advice of elders will bring further benefits. Spiritual inclination will increase. You will find mental peace through temple visits or meditation. Engaging in charitable deeds will bring self-satisfaction. Any journeys you undertake today will bring joy and new experiences. Worshipping your chosen deity will bring peace of mind. You will show interest in engaging in social service activities, which will bring self-satisfaction and social recognition. Overall, today will be a day of good progress for Libra natives. Even if obstacles arise, you will face them bravely and succeed. Family relationships will strengthen. The decisions you make today will benefit your future. This is a suitable time to start learning new things to develop your personal skills. All efforts related to learning will be successful. Paying extra attention to your health is good for the future.",
    "career_ta": "பணியிடத்தில் உங்கள் சமாதானப்படுத்தும் குணம் பாராட்டு பெறும். குழுப்பணிகளில் உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதிய திட்டங்களை முன்னெடுப்பதில் தயக்கம் காட்ட மாட்டீர்கள். வணிகர்களுக்கு புதிய கூட்டாளிகள் கிடைப்பார்கள். சவாலான பணிகளை திறம்பட முடித்து, நற்பெயர் பெறுவீர்கள். கலை மற்றும் சட்டத் துறையில் உள்ளவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் அமையும். அரசுத் துறையில் உள்ளவர்களுக்கு பதவி உயர்வுக்கான வாய்ப்புகள் பிரகாசமாக இருக்கும். சுயதொழில் செய்பவர்கள் தங்கள் வணிகத்தை விரிவுபடுத்துவதற்கான துணிச்சலான முடிவுகளை எடுப்பார்கள்.",
    "career_en": "Your conciliatory nature will be appreciated in the workplace. Your contribution will be important in teamwork. You will not hesitate to initiate new projects. Business owners will find new partners. You will efficiently complete challenging tasks and earn a good reputation. Those in arts and legal fields will find excellent opportunities today. Opportunities for promotion are bright for those in government sectors. Self-employed individuals will make courageous decisions to expand their business today.",
    "finance_ta": "நிதி நிலைமை இன்று வலுவாக இருக்கும். எதிர்பார்த்த நிதி ஆதாயங்கள் இன்று கிடைக்கும். நீண்டகால முதலீடுகளில் நல்ல பலன் கிடைக்கும். சொத்து சம்பந்தமான விஷயங்களில் ஆதாயம் உண்டு. நிலம் வாங்குவது, விற்பது அல்லது புதிய வீடு கட்டுவது போன்ற காரியங்களில் நல்ல முன்னேற்றம் ஏற்படும். பழைய கடன்களை அடைப்பதற்கு நல்ல வாய்ப்புகள் அமையும். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதி நிலைமையை மேம்படுத்த புதிய வழிகளைக் கண்டுபிடிப்பீர்கள்.",
    "finance_en": "The financial situation will be strong today. Expected financial gains will be received today. Long-term investments will yield good returns. There will be gains in property-related matters. Good progress will be made in buying, selling land, or building a new house. Good opportunities will arise to repay old debts. You will focus on savings plans. You will discover new ways to improve your family's financial situation.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் இன்று சிறப்பாக இருக்கும். மனதில் உற்சாகமும், புத்துணர்ச்சியும் பெருகும். உடற்பயிற்சி, நடைபயிற்சி போன்றவற்றை மேற்கொள்வதன் மூலம் ஆரோக்கியத்தை மேலும் மேம்படுத்தலாம். மன அமைதிக்கு தியானம் செய்வது நன்மை பயக்கும். இன்று நீங்கள் உணவு விஷயத்தில் சரியான கவனம் செலுத்துவீர்கள். நோயெதிர்ப்பு சக்தி அதிகரிக்கும். வெளிநடவடிக்கைகளில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி தரும்.",
    "health_en": "Your physical health will be excellent today. Enthusiasm and rejuvenation will fill your mind. You can further improve your health by engaging in exercises like walking. Meditation will be beneficial for mental peace. Today, you will pay proper attention to your diet. Your immunity will increase. Engaging in outdoor activities will refresh your mind.",
    "lucky_number": "6",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "விருச்சிகம்",
    "sign_en": "Scorpio",
    "date": "10-02-2026",
    "prediction_ta": "பெப்ரவரி 10, 2026, செவ்வாய்க்கிழமை. இன்றைய செவ்வாயின் ஆதிக்கம் விருச்சிக ராசிக்காரர்களுக்கு அபாரமான தைரியத்தையும், துணிச்சலான செயல்பாடுகளையும், புதிய முயற்சிகளை மேற்கொள்ளும் ஆர்வத்தையும் அளிக்கும். உங்கள் உள்ளுணர்வின் குரலுக்கு செவிமடுத்து, அதனைப் பின்பற்றுவதன் மூலம் எதிர்பாராத வெற்றிகளை ஈட்ட முடியும். நீண்ட நாட்களாகத் திட்டமிட்டிருந்த காரியங்களை இன்று துணிவுடன் முன்னெடுத்துச் செல்லும் வாய்ப்புகள் அமையும். சவால்களைக் கண்டு அஞ்சாமல், அவற்றை ஒரு வாய்ப்பாகக் கருதி செயல்படுவீர்கள். மனதிலுள்ள தயக்கங்களை நீக்கி, உங்கள் இலக்குகளை நோக்கி உறுதியாக நடைபோடுவீர்கள். இன்று நீங்கள் எடுக்கும் துணிச்சலான முடிவுகள் எதிர்காலத்தில் பெரும் ஆதாயங்களைத் தரும் என்பதை நினைவில் கொள்ளுங்கள். எந்தவொரு சூழ்நிலையிலும் உங்கள் மன உறுதியை இழக்காமல் இருப்பது மிக முக்கியம். நீங்கள் வெளிப்படுத்தும் நேர்மையான எண்ணங்களும், உறுதியான செயல்பாடுகளும் உங்களைச் சுற்றியுள்ளோரின் நம்பிக்கையை ஈர்க்கும். அநீதிக்கு எதிராகக் குரல் கொடுக்கவும், தர்மத்தை நிலைநாட்டவும் நீங்கள் தயங்க மாட்டீர்கள். இது உங்கள் சமூக மதிப்பையும், கௌரவத்தையும் உயர்த்தும். இக்காலகட்டத்தில் ஆற்றல் பெருகி காணப்படும், அதை சரியாக பயன்படுத்திக்கொள்வது அவசியம். உங்கள் திறமைகளை வெளிக்கொணர புதிய வாய்ப்புகள் கிடைக்கும். சமூகத்தில் உங்கள் கருத்துக்களுக்கு மதிப்பு கிடைக்கும். தலைமைப் பண்புகள் வெளிப்படும். குடும்பத்திலும், பணியிடத்திலும் உங்கள் முடிவுகள் வரவேற்கப்படும். சொத்து சம்பந்தமான விஷயங்களில் நேர்மறையான நகர்வுகளைக் காணலாம். நிலம் வாங்குவது, விற்பது அல்லது பழுதுபார்ப்பது போன்ற காரியங்களில் சாதகமான முடிவுகள் கிடைக்கும். நீண்டகால முதலீடுகள் குறித்து சிந்திப்பதற்கு இது ஒரு நல்ல தருணம். உங்கள் முன்னோர்களின் சொத்து சம்பந்தமான பிரச்சினைகள் இருந்தால், இன்று அதற்கான ஒரு சுமுகமான தீர்வைக் காண முயற்சி செய்யலாம். சட்டப்பூர்வமான ஆலோசனைகளைப் பெற்று செயல்படுவது நல்ல பலனைத் தரும். உங்கள் வீட்டிற்குத் தேவையான புதிய பொருட்களை வாங்குவதற்கு அல்லது வீட்டை அழகுபடுத்துவதற்கு இன்று சிறந்த நாளாகும். பழைய உறவுகளை புதுப்பிக்க இன்று நல்லதொரு வாய்ப்பு அமையும். சமூக வலைத்தளங்கள் மூலம் பழைய நண்பர்களுடன் மீண்டும் இணைவீர்கள். உங்கள் ஆற்றலை ஆக்கப்பூர்வமான திசையில் பயன்படுத்துவது அவசியம். வீண் விவாதங்களில் ஈடுபடுவதைத் தவிர்த்து, உங்கள் கவனத்தை பயனுள்ள காரியங்களில் செலுத்துங்கள். உடற்பயிற்சி, யோகா போன்ற செயல்பாடுகளில் ஈடுபடுவது உங்கள் உடல் மற்றும் மன ஆரோக்கியத்திற்கு நன்மை பயக்கும். பழைய நண்பர்களைச் சந்திப்பதன் மூலம் புத்துணர்ச்சி பெறுவீர்கள். புதிய உறவுகளைத் தொடங்குவதற்கும், ஏற்கனவே உள்ள உறவுகளை பலப்படுத்துவதற்கும் இது ஒரு சிறப்பான நாளாகும். உங்கள் துணையுடன் இனிமையான தருணங்களை செலவிடுவீர்கள். காதல் உறவுகளில் புதிய அத்தியாயம் தொடங்கும். திருமணமானவர்களுக்கு கணவன் மனைவி இடையே அன்னியோன்னியம் அதிகரிக்கும். சிறு சிறு கருத்து வேறுபாடுகள் இருந்தாலும், அதனைப் பேசித் தீர்த்துக்கொண்டு ஒற்றுமையுடன் வாழ்வீர்கள். பிள்ளைகளின் எதிர்காலம் குறித்த விஷயங்களில் இன்று ஒரு நல்ல முடிவை எடுக்கலாம். குடும்பத்தில் சுபகாரியங்கள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். கலை மற்றும் கலாச்சாரத் துறைகளில் ஆர்வம் கொண்டவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் அமையலாம். உங்கள் படைப்பாற்றலை வெளிப்படுத்துவதற்கான தளங்கள் கிடைக்கும். மாணவர்கள் கல்வி தொடர்பான விஷயங்களில் அதிக கவனம் செலுத்தி, விடாமுயற்சியுடன் செயல்படுவார்கள். போட்டித் தேர்வுகளுக்குத் தயாராகும் மாணவர்களுக்கு இன்று நல்ல முன்னேற்றம் காண முடியும். பெரியவர்களின் ஆலோசனையைப் பெற்று செயல்படுவது மேலும் நன்மையை விளைவிக்கும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் மூலம் மன அமைதி பெறுவீர்கள். தர்ம காரியங்களில் ஈடுபடுவது மனநிறைவைத் தரும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் மகிழ்ச்சி தருவதோடு, புதிய அனுபவங்களையும் கற்றுத்தரும். உங்கள் விருப்ப தெய்வத்தை வணங்குவது மனதில் நிம்மதியைத் தரும். சமூக சேவை நடவடிக்கைகளில் ஈடுபட ஆர்வம் காட்டுவீர்கள். இதன் மூலம் மனநிறைவும், சமூக அங்கீகாரமும் கிடைக்கும். மொத்தத்தில், இன்று உங்களுக்கு சாதகமான நாளாக அமையும். உங்கள் துணிச்சலான அணுகுமுறையாலும், நேர்மறையான சிந்தனையாலும் எதிலும் வெற்றி பெறுவீர்கள். தடங்கல்கள் ஏற்பட்டாலும், அதனைத் தாண்டிச் செல்லும் மன உறுதி உங்களுக்கு உண்டு. உங்கள் இலக்குகளை நோக்கி உறுதியாகச் செயல்பட்டு, வெற்றியின் உச்சத்தை அடைவீர்கள். குடும்ப உறுப்பினர்களுடன் இணக்கமாகப் பழகுவதன் மூலம் மகிழ்ச்சி பெருகும். இன்று நீங்கள் மேற்கொள்ளும் முயற்சிகள் எதிர்காலத்தில் பெரிய வெற்றிகளுக்கு வழிவகுக்கும் என்பதில் சந்தேகமில்லை. தன்னம்பிக்கையுடன் செயல்படுங்கள், வெற்றி உங்களுக்கே. உங்கள் தனிப்பட்ட திறமைகளை வளர்த்துக்கொள்ள புதிய விஷயங்களைக் கற்கத் தொடங்குவதற்கு இது உகந்த நேரம். கற்றல் தொடர்பான முயற்சிகள் யாவும் வெற்றி பெறும். உங்கள் ஆரோக்கியத்தின் மீது கூடுதல் கவனம் செலுத்துவது எதிர்காலத்திற்கு நல்லது. புதிய தொழில் வாய்ப்புகள் தேடுபவர்களுக்கு இன்று நல்ல செய்திகள் காத்திருக்கின்றன. சவால்களை துணிவுடன் எதிர்கொண்டு, முன்னேற்றப் பாதையில் நடைபோடுங்கள்.",
    "prediction_en": "February 10, 2026, Tuesday. Today's strong influence of Mars will imbue Scorpio natives with immense courage, decisive actions, and an eagerness to undertake new ventures. By listening to and following your intuition, you can achieve unexpected successes. Opportunities will arise to bravely pursue long-planned endeavors today. You will face challenges not with fear, but by seeing them as opportunities. You will shed hesitation and firmly walk towards your goals. Remember that the brave decisions you make today will yield significant gains in the future. It is crucial not to lose your determination in any situation. Your honest intentions and firm actions will earn the trust of those around you. You will not hesitate to raise your voice against injustice and uphold righteousness, which will elevate your social standing and honor. During this period, your energy will be abundant, and it is essential to utilize it properly. New opportunities will emerge to showcase your talents. Your opinions will be valued in society. Leadership qualities will emerge. Your decisions will be welcomed both at home and in the workplace. You may observe positive movements in property-related matters. Favorable outcomes are likely in buying, selling, or repairing land. This is a good time to consider long-term investments. If there are any ancestral property issues, you can try to find an amicable solution today. Seeking legal advice will yield good results. Today is an excellent day to purchase new items for your home or to decorate it. Today also presents a good opportunity to rekindle old relationships. You will reconnect with old friends through social media. It is essential to channel your energy in a constructive direction. Avoid engaging in trivial arguments and focus your attention on productive tasks. Engaging in physical exercise, yoga, and similar activities will benefit your physical and mental health. Meeting old friends will bring rejuvenation. This is an excellent day to initiate new relationships and strengthen existing ones. You will spend pleasant moments with your partner. A new chapter will begin in romantic relationships. For married couples, intimacy will increase between spouses. Despite minor differences of opinion, you will resolve them through discussion and live in harmony. Children's future-related matters can be decided today. Discussions about auspicious events will take place within the family. Those interested in arts and culture may find excellent opportunities today. Platforms will be available to express your creativity. Students will focus more on their education and work diligently. Students preparing for competitive exams can see good progress today. Acting on the advice of elders will bring further benefits. Spiritual inclination will increase. You will find mental peace through temple visits or meditation. Engaging in charitable deeds will bring self-satisfaction. Any journeys you undertake today will bring joy and new experiences. Worshipping your chosen deity will bring peace of mind. You will show interest in engaging in social service activities, which will bring self-satisfaction and social recognition. Overall, today will be a favorable day for you. With your courageous approach and positive thinking, you will succeed in everything. Even if obstacles arise, you possess the mental strength to overcome them. You will firmly work towards your goals and reach the pinnacle of success. Happiness will increase by interacting harmoniously with family members. There is no doubt that the efforts you undertake today will lead to great successes in the future. Act with self-confidence, and success will be yours. This is a suitable time to start learning new things to develop your personal skills. All efforts related to learning will be successful. Paying extra attention to your health is good for the future. Good news awaits those seeking new career opportunities. Bravely face challenges and advance on the path of progress.",
    "career_ta": "இன்று உங்களின் துணிச்சலான அணுகுமுறை பணியிடத்தில் சிறப்பான வெற்றியைத் தேடித்தரும். புதிய திட்டங்களை முன்னெடுப்பதில் தயக்கம் காட்ட மாட்டீர்கள். சக ஊழியர்களிடம் உங்கள் தலைமைப் பண்புகள் வெளிப்படும். பணியிடத்தில் ஒரு புதிய பொறுப்பை ஏற்கும் வாய்ப்பு அமையலாம். வணிகர்களுக்கு புதிய ஒப்பந்தங்கள் ஏற்பட வாய்ப்புகள் உண்டு. சவாலான பணிகளை திறம்பட முடித்து, நற்பெயர் பெறுவீர்கள். அரசுத் துறையில் உள்ளவர்களுக்கு பதவி உயர்வுக்கான பேச்சுவார்த்தைகள் சாதகமாக இருக்கும். உங்கள் தொழில் திறனை மேம்படுத்திக்கொள்ள புதிய பயிற்சிகளில் ஈடுபடுவீர்கள். சுயதொழில் செய்பவர்களுக்கு இன்று வியாபாரம் பெருகும்.",
    "career_en": "Today, your courageous approach will bring excellent success in the workplace. You will not hesitate to take on new projects. Your leadership qualities will shine among colleagues. There may be an opportunity to take on a new responsibility at work. Business owners may find opportunities for new contracts. You will efficiently complete challenging tasks and earn a good reputation. For those in government sectors, promotion discussions will be favorable. You will engage in new training to enhance your professional skills. Self-employed individuals will see their business flourish today.",
    "finance_ta": "பொருளாதார ரீதியாக இன்று உங்களுக்கு நல்ல முன்னேற்றம் ஏற்படும். நீண்ட நாட்களாக எதிர்பார்த்திருந்த நிதி ஆதாயம் இன்று கிடைக்கப் பெறும். சொத்து சம்பந்தமான முதலீடுகளில் நல்ல பலன் கிடைக்கும். நிலம் வாங்குவது, விற்பது போன்ற விஷயங்களில் சாதகமான முடிவுகள் வரும். பழைய கடன்களை அடைப்பதற்கு நல்ல வாய்ப்புகள் அமையும். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதி நிலைமையை மேம்படுத்த புதிய வழிகளைக் கண்டுபிடிப்பீர்கள். ஒரு சிலருக்கு எதிர்பாராத பொருள் வரவு மனமகிழ்ச்சியைத் தரும்.",
    "finance_en": "Financially, you will experience good progress today. Long-awaited financial gains will be received today. Investments related to property will yield good returns. Favorable decisions will come in matters of buying and selling land. Good opportunities will arise to repay old debts. You will focus on savings plans. You will discover new ways to improve your family's financial situation. Unexpected financial inflow will bring joy to some.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் இன்று சிறப்பாக இருக்கும். மனதில் புதிய உற்சாகமும், ஆற்றலும் பெருகும். உடற்பயிற்சி, நடைபயிற்சி போன்றவற்றை மேற்கொள்வதன் மூலம் ஆரோக்கியத்தை மேலும் மேம்படுத்தலாம். மன அமைதிக்கு தியானம் செய்வது நன்மை பயக்கும். இன்று நீங்கள் உணவு விஷயத்தில் சரியான கவனம் செலுத்துவீர்கள். சிறுசிறு உடல் உபாதைகள் ஏற்பட்டாலும், விரைந்து குணமடைவீர்கள். புதிய விளையாட்டு நடவடிக்கைகளில் ஈடுபட ஆர்வம் காட்டுவீர்கள். நோயெதிர்ப்பு சக்தி அதிகரிக்கும்.",
    "health_en": "Your physical health will be excellent today. New enthusiasm and energy will flow in your mind. You can further improve your health by engaging in exercises like walking. Meditation will be beneficial for mental peace. Today, you will pay proper attention to your diet. Even if minor ailments occur, you will recover quickly. You will show interest in engaging in new sports activities. Your immunity will increase.",
    "lucky_number": "9",
    "lucky_color_ta": "ஊதா",
    "lucky_color_en": "Violet"
  },
  {
    "sign_ta": "தனுசு",
    "sign_en": "Sagittarius",
    "date": "10-02-2026",
    "prediction_ta": "பெப்ரவரி 10, 2026, செவ்வாய்க்கிழமை. இன்றைய செவ்வாயின் ஆதிக்கம் தனுசு ராசிக்காரர்களுக்கு புதிய சாகசங்களை மேற்கொள்ளவும், துணிச்சலான பயணங்களை மேற்கொள்ளவும் ஊக்கமளிக்கும். உங்கள் மனதில் உள்ள திட்டங்களை தைரியமாக முன்வைத்து, அவற்றை செயல்படுத்துவதில் வெற்றி காண்பீர்கள். உங்களின் தன்னம்பிக்கையும், விடாமுயற்சியும் இன்று நல்ல பலனைத் தரும். எந்தவொரு சவாலையும் எதிர்கொள்ளும் துணிவு உங்களுக்கு உண்டாகும். சமூகத்தில் உங்கள் கருத்துக்களுக்கு நல்ல மதிப்பு கிடைக்கும். தலைமைப் பொறுப்புகளை ஏற்கும் வாய்ப்புகள் அமையும். உங்கள் முடிவுகளுக்கு ஆதரவு கிடைக்கும். கடந்த கால அனுபவங்களில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவீர்கள். உங்கள் நேர்மையான அணுகுமுறையால் பிறரின் நம்பிக்கையைப் பெறுவீர்கள். இன்று சொத்து சம்பந்தமான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். நீண்ட நாட்களாக நிலுவையிலுள்ள சொத்து விவகாரங்கள் இன்று தீர்க்கப்படலாம். நிலம் வாங்குவது, விற்பது அல்லது புதிய வீடு கட்டுவது போன்ற காரியங்களில் நல்ல முன்னேற்றம் ஏற்படும். உங்கள் வீட்டிற்குத் தேவையான பொருட்களை வாங்குவதற்கும், பழுதுபார்ப்பதற்கும் இன்று சிறந்த நாளாகும். சட்டப்பூர்வமான ஆலோசனைகளைப் பெற்று செயல்படுவது மேலும் நன்மையை விளைவிக்கும். குடும்ப உறுப்பினர்களுடன் இணைந்து புதிய முதலீடுகள் குறித்து ஆலோசிக்கலாம். இன்று உங்கள் மனதில் ஒருவித தைரியமும், சுறுசுறுப்பும் குடிகொண்டிருக்கும். உங்கள் ஆற்றலை ஆக்கப்பூர்வமான வழிகளில் பயன்படுத்த வேண்டும். வீண் விவாதங்கள், வாக்குவாதங்களைத் தவிர்ப்பது நல்லது. கலை, இலக்கியம் மற்றும் ஆராய்ச்சித் துறைகளில் ஆர்வம் கொண்டவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் கிடைக்கும். உங்கள் படைப்பாற்றலை வெளிப்படுத்த நல்லதொரு தளம் அமையும். நண்பர்களுடன் இனிமையான பொழுதைச் செலவிடுவீர்கள். புதிய உறவுகளைத் தொடங்குவதற்கும், ஏற்கனவே உள்ள உறவுகளை வலுப்படுத்துவதற்கும் இன்று ஒரு நல்ல வாய்ப்பாகும். உங்கள் துணையுடன் நீங்கள் எதிர்பார்க்கும் அளவிற்கு நல்லுறவு அமையும். திருமணமானவர்களுக்கு கணவன் மனைவி இடையே அன்னியோன்னியம் அதிகரிக்கும். குழந்தைகளுடன் நேரம் செலவிடுவது மகிழ்ச்சியைத் தரும். மாணவர்களுக்கு இன்று கல்வி தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். போட்டித் தேர்வுகளுக்குத் தயாராகும் மாணவர்களுக்கு இன்று நல்ல முன்னேற்றம் காண முடியும். புதிய விஷயங்களைக் கற்க ஆர்வம் காட்டுவீர்கள். ஆசிரியர்களின் பாராட்டைப் பெறுவீர்கள். பெரியவர்களின் ஆலோசனையைப் பெற்று செயல்படுவது மேலும் நன்மையை விளைவிக்கும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் மூலம் மன அமைதி பெறுவீர்கள். தர்ம காரியங்களில் ஈடுபடுவது மனநிறைவைத் தரும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் மகிழ்ச்சி தருவதோடு, புதிய அனுபவங்களையும் கற்றுத்தரும். உங்கள் விருப்ப தெய்வத்தை வணங்குவது மனதில் நிம்மதியைத் தரும். சமூக சேவை நடவடிக்கைகளில் ஈடுபட ஆர்வம் காட்டுவீர்கள். இதன் மூலம் மனநிறைவும், சமூக அங்கீகாரமும் கிடைக்கும். மொத்தத்தில், இன்று தனுசு ராசிக்காரர்களுக்கு நல்ல முன்னேற்றம் தரக்கூடிய ஒரு நாளாக அமையும். தடங்கல்கள் ஏற்பட்டாலும், அதனைத் துணிவுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். குடும்ப உறவுகள் பலப்படும். இன்று நீங்கள் எடுக்கும் முடிவுகள் எதிர்காலத்திற்கு நன்மை பயக்கும். உங்கள் தனிப்பட்ட திறமைகளை வளர்த்துக்கொள்ள புதிய விஷயங்களைக் கற்கத் தொடங்குவதற்கு இது உகந்த நேரம். கற்றல் தொடர்பான முயற்சிகள் யாவும் வெற்றி பெறும். உங்கள் ஆரோக்கியத்தின் மீது கூடுதல் கவனம் செலுத்துவது எதிர்காலத்திற்கு நல்லது. புதிய தொழில் வாய்ப்புகள் தேடுபவர்களுக்கு இன்று நல்ல செய்திகள் காத்திருக்கின்றன. சவால்களை துணிவுடன் எதிர்கொண்டு, முன்னேற்றப் பாதையில் நடைபோடுங்கள். உங்கள் முயற்சிகளுக்கு இன்று நல்ல ஆதரவு கிடைக்கும்.",
    "prediction_en": "February 10, 2026, Tuesday. Today's strong influence of Mars will encourage Sagittarius natives to undertake new adventures and brave journeys. You will bravely present your plans and succeed in implementing them. Your self-confidence and perseverance will yield good results today. You will possess the courage to face any challenge. Your opinions will be well-regarded in society. Opportunities to take on leadership roles will arise. Your decisions will receive support. You will learn from past experiences and refine your future. Through your honest approach, you will gain the trust of others. Today, good progress will be made in property-related matters. Long-pending property issues may be resolved today. Good progress will be made in buying, selling land, or building a new house. Today is an excellent day to purchase items for your home and to undertake repairs. Seeking legal advice will bring further benefits. You can consult with family members about new investments. Today, a sense of courage and agility will reside in your mind. You must channel your energy in constructive ways. It is advisable to avoid trivial arguments and debates. Those interested in arts, literature, and research will find excellent opportunities today. A good platform will emerge to express your creativity. You will spend pleasant time with friends, which will bring rejuvenation. Today is a good opportunity to start new relationships and strengthen existing ones. You will enjoy a good relationship with your partner as expected. For married couples, intimacy will increase between spouses. Spending time with children will bring joy. Students will experience good progress in educational matters today. Students preparing for competitive exams can see good progress today. You will show interest in learning new things. You will receive praise from teachers. Acting on the advice of elders will bring further benefits. Spiritual inclination will increase. You will find mental peace through temple visits or meditation. Engaging in charitable deeds will bring self-satisfaction. Any journeys you undertake today will bring joy and new experiences. Worshipping your chosen deity will bring peace of mind. You will show interest in engaging in social service activities, which will bring self-satisfaction and social recognition. Overall, today will be a day of good progress for Sagittarius natives. Even if obstacles arise, you will face them bravely and succeed. Family relationships will strengthen. The decisions you make today will benefit your future. This is a suitable time to start learning new things to develop your personal skills. All efforts related to learning will be successful. Paying extra attention to your health is good for the future. Good news awaits those seeking new career opportunities. Bravely face challenges and advance on the path of progress. Your efforts will receive good support today.",
    "career_ta": "பணியிடத்தில் புதிய சவால்களை துணிவுடன் எதிர்கொள்வீர்கள். வெளிநாடு தொடர்பான வாய்ப்புகள் அமையும். உங்கள் தலைமைப் பண்புகள் வெளிப்படும். புதிய திட்டங்களை முன்னெடுத்து, அதில் வெற்றி பெறுவீர்கள். வணிகர்களுக்கு புதிய ஒப்பந்தங்கள் ஏற்பட்டு, ஆதாயம் பெருகும். சவாலான பணிகளை திறம்பட முடித்து, நற்பெயர் பெறுவீர்கள். அரசுத் துறையில் உள்ளவர்களுக்கு பதவி உயர்வுக்கான வாய்ப்புகள் பிரகாசமாக இருக்கும். சுயதொழில் செய்பவர்கள் இன்று தங்கள் வணிகத்தை விரிவாக்குவதற்கான துணிச்சலான முடிவுகளை எடுப்பார்கள். பயணங்கள் மூலம் புதிய வாய்ப்புகள் அமையும்.",
    "career_en": "You will bravely face new challenges in the workplace. Opportunities related to foreign travel will arise. Your leadership qualities will be evident. You will initiate new projects and succeed in them. Business owners will secure new contracts and increase profits. You will efficiently complete challenging tasks and earn a good reputation. Opportunities for promotion are bright for those in government sectors. Self-employed individuals will make courageous decisions to expand their business today. New opportunities will arise through travel.",
    "finance_ta": "நிதி நிலைமை இன்று வலுவாக இருக்கும். எதிர்பார்த்த நிதி ஆதாயங்கள் இன்று கிடைக்கும். நீண்டகால முதலீடுகளில் நல்ல பலன் கிடைக்கும். சொத்து சம்பந்தமான விஷயங்களில் ஆதாயம் உண்டு. நிலம் வாங்குவது, விற்பது அல்லது புதிய வீடு கட்டுவது போன்ற காரியங்களில் நல்ல முன்னேற்றம் ஏற்படும். பழைய கடன்களை அடைப்பதற்கு நல்ல வாய்ப்புகள் அமையும். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதி நிலைமையை மேம்படுத்த புதிய வழிகளைக் கண்டுபிடிப்பீர்கள். ஒரு சிலருக்கு வெளிநாட்டுப் பண வரவு மகிழ்ச்சியைத் தரும்.",
    "finance_en": "The financial situation will be strong today. Expected financial gains will be received today. Long-term investments will yield good returns. There will be gains in property-related matters. Good progress will be made in buying, selling land, or building a new house. Good opportunities will arise to repay old debts. You will focus on savings plans. You will discover new ways to improve your family's financial situation. For some, foreign income will bring joy.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் இன்று சிறப்பாக இருக்கும். மனதில் உற்சாகமும், புத்துணர்ச்சியும் பெருகும். உடற்பயிற்சி, நடைபயிற்சி போன்றவற்றை மேற்கொள்வதன் மூலம் ஆரோக்கியத்தை மேலும் மேம்படுத்தலாம். மன அமைதிக்கு தியானம் செய்வது நன்மை பயக்கும். இன்று நீங்கள் உணவு விஷயத்தில் சரியான கவனம் செலுத்துவீர்கள். நோயெதிர்ப்பு சக்தி அதிகரிக்கும். வெளிநடவடிக்கைகளில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி தரும். நீண்ட தூர பயணங்கள் சோர்வைத் தராது.",
    "health_en": "Your physical health will be excellent today. Enthusiasm and rejuvenation will fill your mind. You can further improve your health by engaging in exercises like walking. Meditation will be beneficial for mental peace. Today, you will pay proper attention to your diet. Your immunity will increase. Engaging in outdoor activities will refresh your mind. Long-distance travels will not cause fatigue.",
    "lucky_number": "3",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "மகரம்",
    "sign_en": "Capricorn",
    "date": "10-02-2026",
    "prediction_ta": "பெப்ரவரி 10, 2026, செவ்வாய்க்கிழமை. இன்றைய செவ்வாயின் ஆதிக்கம் மகர ராசிக்காரர்களுக்கு திட்டமிட்ட காரியங்களை நிறைவேற்றுவதில் கூடுதல் பலத்தையும், மன உறுதியையும் அளிக்கும். பொறுமையுடன் செயல்பட்டு, உங்கள் இலக்குகளை அடைவதில் வெற்றி காண்பீர்கள். உங்களின் கடின உழைப்பும், விடாமுயற்சியும் இன்று நல்ல பலனைத் தரும். மனதிலுள்ள குழப்பங்கள் நீங்கி தெளிவு பிறக்கும். எந்தவொரு சவாலையும் எதிர்கொள்ளும் துணிவு உங்களுக்கு உண்டாகும். இன்று நீங்கள் மேற்கொள்ளும் முயற்சிகள் அனைத்தும் வெற்றி பெறும் என்பதில் சந்தேகமில்லை. உங்கள் உள்மனதின் குரலுக்கு செவிமடுத்து செயல்படுவது உங்களுக்கு நன்மை பயக்கும். கடந்தகால அனுபவங்களில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செதுக்குவீர்கள். உங்கள் நேர்மையான அணுகுமுறையால் பிறரின் நம்பிக்கையைப் பெறுவீர்கள். சமூகத்தில் உங்கள் கருத்துக்களுக்கு மதிப்பு கூடும். தலைமைப் பண்புகள் வெளிப்படும். குடும்பத்தில் உங்கள் அறிவுரைகள் ஏற்றுக்கொள்ளப்படும். சகோதர உறவுகள் பலப்படும். சொத்து சம்பந்தமான விஷயங்களில் இன்று நேர்மறையான முடிவுகளைக் காணலாம். நிலம் வாங்குவது, விற்பது அல்லது பழைய சொத்துக்களை பழுதுபார்ப்பது போன்ற காரியங்களில் நல்ல முன்னேற்றம் ஏற்படும். நீண்டகாலமாக நிலுவையிலிருந்த சொத்து பிரச்சனைகளுக்குத் தீர்வு கிடைக்கும் வாய்ப்புகள் உண்டு. சட்டப்பூர்வமான விஷயங்களில் நிதானமாக செயல்படுவது நல்லது. உங்கள் வீட்டிற்குத் தேவையான பொருட்களை வாங்க அல்லது வீட்டிற்கு புதிய அலங்காரப் பொருட்கள் சேர்ப்பதற்கு இன்று சிறப்பான நாளாகும். உறவினர்களுடன் இணைந்து சுபகாரியங்களை பற்றிப் பேசலாம். இன்று உங்கள் மனதில் ஒருவித அமைதியும், தன்னம்பிக்கையும் குடிகொண்டிருக்கும். உங்கள் ஆற்றலை ஆக்கப்பூர்வமான வழிகளில் பயன்படுத்த வேண்டும். வீண் விவாதங்களில் ஈடுபடுவதைத் தவிர்த்து, உங்கள் கவனத்தை பயனுள்ள காரியங்களில் செலுத்துங்கள். கலை மற்றும் இசை போன்ற பொழுதுபோக்குகளில் ஈடுபடுவது மனதை ஒருமுகப்படுத்த உதவும். நண்பர்களுடன் இனிமையான பொழுதைச் செலவிடுவதன் மூலம் புத்துணர்ச்சி பெறுவீர்கள். புதிய உறவுகளைத் தொடங்குவதற்கும், ஏற்கனவே உள்ள உறவுகளை வலுப்படுத்துவதற்கும் இன்று ஒரு நல்ல வாய்ப்பாகும். உங்கள் துணையுடன் நீங்கள் எதிர்பார்க்கும் அளவிற்கு நல்லுறவு அமையும். திருமணமானவர்களுக்கு கணவன் மனைவி இடையே அன்பு அதிகரிக்கும். குழந்தைகளுடன் நேரம் செலவிடுவது மகிழ்ச்சியைத் தரும். மாணவர்களுக்கு இன்று கல்வி தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். ஆசிரியர்களின் பாராட்டைப் பெறுவீர்கள். புதிய விஷயங்களைக் கற்க ஆர்வம் காட்டுவீர்கள். போட்டித் தேர்வுகளுக்குத் தயாராகும் மாணவர்களுக்கு இன்று நல்ல முன்னேற்றம் காண முடியும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் மூலம் மன அமைதி பெறுவீர்கள். தர்ம காரியங்களில் ஈடுபடுவது மனநிறைவைத் தரும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் மகிழ்ச்சி தருவதோடு, புதிய அனுபவங்களையும் கற்றுத்தரும். இன்று உங்கள் தன்னம்பிக்கை அதிகரிக்கும். எந்த ஒரு புதிய காரியத்தையும் தொடங்க இது ஒரு நல்ல நாளாகும். உங்கள் திறமைகளை முழுமையாகப் பயன்படுத்தி, உங்கள் இலக்குகளை நோக்கி உறுதியாகச் செயல்படுவீர்கள். சமூகத்தில் நற்பெயர் கிடைக்கும். உங்கள் விடாமுயற்சியால் சிறப்பான பலன்களைப் பெறுவீர்கள். மொத்தத்தில், இன்று மகர ராசிக்காரர்களுக்கு நல்ல முன்னேற்றம் தரக்கூடிய ஒரு நாளாக அமையும். தடங்கல்கள் ஏற்பட்டாலும், அதனைத் துணிவுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். குடும்ப உறவுகள் பலப்படும். இன்று நீங்கள் எடுக்கும் முடிவுகள் எதிர்காலத்திற்கு நன்மை பயக்கும். உங்கள் தனிப்பட்ட திறமைகளை வளர்த்துக்கொள்ள புதிய விஷயங்களைக் கற்கத் தொடங்குவதற்கு இது உகந்த நேரம். கற்றல் தொடர்பான முயற்சிகள் யாவும் வெற்றி பெறும்.",
    "prediction_en": "February 10, 2026, Tuesday. Today's strong influence of Mars will grant Capricorn natives additional strength and determination to accomplish planned tasks. You will succeed in achieving your goals by acting patiently. Your hard work and perseverance will yield good results today. Mental confusion will clear, leading to clarity. You will possess the courage to face any challenge. There is no doubt that all your efforts today will succeed. Acting by listening to your inner voice will benefit you. You will learn from past experiences and shape your future. Through your honest approach, you will gain the trust of others. Your opinions will gain value in society. Leadership qualities will emerge. Your advice will be accepted in the family. Sibling relationships will strengthen. You may see positive outcomes in property-related matters today. Good progress will be made in buying, selling land, or repairing old properties. Opportunities may arise to resolve long-standing property issues. It is advisable to act calmly in legal matters. Today is an excellent day to purchase items for your home or to add new decorative elements. You can discuss auspicious events with relatives. Today, a sense of peace and self-confidence will prevail in your mind. You must channel your energy constructively. Avoid engaging in trivial arguments and focus your attention on productive tasks. Engaging in hobbies like art and music will help in mental concentration. Spending pleasant time with friends will bring rejuvenation. Today is a good opportunity to start new relationships and strengthen existing ones. You will enjoy a good relationship with your partner as expected. For married couples, love between spouses will increase. Spending time with children will bring joy. Students will experience good progress in educational matters today. You will receive praise from teachers. You will show interest in learning new things. Students preparing for competitive exams can see good progress today. Spiritual inclination will increase. You will find mental peace through temple visits or meditation. Engaging in charitable deeds will bring self-satisfaction. Any journeys you undertake today will bring joy and new experiences. Today, your self-confidence will increase. This is a good day to start any new endeavor. You will fully utilize your talents and firmly work towards your goals. You will gain a good reputation in society. Your perseverance will bring excellent results. Overall, today will be a day of good progress for Capricorn natives. Even if obstacles are encountered, you will face them bravely and succeed. Family relationships will strengthen. The decisions you make today will benefit your future. This is a suitable time to start learning new things to develop your personal skills. All efforts related to learning will be successful.",
    "career_ta": "பணியிடத்தில் உங்கள் கடின உழைப்பு அங்கீகரிக்கப்படும். புதிய பொறுப்புகளை ஏற்கும் வாய்ப்புகள் அமையும். சவாலான திட்டங்களை கையாளும் துணிச்சல் பிறக்கும். சக ஊழியர்களின் ஒத்துழைப்பு கிடைக்கும். வணிகத்தில் புதிய வாடிக்கையாளர்களை ஈர்ப்பீர்கள். நீண்டகாலமாக நிலுவையிலுள்ள ஒப்பந்தங்கள் இன்று கையெழுத்தாகலாம். அரசு ஊழியர்களுக்கு பதவி உயர்வு அல்லது இடமாற்றம் தொடர்பான நல்ல செய்திகள் வந்து சேரும். சுயதொழில் செய்பவர்கள் தங்கள் வணிகத்தை விரிவுபடுத்த சாதகமான வாய்ப்புகளைப் பெறுவார்கள். உங்கள் தொழில் திறனை மேம்படுத்திக்கொள்ள புதிய பயிற்சிகளில் ஈடுபடுவீர்கள்.",
    "career_en": "Your hard work will be recognized in the workplace. Opportunities to take on new responsibilities will arise. You will gain the courage to handle challenging projects. Cooperation from colleagues will be available. In business, you will attract new customers. Long-pending contracts may be signed today. Government employees will receive good news regarding promotions or transfers. Self-employed individuals will get favorable opportunities to expand their business. You will engage in new training to enhance your professional skills.",
    "finance_ta": "நிதி நிலைமை மேம்படும். எதிர்பார்த்த நிதி ஆதாயங்கள் இன்று கிடைக்கும். சேமிப்பு மற்றும் முதலீடுகளில் நல்ல முடிவுகளை எடுப்பீர்கள். நீண்டகாலமாக நிலுவையிலுள்ள கடன்களை அடைப்பதற்கான வழிகள் பிறக்கும். சொத்து சம்பந்தமான விஷயங்களில் ஆதாயம் உண்டு. வாரிசு சொத்து தொடர்பான பிரச்சனைகள் சுமுகமாக தீர்க்கப்படும். உங்கள் குடும்பத்தின் நிதி நிலைமையை வலுப்படுத்த திட்டமிடுவீர்கள். திடீர் பண வரவுகள் மகிழ்ச்சியைத் தரும். கடன் கொடுத்தவர்கள் பணத்தை வசூலிப்பதில் வெற்றி பெறுவார்கள்.",
    "finance_en": "The financial situation will improve. Expected financial gains will be received today. You will make good decisions regarding savings and investments. Ways to repay long-pending debts will emerge. There will be gains in property-related matters. Heirloom property issues will be resolved amicably. You will plan to strengthen your family's financial situation. Sudden inflows of cash will bring joy. Lenders will succeed in collecting money.",
    "health_ta": "உங்கள் ஆரோக்கியம் இன்று ஸ்திரமாக இருக்கும். மனஅழுத்தம் குறைந்து மன அமைதி நிலவும். உடற்பயிற்சி மற்றும் யோகா போன்றவற்றை தொடர்ந்து செய்வதன் மூலம் உடல் நலத்தை பாதுகாக்கலாம். சுறுசுறுப்புடன் செயல்படுவீர்கள். சரியான உணவுப் பழக்கங்களை கடைபிடிப்பது அவசியம். சிறிய அளவிலான உடற்பயிற்சிகளை மேற்கொள்வது அன்றாட ஆற்றலை அதிகரிக்கும். நோயெதிர்ப்பு சக்தி வலுப்பெறும். போதுமான ஓய்வு எடுப்பது முக்கியம்.",
    "health_en": "Your health will be stable today. Mental stress will reduce, and peace of mind will prevail. You can maintain your health by continuously practicing exercise and yoga. You will act with agility. Adhering to proper eating habits is essential. Engaging in minor physical exercises will increase daily energy. Your immunity will strengthen. Taking adequate rest is important.",
    "lucky_number": "8",
    "lucky_color_ta": "கருப்பு",
    "lucky_color_en": "Black"
  },
  {
    "sign_ta": "கும்பம்",
    "sign_en": "Aquarius",
    "date": "10-02-2026",
    "prediction_ta": "பெப்ரவரி 10, 2026, செவ்வாய்க்கிழமை. இன்றைய செவ்வாயின் ஆதிக்கம் கும்ப ராசிக்காரர்களுக்கு புதிய யோசனைகளை செயல்படுத்தவும், சவால்களை துணிவுடன் எதிர்கொள்ளவும் ஊக்கமளிக்கும். உங்கள் மனதில் உள்ள திட்டங்களை வெளிப்படையாகப் பேசவும், அவற்றை செயல்படுத்துவதற்கான நடவடிக்கைகளை மேற்கொள்ளவும் இன்று சிறந்த நாளாகும். உங்களின் தொடர்புத் திறன் இன்று சிறப்பாக செயல்படும். குடும்பத்தினர் மற்றும் நண்பர்களுடன் சுமுகமான உறவைப் பேணுவீர்கள். எந்த ஒரு சூழ்நிலையிலும் மனதை தளரவிடாமல், தன்னம்பிக்கையுடன் செயல்படுவீர்கள். ஒரு சில புதிய வாய்ப்புகள் தேடி வரும். அதனை சரியாகப் பயன்படுத்திக் கொள்வது உங்கள் பொறுப்பு. நேர்மறையான சிந்தனையுடன் செயல்பட்டால், எதிர்பார்த்த வெற்றியை விட மேலான பலனைப் பெறுவீர்கள். கடந்த கால தவறுகளில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவீர்கள். சமூகத்தில் உங்களது பேச்சுக்கு மரியாதை கிடைக்கும். தலைமைப் பொறுப்புகளை ஏற்கும் வாய்ப்புகள் அமையும். உங்கள் முடிவுகளுக்கு ஆதரவு கிடைக்கும். இன்று சொத்து சம்பந்தமான விஷயங்களில் சாதகமான முடிவுகள் கிடைக்கும். நீண்ட நாட்களாக நிலுவையிலுள்ள சொத்து விவகாரங்கள் இன்று தீர்க்கப்படலாம். நிலம் வாங்குவது, விற்பது அல்லது புதிய வீடு கட்டுவது போன்ற காரியங்களில் நல்ல முன்னேற்றம் ஏற்படும். உங்கள் வீட்டிற்குத் தேவையான பொருட்களை வாங்குவதற்கும், பழுதுபார்ப்பதற்கும் இன்று சிறந்த நாளாகும். சட்டப்பூர்வமான ஆலோசனைகளைப் பெற்று செயல்படுவது மேலும் நன்மையை விளைவிக்கும். குடும்ப உறுப்பினர்களுடன் இணைந்து புதிய முதலீடுகள் குறித்து ஆலோசிக்கலாம். இன்று உங்கள் மனதினில் ஒருவித தைரியமும், சுறுசுறுப்பும் குடிகொண்டிருக்கும். உங்கள் ஆற்றலை சரியான வழியில் பயன்படுத்த வேண்டும். வீண் விவாதங்கள், வாக்குவாதங்களைத் தவிர்ப்பது நல்லது. கலை, இலக்கியம் மற்றும் அறிவியல் துறைகளில் ஆர்வம் கொண்டவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் கிடைக்கும். உங்கள் படைப்பாற்றலை வெளிப்படுத்த நல்லதொரு தளம் அமையும். நண்பர்களுடன் இனிமையான பொழுதைச் செலவிடுவீர்கள். புதிய உறவுகளைத் தொடங்குவதற்கும், ஏற்கனவே உள்ள உறவுகளை வலுப்படுத்துவதற்கும் இன்று ஒரு நல்ல வாய்ப்பாகும். உங்கள் துணையுடன் நீங்கள் எதிர்பார்க்கும் அளவிற்கு நல்லுறவு அமையும். திருமணமானவர்களுக்கு கணவன் மனைவி இடையே அன்னியோன்னியம் அதிகரிக்கும். குழந்தைகளுடன் நேரம் செலவிடுவது மகிழ்ச்சியைத் தரும். மாணவர்களுக்கு இன்று கல்வி தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். போட்டித் தேர்வுகளுக்குத் தயாராகும் மாணவர்களுக்கு இன்று நல்ல முன்னேற்றம் காண முடியும். புதிய விஷயங்களைக் கற்க ஆர்வம் காட்டுவீர்கள். ஆசிரியர்களின் பாராட்டைப் பெறுவீர்கள். பெரியவர்களின் ஆலோசனையைப் பெற்று செயல்படுவது மேலும் நன்மையை விளைவிக்கும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் மூலம் மன அமைதி பெறுவீர்கள். தர்ம காரியங்களில் ஈடுபடுவது மனநிறைவைத் தரும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் மகிழ்ச்சி தருவதோடு, புதிய அனுபவங்களையும் கற்றுத்தரும். உங்கள் விருப்ப தெய்வத்தை வணங்குவது மனதில் நிம்மதியைத் தரும். சமூக சேவை நடவடிக்கைகளில் ஈடுபட ஆர்வம் காட்டுவீர்கள். இதன் மூலம் மனநிறைவும், சமூக அங்கீகாரமும் கிடைக்கும். மொத்தத்தில், இன்று கும்ப ராசிக்காரர்களுக்கு நல்ல முன்னேற்றம் தரக்கூடிய ஒரு நாளாக அமையும். தடங்கல்கள் ஏற்பட்டாலும், அதனைத் துணிவுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். குடும்ப உறவுகள் பலப்படும். இன்று நீங்கள் எடுக்கும் முடிவுகள் எதிர்காலத்திற்கு நன்மை பயக்கும். உங்கள் தனிப்பட்ட திறமைகளை வளர்த்துக்கொள்ள புதிய விஷயங்களைக் கற்கத் தொடங்குவதற்கு இது உகந்த நேரம். கற்றல் தொடர்பான முயற்சிகள் யாவும் வெற்றி பெறும்.",
    "prediction_en": "February 10, 2026, Tuesday. Today's strong influence of Mars will encourage Aquarius natives to implement new ideas and bravely face challenges. Today is an excellent day to openly discuss your plans and take steps to implement them. Your communication skills will be excellent today. You will maintain harmonious relationships with family and friends. You will act with self-confidence in any situation, without letting your spirits dampen. Some new opportunities will come your way. It is your responsibility to utilize them properly. If you act with positive thinking, you will achieve results greater than expected. You will learn from past mistakes and refine your future. Your words will be respected in society. Opportunities to take on leadership roles will arise. Your decisions will receive support. Today, favorable outcomes will be seen in property-related matters. Long-pending property issues may be resolved today. Good progress will be made in buying, selling land, or building a new house. Today is an excellent day to purchase items for your home and to undertake repairs. Seeking legal advice will bring further benefits. You can consult with family members about new investments. Today, a sense of courage and agility will reside in your mind. You must channel your energy in the right direction. It is advisable to avoid trivial arguments and debates. Those interested in arts, literature, and science will find excellent opportunities today. A good platform will emerge to express your creativity. You will spend pleasant time with friends. Today is a good opportunity to start new relationships and strengthen existing ones. You will enjoy a good relationship with your partner as expected. For married couples, intimacy will increase between spouses. Spending time with children will bring joy. Students will experience good progress in educational matters today. Students preparing for competitive exams can see good progress today. You will show interest in learning new things. You will receive praise from teachers. Acting on the advice of elders will bring further benefits. Spiritual inclination will increase. You will find mental peace through temple visits or meditation. Engaging in charitable deeds will bring self-satisfaction. Any journeys you undertake today will bring joy and new experiences. Worshipping your chosen deity will bring peace of mind. You will show interest in engaging in social service activities, which will bring self-satisfaction and social recognition. Overall, today will be a day of good progress for Aquarius natives. Even if obstacles arise, you will face them bravely and succeed. Family relationships will strengthen. The decisions you make today will benefit your future. This is a suitable time to start learning new things to develop your personal skills. All efforts related to learning will be successful.",
    "career_ta": "பணியிடத்தில் உங்கள் புதிய சிந்தனைகளுக்கு வரவேற்பு கிடைக்கும். குழுப்பணிகளில் உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். சவாலான பணிகளை துணிவுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். புதிய தொழில் வாய்ப்புகள் தேடி வரும். சமூக ஊடகங்கள் மற்றும் தொழில்நுட்பத் துறையில் உள்ளவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் அமையும். அரசுத் துறையில் உள்ளவர்களுக்கு புதிய பொறுப்புகள் அமையலாம். சுயதொழில் செய்பவர்கள் இன்று தங்கள் வணிகத்தை விரிவாக்குவதற்கான திட்டங்களில் வெற்றி பெறுவார்கள்.",
    "career_en": "Your new ideas will be welcomed in the workplace. Your contribution will be important in teamwork. You will bravely face challenging tasks and succeed. New career opportunities will come your way. Those in social media and technology sectors will find excellent opportunities today. Government employees may take on new responsibilities. Self-employed individuals will succeed in their plans to expand their business today.",
    "finance_ta": "நிதி நிலைமை இன்று சாதகமாக இருக்கும். எதிர்பார்த்த பண வரவுகள் கிடைக்கும். புத்திசாலித்தனமான முதலீடுகளை மேற்கொள்வீர்கள். பழைய கடன்களை அடைப்பதற்கான வழிகள் பிறக்கும். சொத்து சம்பந்தமான விஷயங்களில் நல்ல முடிவுகளை எடுப்பீர்கள். குறிப்பாக, புதிய சொத்து வாங்குவதற்கு இன்று நல்ல நாளாகும். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். சமூக நலத் திட்டங்களில் நிதி முதலீடு செய்ய ஆர்வம் காட்டுவீர்கள். எதிர்பாராத பண வரவுகள் மனமகிழ்ச்சியைத் தரும்.",
    "finance_en": "The financial situation will be favorable today. Expected financial inflows will be received. You will make smart investments. Ways to repay old debts will emerge. You will make good decisions in property-related matters. Especially, today is a good day to buy new property. You will focus on savings plans. You will show interest in investing in social welfare schemes. Unexpected financial inflows will bring joy.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் இன்று நன்றாக இருக்கும். மனது லேசாகவும், உற்சாகமாகவும் இருக்கும். சுவாசப் பயிற்சி, நடைபயிற்சி போன்றவற்றை மேற்கொள்வது நன்மை பயக்கும். மனதை ஒருமுகப்படுத்த தியானம் செய்யலாம். நல்ல உணவுப் பழக்கவழக்கங்களை கடைபிடிப்பது அவசியம். புதிய உற்சாகத்துடன் செயல்படுவீர்கள். சமூக செயல்பாடுகளில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி தரும். நோயெதிர்ப்பு சக்தி வலுப்பெறும்.",
    "health_en": "Your physical health will be good today. Your mind will be light and enthusiastic. Practicing breathing exercises and walking will be beneficial. You can meditate to focus your mind. Adhering to good eating habits is essential. You will act with new enthusiasm. Engaging in social activities will refresh your mind. Your immunity will strengthen.",
    "lucky_number": "4",
    "lucky_color_ta": "இளநீலம்",
    "lucky_color_en": "Light Blue"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "10-02-2026",
    "prediction_ta": "பெப்ரவரி 10, 2026, செவ்வாய்க்கிழமை. இன்றைய செவ்வாயின் ஆதிக்கம் மீன ராசிக்காரர்களுக்கு ஆன்மீகத்திலும், சமூக சேவையிலும் ஈடுபட ஊக்கமளிக்கும். உங்கள் உள்ளுணர்வின் குரலுக்கு செவிமடுத்து, அதனைப் பின்பற்றுவதன் மூலம் எதிர்பாராத வெற்றிகளை ஈட்ட முடியும். நீண்ட நாட்களாகத் திட்டமிட்டிருந்த காரியங்களை இன்று துணிவுடன் முன்னெடுத்துச் செல்லும் வாய்ப்புகள் அமையும். சவால்களைக் கண்டு அஞ்சாமல், அவற்றை ஒரு வாய்ப்பாகக் கருதி செயல்படுவீர்கள். மனதிலுள்ள தயக்கங்களை நீக்கி, உங்கள் இலக்குகளை நோக்கி உறுதியாக நடைபோடுவீர்கள். இன்று நீங்கள் எடுக்கும் துணிச்சலான முடிவுகள் எதிர்காலத்தில் பெரும் ஆதாயங்களைத் தரும் என்பதை நினைவில் கொள்ளுங்கள். எந்தவொரு சூழ்நிலையிலும் உங்கள் மன உறுதியை இழக்காமல் இருப்பது மிக முக்கியம். நீங்கள் வெளிப்படுத்தும் நேர்மையான எண்ணங்களும், உறுதியான செயல்பாடுகளும் உங்களைச் சுற்றியுள்ளோரின் நம்பிக்கையை ஈர்க்கும். அநீதிக்கு எதிராகக் குரல் கொடுக்கவும், தர்மத்தை நிலைநாட்டவும் நீங்கள் தயங்க மாட்டீர்கள். இது உங்கள் சமூக மதிப்பையும், கௌரவத்தையும் உயர்த்தும். இக்காலகட்டத்தில் ஆற்றல் பெருகி காணப்படும், அதை சரியாக பயன்படுத்திக்கொள்வது அவசியம். உங்கள் திறமைகளை வெளிக்கொணர புதிய வாய்ப்புகள் கிடைக்கும். சமூகத்தில் உங்கள் கருத்துக்களுக்கு மதிப்பு கிடைக்கும். தலைமைப் பண்புகள் வெளிப்படும். குடும்பத்திலும், பணியிடத்திலும் உங்கள் முடிவுகள் வரவேற்கப்படும். சொத்து சம்பந்தமான விஷயங்களில் நேர்மறையான நகர்வுகளைக் காணலாம். நிலம் வாங்குவது, விற்பது அல்லது பழுதுபார்ப்பது போன்ற காரியங்களில் சாதகமான முடிவுகள் கிடைக்கும். நீண்டகால முதலீடுகள் குறித்து சிந்திப்பதற்கு இது ஒரு நல்ல தருணம். உங்கள் முன்னோர்களின் சொத்து சம்பந்தமான பிரச்சினைகள் இருந்தால், இன்று அதற்கான ஒரு சுமுகமான தீர்வைக் காண முயற்சி செய்யலாம். சட்டப்பூர்வமான ஆலோசனைகளைப் பெற்று செயல்படுவது நல்ல பலனைத் தரும். உங்கள் வீட்டிற்குத் தேவையான புதிய பொருட்களை வாங்குவதற்கு அல்லது வீட்டை அழகுபடுத்துவதற்கு இன்று சிறந்த நாளாகும். பழைய உறவுகளை புதுப்பிக்க இன்று நல்லதொரு வாய்ப்பு அமையும். சமூக வலைத்தளங்கள் மூலம் பழைய நண்பர்களுடன் மீண்டும் இணைவீர்கள். உங்கள் ஆற்றலை ஆக்கப்பூர்வமான திசையில் பயன்படுத்துவது அவசியம். வீண் விவாதங்களில் ஈடுபடுவதைத் தவிர்த்து, உங்கள் கவனத்தை பயனுள்ள காரியங்களில் செலுத்துங்கள். உடற்பயிற்சி, யோகா போன்ற செயல்பாடுகளில் ஈடுபடுவது உங்கள் உடல் மற்றும் மன ஆரோக்கியத்திற்கு நன்மை பயக்கும். பழைய நண்பர்களைச் சந்திப்பதன் மூலம் புத்துணர்ச்சி பெறுவீர்கள். புதிய உறவுகளைத் தொடங்குவதற்கும், ஏற்கனவே உள்ள உறவுகளை பலப்படுத்துவதற்கும் இது ஒரு சிறப்பான நாளாகும். உங்கள் துணையுடன் இனிமையான தருணங்களை செலவிடுவீர்கள். காதல் உறவுகளில் புதிய அத்தியாயம் தொடங்கும். திருமணமானவர்களுக்கு கணவன் மனைவி இடையே அன்னியோன்னியம் அதிகரிக்கும். சிறு சிறு கருத்து வேறுபாடுகள் இருந்தாலும், அதனைப் பேசித் தீர்த்துக்கொண்டு ஒற்றுமையுடன் வாழ்வீர்கள். பிள்ளைகளின் எதிர்காலம் குறித்த விஷயங்களில் இன்று ஒரு நல்ல முடிவை எடுக்கலாம். குடும்பத்தில் சுபகாரியங்கள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். கலை மற்றும் கலாச்சாரத் துறைகளில் ஆர்வம் கொண்டவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் அமையலாம். உங்கள் படைப்பாற்றலை வெளிப்படுத்துவதற்கான தளங்கள் கிடைக்கும். மாணவர்கள் கல்வி தொடர்பான விஷயங்களில் அதிக கவனம் செலுத்தி, விடாமுயற்சியுடன் செயல்படுவார்கள். போட்டித் தேர்வுகளுக்குத் தயாராகும் மாணவர்களுக்கு இன்று நல்ல முன்னேற்றம் காண முடியும். பெரியவர்களின் ஆலோசனையைப் பெற்று செயல்படுவது மேலும் நன்மையை விளைவிக்கும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் அல்லது தியானம் மூலம் மன அமைதி பெறுவீர்கள். தர்ம காரியங்களில் ஈடுபடுவது மனநிறைவைத் தரும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் மகிழ்ச்சி தருவதோடு, புதிய அனுபவங்களையும் கற்றுத்தரும். உங்கள் விருப்ப தெய்வத்தை வணங்குவது மனதில் நிம்மதியைத் தரும். சமூக சேவை நடவடிக்கைகளில் ஈடுபட ஆர்வம் காட்டுவீர்கள். இதன் மூலம் மனநிறைவும், சமூக அங்கீகாரமும் கிடைக்கும். மொத்தத்தில், இன்று உங்களுக்கு சாதகமான நாளாக அமையும். உங்கள் துணிச்சலான அணுகுமுறையாலும், நேர்மறையான சிந்தனையாலும் எதிலும் வெற்றி பெறுவீர்கள். தடங்கல்கள் ஏற்பட்டாலும், அதனைத் தாண்டிச் செல்லும் மன உறுதி உங்களுக்கு உண்டு. உங்கள் இலக்குகளை நோக்கி உறுதியாகச் செயல்பட்டு, வெற்றியின் உச்சத்தை அடைவீர்கள். குடும்ப உறுப்பினர்களுடன் இணக்கமாகப் பழகுவதன் மூலம் மகிழ்ச்சி பெருகும். இன்று நீங்கள் மேற்கொள்ளும் முயற்சிகள் எதிர்காலத்தில் பெரிய வெற்றிகளுக்கு வழிவகுக்கும் என்பதில் சந்தேகமில்லை. தன்னம்பிக்கையுடன் செயல்படுங்கள், வெற்றி உங்களுக்கே. உங்கள் தனிப்பட்ட திறமைகளை வளர்த்துக்கொள்ள புதிய விஷயங்களைக் கற்கத் தொடங்குவதற்கு இது உகந்த நேரம். கற்றல் தொடர்பான முயற்சிகள் யாவும் வெற்றி பெறும். உங்கள் ஆரோக்கியத்தின் மீது கூடுதல் கவனம் செலுத்துவது எதிர்காலத்திற்கு நல்லது. புதிய தொழில் வாய்ப்புகள் தேடுபவர்களுக்கு இன்று நல்ல செய்திகள் காத்திருக்கின்றன. சவால்களை துணிவுடன் எதிர்கொண்டு, முன்னேற்றப் பாதையில் நடைபோடுங்கள்.",
    "prediction_en": "February 10, 2026, Tuesday. Today's strong influence of Mars will inspire Pisces natives to engage in spirituality and social service. By listening to and following your intuition, you can achieve unexpected successes. Opportunities will arise to bravely pursue long-planned endeavors today. You will face challenges not with fear, but by seeing them as opportunities. You will shed hesitation and firmly walk towards your goals. Remember that the brave decisions you make today will yield significant gains in the future. It is crucial not to lose your determination in any situation. Your honest intentions and firm actions will earn the trust of those around you. You will not hesitate to raise your voice against injustice and uphold righteousness, which will elevate your social standing and honor. During this period, your energy will be abundant, and it is essential to utilize it properly. New opportunities will emerge to showcase your talents. Your opinions will be valued in society. Leadership qualities will emerge. Your decisions will be welcomed both at home and in the workplace. You may observe positive movements in property-related matters. Favorable outcomes are likely in buying, selling, or repairing land. This is a good time to consider long-term investments. If there are any ancestral property issues, you can try to find an amicable solution today. Seeking legal advice will yield good results. Today is an excellent day to purchase new items for your home or to decorate it. Today also presents a good opportunity to rekindle old relationships. You will reconnect with old friends through social media. It is essential to channel your energy in a constructive direction. Avoid engaging in trivial arguments and focus your attention on productive tasks. Engaging in physical exercise, yoga, and similar activities will benefit your physical and mental health. Meeting old friends will bring rejuvenation. This is an excellent day to initiate new relationships and strengthen existing ones. You will spend pleasant moments with your partner. A new chapter will begin in romantic relationships. For married couples, intimacy will increase between spouses. Despite minor differences of opinion, you will resolve them through discussion and live in harmony. Children's future-related matters can be decided today. Discussions about auspicious events will take place within the family. Those interested in arts and culture may find excellent opportunities today. Platforms will be available to express your creativity. Students will focus more on their education and work diligently. Students preparing for competitive exams can see good progress today. Acting on the advice of elders will bring further benefits. Spiritual inclination will increase. You will find mental peace through temple visits or meditation. Engaging in charitable deeds will bring self-satisfaction. Any journeys you undertake today will bring joy and new experiences. Worshipping your chosen deity will bring peace of mind. You will show interest in engaging in social service activities, which will bring self-satisfaction and social recognition. Overall, today will be a favorable day for you. With your courageous approach and positive thinking, you will succeed in everything. Even if obstacles arise, you possess the mental strength to overcome them. You will firmly work towards your goals and reach the pinnacle of success. Happiness will increase by interacting harmoniously with family members. There is no doubt that the efforts you undertake today will lead to great successes in the future. Act with self-confidence, and success will be yours. This is a suitable time to start learning new things to develop your personal skills. All efforts related to learning will be successful. Paying extra attention to your health is good for the future. Good news awaits those seeking new career opportunities. Bravely face challenges and advance on the path of progress.",
    "career_ta": "பணியிடத்தில் உங்கள் உள்மனதின் குரலுக்கு செவிமடுத்து செயல்படுவீர்கள். சமூக சேவை சார்ந்த பணிகளில் சிறந்து விளங்குவீர்கள். புதிய திட்டங்களை முன்னெடுப்பதில் துணிச்சல் பிறக்கும். சக ஊழியர்களின் ஒத்துழைப்பு கிடைக்கும். வணிகர்களுக்கு புதிய சமூக பொறுப்புணர்வு திட்டங்கள் மூலம் நல்ல லாபம் கிடைக்கும். சவாலான பணிகளை திறம்பட முடித்து, நற்பெயர் பெறுவீர்கள். அரசுத் துறையில் உள்ளவர்களுக்கு பதவி உயர்வுக்கான வாய்ப்புகள் பிரகாசமாக இருக்கும். சுயதொழில் செய்பவர்கள் தங்கள் வணிகத்தை விரிவாக்குவதற்கான துணிச்சலான முடிவுகளை எடுப்பார்கள்.",
    "career_en": "You will act by listening to your inner voice in the workplace. You will excel in social service-related tasks. You will gain courage to initiate new projects. Cooperation from colleagues will be available. Business owners will gain good profits through new social responsibility projects. You will efficiently complete challenging tasks and earn a good reputation. Opportunities for promotion are bright for those in government sectors. Self-employed individuals will make courageous decisions to expand their business today.",
    "finance_ta": "பொருளாதார ரீதியாக இன்று உங்களுக்கு நல்ல முன்னேற்றம் ஏற்படும். நீண்ட நாட்களாக எதிர்பார்த்திருந்த நிதி ஆதாயம் இன்று கிடைக்கப் பெறும். சொத்து சம்பந்தமான முதலீடுகளில் நல்ல பலன் கிடைக்கும். நிலம் வாங்குவது, விற்பது போன்ற விஷயங்களில் சாதகமான முடிவுகள் வரும். பழைய கடன்களை அடைப்பதற்கு நல்ல வாய்ப்புகள் அமையும். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதி நிலைமையை மேம்படுத்த புதிய வழிகளைக் கண்டுபிடிப்பீர்கள். ஒரு சிலருக்கு ஆன்மீக ரீதியான செலவுகள் இருந்தாலும், அது மனநிறைவைத் தரும்.",
    "finance_en": "Financially, you will experience good progress today. Long-awaited financial gains will be received today. Investments related to property will yield good returns. Favorable decisions will come in matters of buying and selling land. Good opportunities will arise to repay old debts. You will focus on savings plans. You will discover new ways to improve your family's financial situation. While some may incur spiritual expenses, it will bring self-satisfaction.",
    "health_ta": "உங்கள் உடல் ஆரோக்கியம் இன்று சிறப்பாக இருக்கும். மனதில் புதிய உற்சாகமும், ஆற்றலும் பெருகும். உடற்பயிற்சி, நடைபயிற்சி போன்றவற்றை மேற்கொள்வதன் மூலம் ஆரோக்கியத்தை மேலும் மேம்படுத்தலாம். மன அமைதிக்கு தியானம் செய்வது நன்மை பயக்கும். இன்று நீங்கள் உணவு விஷயத்தில் சரியான கவனம் செலுத்துவீர்கள். சிறுசிறு உடல் உபாதைகள் ஏற்பட்டாலும், விரைந்து குணமடைவீர்கள். புதிய விளையாட்டு நடவடிக்கைகளில் ஈடுபட ஆர்வம் காட்டுவீர்கள். நோயெதிர்ப்பு சக்தி அதிகரிக்கும். ஆன்மீக நாட்டம் மனதிற்கு அமைதி தரும்.",
    "health_en": "Your physical health will be excellent today. New enthusiasm and energy will flow in your mind. You can further improve your health by engaging in exercises like walking. Meditation will be beneficial for mental peace. Today, you will pay proper attention to your diet. Even if minor ailments occur, you will recover quickly. You will show interest in engaging in new sports activities. Your immunity will increase. Spiritual inclination will bring peace to your mind.",
    "lucky_number": "7",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  }
]
