[
  {
    "sign_ta": "மேஷம்",
    "sign_en": "Aries",
    "date": "24-02-2026",
    "prediction_ta": "இன்று செவ்வாய்க்கிழமை என்பதால், மேஷ ராசிக்காரர்களே, செவ்வாய் கோளின் செல்வாக்கு உங்கள் ராசிக்கு ஒரு சிறப்பான ஆற்றலையும், புதிய ஊக்கத்தையும் அளிக்கப்போகிறது. உங்கள் மன உறுதி அதிகரிக்கும். எந்த ஒரு செயலிலும் முன்னின்று செயல்படும் தைரியம் உங்களுக்கு இயல்பாகவே உண்டாகும். நீண்ட நாட்களாக மனதில் போட்டு குடைந்து கொண்டிருந்த சில குறிப்பான முடிவுகளை இன்று நீங்கள் துணிச்சலுடன் எடுப்பீர்கள். இதன் மூலம் உங்கள் வாழ்வில் ஒரு புதிய கட்டம் ஆரம்பிக்கும். உங்கள் உள்ளுணர்வு இன்று மிகச் சரியாக வழிகாட்டும் என்பதால், அதனை நம்பி நீங்கள் முன்னேறலாம். சவால்களைக் கண்டு அஞ்சாமல், அவற்றை வெற்றிக்கான படிகளாக மாற்றுவீர்கள். கடந்த கால தடைகள் அனைத்தும் இன்று உங்களது உறுதியான செயல்பாடுகளால் தகர்க்கப்படும். உங்களது தனிப்பட்ட வளர்ச்சிக்கு இது ஒரு அருமையான நாள். புதிய திறன்களைக் கற்றுக்கொள்வதற்கும், ஏற்கனவே உள்ள திறன்களை மெருகூட்டுவதற்கும் திட்டமிடலாம். ஆக்கபூர்வமான சிந்தனைகள் உங்கள் மனதில் தோன்றும். அவற்றை உடனடியாக செயல்படுத்தத் தொடங்குவது நல்லது. எந்த ஒரு வேலையிலும் ஒருவித வேகத்தையும், உறுதியையும் காண முடியும். உங்களுடைய கடின உழைப்பும், முழு ஈடுபாடும் இன்று நல்ல பலன்களைத் தரும். தேவையற்ற வாக்குவாதங்களைத் தவிர்த்து, அமைதியுடன் செயல்பட்டால், சூழ்நிலைகளை உங்களுக்கு நன்மை பயக்கும் விதமாக மாற்றிக்கொள்ள முடியும். உடல் ரீதியாகவும், மன ரீதியாகவும் நீங்கள் இன்று மிகவும் வலிமையுடன் உணர்வீர்கள். உங்கள் இலக்குகளை நோக்கி முன்னேறுவதில் எந்தவித தடங்கலும் இருக்காது. சிறுசிறு தடைகள் தோன்றினாலும், அவற்றை திறம்பட சமாளிக்கும் ஆற்றல் உங்களுக்கு இருக்கும்.\n\nஉங்கள் குடும்ப வாழ்க்கையில் இன்று மகிழ்ச்சியும், அமைதியும் நிலைக்கும். உடன் பிறந்தோருடனான உறவுகள் வலுப்பெறும். அவர்கள் மூலமாக உங்களுக்கு நல்ல ஆலோசனை அல்லது உதவி கிடைக்கலாம். இல்லத்தில் மங்கல நிகழ்வுகள் குறித்த பேச்சுவார்த்தைகள் நடக்கலாம். பெற்றோர்களின் ஆதரவு உங்களுக்கு கிடைக்கும். பிள்ளைகளின் வளர்ச்சி உங்களுக்கு பெருமையையும், மன நிறைவையும் அளிக்கும். அயல்நாட்டவர் அல்லது வெளியூர் நண்பர்களின் தொடர்புகள் மூலம் புதிய வாய்ப்புகள் உருவாகலாம். பொது வாழ்வில் உங்கள் மதிப்பு உயரும். புதிய தொடர்புகள் மூலம் புதிய வாய்ப்புகள் உருவாகலாம். இன்று நீங்கள் மேற்கொள்ளும் முயற்சிகள் அனைத்தும் எதிர்காலத்தில் பெரும் வெற்றிகளுக்கு அடித்தளமாக அமையும். உங்கள் பேச்சுத் திறமையும், வாதத் திறமையும் இன்று உங்களுக்கு நன்மை பயக்கும். குறிப்பான கலந்துரையாடல்களில் உங்கள் கருத்துக்கள் ஏற்கப்படும். உங்கள் கருத்துக்களில் உள்ள நியாயத்தையும், உறுதியையும் அனைவரும் உணர்வார்கள். இன்று நீங்கள் செய்யும் முதலீடுகள் அல்லது சொத்து சம்பந்தமான முடிவுகள் நீண்ட காலத்திற்கு நன்மை பயக்கும் விதமாக அமையும். உங்கள் இல்லத்தில் மகிழ்ச்சியும், அமைதியும் நிலைக்கும். உறவினர்களுடன் இணக்கமான உறவு நீடிக்கும். ஆன்மீக ரீதியான சிந்தனைகள் உங்கள் மனதை அமைதிப்படுத்தும். புத்துணர்ச்சியுடன் செயல்பட உதவும். இன்று நீங்கள் எடுக்கும் ஒவ்வொரு முடிவும் உங்கள் எதிர்காலத்தை ஒளிமயமாக்கும். எனவே, பயமின்றி தைரியமாக செயல்படுங்கள். உங்கள் உள்மனதின் குரலுக்கு செவிசாய்த்து செயல்படுங்கள். இன்றைய நாள் உங்களுக்கு ஒரு அற்புதமான ஆரம்பமாக அமையும். எந்த ஒரு சவாலையும் தன்னம்பிக்கையுடன் எதிர்கொள்ளும் மன தைரியத்தை செவ்வாய் கோள் உங்களுக்கு வழங்கும். உங்கள் தன்னம்பிக்கை அதிகரிக்கும் நாள் இது. புதிய முயற்சிகளில் ஈடுபடுவதற்கு இது மிகவும் உகந்த நேரம். நீண்டகாலமாக நிலுவையில் உள்ள வேலைகளை இன்று நீங்கள் திறம்பட முடிப்பீர்கள். குடும்ப உறுப்பினர்களுடனான உறவு இனிமையாகும். உடன் பிறந்தோர் உறவுகள் வலுப்பெறும். உங்களது ஆற்றலை சரியான வழியில் பயன்படுத்துவதன் மூலம் பெரிய வெற்றிகளை அடையலாம். பொது வாழ்வில் உங்கள் பெயர் உயரும்.",
    "prediction_en": "Today, being a Tuesday, the influence of Mars will bring a special energy and new motivation to your Aries sign. Your mental resolve will increase. You will naturally feel the courage to take the lead in any task. Today, you will bravely make some important decisions that you have been contemplating for a long time. Through this, a new chapter will begin in your life. Your intuition will guide you accurately today, so you can move forward with confidence. Instead of fearing challenges, you will turn them into stepping stones to success. All past obstacles will be overcome by your determined actions today. This is an excellent day for your personal growth. You can plan to learn new skills or refine existing ones. Constructive thoughts will arise in your mind. It is good to start implementing them immediately. You will feel a sense of speed and determination in every task. Your hard work and full commitment will yield good results today. By avoiding unnecessary arguments and acting calmly, you will be able to turn situations to your advantage. Physically and mentally, you will feel very strong today. There will be no hindrance in moving towards your goals. Even if minor obstacles appear, you will have the ability to skillfully overcome them.\n\nToday, happiness and peace will prevail in your family life. Relationships with siblings will strengthen. Through them, you may receive good advice or assistance. Discussions about auspicious events may take place in the home. You will receive support from your parents. The growth of your children will bring you pride and satisfaction. New opportunities may arise through contact with foreigners or out-of-town friends. Your standing in public life will increase. New opportunities may arise through new connections. All your endeavors today will lay the foundation for great successes in the future. Your speaking skills and argumentative ability will be beneficial today. Your views will be accepted in important discussions. Everyone will recognize the fairness and conviction in your opinions. Investments or property-related decisions you make today will be beneficial in the long run. Happiness and peace will prevail in your home. Harmonious relationships with relatives will continue. Spiritual thoughts will calm your mind and help you act with renewed vigor. Every decision you make today will brighten your future. Therefore, act bravely without fear. Listen to your inner voice and act accordingly. Today will be a wonderful beginning for you. The planet Mars will grant you the mental courage to face any challenge with self-confidence. This is a day when your self-confidence will increase. It is a very opportune time to engage in new endeavors. You will skillfully complete long-pending tasks today. Family relationships will be sweet. Sibling bonds will strengthen. By utilizing your energy in the right way, you can achieve great successes. Your name will rise in public life.",
    "career_ta": "பணியிடத்தில் புதிய பொறுப்புகள் தேடி வரலாம். அவற்றை திறம்பட ஏற்று சிறப்பாகச் செயல்படுவீர்கள். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். உங்கள் முடிவுகளுக்கு உயர் அதிகாரிகளின் ஆதரவு கிடைக்கும். தொழில்முனைவோருக்கு புதிய ஒப்பந்தங்கள் கிடைக்கும்.",
    "career_en": "New responsibilities may come your way at work. You will skillfully accept and perform them excellently. You will receive cooperation from colleagues. You will have the courage to initiate new projects. Your decisions will receive support from higher authorities. Entrepreneurs will secure new contracts.",
    "finance_ta": "நிதிநிலை திருப்திகரமாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். சொத்து சம்பந்தமான முதலீடுகள் ஈட்டத்தை அளிக்கும் விதமாக அமையும். நீண்டகால முதலீடுகளைத் தொடங்க இது ஒரு நல்ல வாய்ப்பு. கொடுக்கல் வாங்கலில் கவனமும், நேர்மையும் நன்மை பயக்கும்.",
    "finance_en": "Financial status will be satisfactory. Expected money flow will occur. Property-related investments will be profitable. This is a good opportunity to start long-term investments. Caution and integrity in transactions will be beneficial.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். புத்துணர்ச்சியுடன் இருப்பீர்கள். வழக்கமான உடற்பயிற்சிகளை மேற்கொள்வது மேலும் நன்மைகளைத் தரும். மனதில் நேர்மறை எண்ணங்கள் மேலோங்கும்.",
    "health_en": "Physical health will be excellent. You will feel refreshed. Regular exercise will bring further benefits. Positive thoughts will prevail in your mind.",
    "lucky_number": "9",
    "lucky_color_ta": "சிவப்பு",
    "lucky_color_en": "Red"
  },
  {
    "sign_ta": "ரிஷபம்",
    "sign_en": "Taurus",
    "date": "24-02-2026",
    "prediction_ta": "இன்று செவ்வாய்க்கிழமை என்பதால், ரிஷப ராசிக்காரர்களே, செவ்வாய் கோளின் செல்வாக்கு உங்கள் வாழ்வில் புதிய ஊக்கத்தையும், செயல்களில் வேகத்தையும் தரவுள்ளது. உங்கள் மனதில் இருந்த சில தயக்கங்கள் இன்று நீங்கி, துணிச்சலுடன் முடிவுகளை எடுப்பீர்கள். உறுதியுடன் செயல்பட்டு உங்கள் இலக்குகளை நோக்கி முன்னேறுவீர்கள். உங்கள் பொறுமைக்கும், கடின உழைப்பிற்கும் இன்று நல்ல பலன்கள் கிடைக்கும். நீண்ட நாட்களாக நீங்கள் எதிர்பார்த்திருந்த ஒரு நல்ல செய்தி இன்று உங்களைத் தேடி வரும். உங்கள் முயற்சிகளில் வெற்றி காண செவ்வாய் கோள் உங்களுக்குத் துணை நிற்கும். எதிலும் ஒருபடி மேலே சென்று சிந்தித்து செயல்படுவீர்கள். இன்றைய நாள் உங்களுக்கு மிகவும் நன்மை பயக்கும் விதமாக அமையும். பழைய தடங்கல்கள் நீங்கி, புதிய வழிகள் பிறக்கும். உங்கள் உறுதிப்பாடு இன்று மிகப்பெரிய வெற்றிகளை உங்களுக்கு ஈட்டித்தரும்.\n\nஉங்கள் குடும்ப வாழ்க்கையில் இன்று மகிழ்ச்சியும், அமைதியும் நிலவும். உடன் பிறந்தோருடனான சந்திப்புகள் இனிமையாக இருக்கும். இல்லத்தில் மங்கல நிகழ்வுகள் பற்றிய பேச்சுவார்த்தைகள் நடக்க வாய்ப்புள்ளது. குடும்ப உறுப்பினர்களுடன் இணைந்து புதிய திட்டங்களை வகுப்பீர்கள். குறிப்பாக, உங்கள் வாழ்க்கைத்துணையுடனான உறவு மேலும் வலுப்பெறும். பரஸ்பர புரிதலும், அன்பும் அதிகரிக்கும். நிலுவையில் இருந்த சொத்து சம்பந்தமான வேலைகள் இன்று எளிதாக முடிவடையும். புதிய வீடு வாங்குவதற்கோ அல்லது நிலம் வாங்குவதற்கோ இன்று நல்ல வாய்ப்புகள் கிடைக்கும். பழைய சொத்துக்களை சீரமைக்கும் வேலைகளைத் தொடங்கலாம். சட்டரீதியான ஆலோசனைகள் உங்களுக்கு நன்மை பயக்கும். உங்கள் இல்லத்தின் பராமரிப்பு வேலைகளை மேற்கொள்வதற்கு இது ஒரு நல்ல நாள். இது உங்கள் மனதிற்கு மகிழ்ச்சியையும், திருப்தியையும் அளிக்கும்.\n\nப பணி மற்றும் தொழில் ரீதியாக இன்று ஒரு சிறப்பான நாள். புதிய திட்டங்களை தைரியமாக முன்னெடுப்பீர்கள். உங்கள் துணிச்சலான முடிவுகள் ஈட்டத்தை ஈட்டித் தரும். உடன் பணிபுரிவோருடனான உறவு இணக்கமாக இருக்கும். அவர்களின் ஒத்துழைப்புடன் வேலைகளை எளிதாக முடிப்பீர்கள். தொழில்முனைவோருக்கு புதிய ஒப்பந்தங்கள் கிடைக்க வாய்ப்புள்ளது. அயல்நாட்டு வர்த்தகத்தில் ஈடுபடுவோருக்கு நல்ல ஈட்டம் கிடைக்கும். நீங்கள் செய்யும் ஒவ்வொரு முயற்சியிலும் வெற்றி உண்டாகும். கலைத்துறையை சார்ந்தவர்களுக்கு புதிய வாய்ப்புகள் கிடைக்கும். உங்கள் திறமைகள் அங்கீகரிக்கப்பட்டு பாராட்டப்படும். பொது வாழ்வில் உங்கள் செல்வாக்கு உயரும். புதிய தொடர்புகள் மூலம் புதிய வாய்ப்புகள் உண்டாகும்.\n\nகல்வித் துறையில் உள்ள மாணவர்களுக்கு படிப்பில் ஆர்வம் அதிகரிக்கும். போட்டித் தேர்வுகளில் சிறப்பான முறையில் செயல்படுவீர்கள். புதிய பாடத்திட்டங்களை கற்றுக்கொள்வதில் வெற்றி பெறுவீர்கள். ஆசிரியர்களின் ஆதரவு கிடைக்கும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். இன்று நீங்கள் மேற்கொள்ளும் ஆராய்ச்சிகள் நல்ல பலனைத் தரும். உங்கள் அறிவாற்றல் இன்று சிறப்பான முறையில் வெளிப்படும்.\n\nஉடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் இருந்த தேவையற்ற குழப்பங்கள் நீங்கி, தெளிவு பிறக்கும். உடல் ரீதியாகவும், மன ரீதியாகவும் நீங்கள் இன்று மிகவும் வலிமையுடன் உணர்வீர்கள். சீரான உடற்பயிற்சிகளை மேற்கொள்வது மேலும் நன்மைகளைத் தரும். ஆரோக்கியமான உணவுப் பழக்க வழக்கங்களை கடைபிடிப்பது மிகவும் நல்லது. உங்கள் மனதை அமைதியாக வைத்துக்கொள்ள தியானம் அல்லது யோகா செய்யலாம். இது உங்கள் மனதிற்கு புத்துணர்ச்சியையும், ஆற்றலையும் அளிக்கும்.\n\nநிதி நிலைமை இன்று வலுவாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைக்கப்படும். சேமிப்புகளை அதிகரிக்கும் வாய்ப்புகள் ஏற்படும். பங்குச்சந்தையில் முதலீடு செய்ய திட்டமிட்டிருந்தால், நிதானமான அணுகுமுறை நன்மை தரும். பெரிய முதலீடுகளை செய்வதற்கு முன் திறன்மிக்க நிபுணர்களின் ஆலோசனையைப் பெறுவது நல்லது. இன்று நீங்கள் மேற்கொள்ளும் நிதி சார்ந்த முடிவுகள் எதிர்காலத்தில் பெரிய ஈட்டத்தை அளிக்கும். உங்கள் கடின உழைப்புக்கு நல்ல பலன் கிடைக்கும் நாள் இது. ஆகையால், எந்த ஒரு செயலிலும் துணிச்சலுடன் ஈடுபட்டு, உங்கள் கனவுகளை நனவாக்குங்கள். ஒட்டுமொத்தமாக, இன்றைய நாள் உங்களுக்கு உற்சாகத்தையும், வெற்றியையும் வழங்கும்.",
    "prediction_en": "Today, being a Tuesday, the influence of Mars will bring new motivation and speed in your actions, Taurus natives. Some hesitations in your mind will disappear today, and you will make decisions bravely. You will act with determination and move towards your goals. Your patience and hard work will yield good results today. A good news you have been expecting for a long time will reach you today. Mars will assist you in achieving success in your endeavors. You will think and act one step ahead in everything. Today will be very beneficial for you. Old obstacles will be removed, and new paths will emerge. Your determination today will bring you great successes.\n\nToday, happiness and peace will prevail in your family life. Meetings with siblings will be pleasant. Discussions about auspicious events may take place in the home. You will plan new projects together with family members. In particular, your relationship with your spouse will strengthen further. Mutual understanding and love will increase. Pending property-related tasks will be completed easily today. Good opportunities will arise today for buying a new house or land. You can start renovation work on old properties. Legal advice will be beneficial for you. This is a good day to undertake maintenance work for your home. This will bring joy and satisfaction to your mind.\n\nToday is an excellent day for career and business. You will bravely undertake new projects. Your courageous decisions will bring profits. Relationships with colleagues will be harmonious. You will complete tasks easily with their cooperation. Entrepreneurs are likely to get new contracts. Those involved in foreign trade will reap good profits. Every effort you make will lead to success. Those in the arts field will get new opportunities. Your talents will be recognized and appreciated. Your influence in public life will increase. New opportunities will arise through new contacts.\n\nFor students in the field of education, interest in studies will increase. You will perform excellently in competitive exams. You will succeed in learning new curricula. You will receive support from teachers. All your efforts will be successful. Research you undertake today will yield good results. Your intellect will be brilliantly expressed today.\n\nPhysical health will be good. Unnecessary confusions in your mind will clear up, bringing clarity. Physically and mentally, you will feel very strong today. Regular exercise will bring further benefits. It is very good to adopt healthy eating habits. You can meditate or do yoga to keep your mind calm. This will bring freshness and energy to your mind.\n\nFinancial situation will be strong today. Expected money flow will occur. Old debts will be repaid. Opportunities to increase savings will arise. If you plan to invest in the stock market, a cautious approach will be beneficial. It is advisable to seek expert advice before making large investments. Financial decisions you make today will bring significant profits in the future. This is a day when your hard work will yield good results. Therefore, engage in any task with courage and make your dreams come true. Overall, today will bring you enthusiasm and success.",
    "career_ta": "பணியிடத்தில் புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். உங்கள் துணிச்சலான முடிவுகள் ஈட்டத்தை ஈட்டித் தரும். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். தொழில்முனைவோருக்கு புதிய ஒப்பந்தங்கள் கிடைக்கும். வெளிநாட்டு வர்த்தகத்தில் ஈடுபடுவோருக்கு நல்ல ஈட்டம் உண்டு.",
    "career_en": "You will have the courage to initiate new projects at work. Your brave decisions will yield profits. You will receive cooperation from colleagues. Entrepreneurs will secure new contracts. Those involved in foreign trade will have good earnings.",
    "finance_ta": "நிதிநிலை வலுவாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைக்கப்படும். சொத்து சம்பந்தமான முதலீடுகள் நன்மை பயக்கும் விதமாக அமையும். சேமிப்புகளை அதிகரிக்க இது ஒரு நல்ல நாள்.",
    "finance_en": "Financial situation will be strong. Expected money flow will occur. Old debts will be repaid. Opportunities to increase savings will arise. Property-related investments will be beneficial. This is a good day to increase savings.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மனதில் இருந்த குழப்பங்கள் நீங்கி தெளிவு பிறக்கும். உடல் ரீதியாகவும், மன ரீதியாகவும் இன்று வலிமையுடன் உணர்வீர்கள். புத்துணர்ச்சியுடன் இருப்பீர்கள்.",
    "health_en": "Physical health will be excellent. Confusions in your mind will clear, bringing clarity. You will feel strong physically and mentally today. You will be refreshed.",
    "lucky_number": "6",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "மிதுனம்",
    "sign_en": "Gemini",
    "date": "24-02-2026",
    "prediction_ta": "மிதுன ராசிக்காரர்களே, இன்று செவ்வாய்க்கிழமை என்பதால், செவ்வாய் கோளின் செல்வாக்கு உங்கள் சிந்தனைகளிலும், செயல்களிலும் ஒரு புதிய வேகத்தை அளிக்கும். நீங்கள் சுறுசுறுப்புடனும், ஆற்றலுடனும் செயல்படுவீர்கள். இன்று நீங்கள் எடுக்கும் முடிவுகள் எதிர்காலத்தில் பெரிய மாற்றங்களை உருவாக்கும். உங்கள் புத்திசாலித்தனமும், அறிவாற்றலும் இன்று சிறப்பாக வெளிப்படும். பலதரப்பட்ட கருத்துக்களையும் அலசி ஆராய்ந்து, சரியான முடிவுகளை எடுப்பதில் நீங்கள் வல்லவராகத் திகழ்வீர்கள். நீண்ட நாட்களாக நிலுவையில் உள்ள வேலைகளை இன்று துணிச்சலுடன் முன்னெடுத்து முடிப்பீர்கள். சவால்களைக் கண்டு அஞ்சாமல், அவற்றை தைரியமாக எதிர்கொண்டு வெற்றி பெறுவீர்கள். உங்களின் தொடர்பாடல் திறன் இன்று சிறப்பாக இருக்கும். மற்றவர்களுடன் இணக்கமாக பேசி, உங்கள் கருத்துக்களை தெளிவாக எடுத்துரைப்பீர்கள். இது உங்கள் தனிப்பட்ட மற்றும் தொழில் வாழ்க்கையில் பல நன்மைகளை ஈட்டித்தரும்.\n\nஉங்கள் குடும்ப வாழ்க்கையில் மகிழ்ச்சியும், ஒருவித புதிய ஊக்கமும் நிலவும். உடன் பிறந்தோருடனான உறவுகள் வலுப்பெறும். அவர்களுடன் இணைந்து புதிய திட்டங்களை வகுப்பீர்கள். குடும்ப உறுப்பினர்களுடன் வெளியே சென்று வர வாய்ப்புள்ளது. இது உங்கள் மனதிற்கு புத்துணர்ச்சியை அளிக்கும். இல்லத்தில் ஒரு புதிய மாற்றத்தை உருவாக்க திட்டமிடுவீர்கள். வீட்டை புதுப்பித்தல் அல்லது அலங்கரித்தல் போன்ற வேலைகளை இன்று தொடங்கலாம். சொத்து சம்பந்தமான முடிவுகளை எடுக்க இது ஒரு நல்ல நாள். நிலுவையில் உள்ள சொத்து ஆவணங்கள் இன்று சரியாகும். நிலம் வாங்குவது அல்லது விற்பது போன்ற வேலைகளில் உங்களுக்கு நன்மை பயக்கும் திருப்பங்கள் ஏற்படும். சட்டரீதியான பிரச்சனைகளில் உங்களுக்கு ஆதரவான முடிவுகள் கிடைக்கும். உங்கள் இல்லத்தின் பாதுகாப்பு மற்றும் பராமரிப்பில் கவனம் செலுத்துவீர்கள்.\n\nபணி மற்றும் தொழில் ரீதியாக இன்று ஒரு சிறப்பான நாள். நீங்கள் தலைமைப் பொறுப்பை ஏற்க வேண்டிய சூழ்நிலைகள் ஏற்படலாம். அதை திறம்பட கையாண்டு வெற்றி பெறுவீர்கள். புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். உயர் அதிகாரிகளின் ஆதரவு உங்களுக்கு நன்மை பயக்கும் விதமாக அமையும். தொழில்முனைவோருக்கு புதிய வாடிக்கையாளர்கள் கிடைப்பார்கள். உங்கள் படைப்பாற்றல் இன்று சிறப்பாக வெளிப்படும். புதிய கண்டுபிடிப்புகள் மூலம் நீங்கள் பாராட்டப்படுவீர்கள். அயல்நாட்டு வர்த்தகத்தில் ஈடுபடுவோருக்கு இன்று நல்ல ஈட்டம் கிடைக்கும். இன்று உங்களுக்கு புதிய வாய்ப்புகள் தேடி வரும்.\n\nகல்வித் துறையில் உள்ள மாணவர்களுக்கு இன்று ஒரு சிறந்த நாள். படிப்பில் இருந்த தேக்க நிலை நீங்கி, புதிய ஊக்கம் பிறக்கும். ஆராய்ச்சி மாணவர்களுக்கு இன்று முக்கிய கண்டுபிடிப்புகள் நிகழலாம். போட்டித் தேர்வுகளில் சிறப்பான முறையில் வெற்றி பெறுவீர்கள். புதிய திறமைகளைக் கற்றுக்கொள்வதற்கு இது ஒரு நல்ல நாள். உங்கள் கடின உழைப்புக்கு நல்ல பலன் கிடைக்கும். உங்கள் அறிவுத்திறன் இன்று சிறப்பான முறையில் வெளிப்படும்.\n\nஉடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் இருந்த தேவையற்ற கவலைகள் நீங்கி, புத்துணர்ச்சி உண்டாகும். சுறுசுறுப்புடனும், ஆற்றலுடனும் செயல்படுவீர்கள். உடற்பயிற்சிகளை மேற்கொள்வது மேலும் நன்மைகளைத் தரும். மனதை அமைதியாக வைத்துக்கொள்ள தியானம் அல்லது யோகா செய்யலாம். ஆரோக்கியமான உணவுப் பழக்கவழக்கங்களை கடைபிடிப்பது மிகவும் நல்லது. இது உங்கள் மனதிற்கு அமைதியையும், ஆற்றலையும் அளிக்கும்.\n\nநிதி நிலைமை இன்று சிறப்பாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைக்கப்படும். சேமிப்புகளை அதிகரிக்கும் வாய்ப்புகள் ஏற்படும். புதிய முதலீடுகளை மேற்கொள்ள இது ஒரு நல்ல நாள். குறிப்பாக, நீண்டகால முதலீடுகள் உங்களுக்கு எதிர்காலத்தில் பெரிய ஈட்டத்தை அளிக்கும். அறிவுசார்ந்த நிதி முடிவுகளை எடுப்பீர்கள். உங்கள் நிதி நிலைமை இன்று மேலும் வலுப்பெறும். சொத்து சம்பந்தமான முதலீடுகள் நல்ல பலனைத் தரும். உங்கள் திறமையான நிதி மேலாண்மைக்கு நல்ல பலன் கிடைக்கும். இன்று நீங்கள் மேற்கொள்ளும் நிதி சார்ந்த முடிவுகள் உங்களுக்கு நன்மை பயக்கும். இன்று உங்களுக்கு எதிர்பாராத நிதி வரவுகள் கிடைக்க வாய்ப்புள்ளது.",
    "prediction_en": "Today, being a Tuesday, the influence of Mars will bring a new momentum to your thoughts and actions, Gemini natives. You will act with agility and energy. Decisions you make today will create big changes in the future. Your intelligence and intellect will be brilliantly displayed today. You will excel in analyzing diverse opinions and making sound decisions. You will bravely undertake and complete long-pending tasks today. Instead of fearing challenges, you will bravely face and overcome them. Your communication skills will be excellent today. You will speak harmoniously with others and clearly express your views. This will bring many benefits to your personal and professional life.\n\nYour family life will be filled with happiness and a new kind of motivation today. Relationships with siblings will strengthen. You will plan new projects with them. There's a possibility of going out with family members, which will refresh your mind. You will plan to create a new change in your home. You can start tasks like renovating or decorating your house today. This is a good day to make property-related decisions. Pending property documents will be settled today. You will experience beneficial turns in tasks like buying or selling land. You will receive favorable outcomes in legal matters. You will pay attention to the safety and maintenance of your home. This will bring joy and satisfaction to your mind.\n\nToday is an excellent day for career and business. You may face situations where you have to take on leadership roles. You will skillfully manage them and succeed. You will have the courage to initiate new projects. You will receive cooperation from colleagues. Support from higher authorities will be beneficial for you. Entrepreneurs will gain new customers. Your creativity will be brilliantly expressed today. You will be appreciated for new innovations. Those involved in foreign trade will have good earnings today. New opportunities will come your way today.\n\nFor students in the field of education, today is an excellent day. Stagnation in studies will disappear, and new motivation will arise. Research students may experience significant discoveries today. You will perform excellently in competitive exams. You will succeed in learning new curricula. You will receive support from teachers. Your hard work will yield good results. Your intellectual abilities will be brilliantly expressed today.\n\nPhysical health will be good. Unnecessary worries in your mind will disappear, and you will feel refreshed. You will feel very strong physically and mentally today. Regular exercise will bring further benefits. It is very good to adopt healthy eating habits. You can meditate or do yoga to keep your mind calm. This will bring peace and energy to your mind.\n\nFinancial situation will be excellent today. Expected money flow will occur. Old debts will be repaid. Opportunities to increase savings will arise. This is a good day to make new investments. In particular, long-term investments will bring you significant profits in the future. You will make intelligent financial decisions. Your financial situation will strengthen further today. Property-related investments will yield good results. Your efficient financial management will bring good returns. Financial decisions you make today will be beneficial for you. You are likely to receive unexpected financial inflows today.",
    "career_ta": "பணியிடத்தில் புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். தலைமைப் பொறுப்பை திறம்பட கையாள்வீர்கள். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். தொழில்முனைவோருக்கு புதிய வாடிக்கையாளர்கள் கிடைப்பார்கள். உங்கள் படைப்பாற்றல் சிறக்கும்.",
    "career_en": "You will have the courage to initiate new projects at work. You will skillfully handle leadership roles. You will receive cooperation from colleagues. Entrepreneurs will gain new customers. Your creativity will flourish.",
    "finance_ta": "நிதிநிலை சிறப்பாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைக்கப்படும். சொத்து சம்பந்தமான முதலீடுகள் நன்மை பயக்கும். புதிய முதலீடுகளை மேற்கொள்ள இது ஒரு நல்ல நாள்.",
    "finance_en": "Financial situation will be excellent. Expected money flow will occur. Old debts will be repaid. Property-related investments will be beneficial. This is a good day to make new investments.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் இருந்த கவலைகள் நீங்கி புத்துணர்ச்சி உண்டாகும். சுறுசுறுப்புடனும், ஆற்றலுடனும் செயல்படுவீர்கள். ஆரோக்கியமான உணவுப் பழக்கம் நன்மைகளைத் தரும்.",
    "health_en": "Physical health will be good. Worries in your mind will clear, bringing freshness. You will act with agility and energy. Healthy eating habits will bring benefits.",
    "lucky_number": "5",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "24-02-2026",
    "prediction_ta": "கடக ராசிக்காரர்களே, இன்று செவ்வாய்க்கிழமை என்பதால், செவ்வாய் கோளின் செல்வாக்கு உங்கள் மன உறுதிப்பாட்டையும், பாதுகாப்பின் மீதான தேவையையும் அதிகரிக்கும். குடும்பம் சார்ந்த வேலைகளில் இன்று நீங்கள் மிகுந்த ஈடுபாட்டுடன் செயல்படுவீர்கள். நீண்ட நாட்களாக நிலுவையில் இருந்த குடும்ப வேலைகள் அல்லது வீட்டிற்கு தேவையான சீரமைப்பு வேலைகளை இன்று துணிச்சலுடன் முன்னெடுப்பீர்கள். உங்கள் உணர்ச்சிபூர்வமான நிலையான அணுகுமுறை இன்று உங்களுக்கு பல நன்மைகளை ஈட்டித்தரும். மற்றவர்களின் உணர்வுகளுக்கு மதிப்பளிக்கும் அதே வேளையில், உங்கள் சொந்த தேவைகளுக்கும் முக்கியத்துவம் அளிப்பீர்கள். இன்று நீங்கள் எடுக்கும் முடிவுகள் குடும்பத்தில் மகிழ்ச்சியையும், அமைதியையும் நிலைநிறுத்தும். உங்கள் மனதில் இருந்த குழப்பங்கள் நீங்கி தெளிவு பிறக்கும்.\n\nகுடும்ப உறுப்பினர்களுடனான உறவுகள் இன்று மிகவும் இணக்கமாக இருக்கும். குறிப்பாக, பெற்றோர்களுடனான உறவில் ஒருவித புரிதலும், அன்பும் அதிகரிக்கும். உடன் பிறந்தோர் உங்களுக்கு ஆதரவாக இருப்பார்கள். அவர்களுடன் இணைந்து புதிய திட்டங்களை வகுப்பீர்கள். இல்லத்தில் மங்கல நிகழ்வுகள் குறித்த பேச்சுவார்த்தைகள் நடக்க வாய்ப்புள்ளது. புதிய வீடு கட்டுவதற்கோ அல்லது நிலம் வாங்குவதற்கோ இன்று நல்ல வாய்ப்புகள் கிடைக்கும். சொத்து சம்பந்தமான ஆவண வேலைகள் இன்று துரிதமாக நடக்கும். நிலுவையில் உள்ள சட்டரீதியான பிரச்சனைகளுக்கு இன்று தீர்வு காண நன்மை பயக்கும் சூழ்நிலைகள் உருவாகும். உங்கள் இல்லத்தின் பாதுகாப்பு மற்றும் பராமரிப்பில் கவனம் செலுத்துவீர்கள். இது உங்கள் மனதிற்கு மகிழ்ச்சியையும், திருப்தியையும் அளிக்கும்.\n\nபணி மற்றும் தொழில் ரீதியாக இன்று ஒரு சிறப்பான நாள். உங்கள் கடின உழைப்பும், அர்ப்பணிப்பும் இன்று உயர் அதிகாரிகளால் பாராட்டப்படும். புதிய பொறுப்புகள் தேடி வரலாம். அவற்றை திறம்பட ஏற்று சிறப்பாகச் செயல்படுவீர்கள். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். தொழில்முனைவோருக்கு புதிய ஒப்பந்தங்கள் கிடைக்கும். வெளிநாட்டு வர்த்தகத்தில் ஈடுபடுவோருக்கு நல்ல ஈட்டம் கிடைக்கும். உங்கள் அறிவுசார்ந்த முடிவுகள் உங்களுக்கு நன்மை பயக்கும் விதமாக அமையும். நீங்கள் எடுக்கும் ஒவ்வொரு முயற்சியிலும் வெற்றி உண்டாகும். இன்று உங்களுக்கு புதிய வாய்ப்புகள் தேடி வரும்.\n\nகல்வித் துறையில் உள்ள மாணவர்களுக்கு இன்று ஒரு சிறந்த நாள். படிப்பில் ஆர்வம் அதிகரிக்கும். போட்டித் தேர்வுகளில் சிறப்பான முறையில் செயல்படுவீர்கள். புதிய பாடத்திட்டங்களை கற்றுக்கொள்வதில் வெற்றி பெறுவீர்கள். ஆசிரியர்களின் ஆதரவு கிடைக்கும். ஆராய்ச்சி மாணவர்களுக்கு இன்று புதிய தகவல்கள் கிடைக்கும். உங்கள் அறிவுத்தாகம் அதிகரிக்கும். உங்கள் மனதை ஒருமுகப்படுத்தி படிப்பது சிறப்பான பலனைத் தரும்.\n\nஉடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் இருந்த தேவையற்ற கவலைகள் நீங்கி, புத்துணர்ச்சி உண்டாகும். உடல் ரீதியாகவும், மன ரீதியாகவும் நீங்கள் இன்று மிகவும் வலிமையுடன் உணர்வீர்கள். சீரான உடற்பயிற்சிகளை மேற்கொள்வது மேலும் நன்மைகளைத் தரும். ஆரோக்கியமான உணவுப் பழக்கவழக்கங்களை கடைபிடிப்பது மிகவும் நல்லது. மனதை அமைதியாக வைத்துக்கொள்ள தியானம் அல்லது யோகா செய்யலாம். இது உங்கள் மனதிற்கு அமைதியையும், ஆற்றலையும் அளிக்கும்.\n\nநிதி நிலைமை இன்று வலுவாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைக்கப்படும். சேமிப்புகளை அதிகரிக்கும் வாய்ப்புகள் ஏற்படும். புதிய முதலீடுகளை மேற்கொள்ள இது ஒரு நல்ல நாள். குறிப்பாக, நீண்டகால முதலீடுகள் உங்களுக்கு எதிர்காலத்தில் பெரிய ஈட்டத்தை அளிக்கும். அறிவுசார்ந்த நிதி முடிவுகளை எடுப்பீர்கள். உங்கள் நிதி நிலைமை இன்று மேலும் வலுப்பெறும். சொத்து சம்பந்தமான முதலீடுகள் நல்ல பலனைத் தரும். உங்கள் திறமையான நிதி மேலாண்மைக்கு நல்ல பலன் கிடைக்கும். இன்று நீங்கள் மேற்கொள்ளும் நிதி சார்ந்த முடிவுகள் உங்களுக்கு நன்மை பயக்கும். இன்று உங்களுக்கு எதிர்பாராத நிதி வரவுகள் கிடைக்க வாய்ப்புள்ளது.",
    "prediction_en": "Today, being a Tuesday, the influence of Mars will increase your mental resolve and need for security, Cancer natives. Today, you will engage with great dedication in family-related tasks. You will bravely undertake long-pending family tasks or home renovation projects today. Your emotionally stable approach today will bring you many benefits. While respecting the feelings of others, you will also give importance to your own needs. Decisions you make today will bring happiness and peace to your family. Confusions in your mind will clear, bringing clarity.\n\nRelationships with family members will be very harmonious today. In particular, understanding and affection in relationships with parents will increase. Siblings will be supportive of you. You will plan new projects with them. Discussions about auspicious events may take place in the home. Good opportunities will arise today for building a new house or buying land. Property-related documentation will proceed quickly today. Favorable circumstances will arise today to resolve pending legal issues. You will focus on the safety and maintenance of your home. This will bring joy and satisfaction to your mind.\n\nToday is an excellent day for career and business. Your hard work and dedication will be appreciated by higher authorities today. New responsibilities may come your way. You will skillfully accept and perform them excellently. You will receive cooperation from colleagues. You will have the courage to initiate new projects. Entrepreneurs will secure new contracts. Those involved in foreign trade will reap good profits. Your intelligent decisions will be beneficial for you. Every effort you make will lead to success. New opportunities will come your way today.\n\nFor students in the field of education, today is an excellent day. Interest in studies will increase. You will perform excellently in competitive exams. You will succeed in learning new curricula. You will receive support from teachers. Research students will receive new information today. Your thirst for knowledge will increase. Focusing your mind on studies will yield excellent results.\n\nPhysical health will be good. Unnecessary worries in your mind will disappear, and you will feel refreshed. You will feel very strong physically and mentally today. Regular exercise will bring further benefits. It is very good to adopt healthy eating habits. You can meditate or do yoga to keep your mind calm. This will bring peace and energy to your mind.\n\nFinancial situation will be strong today. Expected money flow will occur. Old debts will be repaid. Opportunities to increase savings will arise. This is a good day to make new investments. In particular, long-term investments will bring you significant profits in the future. You will make intelligent financial decisions. Your financial situation will strengthen further today. Property-related investments will yield good results. Your efficient financial management will bring good returns. Financial decisions you make today will be beneficial for you. You are likely to receive unexpected financial inflows today.",
    "career_ta": "பணியிடத்தில் புதிய பொறுப்புகள் தேடி வரலாம். அவற்றை திறம்பட ஏற்று சிறப்பாகச் செயல்படுவீர்கள். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். தொழில்முனைவோருக்கு புதிய ஒப்பந்தங்கள் கிடைக்க வாய்ப்புள்ளது.",
    "career_en": "New responsibilities may come your way at work. You will skillfully accept and perform them excellently. You will receive cooperation from colleagues. You will have the courage to initiate new projects. Entrepreneurs are likely to get new contracts.",
    "finance_ta": "நிதிநிலை வலுவாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைக்கப்படும். சேமிப்புகளை அதிகரிக்கும் வாய்ப்புகள் ஏற்படும். சொத்து சம்பந்தமான முதலீடுகள் நன்மை பயக்கும் விதமாக அமையும்.",
    "finance_en": "Financial situation will be strong. Expected money flow will occur. Old debts will be repaid. Opportunities to increase savings will arise. Property-related investments will be beneficial.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் இருந்த கவலைகள் நீங்கி புத்துணர்ச்சி உண்டாகும். உடல் ரீதியாகவும், மன ரீதியாகவும் வலிமையுடன் உணர்வீர்கள். ஆரோக்கியமான உணவுப் பழக்கம் நன்மைகளைத் தரும்.",
    "health_en": "Physical health will be good. Worries in your mind will clear, bringing freshness. You will feel strong physically and mentally. Healthy eating habits will bring benefits.",
    "lucky_number": "2",
    "lucky_color_ta": "வெள்ளை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "சிம்மம்",
    "sign_en": "Leo",
    "date": "24-02-2026",
    "prediction_ta": "சிம்ம ராசிக்காரர்களே, இன்று செவ்வாய்க்கிழமை என்பதால், செவ்வாய் கோளின் செல்வாக்கு உங்கள் தலைமைப் பண்பையும், தன்னம்பிக்கையையும் அதிகரிக்கும். இன்று நீங்கள் எந்த ஒரு செயலையும் மிகுந்த தைரியத்துடன் அணுகுவீர்கள். உங்கள் உள்ளுணர்வு சரியாக வழிகாட்டும் என்பதால், தயக்கமின்றி குறிப்பான முடிவுகளை எடுக்கலாம். நீண்ட நாட்களாக நிலுவையில் உள்ள வேலைகளை முடிக்க இன்று ஒரு நல்ல வாய்ப்பு கிடைக்கும். உங்கள் ஆற்றலை சரியான திசையில் செலுத்துவதன் மூலம், எதிர்பாராத வெற்றிகளை ஈட்ட முடியும். சவால்களை தைரியமாக எதிர்கொள்ளும் மனப்பான்மை உங்களுக்கு இன்றைய நாளில் ஒரு வரப்பிரசாதமாக அமையும். குடும்பத்திலும் சரி, பொது வாழ்விலும் சரி, உங்களது தலைமைப் பண்புகள் வெளிப்படும். அடுத்தவர்களை வழிநடத்தும் ஆற்றல் உங்களுக்கு இயல்பாகவே உண்டாகும்.\n\nநிலுவையில் உள்ள சொத்து சம்பந்தமான பிரச்சனைகளுக்கு இன்று தீர்வு காண உகந்த நாள். சட்டரீதியான விஷயங்களில் நன்மை பயக்கும் திருப்பங்கள் ஏற்படும் வாய்ப்பு உள்ளது. உங்கள் உடன் பிறந்தோர் உங்களுடன் நல்லுறவைப் பேணுவார்கள், அவர்கள் மூலமாக உங்களுக்கு ஒரு நல்ல ஆலோசனை அல்லது உதவி கிடைக்கலாம். இன்றைய நாள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கு மிகவும் நன்மை பயக்கும். புதிய திறன்களைக் கற்றுக்கொள்ளவோ அல்லது ஏற்கனவே உள்ள திறமைகளை மெருகூட்டவோ திட்டமிடலாம். ஆக்கபூர்வமான சிந்தனைகள் உங்கள் மனதில் தோன்றும். அவற்றை உடனடியாக செயல்படுத்தத் தொடங்குவது நல்லது. எந்த ஒரு வேலையிலும் ஒருவித வேகத்தையும், உறுதியையும் காண முடியும். உங்களுடைய கடின உழைப்பும், முழு ஈடுபாடும் இன்று நல்ல பலன்களைத் தரும். தேவையற்ற வாக்குவாதங்களைத் தவிர்த்து, அமைதியுடன் செயல்பட்டால், சூழ்நிலைகளை உங்களுக்கு நன்மை பயக்கும் விதமாக மாற்றிக்கொள்ள முடியும். உடல் ரீதியாகவும், மன ரீதியாகவும் நீங்கள் இன்று மிகவும் வலிமையுடன் உணர்வீர்கள். உங்கள் இலக்குகளை நோக்கி முன்னேறுவதில் எந்தவித தடங்கலும் இருக்காது. சிறுசிறு தடைகள் தோன்றினாலும், அவற்றை திறம்பட சமாளிக்கும் ஆற்றல் உங்களுக்கு இருக்கும்.\n\nபொது வாழ்வில் உங்கள் மதிப்பு உயரும். புதிய தொடர்புகள் மூலம் புதிய வாய்ப்புகள் உருவாகலாம். இன்று நீங்கள் மேற்கொள்ளும் முயற்சிகள் அனைத்தும் எதிர்காலத்தில் பெரும் வெற்றிகளுக்கு அடித்தளமாக அமையும். உங்கள் பேச்சுத் திறமையும், வாதத் திறமையும் இன்று உங்களுக்கு நன்மை பயக்கும். குறிப்பான கலந்துரையாடல்களில் உங்கள் கருத்துக்கள் ஏற்கப்படும். உங்கள் கருத்துக்களில் உள்ள நியாயத்தையும், உறுதியையும் அனைவரும் உணர்வார்கள். இன்று நீங்கள் செய்யும் முதலீடுகள் அல்லது சொத்து சம்பந்தமான முடிவுகள் நீண்ட காலத்திற்கு ஈட்டத்தை ஈட்டித்தரும். உங்கள் இல்லத்தில் மகிழ்ச்சியும், அமைதியும் நிலைக்கும். உறவினர்களுடன் இணக்கமான உறவு நீடிக்கும். பிள்ளைகளின் வளர்ச்சி உங்களுக்கு பெருமையையும், மன நிறைவையும் அளிக்கும். ஆன்மீக ரீதியான சிந்தனைகள் உங்கள் மனதை அமைதிப்படுத்தும். புத்துணர்ச்சியுடன் செயல்பட உதவும். இன்று நீங்கள் எடுக்கும் ஒவ்வொரு முடிவும் உங்கள் எதிர்காலத்தை ஒளிமயமாக்கும். எனவே, பயமின்றி தைரியமாக செயல்படுங்கள். உங்கள் உள்மனதின் குரலுக்கு செவிசாய்த்து செயல்படுங்கள். இன்றைய நாள் உங்களுக்கு ஒரு அற்புதமான ஆரம்பமாக அமையும். எந்த ஒரு சவாலையும் தன்னம்பிக்கையுடன் எதிர்கொள்ளும் மன தைரியத்தை செவ்வாய் கோள் உங்களுக்கு வழங்கும். உங்கள் தன்னம்பிக்கை அதிகரிக்கும் நாள் இது. புதிய முயற்சிகளில் ஈடுபடுவதற்கு இது மிகவும் உகந்த நேரம். நீண்டகாலமாக நிலுவையில் உள்ள வேலைகளை இன்று நீங்கள் திறம்பட முடிப்பீர்கள். குடும்ப உறுப்பினர்களுடனான உறவு இனிமையாகும். உடன் பிறந்தோர் உறவுகள் வலுப்பெறும். உங்களது ஆற்றலை சரியான வழியில் பயன்படுத்துவதன் மூலம் பெரிய வெற்றிகளை அடையலாம். பொது வாழ்வில் உங்கள் பெயர் உயரும்.",
    "prediction_en": "Today, being a Tuesday, the influence of Mars will enhance your leadership qualities and self-confidence, Leo natives. Today, you will approach every task with great courage. Your intuition will guide you correctly, so you can make specific decisions without hesitation. Today offers a good opportunity to complete long-pending tasks. By directing your energy appropriately, you can achieve unexpected successes. The attitude of bravely facing challenges will be a boon to you today. Your leadership qualities will be evident both in family and public life. You will naturally possess the ability to guide others.\n\nToday is a suitable day to resolve pending property-related issues. There is a possibility of favorable turns in legal matters. Your siblings will maintain good relations with you, and through them, you may receive good advice or assistance. Today is very beneficial for your personal growth. You can plan to learn new skills or refine existing ones. Constructive thoughts will arise in your mind. It is good to start implementing them immediately. You will feel a sense of speed and determination in every task. Your hard work and full commitment will yield good results today. By avoiding unnecessary arguments and acting calmly, you will be able to turn situations to your advantage. Physically and mentally, you will feel very strong today. There will be no hindrance in moving towards your goals. Even if minor obstacles appear, you will have the ability to skillfully overcome them.\n\nYour standing in public life will increase. New opportunities may arise through new connections. All your endeavors today will lay the foundation for great successes in the future. Your speaking skills and argumentative ability will be beneficial today. Your views will be accepted in important discussions. Everyone will recognize the fairness and conviction in your opinions. Investments or property-related decisions you make today will be profitable in the long run. Happiness and peace will prevail in your home. Harmonious relationships with relatives will continue. The growth of your children will bring you pride and satisfaction. Spiritual thoughts will calm your mind. They will help you act with renewed vigor. Every decision you make today will brighten your future. Therefore, act bravely without fear. Listen to your inner voice and act accordingly. Today will be a wonderful beginning for you. The planet Mars will grant you the mental courage to face any challenge with self-confidence. This is a day when your self-confidence will increase. It is a very opportune time to engage in new endeavors. You will skillfully complete long-pending tasks today. Family relationships will be sweet. Sibling bonds will strengthen. By utilizing your energy in the right way, you can achieve great successes. Your name will rise in public life.",
    "career_ta": "பணியிடத்தில் புதிய பொறுப்புகள் தேடி வரலாம். அவற்றை திறம்பட ஏற்று சிறப்பாகச் செயல்படுவீர்கள். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். உங்கள் முடிவுகளுக்கு உயர் அதிகாரிகளின் ஆதரவு கிடைக்கும். தொழில்முனைவோருக்கு புதிய ஒப்பந்தங்கள் கிடைக்கும்.",
    "career_en": "New responsibilities may come your way at work. You will skillfully accept and perform them excellently. You will receive cooperation from colleagues. You will have the courage to initiate new projects. Your decisions will receive support from higher authorities. Entrepreneurs will secure new contracts.",
    "finance_ta": "நிதிநிலை திருப்திகரமாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். சொத்து சம்பந்தமான முதலீடுகள் ஈட்டத்தை அளிக்கும் விதமாக அமையும். நீண்டகால முதலீடுகளைத் தொடங்க இது ஒரு நல்ல வாய்ப்பு. கொடுக்கல் வாங்கலில் கவனமும், நேர்மையும் நன்மை பயக்கும்.",
    "finance_en": "Financial status will be satisfactory. Expected money flow will occur. Property-related investments will be profitable. This is a good opportunity to start long-term investments. Caution and integrity in transactions will be beneficial.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். புத்துணர்ச்சியுடன் இருப்பீர்கள். வழக்கமான உடற்பயிற்சிகளை மேற்கொள்வது மேலும் நன்மைகளைத் தரும். மனதில் நேர்மறை எண்ணங்கள் மேலோங்கும்.",
    "health_en": "Physical health will be excellent. You will feel refreshed. Regular exercise will bring further benefits. Positive thoughts will prevail in your mind.",
    "lucky_number": "1",
    "lucky_color_ta": "செம்மஞ்சள்",
    "lucky_color_en": "Orange"
  },
  {
    "sign_ta": "கன்னி",
    "sign_en": "Virgo",
    "date": "24-02-2026",
    "prediction_ta": "கன்னி ராசிக்காரர்களே, இன்று செவ்வாய்க்கிழமை என்பதால், செவ்வாய் கோளின் செல்வாக்கு உங்கள் வாழ்வில் ஒரு புதிய ஒழுங்குமுறையையும், தெளிவான சிந்தனையையும் கொண்டு வரும். இன்று நீங்கள் எந்த ஒரு வேலையிலும் திட்டமிட்டு, கவனத்துடன் செயல்படுவீர்கள். உங்கள் பகுப்பாய்வுத் திறன் இன்று சிறப்பாக வெளிப்படும். அது உங்களை சரியான முடிவுகளை எடுக்க வழிநடத்தும். நீண்ட நாட்களாக நிலுவையில் உள்ள சில சிக்கலான வேலைகளுக்கு இன்று தீர்வு காண்பீர்கள். உங்கள் கடின உழைப்பும், அர்ப்பணிப்பும் இன்று நல்ல பலன்களைத் தரும். தேவையற்ற குழப்பங்கள் நீங்கி, மனதில் தெளிவு பிறக்கும். நீங்கள் மேற்கொள்ளும் ஒவ்வொரு முயற்சியிலும் வெற்றி உண்டாகும். சவால்களை துணிச்சலுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள்.\n\nஉங்கள் குடும்ப வாழ்க்கையில் இன்று அமைதியும், மகிழ்ச்சியும் நிலவும். குடும்ப உறுப்பினர்களுடனான உறவுகள் இணக்கமாக இருக்கும். குடும்பத்தின் நலன் கருதி இன்று சில குறிப்பான முடிவுகளை எடுப்பீர்கள். உடன் பிறந்தோர் உங்களுக்கு ஆதரவாக இருப்பார்கள். இல்லத்தில் மங்கல நிகழ்வுகள் குறித்த பேச்சுவார்த்தைகள் நடக்கலாம். புதிய வீடு வாங்குவதற்கோ அல்லது நிலம் வாங்குவதற்கோ இன்று நல்ல வாய்ப்புகள் கிடைக்கும். சொத்து சம்பந்தமான வேலைகள் இன்று துரிதமாக நடக்கும். நிலுவையில் உள்ள சட்டரீதியான பிரச்சனைகளுக்கு இன்று தீர்வு காண நன்மை பயக்கும் சூழ்நிலைகள் உருவாகும். உங்கள் இல்லத்தின் பராமரிப்பு வேலைகளை மேற்கொள்வதற்கு இது ஒரு நல்ல நாள். இது உங்கள் மனதிற்கு மகிழ்ச்சியையும், திருப்தியையும் அளிக்கும்.\n\nபணி மற்றும் தொழில் ரீதியாக இன்று ஒரு சிறப்பான நாள். உங்கள் கடின உழைப்பும், அர்ப்பணிப்பும் இன்று உயர் அதிகாரிகளால் பாராட்டப்படும். புதிய பொறுப்புகள் தேடி வரலாம். அவற்றை திறம்பட ஏற்று சிறப்பாகச் செயல்படுவீர்கள். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். தொழில்முனைவோருக்கு புதிய ஒப்பந்தங்கள் கிடைக்கும். வெளிநாட்டு வர்த்தகத்தில் ஈடுபடுவோருக்கு நல்ல ஈட்டம் கிடைக்கும். உங்கள் அறிவுசார்ந்த முடிவுகள் உங்களுக்கு நன்மை பயக்கும் விதமாக அமையும். நீங்கள் எடுக்கும் ஒவ்வொரு முயற்சியிலும் வெற்றி உண்டாகும். இன்று உங்களுக்கு புதிய வாய்ப்புகள் தேடி வரும்.\n\nகல்வித் துறையில் உள்ள மாணவர்களுக்கு இன்று ஒரு சிறந்த நாள். படிப்பில் ஆர்வம் அதிகரிக்கும். போட்டித் தேர்வுகளில் சிறப்பான முறையில் செயல்படுவீர்கள். புதிய பாடத்திட்டங்களை கற்றுக்கொள்வதில் வெற்றி பெறுவீர்கள். ஆசிரியர்களின் ஆதரவு கிடைக்கும். ஆராய்ச்சி மாணவர்களுக்கு இன்று புதிய தகவல்கள் கிடைக்கும். உங்கள் அறிவுத்தாகம் அதிகரிக்கும். உங்கள் மனதை ஒருமுகப்படுத்தி படிப்பது சிறப்பான பலனைத் தரும்.\n\nஉடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் இருந்த தேவையற்ற கவலைகள் நீங்கி, புத்துணர்ச்சி உண்டாகும். உடல் ரீதியாகவும், மன ரீதியாகவும் நீங்கள் இன்று மிகவும் வலிமையுடன் உணர்வீர்கள். சீரான உடற்பயிற்சிகளை மேற்கொள்வது மேலும் நன்மைகளைத் தரும். ஆரோக்கியமான உணவுப் பழக்கவழக்கங்களை கடைபிடிப்பது மிகவும் நல்லது. மனதை அமைதியாக வைத்துக்கொள்ள தியானம் அல்லது யோகா செய்யலாம். இது உங்கள் மனதிற்கு அமைதியையும், ஆற்றலையும் அளிக்கும்.\n\nநிதி நிலைமை இன்று வலுவாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைக்கப்படும். சேமிப்புகளை அதிகரிக்கும் வாய்ப்புகள் ஏற்படும். புதிய முதலீடுகளை மேற்கொள்ள இது ஒரு நல்ல நாள். குறிப்பாக, நீண்டகால முதலீடுகள் உங்களுக்கு எதிர்காலத்தில் பெரிய ஈட்டத்தை அளிக்கும். அறிவுசார்ந்த நிதி முடிவுகளை எடுப்பீர்கள். உங்கள் நிதி நிலைமை இன்று மேலும் வலுப்பெறும். சொத்து சம்பந்தமான முதலீடுகள் நல்ல பலனைத் தரும். உங்கள் திறமையான நிதி மேலாண்மைக்கு நல்ல பலன் கிடைக்கும். இன்று நீங்கள் மேற்கொள்ளும் நிதி சார்ந்த முடிவுகள் உங்களுக்கு நன்மை பயக்கும். இன்று உங்களுக்கு எதிர்பாராத நிதி வரவுகள் கிடைக்க வாய்ப்புள்ளது.",
    "prediction_en": "Today, being a Tuesday, the influence of Mars will bring a new order and clear thinking into your life, Virgo natives. Today, you will act with planning and care in every task. Your analytical skills will be excellently displayed today. This will guide you to make the right decisions. You will find solutions to some complex, long-pending tasks today. Your hard work and dedication will yield good results today. Unnecessary confusions will clear, bringing clarity to your mind. Every effort you make will lead to success. You will bravely face challenges and overcome them.\n\nToday, peace and happiness will prevail in your family life. Relationships with family members will be harmonious. Today, you will make some specific decisions for the well-being of your family. Siblings will be supportive of you. Discussions about auspicious events may take place in the home. Good opportunities will arise today for buying a new house or land. Property-related tasks will proceed quickly today. Favorable circumstances will arise today to resolve pending legal issues. This is a good day to undertake maintenance work for your home. This will bring joy and satisfaction to your mind.\n\nToday is an excellent day for career and business. Your hard work and dedication will be appreciated by higher authorities today. New responsibilities may come your way. You will skillfully accept and perform them excellently. You will receive cooperation from colleagues. You will have the courage to initiate new projects. Entrepreneurs will secure new contracts. Those involved in foreign trade will reap good profits. Your intelligent decisions will be beneficial for you. Every effort you make will lead to success. New opportunities will come your way today.\n\nFor students in the field of education, today is an excellent day. Interest in studies will increase. You will perform excellently in competitive exams. You will succeed in learning new curricula. You will receive support from teachers. Research students will receive new information today. Your thirst for knowledge will increase. Focusing your mind on studies will yield excellent results.\n\nPhysical health will be good. Unnecessary worries in your mind will disappear, and you will feel refreshed. You will feel very strong physically and mentally today. Regular exercise will bring further benefits. It is very good to adopt healthy eating habits. You can meditate or do yoga to keep your mind calm. This will bring peace and energy to your mind.\n\nFinancial situation will be strong today. Expected money flow will occur. Old debts will be repaid. Opportunities to increase savings will arise. This is a good day to make new investments. In particular, long-term investments will bring you significant profits in the future. You will make intelligent financial decisions. Your financial situation will strengthen further today. Property-related investments will yield good results. Your efficient financial management will bring good returns. Financial decisions you make today will be beneficial for you. You are likely to receive unexpected financial inflows today.",
    "career_ta": "பணியிடத்தில் உங்கள் கடின உழைப்பு பாராட்டப்படும். புதிய பொறுப்புகள் தேடி வரலாம். அவற்றை திறம்பட ஏற்று சிறப்பாகச் செயல்படுவீர்கள். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். தொழில்முனைவோருக்கு புதிய ஒப்பந்தங்கள் கிடைக்கும்.",
    "career_en": "Your hard work will be appreciated at work. New responsibilities may come your way. You will skillfully accept and perform them excellently. You will receive cooperation from colleagues. You will have the courage to initiate new projects. Entrepreneurs will secure new contracts.",
    "finance_ta": "நிதிநிலை வலுவாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைக்கப்படும். சேமிப்புகளை அதிகரிக்கும் வாய்ப்புகள் ஏற்படும். சொத்து சம்பந்தமான முதலீடுகள் நன்மை பயக்கும். இன்று எதிர்பாராத நிதி வரவுகள் கிடைக்கலாம்.",
    "finance_en": "Financial situation will be strong. Expected money flow will occur. Old debts will be repaid. Opportunities to increase savings will arise. Property-related investments will be beneficial. Unexpected financial inflows may occur today.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் இருந்த கவலைகள் நீங்கி புத்துணர்ச்சி உண்டாகும். உடல் ரீதியாகவும், மன ரீதியாகவும் வலிமையுடன் உணர்வீர்கள். ஆரோக்கியமான உணவுப் பழக்கம் நன்மைகளைத் தரும்.",
    "health_en": "Physical health will be good. Worries in your mind will clear, bringing freshness. You will feel strong physically and mentally. Healthy eating habits will bring benefits.",
    "lucky_number": "5",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "24-02-2026",
    "prediction_ta": "துலாம் ராசிக்காரர்களே, இன்று செவ்வாய்க்கிழமை என்பதால், செவ்வாய் கோளின் செல்வாக்கு உங்கள் வாழ்வில் ஒரு சமநிலையையும், இணக்கமான அணுகுமுறையையும் கொண்டு வரும். இன்று நீங்கள் எந்த ஒரு செயலிலும் நீதியுடனும், நியாயத்துடனும் செயல்படுவீர்கள். உங்கள் முடிவுகள் பலரின் நலன்களையும் கருத்தில் கொண்டதாக இருக்கும். நீண்ட நாட்களாக நிலுவையில் உள்ள சில உறவுச் சிக்கல்களுக்கு இன்று தீர்வு காண்பீர்கள். உங்கள் சமரச அணுகுமுறை இன்று பல நன்மைகளை ஈட்டித்தரும். மற்றவர்களுடன் இணக்கமாக பேசி, உங்கள் கருத்துக்களை தெளிவாக எடுத்துரைப்பீர்கள். சவால்களை துணிச்சலுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். இன்று நீங்கள் எடுக்கும் முடிவுகள் உங்கள் எதிர்காலத்திற்கு நன்மை பயக்கும் விதமாக அமையும்.\n\nஉங்கள் குடும்ப வாழ்க்கையில் இன்று மகிழ்ச்சியும், அமைதியும் நிலவும். உடன் பிறந்தோருடனான உறவுகள் வலுப்பெறும். அவர்களுடன் இணைந்து புதிய திட்டங்களை வகுப்பீர்கள். குடும்ப உறுப்பினர்களுடன் வெளியே சென்று வர வாய்ப்புள்ளது. இது உங்கள் மனதிற்கு புத்துணர்ச்சியை அளிக்கும். இல்லத்தில் ஒரு புதிய மாற்றத்தை உருவாக்க திட்டமிடுவீர்கள். வீட்டை புதுப்பித்தல் அல்லது அலங்கரித்தல் போன்ற வேலைகளை இன்று தொடங்கலாம். சொத்து சம்பந்தமான முடிவுகளை எடுக்க இது ஒரு நல்ல நாள். நிலுவையில் உள்ள சொத்து ஆவணங்கள் இன்று சரியாகும். நிலம் வாங்குவது அல்லது விற்பது போன்ற வேலைகளில் உங்களுக்கு நன்மை பயக்கும் திருப்பங்கள் ஏற்படும். சட்டரீதியான பிரச்சனைகளில் உங்களுக்கு ஆதரவான முடிவுகள் கிடைக்கும். உங்கள் இல்லத்தின் பாதுகாப்பு மற்றும் பராமரிப்பில் கவனம் செலுத்துவீர்கள். இது உங்கள் மனதிற்கு மகிழ்ச்சியையும், திருப்தியையும் அளிக்கும்.\n\nப பணி மற்றும் தொழில் ரீதியாக இன்று ஒரு சிறப்பான நாள். நீங்கள் தலைமைப் பொறுப்பை ஏற்க வேண்டிய சூழ்நிலைகள் ஏற்படலாம். அதை திறம்பட கையாண்டு வெற்றி பெறுவீர்கள். புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். உயர் அதிகாரிகளின் ஆதரவு உங்களுக்கு நன்மை பயக்கும் விதமாக அமையும். தொழில்முனைவோருக்கு புதிய வாடிக்கையாளர்கள் கிடைப்பார்கள். உங்கள் படைப்பாற்றல் இன்று சிறப்பாக வெளிப்படும். புதிய கண்டுபிடிப்புகள் மூலம் நீங்கள் பாராட்டப்படுவீர்கள். அயல்நாட்டு வர்த்தகத்தில் ஈடுபடுவோருக்கு இன்று நல்ல ஈட்டம் கிடைக்கும். இன்று உங்களுக்கு புதிய வாய்ப்புகள் தேடி வரும்.\n\nகல்வித் துறையில் உள்ள மாணவர்களுக்கு இன்று ஒரு சிறந்த நாள். படிப்பில் இருந்த தேக்க நிலை நீங்கி, புதிய ஊக்கம் பிறக்கும். ஆராய்ச்சி மாணவர்களுக்கு இன்று குறிப்பான கண்டுபிடிப்புகள் நிகழலாம். போட்டித் தேர்வுகளில் சிறப்பான முறையில் வெற்றி பெறுவீர்கள். புதிய திறமைகளைக் கற்றுக்கொள்வதற்கு இது ஒரு நல்ல நாள். உங்கள் கடின உழைப்புக்கு நல்ல பலன் கிடைக்கும். உங்கள் அறிவுத்திறன் இன்று சிறப்பான முறையில் வெளிப்படும்.\n\nஉடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் இருந்த தேவையற்ற கவலைகள் நீங்கி, புத்துணர்ச்சி உண்டாகும். சுறுசுறுப்புடனும், ஆற்றலுடனும் செயல்படுவீர்கள். உடற்பயிற்சிகளை மேற்கொள்வது மேலும் நன்மைகளைத் தரும். மனதை அமைதியாக வைத்துக்கொள்ள தியானம் அல்லது யோகா செய்யலாம். ஆரோக்கியமான உணவுப் பழக்கவழக்கங்களை கடைபிடிப்பது மிகவும் நல்லது. இது உங்கள் மனதிற்கு அமைதியையும், ஆற்றலையும் அளிக்கும்.\n\nநிதி நிலைமை இன்று சிறப்பாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைக்கப்படும். சேமிப்புகளை அதிகரிக்கும் வாய்ப்புகள் ஏற்படும். புதிய முதலீடுகளை மேற்கொள்ள இது ஒரு நல்ல நாள். குறிப்பாக, நீண்டகால முதலீடுகள் உங்களுக்கு எதிர்காலத்தில் பெரிய ஈட்டத்தை அளிக்கும். அறிவுசார்ந்த நிதி முடிவுகளை எடுப்பீர்கள். உங்கள் நிதி நிலைமை இன்று மேலும் வலுப்பெறும். சொத்து சம்பந்தமான முதலீடுகள் நல்ல பலனைத் தரும். உங்கள் திறமையான நிதி மேலாண்மைக்கு நல்ல பலன் கிடைக்கும். இன்று நீங்கள் மேற்கொள்ளும் நிதி சார்ந்த முடிவுகள் உங்களுக்கு நன்மை பயக்கும். இன்று உங்களுக்கு எதிர்பாராத நிதி வரவுகள் கிடைக்க வாய்ப்புள்ளது.",
    "prediction_en": "Today, being a Tuesday, the influence of Mars will bring a sense of balance and a harmonious approach to your life, Libra natives. Today, you will act with justice and fairness in every task. Your decisions will consider the well-being of many. You will find solutions to some long-pending relationship issues today. Your conciliatory approach today will bring many benefits. You will speak harmoniously with others and clearly express your views. You will bravely face challenges and overcome them. Decisions you make today will be beneficial for your future.\n\nToday, happiness and peace will prevail in your family life. Relationships with siblings will strengthen. You will plan new projects with them. There's a possibility of going out with family members, which will refresh your mind. You will plan to create a new change in your home. You can start tasks like renovating or decorating your house today. This is a good day to make property-related decisions. Pending property documents will be settled today. You will experience beneficial turns in tasks like buying or selling land. You will receive favorable outcomes in legal matters. You will pay attention to the safety and maintenance of your home. This will bring joy and satisfaction to your mind.\n\nToday is an excellent day for career and business. You may face situations where you have to take on leadership roles. You will skillfully manage them and succeed. You will have the courage to initiate new projects. You will receive cooperation from colleagues. Support from higher authorities will be beneficial for you. Entrepreneurs will gain new customers. Your creativity will be brilliantly expressed today. You will be appreciated for new innovations. Those involved in foreign trade will have good earnings today. New opportunities will come your way today.\n\nFor students in the field of education, today is an excellent day. Stagnation in studies will disappear, and new motivation will arise. Research students may experience specific discoveries today. You will perform excellently in competitive exams. This is a good day to learn new skills. Your hard work will yield good results. Your intellectual abilities will be brilliantly expressed today.\n\nPhysical health will be good. Unnecessary worries in your mind will disappear, and you will feel refreshed. You will feel very strong physically and mentally today. Regular exercise will bring further benefits. It is very good to adopt healthy eating habits. You can meditate or do yoga to keep your mind calm. This will bring peace and energy to your mind.\n\nFinancial situation will be excellent today. Expected money flow will occur. Old debts will be repaid. Opportunities to increase savings will arise. This is a good day to make new investments. In particular, long-term investments will bring you significant profits in the future. You will make intelligent financial decisions. Your financial situation will strengthen further today. Property-related investments will yield good results. Your efficient financial management will bring good returns. Financial decisions you make today will be beneficial for you. You are likely to receive unexpected financial inflows today.",
    "career_ta": "பணியிடத்தில் தலைமைப் பொறுப்பை திறம்பட கையாள்வீர்கள். புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். தொழில்முனைவோருக்கு புதிய வாடிக்கையாளர்கள் கிடைப்பார்கள். உங்கள் படைப்பாற்றல் சிறக்கும்.",
    "career_en": "You will skillfully handle leadership roles at work. You will have the courage to initiate new projects. You will receive cooperation from colleagues. Entrepreneurs will gain new customers. Your creativity will flourish.",
    "finance_ta": "நிதிநிலை சிறப்பாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைக்கப்படும். சேமிப்புகளை அதிகரிக்கும் வாய்ப்புகள் ஏற்படும். சொத்து சம்பந்தமான முதலீடுகள் நன்மை பயக்கும். இன்று எதிர்பாராத நிதி வரவுகள் கிடைக்கலாம்.",
    "finance_en": "Financial situation will be excellent. Expected money flow will occur. Old debts will be repaid. Opportunities to increase savings will arise. Property-related investments will be beneficial. Unexpected financial inflows may occur today.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் இருந்த கவலைகள் நீங்கி புத்துணர்ச்சி உண்டாகும். சுறுசுறுப்புடனும், ஆற்றலுடனும் செயல்படுவீர்கள். ஆரோக்கியமான உணவுப் பழக்கம் நன்மைகளைத் தரும்.",
    "health_en": "Physical health will be good. Worries in your mind will clear, bringing freshness. You will act with agility and energy. Healthy eating habits will bring benefits.",
    "lucky_number": "6",
    "lucky_color_ta": "கருநீலம்",
    "lucky_color_en": "Indigo"
  },
  {
    "sign_ta": "விருச்சிகம்",
    "sign_en": "Scorpio",
    "date": "24-02-2026",
    "prediction_ta": "விருச்சிக ராசிக்காரர்களே, இன்று செவ்வாய்க்கிழமை என்பதால், செவ்வாய் கோளின் செல்வாக்கு உங்கள் ராசிக்கு புதிய ஆற்றலையும், அசைக்க முடியாத உறுதியையும் அளிக்கப்போகிறது. இன்று நீங்கள் எந்த ஒரு செயலையும் மிகுந்த தன்னம்பிக்கையுடனும், ஆழ்ந்த நுண்ணறிவுடனும் அணுகுவீர்கள். உங்கள் உள்ளுணர்வு சரியாக வழிகாட்டும் என்பதால், தயக்கமின்றி குறிப்பான முடிவுகளை எடுக்கலாம். நீண்ட நாட்களாக நிலுவையில் உள்ள வேலைகளை முடிக்க இன்று ஒரு நல்ல வாய்ப்பு கிடைக்கும். உங்கள் ஆற்றலை சரியான திசையில் செலுத்துவதன் மூலம், எதிர்பாராத வெற்றிகளை ஈட்ட முடியும். சவால்களை தைரியமாக எதிர்கொள்ளும் மனப்பான்மை உங்களுக்கு இன்றைய நாளில் ஒரு வரப்பிரசாதமாக அமையும். குடும்பத்திலும் சரி, பொது வாழ்விலும் சரி, உங்களது உறுதியான நிலைப்பாடுகள் வெளிப்படும். அடுத்தவர்களை வழிநடத்தும் ஆற்றல் உங்களுக்கு இயல்பாகவே உண்டாகும்.\n\nநிலுவையில் உள்ள சொத்து சம்பந்தமான பிரச்சனைகளுக்கு இன்று தீர்வு காண உகந்த நாள். சட்டரீதியான விஷயங்களில் நன்மை பயக்கும் திருப்பங்கள் ஏற்படும் வாய்ப்பு உள்ளது. உங்கள் உடன் பிறந்தோர் உங்களுடன் நல்லுறவைப் பேணுவார்கள், அவர்கள் மூலமாக உங்களுக்கு ஒரு நல்ல ஆலோசனை அல்லது உதவி கிடைக்கலாம். இன்றைய நாள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கு மிகவும் நன்மை பயக்கும். புதிய திறன்களைக் கற்றுக்கொள்ளவோ அல்லது ஏற்கனவே உள்ள திறமைகளை மெருகூட்டவோ திட்டமிடலாம். ஆக்கபூர்வமான சிந்தனைகள் உங்கள் மனதில் தோன்றும். அவற்றை உடனடியாக செயல்படுத்தத் தொடங்குவது நல்லது. எந்த ஒரு வேலையிலும் ஒருவித வேகத்தையும், உறுதியையும் காண முடியும். உங்களுடைய கடின உழைப்பும், முழு ஈடுபாடும் இன்று நல்ல பலன்களைத் தரும். தேவையற்ற வாக்குவாதங்களைத் தவிர்த்து, அமைதியுடன் செயல்பட்டால், சூழ்நிலைகளை உங்களுக்கு நன்மை பயக்கும் விதமாக மாற்றிக்கொள்ள முடியும். உடல் ரீதியாகவும், மன ரீதியாகவும் நீங்கள் இன்று மிகவும் வலிமையுடன் உணர்வீர்கள். உங்கள் இலக்குகளை நோக்கி முன்னேறுவதில் எந்தவித தடங்கலும் இருக்காது. சிறுசிறு தடைகள் தோன்றினாலும், அவற்றை திறம்பட சமாளிக்கும் ஆற்றல் உங்களுக்கு இருக்கும்.\n\nபொது வாழ்வில் உங்கள் மதிப்பு உயரும். புதிய தொடர்புகள் மூலம் புதிய வாய்ப்புகள் உருவாகலாம். இன்று நீங்கள் மேற்கொள்ளும் முயற்சிகள் அனைத்தும் எதிர்காலத்தில் பெரும் வெற்றிகளுக்கு அடித்தளமாக அமையும். உங்கள் பேச்சுத் திறமையும், வாதத் திறமையும் இன்று உங்களுக்கு நன்மை பயக்கும். குறிப்பான கலந்துரையாடல்களில் உங்கள் கருத்துக்கள் ஏற்கப்படும். உங்கள் கருத்துக்களில் உள்ள நியாயத்தையும், உறுதியையும் அனைவரும் உணர்வார்கள். இன்று நீங்கள் செய்யும் முதலீடுகள் அல்லது சொத்து சம்பந்தமான முடிவுகள் நீண்ட காலத்திற்கு ஈட்டத்தை ஈட்டித்தரும். உங்கள் இல்லத்தில் மகிழ்ச்சியும், அமைதியும் நிலைக்கும். உறவினர்களுடன் இணக்கமான உறவு நீடிக்கும். பிள்ளைகளின் வளர்ச்சி உங்களுக்கு பெருமையையும், மன நிறைவையும் அளிக்கும். ஆன்மீக ரீதியான சிந்தனைகள் உங்கள் மனதை அமைதிப்படுத்தும். புத்துணர்ச்சியுடன் செயல்பட உதவும். இன்று நீங்கள் எடுக்கும் ஒவ்வொரு முடிவும் உங்கள் எதிர்காலத்தை ஒளிமயமாக்கும். எனவே, பயமின்றி தைரியமாக செயல்படுங்கள். உங்கள் உள்மனதின் குரலுக்கு செவிசாய்த்து செயல்படுங்கள். இன்றைய நாள் உங்களுக்கு ஒரு அற்புதமான ஆரம்பமாக அமையும். எந்த ஒரு சவாலையும் தன்னம்பிக்கையுடன் எதிர்கொள்ளும் மன தைரியத்தை செவ்வாய் கோள் உங்களுக்கு வழங்கும். உங்கள் தன்னம்பிக்கை அதிகரிக்கும் நாள் இது. புதிய முயற்சிகளில் ஈடுபடுவதற்கு இது மிகவும் உகந்த நேரம். நீண்டகாலமாக நிலுவையில் உள்ள வேலைகளை இன்று நீங்கள் திறம்பட முடிப்பீர்கள். குடும்ப உறுப்பினர்களுடனான உறவு இனிமையாகும். உடன் பிறந்தோர் உறவுகள் வலுப்பெறும். உங்களது ஆற்றலை சரியான வழியில் பயன்படுத்துவதன் மூலம் பெரிய வெற்றிகளை அடையலாம். பொது வாழ்வில் உங்கள் பெயர் உயரும்.",
    "prediction_en": "Today, being a Tuesday, the influence of Mars will bring new energy and unshakeable determination to your Scorpio sign. Today, you will approach every task with great confidence and deep insight. Your intuition will guide you correctly, so you can make specific decisions without hesitation. Today offers a good opportunity to complete long-pending tasks. By directing your energy appropriately, you can achieve unexpected successes. The attitude of bravely facing challenges will be a boon to you today. Your firm stances will be evident both in family and public life. You will naturally possess the ability to guide others.\n\nToday is a suitable day to resolve pending property-related issues. There is a possibility of favorable turns in legal matters. Your siblings will maintain good relations with you, and through them, you may receive good advice or assistance. Today is very beneficial for your personal growth. You can plan to learn new skills or refine existing ones. Constructive thoughts will arise in your mind. It is good to start implementing them immediately. You will feel a sense of speed and determination in every task. Your hard work and full commitment will yield good results today. By avoiding unnecessary arguments and acting calmly, you will be able to turn situations to your advantage. Physically and mentally, you will feel very strong today. There will be no hindrance in moving towards your goals. Even if minor obstacles appear, you will have the ability to skillfully overcome them.\n\nYour standing in public life will increase. New opportunities may arise through new connections. All your endeavors today will lay the foundation for great successes in the future. Your speaking skills and argumentative ability will be beneficial today. Your views will be accepted in important discussions. Everyone will recognize the fairness and conviction in your opinions. Investments or property-related decisions you make today will be profitable in the long run. Happiness and peace will prevail in your home. Harmonious relationships with relatives will continue. The growth of your children will bring you pride and satisfaction. Spiritual thoughts will calm your mind. They will help you act with renewed vigor. Every decision you make today will brighten your future. Therefore, act bravely without fear. Listen to your inner voice and act accordingly. Today will be a wonderful beginning for you. The planet Mars will grant you the mental courage to face any challenge with self-confidence. This is a day when your self-confidence will increase. It is a very opportune time to engage in new endeavors. You will skillfully complete long-pending tasks today. Family relationships will be sweet. Sibling bonds will strengthen. By utilizing your energy in the right way, you can achieve great successes. Your name will rise in public life.",
    "career_ta": "பணியிடத்தில் புதிய பொறுப்புகள் தேடி வரலாம். அவற்றை திறம்பட ஏற்று சிறப்பாகச் செயல்படுவீர்கள். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். உங்கள் முடிவுகளுக்கு உயர் அதிகாரிகளின் ஆதரவு கிடைக்கும். தொழில்முனைவோருக்கு புதிய ஒப்பந்தங்கள் கிடைக்கும்.",
    "career_en": "New responsibilities may come your way at work. You will skillfully accept and perform them excellently. You will receive cooperation from colleagues. You will have the courage to initiate new projects. Your decisions will receive support from higher authorities. Entrepreneurs will secure new contracts.",
    "finance_ta": "நிதிநிலை திருப்திகரமாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். சொத்து சம்பந்தமான முதலீடுகள் ஈட்டத்தை அளிக்கும் விதமாக அமையும். நீண்டகால முதலீடுகளைத் தொடங்க இது ஒரு நல்ல வாய்ப்பு. கொடுக்கல் வாங்கலில் கவனமும், நேர்மையும் நன்மை பயக்கும்.",
    "finance_en": "Financial status will be satisfactory. Expected money flow will occur. Property-related investments will be profitable. This is a good opportunity to start long-term investments. Caution and integrity in transactions will be beneficial.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். புத்துணர்ச்சியுடன் இருப்பீர்கள். வழக்கமான உடற்பயிற்சிகளை மேற்கொள்வது மேலும் நன்மைகளைத் தரும். மனதில் நேர்மறை எண்ணங்கள் மேலோங்கும்.",
    "health_en": "Physical health will be excellent. You will feel refreshed. Regular exercise will bring further benefits. Positive thoughts will prevail in your mind.",
    "lucky_number": "9",
    "lucky_color_ta": "அடர் சிவப்பு",
    "lucky_color_en": "Dark Red"
  },
  {
    "sign_ta": "தனுசு",
    "sign_en": "Sagittarius",
    "date": "24-02-2026",
    "prediction_ta": "தனுசு ராசிக்காரர்களே, இன்று செவ்வாய்க்கிழமை என்பதால், செவ்வாய் கோளின் செல்வாக்கு உங்கள் ராசிக்கு புதிய அறிவையும், விரிவாக்கத்திற்கான ஊக்கத்தையும் அளிக்கப்போகிறது. இன்று நீங்கள் புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் எல்லைகளை விரிவுபடுத்துவதற்கும் மிகுந்த ஆர்வம் காட்டுவீர்கள். தொலைநோக்கு சிந்தனையுடன் செயல்பட்டு, நீண்டகால திட்டங்களை வகுப்பீர்கள். உங்கள் துணிச்சலும், நேர்மையும் இன்று பல நன்மைகளை ஈட்டித்தரும். நீங்கள் எடுக்கும் குறிப்பான முடிவுகள் எதிர்காலத்தில் பெரிய வெற்றிகளுக்கு வழிவகுக்கும். சவால்களை தைரியமாக எதிர்கொண்டு, அவற்றை வெற்றிக்கான படிகளாக மாற்றுவீர்கள். அயல்நாட்டு தொடர்புகள் மூலமாக புதிய வாய்ப்புகள் உருவாகலாம். உங்கள் மனதில் இருந்த குழப்பங்கள் நீங்கி தெளிவு பிறக்கும்.\n\nஉங்கள் குடும்ப வாழ்க்கையில் இன்று மகிழ்ச்சியும், அமைதியும் நிலவும். குடும்ப உறுப்பினர்களுடனான உறவுகள் இணக்கமாக இருக்கும். குறிப்பாக, பெற்றோர்களுடனான உறவில் ஒருவித புரிதலும், அன்பும் அதிகரிக்கும். உடன் பிறந்தோர் உங்களுக்கு ஆதரவாக இருப்பார்கள். அவர்களுடன் இணைந்து புதிய திட்டங்களை வகுப்பீர்கள். இல்லத்தில் மங்கல நிகழ்வுகள் குறித்த பேச்சுவார்த்தைகள் நடக்க வாய்ப்புள்ளது. புதிய வீடு கட்டுவதற்கோ அல்லது நிலம் வாங்குவதற்கோ இன்று நல்ல வாய்ப்புகள் கிடைக்கும். சொத்து சம்பந்தமான ஆவண வேலைகள் இன்று துரிதமாக நடக்கும். நிலுவையில் உள்ள சட்டரீதியான பிரச்சனைகளுக்கு இன்று தீர்வு காண நன்மை பயக்கும் சூழ்நிலைகள் உருவாகும். உங்கள் இல்லத்தின் பாதுகாப்பு மற்றும் பராமரிப்பில் கவனம் செலுத்துவீர்கள். இது உங்கள் மனதிற்கு மகிழ்ச்சியையும், திருப்தியையும் அளிக்கும்.\n\nபணி மற்றும் தொழில் ரீதியாக இன்று ஒரு சிறப்பான நாள். உங்கள் கடின உழைப்பும், அர்ப்பணிப்பும் இன்று உயர் அதிகாரிகளால் பாராட்டப்படும். புதிய பொறுப்புகள் தேடி வரலாம். அவற்றை திறம்பட ஏற்று சிறப்பாகச் செயல்படுவீர்கள். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். தொழில்முனைவோருக்கு புதிய ஒப்பந்தங்கள் கிடைக்கும். வெளிநாட்டு வர்த்தகத்தில் ஈடுபடுவோருக்கு நல்ல ஈட்டம் கிடைக்கும். உங்கள் அறிவுசார்ந்த முடிவுகள் உங்களுக்கு நன்மை பயக்கும் விதமாக அமையும். நீங்கள் எடுக்கும் ஒவ்வொரு முயற்சியிலும் வெற்றி உண்டாகும். இன்று உங்களுக்கு புதிய வாய்ப்புகள் தேடி வரும்.\n\nகல்வித் துறையில் உள்ள மாணவர்களுக்கு இன்று ஒரு சிறந்த நாள். படிப்பில் ஆர்வம் அதிகரிக்கும். போட்டித் தேர்வுகளில் சிறப்பான முறையில் செயல்படுவீர்கள். புதிய பாடத்திட்டங்களை கற்றுக்கொள்வதில் வெற்றி பெறுவீர்கள். ஆசிரியர்களின் ஆதரவு கிடைக்கும். ஆராய்ச்சி மாணவர்களுக்கு இன்று புதிய தகவல்கள் கிடைக்கும். உங்கள் அறிவுத்தாகம் அதிகரிக்கும். உங்கள் மனதை ஒருமுகப்படுத்தி படிப்பது சிறப்பான பலனைத் தரும்.\n\nஉடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் இருந்த தேவையற்ற கவலைகள் நீங்கி, புத்துணர்ச்சி உண்டாகும். உடல் ரீதியாகவும், மன ரீதியாகவும் நீங்கள் இன்று மிகவும் வலிமையுடன் உணர்வீர்கள். சீரான உடற்பயிற்சிகளை மேற்கொள்வது மேலும் நன்மைகளைத் தரும். ஆரோக்கியமான உணவுப் பழக்கவழக்கங்களை கடைபிடிப்பது மிகவும் நல்லது. மனதை அமைதியாக வைத்துக்கொள்ள தியானம் அல்லது யோகா செய்யலாம். இது உங்கள் மனதிற்கு அமைதியையும், ஆற்றலையும் அளிக்கும்.\n\nநிதி நிலைமை இன்று வலுவாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைக்கப்படும். சேமிப்புகளை அதிகரிக்கும் வாய்ப்புகள் ஏற்படும். புதிய முதலீடுகளை மேற்கொள்ள இது ஒரு நல்ல நாள். குறிப்பாக, நீண்டகால முதலீடுகள் உங்களுக்கு எதிர்காலத்தில் பெரிய ஈட்டத்தை அளிக்கும். அறிவுசார்ந்த நிதி முடிவுகளை எடுப்பீர்கள். உங்கள் நிதி நிலைமை இன்று மேலும் வலுப்பெறும். சொத்து சம்பந்தமான முதலீடுகள் நல்ல பலனைத் தரும். உங்கள் திறமையான நிதி மேலாண்மைக்கு நல்ல பலன் கிடைக்கும். இன்று நீங்கள் மேற்கொள்ளும் நிதி சார்ந்த முடிவுகள் உங்களுக்கு நன்மை பயக்கும். இன்று உங்களுக்கு எதிர்பாராத நிதி வரவுகள் கிடைக்க வாய்ப்புள்ளது.",
    "prediction_en": "Today, being a Tuesday, the influence of Mars will bring new knowledge and motivation for expansion to your Sagittarius sign. Today, you will show great interest in learning new things and expanding your horizons. You will act with foresight and formulate long-term plans. Your courage and honesty will bring many benefits today. The specific decisions you make will lead to great successes in the future. You will bravely face challenges and turn them into stepping stones to success. New opportunities may arise through foreign contacts. Confusions in your mind will clear, bringing clarity.\n\nToday, happiness and peace will prevail in your family life. Relationships with family members will be harmonious. In particular, understanding and affection in relationships with parents will increase. Siblings will be supportive of you. You will plan new projects with them. Discussions about auspicious events may take place in the home. Good opportunities will arise today for building a new house or buying land. Property-related documentation will proceed quickly today. Favorable circumstances will arise today to resolve pending legal issues. You will focus on the safety and maintenance of your home. This will bring joy and satisfaction to your mind.\n\nToday is an excellent day for career and business. Your hard work and dedication will be appreciated by higher authorities today. New responsibilities may come your way. You will skillfully accept and perform them excellently. You will receive cooperation from colleagues. You will have the courage to initiate new projects. Entrepreneurs will secure new contracts. Those involved in foreign trade will reap good profits. Your intelligent decisions will be beneficial for you. Every effort you make will lead to success. New opportunities will come your way today.\n\nFor students in the field of education, today is an excellent day. Interest in studies will increase. You will perform excellently in competitive exams. You will succeed in learning new curricula. You will receive support from teachers. All your efforts will be successful. Research you undertake today will yield good results. Your intellect will be brilliantly expressed today.\n\nPhysical health will be good. Unnecessary worries in your mind will disappear, and you will feel refreshed. You will feel very strong physically and mentally today. Regular exercise will bring further benefits. It is very good to adopt healthy eating habits. You can meditate or do yoga to keep your mind calm. This will bring peace and energy to your mind.\n\nFinancial situation will be strong today. Expected money flow will occur. Old debts will be repaid. Opportunities to increase savings will arise. This is a good day to make new investments. In particular, long-term investments will bring you significant profits in the future. You will make intelligent financial decisions. Your financial situation will strengthen further today. Property-related investments will yield good results. Your efficient financial management will bring good returns. Financial decisions you make today will be beneficial for you. You are likely to receive unexpected financial inflows today.",
    "career_ta": "பணியிடத்தில் புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். உங்கள் கடின உழைப்பு பாராட்டப்படும். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். தொழில்முனைவோருக்கு புதிய ஒப்பந்தங்கள் கிடைக்கும். வெளிநாட்டு வர்த்தகத்தில் ஈடுபடுவோருக்கு நல்ல ஈட்டம் உண்டு.",
    "career_en": "You will have the courage to initiate new projects at work. Your hard work will be appreciated. You will receive cooperation from colleagues. Entrepreneurs will secure new contracts. Those involved in foreign trade will have good earnings.",
    "finance_ta": "நிதிநிலை வலுவாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைக்கப்படும். சேமிப்புகளை அதிகரிக்கும் வாய்ப்புகள் ஏற்படும். சொத்து சம்பந்தமான முதலீடுகள் நன்மை பயக்கும். இன்று எதிர்பாராத நிதி வரவுகள் கிடைக்கலாம்.",
    "finance_en": "Financial situation will be strong. Expected money flow will occur. Old debts will be repaid. Opportunities to increase savings will arise. Property-related investments will be beneficial. Unexpected financial inflows may occur today.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் இருந்த கவலைகள் நீங்கி புத்துணர்ச்சி உண்டாகும். உடல் ரீதியாகவும், மன ரீதியாகவும் வலிமையுடன் உணர்வீர்கள். ஆரோக்கியமான உணவுப் பழக்கம் நன்மைகளைத் தரும்.",
    "health_en": "Physical health will be good. Worries in your mind will clear, bringing freshness. You will feel strong physically and mentally. Healthy eating habits will bring benefits.",
    "lucky_number": "3",
    "lucky_color_ta": "பொன்னிறம்",
    "lucky_color_en": "Golden"
  },
  {
    "sign_ta": "மகரம்",
    "sign_en": "Capricorn",
    "date": "24-02-2026",
    "prediction_ta": "மகர ராசிக்காரர்களே, இன்று செவ்வாய்க்கிழமை என்பதால், செவ்வாய் கோளின் செல்வாக்கு உங்கள் வாழ்வில் ஒரு புதிய ஒழுங்குமுறையையும், நிலையான முன்னேற்றத்தையும் கொண்டு வரும். இன்று நீங்கள் எந்த ஒரு செயலிலும் மிகுந்த பொறுமையுடனும், உறுதியுடனும் செயல்படுவீர்கள். உங்கள் கடின உழைப்பும், ஒழுக்கமும் இன்று நல்ல பலன்களைத் தரும். நீண்ட நாட்களாக நிலுவையில் உள்ள சில சிக்கலான வேலைகளுக்கு இன்று தீர்வு காண்பீர்கள். உங்கள் திட்டமிட்ட அணுகுமுறை இன்று பல நன்மைகளை ஈட்டித்தரும். சவால்களை துணிச்சலுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். நீங்கள் மேற்கொள்ளும் ஒவ்வொரு முயற்சியிலும் வெற்றி உண்டாகும். உங்கள் மனதில் இருந்த தேவையற்ற குழப்பங்கள் நீங்கி, தெளிவு பிறக்கும்.\n\nஉங்கள் குடும்ப வாழ்க்கையில் இன்று அமைதியும், மகிழ்ச்சியும் நிலவும். குடும்ப உறுப்பினர்களுடனான உறவுகள் இணக்கமாக இருக்கும். குடும்பத்தின் நலன் கருதி இன்று சில குறிப்பான முடிவுகளை எடுப்பீர்கள். உடன் பிறந்தோர் உங்களுக்கு ஆதரவாக இருப்பார்கள். இல்லத்தில் மங்கல நிகழ்வுகள் குறித்த பேச்சுவார்த்தைகள் நடக்கலாம். புதிய வீடு வாங்குவதற்கோ அல்லது நிலம் வாங்குவதற்கோ இன்று நல்ல வாய்ப்புகள் கிடைக்கும். சொத்து சம்பந்தமான வேலைகள் இன்று துரிதமாக நடக்கும். நிலுவையில் உள்ள சட்டரீதியான பிரச்சனைகளுக்கு இன்று தீர்வு காண நன்மை பயக்கும் சூழ்நிலைகள் உருவாகும். உங்கள் இல்லத்தின் பராமரிப்பு வேலைகளை மேற்கொள்வதற்கு இது ஒரு நல்ல நாள். இது உங்கள் மனதிற்கு மகிழ்ச்சியையும், திருப்தியையும் அளிக்கும்.\n\nப பணி மற்றும் தொழில் ரீதியாக இன்று ஒரு சிறப்பான நாள். உங்கள் கடின உழைப்பும், அர்ப்பணிப்பும் இன்று உயர் அதிகாரிகளால் பாராட்டப்படும். புதிய பொறுப்புகள் தேடி வரலாம். அவற்றை திறம்பட ஏற்று சிறப்பாகச் செயல்படுவீர்கள். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். தொழில்முனைவோருக்கு புதிய ஒப்பந்தங்கள் கிடைக்கும். வெளிநாட்டு வர்த்தகத்தில் ஈடுபடுவோருக்கு நல்ல ஈட்டம் கிடைக்கும். உங்கள் அறிவுசார்ந்த முடிவுகள் உங்களுக்கு நன்மை பயக்கும் விதமாக அமையும். நீங்கள் எடுக்கும் ஒவ்வொரு முயற்சியிலும் வெற்றி உண்டாகும். இன்று உங்களுக்கு புதிய வாய்ப்புகள் தேடி வரும்.\n\nகல்வித் துறையில் உள்ள மாணவர்களுக்கு இன்று ஒரு சிறந்த நாள். படிப்பில் ஆர்வம் அதிகரிக்கும். போட்டித் தேர்வுகளில் சிறப்பான முறையில் செயல்படுவீர்கள். புதிய பாடத்திட்டங்களை கற்றுக்கொள்வதில் வெற்றி பெறுவீர்கள். ஆசிரியர்களின் ஆதரவு கிடைக்கும். ஆராய்ச்சி மாணவர்களுக்கு இன்று புதிய தகவல்கள் கிடைக்கும். உங்கள் அறிவுத்தாகம் அதிகரிக்கும். உங்கள் மனதை ஒருமுகப்படுத்தி படிப்பது சிறப்பான பலனைத் தரும்.\n\nஉடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் இருந்த தேவையற்ற கவலைகள் நீங்கி, புத்துணர்ச்சி உண்டாகும். உடல் ரீதியாகவும், மன ரீதியாகவும் நீங்கள் இன்று மிகவும் வலிமையுடன் உணர்வீர்கள். சீரான உடற்பயிற்சிகளை மேற்கொள்வது மேலும் நன்மைகளைத் தரும். ஆரோக்கியமான உணவுப் பழக்கவழக்கங்களை கடைபிடிப்பது மிகவும் நல்லது. மனதை அமைதியாக வைத்துக்கொள்ள தியானம் அல்லது யோகா செய்யலாம். இது உங்கள் மனதிற்கு அமைதியையும், ஆற்றலையும் அளிக்கும்.\n\nநிதி நிலைமை இன்று வலுவாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைக்கப்படும். சேமிப்புகளை அதிகரிக்கும் வாய்ப்புகள் ஏற்படும். புதிய முதலீடுகளை மேற்கொள்ள இது ஒரு நல்ல நாள். குறிப்பாக, நீண்டகால முதலீடுகள் உங்களுக்கு எதிர்காலத்தில் பெரிய ஈட்டத்தை அளிக்கும். அறிவுசார்ந்த நிதி முடிவுகளை எடுப்பீர்கள். உங்கள் நிதி நிலைமை இன்று மேலும் வலுப்பெறும். சொத்து சம்பந்தமான முதலீடுகள் நல்ல பலனைத் தரும். உங்கள் திறமையான நிதி மேலாண்மைக்கு நல்ல பலன் கிடைக்கும். இன்று நீங்கள் மேற்கொள்ளும் நிதி சார்ந்த முடிவுகள் உங்களுக்கு நன்மை பயக்கும். இன்று உங்களுக்கு எதிர்பாராத நிதி வரவுகள் கிடைக்க வாய்ப்புள்ளது.",
    "prediction_en": "Today, being a Tuesday, the influence of Mars will bring a new order and stable progress into your life, Capricorn natives. Today, you will act with great patience and determination in every task. Your hard work and discipline will yield good results today. You will find solutions to some complex, long-pending tasks today. Your planned approach today will bring many benefits. You will bravely face challenges and overcome them. Every effort you make will lead to success. Unnecessary confusions in your mind will clear, bringing clarity.\n\nToday, peace and happiness will prevail in your family life. Relationships with family members will be harmonious. Today, you will make some specific decisions for the well-being of your family. Siblings will be supportive of you. Discussions about auspicious events may take place in the home. Good opportunities will arise today for building a new house or buying land. Property-related tasks will proceed quickly today. Favorable circumstances will arise today to resolve pending legal issues. This is a good day to undertake maintenance work for your home. This will bring joy and satisfaction to your mind.\n\nToday is an excellent day for career and business. Your hard work and dedication will be appreciated by higher authorities today. New responsibilities may come your way. You will skillfully accept and perform them excellently. You will receive cooperation from colleagues. You will have the courage to initiate new projects. Entrepreneurs will secure new contracts. Those involved in foreign trade will reap good profits. Your intelligent decisions will be beneficial for you. Every effort you make will lead to success. New opportunities will come your way today.\n\nFor students in the field of education, today is an excellent day. Interest in studies will increase. You will perform excellently in competitive exams. You will succeed in learning new curricula. You will receive support from teachers. Research students will receive new information today. Your thirst for knowledge will increase. Focusing your mind on studies will yield excellent results.\n\nPhysical health will be good. Unnecessary worries in your mind will disappear, and you will feel refreshed. You will feel very strong physically and mentally today. Regular exercise will bring further benefits. It is very good to adopt healthy eating habits. You can meditate or do yoga to keep your mind calm. This will bring peace and energy to your mind.\n\nFinancial situation will be strong today. Expected money flow will occur. Old debts will be repaid. Opportunities to increase savings will arise. This is a good day to make new investments. In particular, long-term investments will bring you significant profits in the future. You will make intelligent financial decisions. Your financial situation will strengthen further today. Property-related investments will yield good results. Your efficient financial management will bring good returns. Financial decisions you make today will be beneficial for you. You are likely to receive unexpected financial inflows today.",
    "career_ta": "பணியிடத்தில் உங்கள் கடின உழைப்பு பாராட்டப்படும். புதிய பொறுப்புகள் தேடி வரலாம். அவற்றை திறம்பட ஏற்று சிறப்பாகச் செயல்படுவீர்கள். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். தொழில்முனைவோருக்கு புதிய ஒப்பந்தங்கள் கிடைக்கும்.",
    "career_en": "Your hard work will be appreciated at work. New responsibilities may come your way. You will skillfully accept and perform them excellently. You will receive cooperation from colleagues. You will have the courage to initiate new projects. Entrepreneurs will secure new contracts.",
    "finance_ta": "நிதிநிலை வலுவாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைக்கப்படும். சேமிப்புகளை அதிகரிக்கும் வாய்ப்புகள் ஏற்படும். சொத்து சம்பந்தமான முதலீடுகள் நன்மை பயக்கும். இன்று எதிர்பாராத நிதி வரவுகள் கிடைக்கலாம்.",
    "finance_en": "Financial situation will be strong. Expected money flow will occur. Old debts will be repaid. Opportunities to increase savings will arise. Property-related investments will be beneficial. Unexpected financial inflows may occur today.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் இருந்த கவலைகள் நீங்கி புத்துணர்ச்சி உண்டாகும். உடல் ரீதியாகவும், மன ரீதியாகவும் வலிமையுடன் உணர்வீர்கள். ஆரோக்கியமான உணவுப் பழக்கம் நன்மைகளைத் தரும்.",
    "health_en": "Physical health will be good. Worries in your mind will clear, bringing freshness. You will feel strong physically and mentally. Healthy eating habits will bring benefits.",
    "lucky_number": "8",
    "lucky_color_ta": "கருப்பு",
    "lucky_color_en": "Black"
  },
  {
    "sign_ta": "கும்பம்",
    "sign_en": "Aquarius",
    "date": "24-02-2026",
    "prediction_ta": "கும்ப ராசிக்காரர்களே, இன்று செவ்வாய்க்கிழமை என்பதால், செவ்வாய் கோளின் செல்வாக்கு உங்கள் புதுமையான சிந்தனைகளுக்கும், சமூக நலன் சார்ந்த வேலைகளுக்கும் புதிய ஊக்கத்தை அளிக்கும். இன்று நீங்கள் எதிர்கால திட்டங்களை வகுப்பதிலும், புதிய கண்டுபிடிப்புகளிலும் ஆர்வம் காட்டுவீர்கள். உங்கள் சமூக அக்கறை இன்று பலராலும் பாராட்டப்படும். பொது வாழ்வில் உங்கள் பங்கு அதிகரிக்கும். நீண்ட நாட்களாக நிலுவையில் உள்ள சில குறிப்பான வேலைகளுக்கு இன்று தீர்வு காண்பீர்கள். உங்கள் பகுப்பாய்வுத் திறனும், அறிவாற்றலும் இன்று சிறப்பாக வெளிப்படும். அது உங்களை சரியான முடிவுகளை எடுக்க வழிநடத்தும். சவால்களை துணிச்சலுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். நீங்கள் மேற்கொள்ளும் ஒவ்வொரு முயற்சியிலும் வெற்றி உண்டாகும்.\n\nஉங்கள் குடும்ப வாழ்க்கையில் இன்று அமைதியும், மகிழ்ச்சியும் நிலவும். குடும்ப உறுப்பினர்களுடனான உறவுகள் இணக்கமாக இருக்கும். குடும்பத்தின் நலன் கருதி இன்று சில குறிப்பான முடிவுகளை எடுப்பீர்கள். உடன் பிறந்தோர் உங்களுக்கு ஆதரவாக இருப்பார்கள். இல்லத்தில் மங்கல நிகழ்வுகள் குறித்த பேச்சுவார்த்தைகள் நடக்கலாம். புதிய வீடு வாங்குவதற்கோ அல்லது நிலம் வாங்குவதற்கோ இன்று நல்ல வாய்ப்புகள் கிடைக்கும். சொத்து சம்பந்தமான வேலைகள் இன்று துரிதமாக நடக்கும். நிலுவையில் உள்ள சட்டரீதியான பிரச்சனைகளுக்கு இன்று தீர்வு காண நன்மை பயக்கும் சூழ்நிலைகள் உருவாகும். உங்கள் இல்லத்தின் பராமரிப்பு வேலைகளை மேற்கொள்வதற்கு இது ஒரு நல்ல நாள். இது உங்கள் மனதிற்கு மகிழ்ச்சியையும், திருப்தியையும் அளிக்கும்.\n\nப பணி மற்றும் தொழில் ரீதியாக இன்று ஒரு சிறப்பான நாள். உங்கள் கடின உழைப்பும், அர்ப்பணிப்பும் இன்று உயர் அதிகாரிகளால் பாராட்டப்படும். புதிய பொறுப்புகள் தேடி வரலாம். அவற்றை திறம்பட ஏற்று சிறப்பாகச் செயல்படுவீர்கள். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். தொழில்முனைவோருக்கு புதிய ஒப்பந்தங்கள் கிடைக்கும். வெளிநாட்டு வர்த்தகத்தில் ஈடுபடுவோருக்கு நல்ல ஈட்டம் கிடைக்கும். உங்கள் அறிவுசார்ந்த முடிவுகள் உங்களுக்கு நன்மை பயக்கும் விதமாக அமையும். நீங்கள் எடுக்கும் ஒவ்வொரு முயற்சியிலும் வெற்றி உண்டாகும். இன்று உங்களுக்கு புதிய வாய்ப்புகள் தேடி வரும்.\n\nகல்வித் துறையில் உள்ள மாணவர்களுக்கு இன்று ஒரு சிறந்த நாள். படிப்பில் ஆர்வம் அதிகரிக்கும். போட்டித் தேர்வுகளில் சிறப்பான முறையில் செயல்படுவீர்கள். புதிய பாடத்திட்டங்களை கற்றுக்கொள்வதில் வெற்றி பெறுவீர்கள். ஆசிரியர்களின் ஆதரவு கிடைக்கும். ஆராய்ச்சி மாணவர்களுக்கு இன்று புதிய தகவல்கள் கிடைக்கும். உங்கள் அறிவுத்தாகம் அதிகரிக்கும். உங்கள் மனதை ஒருமுகப்படுத்தி படிப்பது சிறப்பான பலனைத் தரும்.\n\nஉடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் இருந்த தேவையற்ற கவலைகள் நீங்கி, புத்துணர்ச்சி உண்டாகும். உடல் ரீதியாகவும், மன ரீதியாகவும் நீங்கள் இன்று மிகவும் வலிமையுடன் உணர்வீர்கள். சீரான உடற்பயிற்சிகளை மேற்கொள்வது மேலும் நன்மைகளைத் தரும். ஆரோக்கியமான உணவுப் பழக்கவழக்கங்களை கடைபிடிப்பது மிகவும் நல்லது. மனதை அமைதியாக வைத்துக்கொள்ள தியானம் அல்லது யோகா செய்யலாம். இது உங்கள் மனதிற்கு அமைதியையும், ஆற்றலையும் அளிக்கும்.\n\nநிதி நிலைமை இன்று வலுவாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைக்கப்படும். சேமிப்புகளை அதிகரிக்கும் வாய்ப்புகள் ஏற்படும். புதிய முதலீடுகளை மேற்கொள்ள இது ஒரு நல்ல நாள். குறிப்பாக, நீண்டகால முதலீடுகள் உங்களுக்கு எதிர்காலத்தில் பெரிய ஈட்டத்தை அளிக்கும். அறிவுசார்ந்த நிதி முடிவுகளை எடுப்பீர்கள். உங்கள் நிதி நிலைமை இன்று மேலும் வலுப்பெறும். சொத்து சம்பந்தமான முதலீடுகள் நல்ல பலனைத் தரும். உங்கள் திறமையான நிதி மேலாண்மைக்கு நல்ல பலன் கிடைக்கும். இன்று நீங்கள் மேற்கொள்ளும் நிதி சார்ந்த முடிவுகள் உங்களுக்கு நன்மை பயக்கும். இன்று உங்களுக்கு எதிர்பாராத நிதி வரவுகள் கிடைக்க வாய்ப்புள்ளது.",
    "prediction_en": "Today, being a Tuesday, the influence of Mars will bring new motivation to your innovative thoughts and social welfare tasks, Aquarius natives. Today, you will show interest in formulating future plans and new discoveries. Your social concern will be appreciated by many today. Your role in public life will increase. You will find solutions to some specific long-pending tasks today. Your analytical skills and intellect will be brilliantly displayed today. This will guide you to make the right decisions. You will bravely face challenges and overcome them. Every effort you make will lead to success.\n\nToday, peace and happiness will prevail in your family life. Relationships with family members will be harmonious. Today, you will make some specific decisions for the well-being of your family. Siblings will be supportive of you. Discussions about auspicious events may take place in the home. Good opportunities will arise today for buying a new house or land. Property-related tasks will proceed quickly today. Favorable circumstances will arise today to resolve pending legal issues. This is a good day to undertake maintenance work for your home. This will bring joy and satisfaction to your mind.\n\nToday is an excellent day for career and business. Your hard work and dedication will be appreciated by higher authorities today. New responsibilities may come your way. You will skillfully accept and perform them excellently. You will receive cooperation from colleagues. You will have the courage to initiate new projects. Entrepreneurs will secure new contracts. Those involved in foreign trade will reap good profits. Your intelligent decisions will be beneficial for you. Every effort you make will lead to success. New opportunities will come your way today.\n\nFor students in the field of education, today is an excellent day. Interest in studies will increase. You will perform excellently in competitive exams. You will succeed in learning new curricula. You will receive support from teachers. Research students will receive new information today. Your thirst for knowledge will increase. Focusing your mind on studies will yield excellent results.\n\nPhysical health will be good. Unnecessary worries in your mind will disappear, and you will feel refreshed. You will feel very strong physically and mentally today. Regular exercise will bring further benefits. It is very good to adopt healthy eating habits. You can meditate or do yoga to keep your mind calm. This will bring peace and energy to your mind.\n\nFinancial situation will be strong today. Expected money flow will occur. Old debts will be repaid. Opportunities to increase savings will arise. This is a good day to make new investments. In particular, long-term investments will bring you significant profits in the future. You will make intelligent financial decisions. Your financial situation will strengthen further today. Property-related investments will yield good results. Your efficient financial management will bring good returns. Financial decisions you make today will be beneficial for you. You are likely to receive unexpected financial inflows today.",
    "career_ta": "பணியிடத்தில் உங்கள் கடின உழைப்பு பாராட்டப்படும். புதிய பொறுப்புகள் தேடி வரலாம். அவற்றை திறம்பட ஏற்று சிறப்பாகச் செயல்படுவீர்கள். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். தொழில்முனைவோருக்கு புதிய ஒப்பந்தங்கள் கிடைக்கும்.",
    "career_en": "Your hard work will be appreciated at work. New responsibilities may come your way. You will skillfully accept and perform them excellently. You will receive cooperation from colleagues. You will have the courage to initiate new projects. Entrepreneurs will secure new contracts.",
    "finance_ta": "நிதிநிலை வலுவாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். பழைய கடன்கள் அடைக்கப்படும். சேமிப்புகளை அதிகரிக்கும் வாய்ப்புகள் ஏற்படும். சொத்து சம்பந்தமான முதலீடுகள் நன்மை பயக்கும். இன்று எதிர்பாராத நிதி வரவுகள் கிடைக்கலாம்.",
    "finance_en": "Financial situation will be strong. Expected money flow will occur. Old debts will be repaid. Opportunities to increase savings will arise. Property-related investments will be beneficial. Unexpected financial inflows may occur today.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் இருந்த கவலைகள் நீங்கி புத்துணர்ச்சி உண்டாகும். உடல் ரீதியாகவும், மன ரீதியாகவும் வலிமையுடன் உணர்வீர்கள். ஆரோக்கியமான உணவுப் பழக்கம் நன்மைகளைத் தரும்.",
    "health_en": "Physical health will be good. Worries in your mind will clear, bringing freshness. You will feel strong physically and mentally. Healthy eating habits will bring benefits.",
    "lucky_number": "4",
    "lucky_color_ta": "அடர் நீலம்",
    "lucky_color_en": "Dark Blue"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "24-02-2026",
    "prediction_ta": "மீன ராசிக்காரர்களே, இன்று செவ்வாய்க்கிழமை என்பதால், செவ்வாய் கோளின் செல்வாக்கு உங்கள் மனதில் ஒரு புதிய உத்வேகத்தையும், உள்ளுணர்வு சார்ந்த தெளிவையும் அளிக்கும். இன்று நீங்கள் எந்த ஒரு செயலிலும் மிகுந்த தன்னம்பிக்கையுடனும், ஆன்மீக பலத்துடனும் அணுகுவீர்கள். உங்கள் உள்ளுணர்வு சரியாக வழிகாட்டும் என்பதால், தயக்கமின்றி குறிப்பான முடிவுகளை எடுக்கலாம். நீண்ட நாட்களாக நிலுவையில் உள்ள வேலைகளை முடிக்க இன்று ஒரு நல்ல வாய்ப்பு கிடைக்கும். உங்கள் ஆற்றலை சரியான திசையில் செலுத்துவதன் மூலம், எதிர்பாராத வெற்றிகளை ஈட்ட முடியும். சவால்களை தைரியமாக எதிர்கொள்ளும் மனப்பான்மை உங்களுக்கு இன்றைய நாளில் ஒரு வரப்பிரசாதமாக அமையும். உங்கள் ஆன்மீக வளர்ச்சி இன்று அதிகரிக்கும். அமைதியையும், சமாதானத்தையும் நாடுவீர்கள்.\n\nநிலுவையில் உள்ள சொத்து சம்பந்தமான பிரச்சனைகளுக்கு இன்று தீர்வு காண உகந்த நாள். சட்டரீதியான விஷயங்களில் நன்மை பயக்கும் திருப்பங்கள் ஏற்படும் வாய்ப்பு உள்ளது. உங்கள் உடன் பிறந்தோர் உங்களுடன் நல்லுறவைப் பேணுவார்கள், அவர்கள் மூலமாக உங்களுக்கு ஒரு நல்ல ஆலோசனை அல்லது உதவி கிடைக்கலாம். இன்றைய நாள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கு மிகவும் நன்மை பயக்கும். புதிய திறன்களைக் கற்றுக்கொள்ளவோ அல்லது ஏற்கனவே உள்ள திறமைகளை மெருகூட்டவோ திட்டமிடலாம். ஆக்கபூர்வமான சிந்தனைகள் உங்கள் மனதில் தோன்றும். அவற்றை உடனடியாக செயல்படுத்தத் தொடங்குவது நல்லது. எந்த ஒரு வேலையிலும் ஒருவித வேகத்தையும், உறுதியையும் காண முடியும். உங்களுடைய கடின உழைப்பும், முழு ஈடுபாடும் இன்று நல்ல பலன்களைத் தரும். தேவையற்ற வாக்குவாதங்களைத் தவிர்த்து, அமைதியுடன் செயல்பட்டால், சூழ்நிலைகளை உங்களுக்கு நன்மை பயக்கும் விதமாக மாற்றிக்கொள்ள முடியும். உடல் ரீதியாகவும், மன ரீதியாகவும் நீங்கள் இன்று மிகவும் வலிமையுடன் உணர்வீர்கள். உங்கள் இலக்குகளை நோக்கி முன்னேறுவதில் எந்தவித தடங்கலும் இருக்காது. சிறுசிறு தடைகள் தோன்றினாலும், அவற்றை திறம்பட சமாளிக்கும் ஆற்றல் உங்களுக்கு இருக்கும்.\n\nபொது வாழ்வில் உங்கள் மதிப்பு உயரும். புதிய தொடர்புகள் மூலம் புதிய வாய்ப்புகள் உருவாகலாம். இன்று நீங்கள் மேற்கொள்ளும் முயற்சிகள் அனைத்தும் எதிர்காலத்தில் பெரும் வெற்றிகளுக்கு அடித்தளமாக அமையும். உங்கள் பேச்சுத் திறமையும், வாதத் திறமையும் இன்று உங்களுக்கு நன்மை பயக்கும். குறிப்பான கலந்துரையாடல்களில் உங்கள் கருத்துக்கள் ஏற்கப்படும். உங்கள் கருத்துக்களில் உள்ள நியாயத்தையும், உறுதியையும் அனைவரும் உணர்வார்கள். இன்று நீங்கள் செய்யும் முதலீடுகள் அல்லது சொத்து சம்பந்தமான முடிவுகள் நீண்ட காலத்திற்கு ஈட்டத்தை ஈட்டித்தரும். உங்கள் இல்லத்தில் மகிழ்ச்சியும், அமைதியும் நிலைக்கும். உறவினர்களுடன் இணக்கமான உறவு நீடிக்கும். பிள்ளைகளின் வளர்ச்சி உங்களுக்கு பெருமையையும், மன நிறைவையும் அளிக்கும். ஆன்மீக ரீதியான சிந்தனைகள் உங்கள் மனதை அமைதிப்படுத்தும். புத்துணர்ச்சியுடன் செயல்பட உதவும். இன்று நீங்கள் எடுக்கும் ஒவ்வொரு முடிவும் உங்கள் எதிர்காலத்தை ஒளிமயமாக்கும். எனவே, பயமின்றி தைரியமாக செயல்படுங்கள். உங்கள் உள்மனதின் குரலுக்கு செவிசாய்த்து செயல்படுங்கள். இன்றைய நாள் உங்களுக்கு ஒரு அற்புதமான ஆரம்பமாக அமையும். எந்த ஒரு சவாலையும் தன்னம்பிக்கையுடன் எதிர்கொள்ளும் மன தைரியத்தை செவ்வாய் கோள் உங்களுக்கு வழங்கும். உங்கள் தன்னம்பிக்கை அதிகரிக்கும் நாள் இது. புதிய முயற்சிகளில் ஈடுபடுவதற்கு இது மிகவும் உகந்த நேரம். நீண்டகாலமாக நிலுவையில் உள்ள வேலைகளை இன்று நீங்கள் திறம்பட முடிப்பீர்கள். குடும்ப உறுப்பினர்களுடனான உறவு இனிமையாகும். உடன் பிறந்தோர் உறவுகள் வலுப்பெறும். உங்களது ஆற்றலை சரியான வழியில் பயன்படுத்துவதன் மூலம் பெரிய வெற்றிகளை அடையலாம். பொது வாழ்வில் உங்கள் பெயர் உயரும்.",
    "prediction_en": "Today, being a Tuesday, the influence of Mars will bring a new impetus and intuitive clarity to your mind, Pisces natives. Today, you will approach every task with great confidence and spiritual strength. Your intuition will guide you correctly, so you can make specific decisions without hesitation. Today offers a good opportunity to complete long-pending tasks. By directing your energy appropriately, you can achieve unexpected successes. The attitude of bravely facing challenges will be a boon to you today. Your spiritual growth will increase today. You will seek peace and harmony.\n\nToday is a suitable day to resolve pending property-related issues. There is a possibility of favorable turns in legal matters. Your siblings will maintain good relations with you, and through them, you may receive good advice or assistance. Today is very beneficial for your personal growth. You can plan to learn new skills or refine existing ones. Constructive thoughts will arise in your mind. It is good to start implementing them immediately. You will feel a sense of speed and determination in every task. Your hard work and full commitment will yield good results today. By avoiding unnecessary arguments and acting calmly, you will be able to turn situations to your advantage. Physically and mentally, you will feel very strong today. There will be no hindrance in moving towards your goals. Even if minor obstacles appear, you will have the ability to skillfully overcome them.\n\nYour standing in public life will increase. New opportunities may arise through new connections. All your endeavors today will lay the foundation for great successes in the future. Your speaking skills and argumentative ability will be beneficial today. Your views will be accepted in important discussions. Everyone will recognize the fairness and conviction in your opinions. Investments or property-related decisions you make today will be profitable in the long run. Happiness and peace will prevail in your home. Harmonious relationships with relatives will continue. The growth of your children will bring you pride and satisfaction. Spiritual thoughts will calm your mind. They will help you act with renewed vigor. Every decision you make today will brighten your future. Therefore, act bravely without fear. Listen to your inner voice and act accordingly. Today will be a wonderful beginning for you. The planet Mars will grant you the mental courage to face any challenge with self-confidence. This is a day when your self-confidence will increase. It is a very opportune time to engage in new endeavors. You will skillfully complete long-pending tasks today. Family relationships will be sweet. Sibling bonds will strengthen. By utilizing your energy in the right way, you can achieve great successes. Your name will rise in public life.",
    "career_ta": "பணியிடத்தில் புதிய பொறுப்புகள் தேடி வரலாம். அவற்றை திறம்பட ஏற்று சிறப்பாகச் செயல்படுவீர்கள். உடன் பணிபுரிவோரின் ஒத்துழைப்பு கிடைக்கும். புதிய திட்டங்களை முன்னெடுப்பதற்கான தைரியம் உண்டாகும். உங்கள் முடிவுகளுக்கு உயர் அதிகாரிகளின் ஆதரவு கிடைக்கும். தொழில்முனைவோருக்கு புதிய ஒப்பந்தங்கள் கிடைக்கும்.",
    "career_en": "New responsibilities may come your way at work. You will skillfully accept and perform them excellently. You will receive cooperation from colleagues. You will have the courage to initiate new projects. Your decisions will receive support from higher authorities. Entrepreneurs will secure new contracts.",
    "finance_ta": "நிதிநிலை திருப்திகரமாக இருக்கும். எதிர்பார்த்த பணவரவு கிடைக்கும். சொத்து சம்பந்தமான முதலீடுகள் ஈட்டத்தை அளிக்கும் விதமாக அமையும். நீண்டகால முதலீடுகளைத் தொடங்க இது ஒரு நல்ல வாய்ப்பு. கொடுக்கல் வாங்கலில் கவனமும், நேர்மையும் நன்மை பயக்கும்.",
    "finance_en": "Financial status will be satisfactory. Expected money flow will occur. Property-related investments will be profitable. This is a good opportunity to start long-term investments. Caution and integrity in transactions will be beneficial.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். புத்துணர்ச்சியுடன் இருப்பீர்கள். வழக்கமான உடற்பயிற்சிகளை மேற்கொள்வது மேலும் நன்மைகளைத் தரும். மனதில் நேர்மறை எண்ணங்கள் மேலோங்கும்.",
    "health_en": "Physical health will be excellent. You will feel refreshed. Regular exercise will bring further benefits. Positive thoughts will prevail in your mind.",
    "lucky_number": "7",
    "lucky_color_ta": "மெல்லிய நீலம்",
    "lucky_color_en": "Light Blue"
  }
]
