[{"content":{"parts":[{"text":"```json\n[\n  {\n    \"sign_en\": \"Aries\",\n    \"sign_ta\": \"மேஷம்\",\n    \"date\": \"2026-01-24\",\n    \"forecast_en\": \"General Forecast: Your innate energy and drive are high today. It is a powerful time to initiate new projects and tackle challenging tasks head-on. Career: Leadership roles are favored. Assertiveness in meetings will lead to professional success. Finance: Financial stability is maintained, but watch out for impulsive expenditures driven by excitement. Health: High energy levels need constructive channeling. Focus on physical activity to manage potential stress or impatience.\",\n    \"forecast_ta\": \"பொதுப் பலன்: உங்கள் உள்ளுணர்வும், உந்துதலும் இன்று மிக அதிகமாக இருக்கும். புதிய முயற்சிகளைத் தொடங்கவும், சவாலான பணிகளை எதிர்கொள்ளவும் இது மிகச் சிறந்த நேரம். தொழில்: தலைமைப் பொறுப்புகளை ஏற்க இது உகந்த நாள். கூட்டங்களில் நீங்கள் வெளிப்படுத்தும் துணிச்சல் தொழில் வெற்றியைத் தேடித் தரும். நிதி: நிதி நிலைமை சீராக உள்ளது, எனினும், உற்சாகத்தின் காரணமாக ஏற்படும் அவசர செலவுகளைத் தவிர்க்கவும். ஆரோக்கியம்: அதிக ஆற்றல் உள்ளதால், அதை ஆக்கப்பூர்வமாகச் செலவிட வேண்டும். மன அழுத்தத்தைக் குறைக்க உடற்பயிற்சிகளைச் செய்வது நல்லது.\",\n    \"lucky_number\": \"9\",\n    \"lucky_color_en\": \"Red\",\n    \"lucky_color_ta\": \"சிவப்பு\"\n  },\n  {\n    \"sign_en\": \"Taurus\",\n    \"sign_ta\": \"ரிஷபம்\",\n    \"date\": \"2026-01-24\",\n    \"forecast_en\": \"General Forecast: Stability and comfort are your priorities. This is an excellent day for long-term planning, particularly involving home and personal security. Career: Diligence and patience will be significantly rewarded. Focus on completing detailed tasks with precision. Finance: Excellent opportunities for solid investments and securing existing earnings. Avoid unnecessary risks. Health: Focus on rest and quality nutrition. Ensuring peaceful surroundings will boost your mental well-being.\",\n    \"forecast_ta\": \"பொதுப் பலன்: நிலைத்தன்மை மற்றும் நிம்மதிக்கு இன்று நீங்கள் முன்னுரிமை அளிப்பீர்கள். வீடு மற்றும் தனிப்பட்ட பாதுகாப்பு சார்ந்த நீண்ட கால திட்டங்களுக்கு இது ஒரு நல்ல நாள். தொழில்: விடாமுயற்சியும், பொறுமையும் இன்று உங்களுக்குப் பெரும் வெற்றியைத் தரும். நுட்பமான பணிகளைச் சரியாக முடிப்பதில் கவனம் தேவை. நிதி: உறுதியான முதலீடுகளுக்கும், வருமானத்தைப் பாதுகாப்பதற்கும் சிறந்த வாய்ப்புகள் உள்ளன. அனாவசியமான அபாயங்களைத் தவிர்க்கவும். ஆரோக்கியம்: போதுமான ஓய்வு மற்றும் தரமான உணவில் கவனம் செலுத்துங்கள். அமைதியான சூழல் உங்கள் மன நலத்தை மேம்படுத்தும்.\",\n    \"lucky_number\": \"6\",\n    \"lucky_color_en\": \"White\",\n    \"lucky_color_ta\": \"வெள்ளை\"\n  },\n  {\n    \"sign_en\": \"Gemini\",\n    \"sign_ta\": \"மிதுனம்\",\n    \"date\": \"2026-01-24\",\n    \"forecast_en\": \"General Forecast: Communication and networking are key themes. Your social calendar will be busy, bringing new learning and intellectual opportunities. Career: Meetings, negotiations, and short-distance travel are highly favored. Ensure clear and unambiguous communication in all dealings. Finance: Minor expenses related to communication tools or short trips are possible. Financial matters benefit from quick, informed decisions. Health: Mental stimulation is high, but ensure you schedule regular breaks to prevent mental fatigue.\",\n    \"forecast_ta\": \"பொதுப் பலன்: தகவல் தொடர்பு மற்றும் உறவுகள் இன்று முக்கியப் பங்காற்றும். உங்கள் சமூக வாழ்க்கை சுறுசுறுப்பாக இருக்கும், புதிய அறிவுசார் வாய்ப்புகள் உருவாகும். தொழில்: சந்திப்புகள், பேச்சுவார்த்தைகள் மற்றும் குறுகிய பயணங்கள் இன்று வெற்றியைத் தரும். அனைத்து நடவடிக்கைகளிலும் தெளிவான தகவல் தொடர்பை உறுதிப்படுத்துங்கள். நிதி: தகவல் தொடர்பு அல்லது சிறிய பயணங்கள் தொடர்பான செலவுகள் ஏற்பட வாய்ப்புள்ளது. துரிதமான, தகவல் அறிந்த முடிவுகள் நிதிப் பலனைத் தரும். ஆரோக்கியம்: மனதிற்கு அதிக வேலை கொடுப்பீர்கள். மனச் சோர்வைத் தவிர்க்க அவ்வப்போது ஓய்வு எடுப்பது அவசியம்.\",\n    \"lucky_number\": \"5\",\n    \"lucky_color_en\": \"Green\",\n    \"lucky_color_ta\": \"பச்சை\"\n  },\n  {\n    \"sign_en\": \"Cancer\",\n    \"sign_ta\": \"கடகம்\",\n    \"date\": \"2026-01-24\",\n    \"forecast_en\": \"General Forecast: Emotional matters come to the forefront. Spend time nurturing familial bonds and trusting your powerful intuition. Career: Workplace relations improve significantly. Your empathetic approach helps resolve team conflicts. Trust your gut feeling when making crucial decisions. Finance: Focus on long-term security and domestic investments, potentially related to real estate or household improvements. Health: Your emotional well-being is strongly tied to your physical health today. Practice relaxation techniques.\",\n    \"forecast_ta\": \"பொதுப் பலன்: உணர்ச்சிப்பூர்வமான விடயங்கள் முக்கியத்துவம் பெறும். குடும்ப உறவுகளைப் பேணவும், உங்கள் வலிமையான உள்ளுணர்வை நம்பவும் நேரம் ஒதுக்குங்கள். தொழில்: பணியிட உறவுகள் கணிசமாக மேம்படும். உங்கள் பரிவான அணுகுமுறை குழு மோதல்களைத் தீர்க்க உதவும். முக்கியமான முடிவுகளை எடுக்கும்போது உங்கள் மனதின் குரலைக் கேளுங்கள். நிதி: நீண்ட கால பாதுகாப்பு மற்றும் உள்நாட்டு முதலீடுகளில் கவனம் செலுத்துங்கள் (அசையாச் சொத்து அல்லது வீட்டிற்குத் தேவையான சீரமைப்புகள்). ஆரோக்கியம்: உங்கள் உணர்ச்சிசார் நலன் இன்று உடல் ஆரோக்கியத்துடன் பிணைக்கப்பட்டுள்ளது. தளர்வு பயிற்சிகளை மேற்கொள்ளுங்கள்.\",\n    \"lucky_number\": \"2\",\n    \"lucky_color_en\": \"Pearl White\",\n    \"lucky_color_ta\": \"முத்து வெள்ளை\"\n  },\n  {\n    \"sign_en\": \"Leo\",\n    \"sign_ta\": \"சிம்மம்\",\n    \"date\": \"2026-01-24\",\n    \"forecast_en\": \"General Forecast: Confidence is your superpower today. This is an excellent time for self-expression, creativity, and standing in the spotlight. Career: Recognition for past efforts is likely. Take the lead on innovative or artistic projects. Your presence commands attention. Finance: Calculated risk-taking may yield rewards, especially in speculative areas. However, avoid financial arrogance in deals. Health: Maintain your high energy levels through consistent physical activity. Focus on heart health.\",\n    \"forecast_ta\": \"பொதுப் பலன்: தன்னம்பிக்கை இன்று உங்கள் அரிய சக்தியாகும். உங்களை வெளிப்படுத்தவும், ஆக்கப்பூர்வமான பணிகளில் ஈடுபடவும், அனைவரின் கவனத்தையும் ஈர்க்கவும் இது மிகச் சிறந்த நாளாகும். தொழில்: கடந்தகால முயற்சிகளுக்கு அங்கீகாரம் கிடைக்கும். புதிய அல்லது கலை சார்ந்த திட்டங்களுக்கு தலைமை தாங்குங்கள். நிதி: நன்கு கணக்கிடப்பட்ட இடர் முயற்சிகள் பலனளிக்கும், குறிப்பாக ஊக வணிகங்களில். இருப்பினும், நிதி விவகாரங்களில் ஆணவத்தைத் தவிர்க்கவும். ஆரோக்கியம்: நிலையான உடற்பயிற்சியின் மூலம் உங்கள் ஆற்றல் மட்டங்களைத் தக்க வைத்துக் கொள்ளுங்கள். இதய ஆரோக்கியத்தில் கவனம் செலுத்துங்கள்.\",\n    \"lucky_number\": \"1\",\n    \"lucky_color_en\": \"Gold\",\n    \"lucky_color_ta\": \"பொன்னிறம்\"\n  },\n  {\n    \"sign_en\": \"Virgo\",\n    \"sign_ta\": \"கன்னி\",\n    \"date\": \"2026-01-24\",\n    \"forecast_en\": \"General Forecast: A highly productive day for organization, clearing clutter, and focusing on service. Attention to detail is your key to success. Career: Efficiency is maximized, making it a good day for administrative tasks, data analysis, and fixing procedural issues. Finance: Budgeting and tracking expenses are absolutely essential. Avoid entering into unnecessary debt or impulsive large purchases. Health: Focus on diet and routine. Digestive health requires careful attention today.\",\n    \"forecast_ta\": \"பொதுப் பலன்: ஒழுங்கமைத்தல், தேவையற்றவைகளை நீக்குதல் மற்றும் கடமையில் கவனம் செலுத்துவதற்கு இது மிகவும் பயனுள்ள நாள். நுணுக்கமான விஷயங்களில் உங்கள் கவனம் வெற்றிக்கு வழிவகுக்கும். தொழில்: பணித் திறன் இன்று உச்சத்தில் இருக்கும். நிர்வாகப் பணிகள், தரவு பகுப்பாய்வு மற்றும் செயல்முறை சிக்கல்களைச் சரிசெய்வதற்கு ஏற்ற நாள். நிதி: வரவு செலவு திட்டமிடல் மற்றும் செலவுகளைக் கண்காணித்தல் இன்றியமையாதது. தேவையற்ற கடன்கள் அல்லது அவசரமான பெரிய கொள்முதல்களைத் தவிர்க்கவும். ஆரோக்கியம்: உணவு மற்றும் தினசரி வழக்கத்தில் கவனம் தேவை. செரிமான ஆரோக்கியத்தில் கூடுதல் கவனம் செலுத்துங்கள்.\",\n    \"lucky_number\": \"5\",\n    \"lucky_color_en\": \"Navy Blue\",\n    \"lucky_color_ta\": \"கரும் நீலம்\"\n  },\n  {\n    \"sign_en\": \"Libra\",\n    \"sign_ta\": \"துலாம்\",\n    \"date\": \"2026-01-24\",\n    \"forecast_en\": \"General Forecast: The need for balance and harmony in relationships is paramount. Focus on diplomacy and resolving any minor conflicts peacefully. Career: Partnerships and collaborations are highly favored. Negotiations yield the best results when approached with fairness. Finance: Financial decisions involving partners or joint resources should be balanced and reviewed together. Avoid making unilateral spending choices. Health: Finding a balance between professional duties and personal rest is vital for your peace of mind.\",\n    \"forecast_ta\": \"பொதுப் பலன்: உறவுகளில் சமநிலையையும் நல்லிணக்கத்தையும் நிலைநாட்டுவது மிக முக்கியம். இணக்கமாகவும், சமாதானத்துடனும் சிறிய சச்சரவுகளைத் தீர்க்க கவனம் செலுத்துங்கள். தொழில்: கூட்டுறவுகள் மற்றும் ஒப்பந்தங்கள் இன்று மிகுந்த சாதகமாக அமையும். நேர்மையுடன் அணுகும்போது பேச்சுவார்த்தைகள் சிறந்த முடிவுகளைத் தரும். நிதி: கூட்டாளர்கள் அல்லது கூட்டு நிதிகள் தொடர்பான நிதி முடிவுகளைச் சமநிலையுடன் சேர்ந்து மதிப்பாய்வு செய்ய வேண்டும். ஒருதலைப்பட்சமான செலவு முடிவுகளைத் தவிர்க்கவும். ஆரோக்கியம்: தொழில் கடமைகளுக்கும் தனிப்பட்ட ஓய்வுக்கும் இடையில் சமநிலையைக் கண்டறிவது உங்கள் மன அமைதிக்கு இன்றியமையாதது.\",\n    \"lucky_number\": \"6\",\n    \"lucky_color_en\": \"Pink\",\n    \"lucky_color_ta\": \"இளஞ்சிவப்பு\"\n  },\n  {\n    \"sign_en\": \"Scorpio\",\n    \"sign_ta\": \"விருச்சிகம்\",\n    \"date\": \"2026-01-24\",\n    \"forecast_en\": \"General Forecast: This is a day for deep self-reflection and transformation. You possess profound insight, but be mindful of intense emotions. Career: Tasks involving research, investigation, or complex problem-solving are favored. Transformation of outdated work habits is possible. Finance: Opportunities for shared resources or unexpected gains may arise. Handle all financial dealings with extreme caution and scrutiny. Health: Channel your intense internal energy constructively. Avoid dwelling on past grievances.\",\n    \"forecast_ta\": \"பொதுப் பலன்: ஆழ்ந்த சுய ஆய்வு மற்றும் மாற்றம் நிறைந்த நாள் இது. உங்களுக்கு ஆழமான உள்ளார்ந்த பார்வை இருக்கும், ஆனால் தீவிர உணர்ச்சிகளைக் கவனமாகக் கையாளவும். தொழில்: ஆராய்ச்சி, விசாரணை அல்லது சிக்கலான சிக்கலைத் தீர்க்கும் பணிகள் சாதகமாக இருக்கும். காலாவதியான பணிப் பழக்கங்களை மாற்றியமைக்க வாய்ப்புள்ளது. நிதி: கூட்டு நிதி ஆதாரங்கள் அல்லது எதிர்பாராத ஆதாயங்களுக்கான வாய்ப்புகள் உருவாகலாம். அனைத்து நிதி பரிவர்த்தனைகளையும் அதிக கவனத்துடன் கையாளவும். ஆரோக்கியம்: உங்கள் தீவிரமான உள் ஆற்றலை ஆக்கப்பூர்வமாக வழிநடத்துங்கள். கடந்த கால கஷ்டங்களைப் பற்றி யோசிப்பதைத் தவிர்க்கவும்.\",\n    \"lucky_number\": \"9\",\n    \"lucky_color_en\": \"Maroon\",\n    \"lucky_color_ta\": \"செம்மஞ்சள்\"\n  },\n  {\n    \"sign_en\": \"Sagittarius\",\n    \"sign_ta\": \"தனுசு\",\n    \"date\": \"2026-01-24\",\n    \"forecast_en\": \"General Forecast: Optimism and expansion define your day. This is a favorable time for higher education, philosophical discussions, and planning distant travel. Career: Collaborations involving long distances or international connections succeed. Use this day to share your expertise and vision broadly. Finance: Expenditures may relate to future planning, education, or travel preparations. Overall financial stability is good, but maintain practical constraints. Health: Outdoor activities and exploring new environments will boost your vitality.\",\n    \"forecast_ta\": \"பொதுப் பலன்: நேர்மையும், வளர்ச்சியும் உங்கள் நாளை ஆளுகின்றன. உயர்கல்வி, தத்துவ விவாதங்கள் மற்றும் தொலைதூர பயணங்களைத் திட்டமிடுவதற்கு இது உகந்த நேரம். தொழில்: நீண்ட தூரம் அல்லது வெளிநாட்டு தொடர்புகளை உள்ளடக்கிய கூட்டு முயற்சிகள் வெற்றி பெறும். உங்கள் நிபுணத்துவத்தையும் பார்வையையும் விரிவாகப் பகிர்ந்து கொள்ள இந்த நாளைப் பயன்படுத்துங்கள். நிதி: எதிர்காலத் திட்டமிடல், கல்வி அல்லது பயணத் தயாரிப்புகள் தொடர்பான செலவுகள் இருக்கலாம். ஒட்டுமொத்த நிதி நிலைமை சிறப்பாக இருந்தாலும், நடைமுறை வரம்புகளைப் பராமரிக்கவும். ஆரோக்கியம்: வெளிப்புறச் செயல்பாடுகளும் புதிய சூழல்களை ஆராய்வதும் உங்கள் வலிமையை அதிகரிக்கும்.\",\n    \"lucky_number\": \"3\",\n    \"lucky_color_en\": \"Yellow\",\n    \"lucky_color_ta\": \"மஞ்சள்\"\n  },\n  {\n    \"sign_en\": \"Capricorn\",\n    \"sign_ta\": \"மகரம்\",\n    \"date\": \"2026-01-24\",\n    \"forecast_en\": \"General Forecast: A highly motivated day focusing on discipline, duty, and professional ambition. Achieving long-term, structural goals is possible. Career: Authority figures recognize your efforts, and hard work brings deserved accolades. Focus on building solid foundations for future growth. Finance: Excellent day for savings, securing structural investments, and practicing prudence in spending. Long-term financial planning is favored. Health: You must avoid overworking yourself. Ensure you care for your back and knees through stretching and rest.\",\n    \"forecast_ta\": \"பொதுப் பலன்: ஒழுக்கம், கடமை மற்றும் தொழில் லட்சியத்தில் கவனம் செலுத்தும் ஊக்கமளிக்கும் நாள் இது. நீண்ட கால, கட்டமைக்கப்பட்ட இலக்குகளை அடைவது சாத்தியமாகும். தொழில்: அதிகாரத்தில் உள்ளவர்கள் உங்கள் முயற்சிகளை அங்கீகரிப்பார்கள், கடின உழைப்புக்கான பாராட்டுக்கள் கிடைக்கும். எதிர்கால வளர்ச்சிக்கான உறுதியான அடித்தளங்களை உருவாக்குவதில் கவனம் செலுத்துங்கள். நிதி: சேமிப்பு, கட்டமைக்கப்பட்ட முதலீடுகளைப் பாதுகாத்தல் மற்றும் செலவினங்களில் விவேகத்துடன் செயல்படுதல் ஆகியவற்றிற்கு இது மிகச் சிறந்த நாள். நீண்ட கால நிதித் திட்டமிடல் சாதகமாக இருக்கும். ஆரோக்கியம்: அதிக வேலை செய்வதைத் தவிர்க்க வேண்டும். நீட்சி பயிற்சிகள் மற்றும் ஓய்வு மூலம் உங்கள் முதுகு மற்றும் முழங்கால்களைக் கவனித்துக் கொள்ளுங்கள்.\",\n    \"lucky_number\": \"8\",\n    \"lucky_color_en\": \"Brown\",\n    \"lucky_color_ta\": \"பழுப்பு\"\n  },\n  {\n    \"sign_en\": \"Aquarius\",\n    \"sign_ta\": \"கும்பம்\",\n    \"date\": \"2026-01-24\",\n    \"forecast_en\": \"General Forecast: Innovation and community interaction dominate. Expect unexpected connections and a flood of new, unconventional ideas. Career: Team projects and collaborative efforts thrive. Your unique perspective offers solutions to long-standing problems. Embrace technological advancements. Finance: Financial matters might see unpredictable fluctuations. Avoid speculative investments and focus instead on group funding or collective resource management. Health: The nervous system may be sensitive. Try meditation or grounding exercises to maintain calm.\",\n    \"forecast_ta\": \"பொதுப் பலன்: புதுமைகளும் சமூக ஈடுபாடும் இன்று மேலோங்கும். எதிர்பாராத தொடர்புகள் மற்றும் வழக்கத்திற்கு மாறான புதிய சிந்தனைகளின் வருகையை எதிர்பார்க்கலாம். தொழில்: குழு திட்டங்கள் மற்றும் கூட்டு முயற்சிகள் செழிக்கும். உங்கள் தனித்துவமான கண்ணோட்டம் நீண்டகால பிரச்சினைகளுக்குத் தீர்வுகளை வழங்குகிறது. தொழில்நுட்ப முன்னேற்றங்களைத் தழுவுங்கள். நிதி: நிதி விவகாரங்களில் கணிக்க முடியாத ஏற்ற இறக்கங்கள் காணப்படலாம். ஊக வணிகத்தைத் தவிர்த்து, குழு நிதி அல்லது கூட்டு ஆதார மேலாண்மையில் கவனம் செலுத்துங்கள். ஆரோக்கியம்: நரம்பு மண்டலம் சற்று உணர்திறனுடன் இருக்கலாம். அமைதியைப் பேண தியானம் அல்லது ஆழ்ந்த சுவாசப் பயிற்சிகளை மேற்கொள்ளுங்கள்.\",\n    \"lucky_number\": \"4\",\n    \"lucky_color_en\": \"Violet\",\n    \"lucky_color_ta\": \"ஊதா\"\n  },\n  {\n    \"sign_en\": \"Pisces\",\n    \"sign_ta\": \"மீனம்\",\n    \"date\": \"2026-01-24\",\n    \"forecast_en\": \"General Forecast: Your intuition is extremely sharp today. Spend time in creative pursuits, artistic endeavors, or beneficial solitude. Avoid confusing dreams with reality. Career: Artistic and humanitarian projects find success. You may need to shield yourself from negative workplace influences. Set clear boundaries. Finance: While generosity is appreciated, guard against financial deception or confusing personal and business accounts. Practice clarity in transactions. Health: Hydration and emotional detoxification are key. Listen to the signals your body is sending.\",\n    \"forecast_ta\": \"பொதுப் பலன்: இன்று உங்கள் உள்ளுணர்வு மிகத் தீவிரமாக இருக்கும். ஆக்கப்பூர்வமான முயற்சிகள், கலைப் பணிகள் அல்லது பயனுள்ள தனிமையில் நேரம் செலவிடுங்கள். கனவுகளை யதார்த்தத்துடன் குழப்ப வேண்டாம். தொழில்: கலை மற்றும் மனிதாபிமான திட்டங்கள் வெற்றி பெறும். பணியிடத்தில் உள்ள எதிர்மறை தாக்கங்களிலிருந்து உங்களைப் பாதுகாத்துக் கொள்ள வேண்டியிருக்கலாம். தெளிவான எல்லைகளை வகுக்கவும். நிதி: வள்ளல்தன்மை பாராட்டப்பட்டாலும், நிதி ஏமாற்றத்திலிருந்து அல்லது தனிப்பட்ட மற்றும் வணிகக் கணக்குகளைக் குழப்புவதிலிருந்து உங்களைப் பாதுகாத்துக் கொள்ளுங்கள். பரிவர்த்தனைகளில் தெளிவைப் பேணுங்கள். ஆரோக்கியம்: நீர்ச்சத்து மற்றும் உணர்ச்சி ரீதியான தூய்மை இன்றியமையாதது. உங்கள் உடல் கொடுக்கும் சமிக்ஞைகளுக்குச் செவிசாயுங்கள்.\",\n    \"lucky_number\": \"7\",\n    \"lucky_color_en\": \"Sea Green\",\n    \"lucky_color_ta\": \"கடல் பச்சை\"\n  }\n]\n```","thoughtSignature":"Cp48AXLI2nxe44BaCufiKl6dve9MZqxTSxYJkq9RnRy7QB6Vsv9R9sDv6EQdQ/Tt1Xc6BM8SySi0oqXvIrjOErTsWE2JPbAJ+qXXKfHspNuhFV3bOA0t/VgQ3X6xZmxkLwlu3jDT0Arj76Ydlku5b+WokuQQfpuN5lAIMkjXBBVHFtuCK2a6dTZASuzZexdZpcGz8QDXnB51168iBykVPZjrLRzoalgINZwszaBxaDe0sxfHJEklWhChojPNzhWKUuoTXeLt/5gsYVbktvY79dssrgdOUHrBEJRUcuS0wTmJaOSu88Ex6bZdkMK5r7VUVzFhpfYnVLikfCJznicIdfJPrmyfWrVTZfbaYs+bUyKRf6ZQb6zzWkByAaOPUEbFKPyqq3XRl0/n7Vw7+LqnH0A5/5inJnSI00GHhIxWZ4OkaeUlXRGaumWhSNsDMHSOnx6RgKmOegcei7CEzL6iFONXS1vHwb6LXJy9SSFJ21F/r44BpBTXx1bVZKXb93qPlisDETfJfjAYTjICiWwflcVOlc3puK5KEjeqaiD6svnuA9/aNEusQjh7qQf8WUzuic2vvoa1UrPLSrnnqnoHrQIe8KjoxV6m0tmCi0xrAzReu/zRtWOmwIlZd/Fgd59Eu0OXuqwoR0EeWC905W6mOhlzrhbb3bXEsMB7jo6m6mvcOET6zkrhuM7wyJZu0vkfH08jZ5m+glt+yI6lM0cB+ziVgndqo3dhwtS9o6ePA1qUnj95zlLI723nuM83wkLn9POmzSZnkZ0HUug2BMJFNu2qv8jxM1uf/wcQevz/CsbJ6MZ7Xc7phx5q8mM7ScRmT1Q22aOHzhxMGHg/vDr9qBmqYRkNBotlYOWoRUpol6W73TqQXPtRI+HvNYtWo5gpVSZoilIW2vRHUBDyFB0FqRkBD0Sp/52A1b45wR1WNU7l/T5dgShq/r5/ov+fLTOcbHK7OwQXRxjfCJKtC47pf6SjzvWRk1DiEvBhNQzeNTfs5PmGaD1Q7EQc+MziTMw4UXt72mkNFJoM2jevjT+z1aOpvSXrBPbPHJkHVozUTBYRhJRFi/qpXxRONEusr8YvgsxKUycU0qZ479Px5TiXD96eShqhqQGwh2ChXpbPrCgRGyRvl1RmA0REdmv/6p2kzHbjq9flfQ9R5Jg9zXobt8EvMFixvwAain1y+ORZpJE5XQKtCcwucZl/JYSyt1BNPd0JGFZFMLPZ+9ubQ5qOPXNHEGkYj7WHGslwMYzfY+O9pX1G0L/pTHQGWpCo5zaDOSwWrNcA9a9LeNTWCrd1P7R2++X8/Extx1Fkl+KXdD75tcMZrbuvVwWTsAy145xaZV3vgwPCXRGflUWUNMI5DiwBXXtK47vPIzStwNdBIhBBW6UWIlVymM2ZR7p0wItIC4BzpfsAYzB3EpCTok3lHOJZso+kZ/PRQdtec0mzkx/QVbBg65aJUUrZ7MMBqrurN4Sr94YdBmLrjZNNKSB3F33QfoqgmfIkVrnv6kNQPGbmcRa9N1MtA55xb+WUaqzbQC8Css0CYNh5Kf9nxyRo0siGwea0MPPA02udXZkoqstw4LoZp3IKl6xg8snHpQNsgUalKNUH5sAHBQo8XXvIgZzBfDb0B23/A8KtVeSjYl5VrklcoKvjZL8Ft5L5uqIesd6zC/54hId+dMLSCD4Pfq3u2VER+bq90tYBbTxzpwA/mM/AxI4g0KlFe7k8uoiwJczRXkCilQpcq5k+PBNJ1PcWolcTKOeEpdC5ZfZt14FA3qERcQCsSqIYnbhUFbGEMaor0UEry1MdKEfV4LJPzTCLT0Sios2WMVXSD/f09uZESfBPDpa89TBub9gL090HGIifUiNmoLOuDm5Po0LLr6zTYtG+3kxadNkk1/zNXoRYzpfzalKGtXX5WU9IzE5IBSmP15bGXcH6aU5YJSpXVitRst1Dw4Z46t2u4w4h8Gp3gqN4lFiYVB2mXaKJbIdSAB8Z6xRiK5DIUOBKJJ4I7siD2/IVHzjMBjUgYcF3KvXs2ODK/KjVHv2Pna1DyAmWtiXnyZTv5HziN/xWon1HV0qHsEJYKe6jnik/MwJVOny01ujRFgTJVpVkiZ4qdF9Jsd59K5qlldJuIEG6rk2pg2zyEIQF/2yX5pYA9WyPfYSiS+OXZnO3pM/42G/sRZHZGD65CEOLjmivQN+rkqYsyhDIgfWUNE6IP/3esK+G3zjdRTcwqJnyslVoer8YdN5ANgyN8yliKdPgEoGUHSKMob73QVTDcf5I0p0l3yUgJY/9EThlSiqYEjl8UG664MNRtBLAQFvPs9hdkGTrWAeX6Ov77iLCAWtF5gwZw6IgELBmcPnEmqgMt8bkDLuQJQsO5nrId3ETO6vY51Exs4iZl4f+th4pg2soX4zMalY+yTYxcbhT3/ezdOPGF0sET0ddTYvuMHnOBL8zMw8XviNMn6eMaSYq+CT7Jx8xw9D2fKXj3b2+2+60YUciBN4B8EdNkopb0CCfCk1oCU2Jctzz/n3ZJpkMrZ41gacflseXu0Tlo+HIbMp61MkZY55R7dcCyDGnK2PB6Roli85yha9REILsMfnctNsdNItlQ+/B38e3B4YgAT5h8Blr8jheP3XMkkrVCFg0dJIUZgL4HNcfVXIaTVKQye5TrxdKkzQgYdJhX0rOSZbwDQKTzqy5GQmlRUL+4m9TVWsDbYnnVYwHXRjO0Oy/PlqTodBCNcccugi8NDYpt7i4QjdKq8eH1iIeSd8gIJmvDrvteI+eezPuina65M2GVbrZ2xYGDkXzquoXLPQuI8mHWiz6svm19Kf5u25UKFa1iKJsQxnK4PtQ4qjq5bBOaCV8bUTd3BAdjEEx2sjQ9IE2xZpffKBrwEDzqwToAYR+NYbX1f72XffVzkuxsQtCtqruxmCrZJYgE2BS6qURC5Q95lw0DNFDEZ7dqkhOWJCK/DTNSiZpJ8vaMRL02/iMS9ZTLxzs1GcVzTy3rAeEvf7W3dUzsUw4l0F9qFuAFMVWiX0Fjk3gZ2YcwZ9+bREhece76kT8Db7G9AcyoQTaZ3K37fkECZbiXJRhQfH0QAZwFtYyIr1wicLjPTRj/cIDZO8KWiRz9iGgnLtMWN5p5cDMNDVKzgGFxTbnPLKDd0V9Gb49gUMCgi1BQShM7d5zV8cgRLHJN2eVkO0LAxoom9vdiKBgXYYIY8gjuFwaS0G84MngWuA3RwvXf4Zo6B7N8C2h0loOP/BZrdQRG1gqfchw6IJB9v2gxEHoU2sWb5XopOuo+CbqrgUQjz5tfCTS0Pjl0xUvGbZe00EcMEE5ct4BY8Jci2gmdJm49yCypsGR3umnZZ8iD891lnCeSnR1W3dZPBkgJv26arsmXac+3gtE8sn3s5KMuIF8T9TPMozvOKmHtddOyx94E5ccSqL7lffEmqWgizl8zyYw6rGUTNTgZOCxYTTE4p9rEjRfmzg0tJH4xCtffws14EPzfFNPbDE9+LdqgCoMYlEb72i7Z8tdYUNh5lUDX/uX1xj0skXMQMIKRadr0YrA9F3RwnEWve432w83GF4RsUaDDPlf3/RIHORzKs6ZE42pYAViInPTdLpakyCgEC5Nr5e5wVBFVfpTzYMDuSB7rRgD9psYy2sa4xqwYW08zBAR9BZOBbX/7+WzjWpG1Rv2tTHKkbOedSdlBAZyth5JaQfDNJQB3SrE4nlXtKkvPKQaJVgkr3NIk/AeUn57r/FdCu4WJCMW8zeBmhz+tJh1pJPCBOkC03p1Co0H/pMCPZUCaDxMzVdODekjMgjI0nMZir8BgIC0lvOp72SujNz79tgXBNm5OM1TvwjABUDw0agsSzBKriSdAA91RBe/ukFlVvHz8+hqQIBnfra3zDre4lP6/mD28JdTpbYDul9KyvOUiR0eTE2WRHLFveFTz6yCwWZX9BB59uxY8OxnELGXhbXztd4Tw2gRB7DtihAQiB3JG9lAnzdCxpLsS1LvI93XlqZ2H1brvLyJWqy2tYstj/LXuttLcVlxRvgL6UUpNB5um/a20/SOY3hIrfupHbT6QA0AiN4+RXu95Pu2S3W9lZtjVi5f23oqVqmN0zzGE9WdPFZKWXDVjWLkNz4SkPnel/jLCvPGXq1tPVrdSNIrDweOkvQP58Nqqo3V6aOMxg84kzGxn2IUT/5VdRJ7R43wYAZRJpriXQXT0rME7ClRhvtaKrWwnMX+i6w0nAebfKeaZqGSS48t3zh0QmL1DYvs9ZlI8PDDdTzalJ0fPm8gI5lt19tJaHeOl46etDjCHVUt7u3pTDfcy9tzM+S/11kickqgoei2ZIrALhCzTqoKYCdajYv1/GD9jLeZd7XIwJK16LcxeS1Y+NFkUdYV0/h5S4YruQRk8CeKskYTaozCtvIeHvlj3tgFuL3Spbc9/WaDyENxqZ8WCDhywr4aC2m6/GFlYXWOffxyPPD98xPcwxqC1lsySWWehHwOsNFwAI8ZjhSWnlxnP8tzEHnl+UmBFSoV0wSXzLZ6SDU3hIxEip78FwBXlF0DV4knAa7i5ccZt5BgMXc+xWQphm711K/to4gQDfd7kYhOMUO9+ZGeFjH0uaJJVKVXbTgi+8hjPq9Qz79UBd+56yt0kFSHHm2+S1M0HFzwYl5OCnqLE5diu0mkzSiR4kKIYrWgMFDPy6mB2V+7UaF4MeM/ldDITIIduCm5IwrbkPZ4jlb1DNAr1yWqTR+upRX65G/zitihT93LrYXrw4QLxU5C2oUTC6WV/Kdqazn/LoqCoKPe3jHJ89fnPdsTvbgY0zuEzoRlZR7z873lgoFx6ETIxT27q+r0XCEhCb8fqzyZsinreNDXBLiLOly8RYrW3jDUKMuz8/S0l3fXcEwCyB7cwhR9G0txdbnoFuaGQdch94FrHzUtVQOHOAX0NzboSj/XmKXo0IRCeQ3JqBWsYZolUlCCLivvhQjufcdTnp2V4ZtFKL+U5X1jWBpsQQXj41EZ9emB/ZMUMi9TE6+M/MZg5zfhSWyonD6KfMB2lzWqcaF0yjmIqInvs2SxOMuGVNd8irgzABNtmU+1yL4BgL03Ro7fE9s+PYA5MBjGG/toaLF6ym282EkIj02x7aKcQ3I4uHEzWkthmVQJJPA1v3hDkh2zKI7kWZx0VuzTH8ccOeCyA4g7G4eQ3tVW8fD4tYwcRy0G7uFIBkMKByZdrTEixJP4JZG+ek0/VZy+cBpKyk09LkVRoVvGKpWXd7yjx3sMOTazVNQdfVSlxrvthfxLJUTnfz8KEycq6rTqPpKipwcQTeYy7bOOc7lRNI0mZYErwQpaY71PVT1xSU5Q65Fzhzq4yevrfXyrKjJEShAt++IsFY23/kYZNypfe3MuX5sJTjIadb9UR9JKDw773dvrlO46arhqvX8ehNaKcw+Pwl1VmGlJ3V9R2nEVwMtoj0DBIgA+UZNZmc8s8v12JYOD3Ds+EgaMYCutZlkg4XQO7nkriC33a7UJa3Kui6ziDI0U5BNLqmryTMvelNOCMi+Xx0HMes3UYN04AmMb8ghAJcj+Cb2CEzPcI6DNV5Wg/DVt/agKrvzg8OSYSo+StCQLQVUmLK4ECsM3rmu9qILytpDP8O4kBeoJN2oE7G35s7lxZINajd2s4MUSlnRl7yn+ZHc8fTj3YeFYOA+lPUanZ8LV03KJ3QO7ozw0ZlnlT5WMt4yGh+MJM2BADm1nnKp3G4D30kCm5CzfNyCXAZnoztGs+ncV3MwlVhjV2H9giJAI1dPu18H2CpxuEZKFK9VD6xg8ghobO/s3wxMZtTEabuRcQ52fLUNGbBj5MdEun5F4bRqHHDVHEWgO0OBsB45VedaHxyAsom/P9FC4XeMpQiE/AEVrVXEYjEWLDni+IZ1t1i21jqSx6qRUMn3QWVmiOlkbwSRjHMniRrm19BJks/4rwb8S5lI2GvSvSNkEKtnvOyh0EMjDglDVJxf3XvHmJrfM84eT81AQRI2gRVGQEdplueakynC7uvLDHdG16xCgITu2IsOT75/Smd1cOwsTVeiuZwV2ZzG4FVAOByXV1xNk+O206YJNpGSrLxm2uwK3/ex2UnqVn5RqQMJqldSk0mvrksNtV5HJ7f0JyiiOWkuQY+4GK8gUAmRs4H710c5yRohb2vlMwEvWoedxt7bVKHpXbbisNURyswRHiVvfEyt28CoRxBRDnpavvi/zMpn2PM4ugQjmQpKbKqSCKKn5eBCeYIxJ10JWvlJ8kwP55Jb9C/TTyoaeMScyaoCaizgNU1Xiky/2vCEFoh8Gx5CzkKPhAGNi6yomX7zBoT0ZCxGbtXsQJwiNvFOzJ296rBZZ80vncBV8OywIGhYBy8qW2Ol+08pj+gZ+BsQ3MYFngnxeryHxaZhsWAbSI+NRt7pEf+uNxojHYeavqyuIXJEi++KV/ZAv2iqX0+Sf+qlkSLc2afa4LYCScSo7V0UXg74OajFWprfE19hFPQmdsVZO9QnIVGlzTLJc3ZOUeBQtQX8wKBIywMZhSPN5C59jd0asF5KzYpWskSGbuplu4ElXoP9c9j62mWWeT9bXeQrQ6TZwrcPKkzQUlJq0kqtQj7uJXaaTahuStZAaItOrNxYSL1MAms1jEdgpZmYDpQO4PxFeddJ1MWg5Ne/oNK9sBxH9Vzw60YebYU92uJU27FbVrutMxHN3siAKbVqTnZl4wmZiv5W3YYQ2AdrqCRhJbkpadXFnSYW9L2/r7xG02CPdqYt1H087yz34SJLnK5sDkLaajGHNvlw49kNXMToHCOLMdk64E6yWlpgGKV2FJknS/3UUIjxCOB0MJ/y612Xqmg0idrifdYYsBzTXW7gKn5hQmkfwDHFqNJQKD6EalRWza7BFEUdbDftuyiEBWVAtxrFJGBj3P1I6o/byvzW88PwU4TJ/CJRlfroqOU4WqM1mMO2WnHTEf04xxwez5Iadp7ws66YXI8KJAFY8oLM/pg8NeebSw1LIylBu6+e/9iKn57Yo/KERPm/aM/nppW8VK53Fq8heeNWbK+Z4cGF0HZv0cRnCQeZ/w7UecTqfW2169w3DmyPSRhnnKzdsy4HBiKxv4pBSxKkr+XmWKkNdZNGqwyIyAi+mvFhxSKE9YjdkWn3EVNWMmxBEs8KXjsyqoV/XWYWwQq24BgDbOCpcjUXwcIPYsfgcjILQPTEqEhM/dXkIT8coC5dGv/IatKio849bUI7UY8SP8gakdPcBen6EoTxLqks3fPnAkB5U0xYlN9Ok0UYnLI6BXz0pIFJy67INXIwFc1KHg4/EqGYGs6tCM3fUwK+Rpv43zbKDsx+dvJu8ThONZxJDHMPvSpOXHcr8401ySZ7uZc7+ISxdVNeiCCs8sbDi+Q3c8Zmgm5Ln/WFUqLlfwVaRnhg0DcGEwKA6x21vJZ7Yl/ypuHd1bkv40mOfAbAlPRgFug7qPdYdSB1HlrJYLS1+fHFdo/V+wo1ZMYCCHIi86mwCZC0RlZ8rMvpjg7joRUijF84vRepluUnfp5YfUBK6JPhOE6PCP/xbGiYmjuGA7QfSZ1WXozmPZecwb3Mc7wH6k1FYSHA4TbMQQ/64w5VDCn6F9F8wVgmUKSn2CEZiiTbnrKlskVUUetmRmB3j68OOhy8e1k3SfyXYhqgMXJ+9zjkfXeMf8url64mHjo90xpeVHy/cl57hkzopWzcxmuxhIxfBge5CgwjmSA0U1wz3e2NVBUwiIUB9714f46eaVprh2flYaaURonbd4odn2374SZjlJOMrCqnSQrGB68gc20WEQAhTh+OfqENjQZDBY+rMjvasBmEtR20Topbk98Fit5Z7MPNkgtXeAU/ShHu6mzot8zvWe36/8D8kQAexL5dyB9+wJ8EGGz8nagNZGZwsCtifPV6Xwy8NdHvrHT49n6Wpt9WpphpKcKITgdivccEAxH1zFQC5rsogCeodg/qnItPQs9uPJrpRgWzAQr1VDAn3RVqVl9Tul8QrIjDAohvtcc3a6lpIGNzMdqwIFeure2lTDAVe0Ma8qWXZHNyXovoitcICOhLzGnfy4eAPFbG3EsEiN4RkHqUBZN4W2vZDtyl+XoR4x5qsVJZLtex9HP7WUscBR8QyBUoJLqx7EEPDRvc6OBKHR3tqLqDELlc/yhCL2QejA4Dm4f2owO++PqmtHa7wjeHB+FjMe2DwdmaepzMXybwElgwQjaHKcqqimdr46h96vXxPjD3Iqe3G6wXlEaspX42/M6oG/RIoRVgsccPgEDES1g5y/Jkc/gwFb8FvXXCDd1ZeGABkgyIuE3BuYL+NY9QuAxVIXgt6ttycCKeUryZkA6arOeSSobXuHcrRVFF0X3uRbep/pzMssy10cvibJLzmA07KdPsxuCFKQTLg9rD6cRKcrlc3RkXV3Z2+ZdIBQEbNt7PHX0678B/Zi73BMWwNk5Aoer8FJlax1HFNW1b3Lu8BFTpPWUTBw3mEO7bpjWYBbrZksCpT5VQbgZ1XJhv67uunXxTyqocyYoGgNAUSUe+SPFxLLlKn1aHoDsHIRtM/fBnvIkOyQdD7Ygip+ZG8GbHbUNUY9DcNGhliL+WxaW/PXepyOQyg14G62uNKBMTn6V4194KWQRa8jRtBnaKI/Yy5IOETFwN0FziR5K+mJUpxh9eOXJtg+UV2pykkwuaqizmSPUjLA246DgNuwWrfCD+rQcw2itLf2WyoI2VuZYygRVMVaiUDrpV/+oysYYqm/VbKAYeE+GOYSoh+RWO+KO1jzM8/XVnCpEvVWLMVklN54KcVk2JpalXKbIbJgQ+MHAMXDp8X9Tee6STtKE5l8zTvxWDc2OoCOb50QBN5cDVVLUqTKGwV4EtAsFYB/nvRgYZkSZYDXx0QiT2ic1aufZ5DyVzPNIU+WdZIm+ffu2ukJwP8mlJUBp6RtdbIm450kz8EXHfdNrgRVLhfB8K1Ms2wCNGD3X3X2jvZS8g0tyroDsLuOd3dc6TBWOG6Ek0faDaPte/bUfrRmklwLC0WFAi+SguiUQyF7Bzv88jjzdBFQ+5cTtWaTiaYoKFfpA2qKi/nRIK6oy3baJOwsCza/bJR6/g7fwBmFoMXOr8RmAR4lOv7mWizC0DPS1PMN7wbftdVSWtxq7MQts8PzM1OBknWGv2Dl1QbjYK5pZw85Xk3w3HrhT+cf+IpVuymDO7HhRSdA3WoLg23D2Ab5zUJQkXATY73HVDcEoj+zEigW1Kyv4hcKZDu5gOB8wad4Ej+W4L+hnul6ttzYbq/EYQ9sgRl0KH/2gO+aB73X98ekZWnO4P77Pcf3phgcT0KejU9hEUbtn5SZyFxULqk+7Lm9Q74DDFJgWKrnswBK9G2w6dxfOgfjHxAzSeGtUPwNR6cu2rLprS3JlGCJlLAbQtwdCXOjR/DcUwEtdZZlw+iVHwoh/3ndWy9PtugW3mM5D9hz+WbG2E3bk7B94ziqmYheDsVTnOsqi3jSv7cglk62SBbh88jIqg6RRxpU3zrSkWOaj7masue8UJvl+pJtLKCCJbKL68gio/MU1z46/8Rsy2ivB1dggK4GKv/jth1eVeWv996nYsrxrcoq7WdsXBPSh2o0yHJO9LLUjM/AFtt8KIduxT2OTLf6mbHPJMzsshBpyimLPwZcj1Aw3QRZGJ3s5uFWQQOAJz0OljBrosxq8jnVB38xPuDPVx71ObDr2Hya++/0GqTRaIlU6CbQ+2YF+ghYRfHYnQV2KIqixNKzfMp1mnQgfnbay703+fM8jVGFX4XML8aF0NzpVUIy0B/on8jPS2jGXvOD+KJbZz0dquFYYSVza9E9rLaNavmP1H9cQIVzVcpfr+pWyLatCTT2a0oUgQ3+32AE5jVkBIjlggvXjw6mOsns+N4mhapg/gSlsP0ndRQ4ZLaCC+QVKhMdjGRFzqOHP5CyIady+T/DTAslc3ixML0IqtzZ0zGdAPq+skHuwK5hNgUTMHie7glIyN7gy/g1/4/fMAUa+SC5fDTGyjSCk7UBLNdZLZ8pqqoRwvITfzfMDhlt7AVdUS9nGuQn3KAXl2zdSIkWrj0mQDFsBG0v4JY8VPX5VLMX53KDKsN0yzrNefGcxUU5U6vu5yVSdsoOz2MA0qkvgFXZwPZa8dLqTR3e41+ymvzzeFij8gPk8osKYzFoJmmids7p7BAmo72TdqML+lOeEfKdosA8yF77vARaEe/Xb9V5pxJx/42prIA+pO4CZvjZXqbldNuiNJVLXaEcTeu99JtY1cEm8iy1ALhuC8FyUoqhrNeIRZuLkUvWVHli/34ywIefFnH0Jt2"}],"role":"model"},"finishReason":"STOP","index":0}]