[
  {
    "sign_ta": "மேஷம்",
    "sign_en": "Aries",
    "date": "18-02-2026",
    "prediction_ta": "இன்று புதன்கிழமை என்பதால், புதன் பகவானின் ஆதிக்கம் மேலோங்கி இருக்கும். மேஷ ராசி அன்பர்களே, இன்று உங்களுக்கு அறிவுத்திறன் சார்ந்த விஷயங்களிலும், தகவல் தொடர்பிலும் மிகுந்த முன்னேற்றம் ஏற்படும். உங்கள் பேச்சிலும் எழுத்திலும் தெளிவு பிறக்கும். புதிய கருத்துக்களை எளிதில் வெளிப்படுத்தி அனைவரையும் கவரும் வகையில் செயல்படுவீர்கள். பல நாட்களாக தீர்க்கப்படாமல் இருந்த சில பிரச்சனைகளுக்கு இன்று ஒரு தெளிவான தீர்வு கிடைக்கும். உங்கள் மனது அமைதியுடன் காணப்படும். சக ஊழியர்களுடனும், குடும்ப உறுப்பினர்களுடனும் சுமுகமான உறவைப் பேணுவீர்கள். எந்த ஒரு காரியத்தையும் திட்டமிட்டு செயல்படுத்துவதில் வெற்றி காண்பீர்கள். உங்கள் நுண்ணறிவு மேம்படும். புதிய விஷயங்களை கற்றுக் கொள்வதில் ஆர்வம் காட்டுவீர்கள். மாணவர்கள் கல்வி சம்பந்தமான விஷயங்களில் சிறந்து விளங்குவார்கள். ஆசிரியர்கள் மற்றும் வழிகாட்டிகளின் ஆதரவு கிடைக்கும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் பயனுள்ளதாக அமையும். மனத்திறனை மேம்படுத்தும் செயல்களில் ஈடுபடுவீர்கள். தியானம், யோகா போன்ற பயிற்சிகள் உங்களுக்கு மன அமைதியையும், புத்துணர்வையும் அளிக்கும். உங்களது கருத்துக்களுக்கு இன்று மிகுந்த மதிப்பு கிடைக்கும். பிறரின் உணர்வுகளைப் புரிந்து கொண்டு செயல்படுவீர்கள். சமூகத்தில் உங்கள் மதிப்பு உயரும். புதிய தொடர்புகள் ஏற்படும். இவை உங்களுக்கு பல வகையிலும் பயனுள்ளதாக அமையும். உங்கள் ஆளுமைத்திறன் வெளிப்படும் நாள் இது.\nகுடும்பத்தில் சுப நிகழ்ச்சிகள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். உறவினர்களுடனான சந்திப்புகள் மகிழ்ச்சியை அளிக்கும். குழந்தைகளுடன் நேரம் செலவிடுவது உங்களுக்கு மன நிறைவைத் தரும். பெற்றோரின் ஆரோக்கியத்தில் கவனம் செலுத்துவது நல்லது. அவர்களின் தேவைகளை பூர்த்தி செய்வதில் ஆர்வம் காட்டுவீர்கள். வீட்டில் அமைதியும், மகிழ்ச்சியும் நிறைந்திருக்கும். கலை மற்றும் இலக்கியத் துறையில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். உங்கள் படைப்பாற்றல் இன்று உச்சத்தை அடையும். சமூக சேவைகளில் ஈடுபடுவோருக்கு நல்ல அங்கீகாரம் கிடைக்கும். தன்னார்வ தொண்டுகளில் ஆர்வம் காட்டுவீர்கள். இதனால் சமூகத்தில் உங்கள் மதிப்பு உயரும். உங்கள் மனதில் உள்ள நல்ல எண்ணங்களை வெளிப்படுத்த தயங்காதீர்கள். அவை பலருக்கும் பயனுள்ளதாக அமையும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். எதையும் ஆழமாக சிந்தித்து செயல்படுவீர்கள். மற்றவர்களுடன் இணைந்து பணியாற்றுவதில் வெற்றி காண்பீர்கள். கூட்டு முயற்சிகள் இன்று சிறப்பான பலனைத் தரும். நீண்டகாலமாக நிலுவையில் இருந்த காரியங்கள் இன்று ஒரு முடிவுக்கு வரும். எதிர்பாராத தனலாபம் உண்டாகும். முதலீடுகள் தொடர்பான விஷயங்களில் நிதானமாக முடிவெடுப்பது நல்லது. உங்களுக்கு புத்துணர்ச்சியும், புதிய ஆற்றலும் கிடைக்கும் நாள் இது. உங்களின் தன்னம்பிக்கை அதிகரிக்கும். எதிர்கால திட்டமிடல்களில் தெளிவு கிடைக்கும். புதிய தொழில் முயற்சிகள் பற்றிய ஆலோசனைகள் நடைபெறும். இன்று நீங்கள் எடுக்கும் முடிவுகள் சிறப்பான பலனைத் தரும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் மன அமைதியை அளிக்கும். இன்று நீங்கள் பிறருக்கு செய்யும் உதவிகள் உங்களுக்கு நன்மையை கொண்டு வரும். உங்கள் ஆற்றலை சரியான திசையில் செலுத்தி வெற்றி பெறுவீர்கள்.",
    "prediction_en": "As today is Wednesday, the influence of Mercury will be prominent. Aries natives, today you will experience significant progress in intellectual matters and communication. Clarity will emerge in your speech and writing. You will easily express new ideas and act in a way that captivates everyone. A clear solution will be found today for some problems that have remained unresolved for many days. Your mind will be at peace. You will maintain cordial relationships with colleagues and family members. You will succeed in planning and executing any task. Your intelligence will improve. You will show interest in learning new things. Students will excel in educational matters. Support from teachers and mentors will be available. Journeys undertaken today will be beneficial. You will engage in activities that enhance your mental capacity. Practices like meditation and yoga will bring you mental peace and rejuvenation. Your opinions will gain much value today. You will act with an understanding of others' feelings. Your reputation in society will increase. New connections will form, which will be beneficial to you in many ways. This is a day when your leadership qualities will be evident.\nDiscussions about auspicious events will take place in the family. Meetings with relatives will bring joy. Spending time with children will give you mental satisfaction. It is good to pay attention to your parents' health. You will show interest in fulfilling their needs. The home will be filled with peace and happiness. Good opportunities will arise for those in the arts and literature fields. Your creativity will reach its peak today. Those involved in social service will receive good recognition. You will show interest in volunteering, which will elevate your standing in society. Do not hesitate to express the good thoughts in your mind, as they will be beneficial to many. Innovative thoughts will guide you. You will think deeply before acting. You will succeed in working with others. Joint ventures will yield excellent results today. Long-pending tasks will come to a conclusion today. Unexpected financial gains are possible. It is advisable to make calm decisions regarding investment matters. This is a day when you will gain rejuvenation and new energy. Your self-confidence will increase. Clarity will be achieved in future planning. Discussions about new business ventures will take place. The decisions you make today will bring excellent results. Spiritual inclination will increase. Temple visits will provide peace of mind. The help you offer to others today will bring you good fortune. You will direct your energy in the right direction and achieve success.",
    "career_ta": "உத்தியோகத்தில் சிறப்பான முன்னேற்றம் காணப்படும். உங்கள் கருத்துக்களுக்கு மதிப்பு கிடைக்கும். சக ஊழியர்களின் ஆதரவுடன் பணிகளை சிறப்பாக முடிப்பீர்கள். புதிய திட்டங்களை முன்னெடுப்பதற்கான வாய்ப்புகள் அமையும். வணிகர்களுக்கு லாபம் அதிகரிக்கும். புதிய ஒப்பந்தங்கள் ஏற்படும். கூட்டாளி வகையில் நன்மைகள் உண்டாகும். சுயதொழில் செய்பவர்களுக்கு இன்று புதிய வாடிக்கையாளர்கள் கிடைப்பார்கள். உங்கள் கடின உழைப்புக்கு அங்கீகாரம் கிடைக்கும்.",
    "career_en": "Significant progress will be seen in your career. Your ideas will be valued. You will complete tasks efficiently with the support of colleagues. Opportunities will arise to initiate new projects. Business people will see increased profits. New contracts will be formed. Benefits will come through partners. Self-employed individuals will gain new clients today. Your hard work will be recognized.",
    "finance_ta": "பொருளாதார நிலை சீராக இருக்கும். எதிர்பாராத வரவுகள் உண்டாக வாய்ப்புள்ளது. நீண்டகால முதலீடுகள் பற்றி ஆலோசிப்பீர்கள். சேமிப்பு உயரும். கடன்கள் தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். புதிய நிதித் திட்டங்களில் ஈடுபடுவதற்கு முன், நன்கு ஆராய்வது நல்லது. செலவுகளை கவனமாகக் கையாள்வீர்கள். குடும்பத்தின் நிதித் தேவைகளை சிறப்பாக பூர்த்தி செய்வீர்கள்.",
    "finance_en": "The financial situation will be stable. There is a possibility of unexpected income. You will consider long-term investments. Savings will increase. Good progress will be made in matters related to debts. It is good to thoroughly research before engaging in new financial schemes. You will manage expenses carefully. You will effectively meet the financial needs of your family.",
    "health_ta": "ஆரோக்கியம் சிறப்பாக இருக்கும். மன அழுத்தம் குறைந்து, புத்துணர்ச்சியுடன் செயல்படுவீர்கள். உடல் நலத்தில் கூடுதல் கவனம் செலுத்துவது நல்லது. யோகா, தியானம் போன்ற பயிற்சிகள் உங்களுக்கு பலன் தரும். பழங்கள், காய்கறிகள் நிறைந்த உணவை உட்கொள்வது உடல் ஆரோக்கியத்தை மேம்படுத்தும். புத்துணர்ச்சி தரும் பானங்களை அருந்துவது நல்லது.",
    "health_en": "Health will be excellent. Stress will reduce, and you will act with renewed vigor. It is good to pay extra attention to your physical well-being. Practices like yoga and meditation will benefit you. Consuming a diet rich in fruits and vegetables will improve physical health. It is good to drink refreshing beverages.",
    "lucky_number": 9,
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "ரிஷபம்",
    "sign_en": "Taurus",
    "date": "18-02-2026",
    "prediction_ta": "இன்று புதன்கிழமை, புதனின் ஆதிக்கம் நிறைந்த நாள். ரிஷப ராசி அன்பர்களே, இன்று உங்கள் மனதில் தெளிவும், சிந்தனைகளில் புத்துணர்ச்சியும் மேலோங்கும். நீண்ட நாட்களாக நிலுவையில் இருந்த சில காரியங்களை இன்று திறம்பட முடிப்பீர்கள். உங்கள் ஆற்றலை சரியான திசையில் செலுத்தி வெற்றி காண்பீர்கள். குடும்ப உறுப்பினர்களுடனான உறவில் நல்லிணக்கம் ஏற்படும். உங்கள் பேச்சாற்றல் மூலம் பிறரை வசீகரிப்பீர்கள். தகவல் தொடர்பு துறையில் இருப்பவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் அமையும். எழுதுவது, கற்பிப்பது அல்லது பேசுவது போன்ற துறைகளில் உங்களின் தனித்திறமை வெளிப்படும். புதிய நுட்பங்களை கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். இது உங்கள் அறிவுத்திறனை மேலும் மேம்படுத்தும். சமூக வலைத்தளங்கள் மூலம் புதிய தொடர்புகள் ஏற்படும். இவை எதிர்காலத்தில் உங்களுக்கு பயனுள்ளதாக அமையும். உங்கள் நுண்ணறிவு இன்று கூர்மையடையும். எந்த ஒரு பிரச்சனைக்கும் தர்க்கரீதியான தீர்வுகளைக் காண்பீர்கள். மன அமைதி கிடைக்கும் நாள் இது. தியானம் அல்லது வாசிப்பு போன்ற செயல்களில் ஈடுபடுவது உங்களுக்கு மன அமைதியை அளிக்கும்.\nவீட்டில் சுப காரியங்கள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். உறவினர்களுடனான சந்திப்புகள் மன மகிழ்ச்சியை ஏற்படுத்தும். கலை மற்றும் இசை சார்ந்த துறைகளில் ஆர்வம் கொண்டவர்களுக்கு இன்று நல்ல வாய்ப்புகள் அமையும். உங்கள் படைப்பாற்றல் வெளிப்படும். குழந்தைகளுடன் நேரம் செலவிடுவது உங்களுக்கு மனநிறைவைத் தரும். பெற்றோரின் தேவைகளை நிறைவேற்றுவதில் கவனம் செலுத்துவீர்கள். சமூகத்தில் உங்கள் மதிப்பு உயரும். பிறருக்கு உதவ வேண்டும் என்ற எண்ணம் மேலோங்கும். புதிய நண்பர்களை உருவாக்குவீர்கள். கூட்டு முயற்சிகள் மற்றும் குழுப்பணிகளில் நீங்கள் சிறந்து விளங்குவீர்கள். உங்களின் தலைமைப் பண்பு வெளிப்படும். இன்று மேற்கொள்ளும் பயணங்கள் பயனுள்ளதாக அமையும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் மன அமைதியை அளிக்கும். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் சிறப்பான பலனைத் தரும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். எதையும் ஆழமாக சிந்தித்து செயல்படுவீர்கள். நீண்டகாலமாக நிலுவையில் இருந்த காரியங்கள் இன்று ஒரு முடிவுக்கு வரும். திடீர் தனலாபம் உண்டாக வாய்ப்புள்ளது. முதலீடுகள் தொடர்பான விஷயங்களில் நிதானமாக முடிவெடுப்பது நல்லது. உங்களின் தன்னம்பிக்கை அதிகரிக்கும். எதிர்கால திட்டமிடல்களில் தெளிவு கிடைக்கும். புதிய தொழில் முயற்சிகள் பற்றிய ஆலோசனைகள் நடைபெறும். இன்று நீங்கள் பிறருக்கு செய்யும் உதவிகள் உங்களுக்கு நன்மையை கொண்டு வரும். உங்கள் ஆற்றலை சரியான திசையில் செலுத்தி வெற்றி பெறுவீர்கள்.",
    "prediction_en": "Today is Wednesday, a day filled with the influence of Mercury. Taurus natives, today clarity will prevail in your mind, and your thoughts will be rejuvenated. You will successfully complete some long-pending tasks today. You will channel your energy in the right direction and achieve success. Harmony will prevail in relationships with family members. You will charm others with your eloquence. Those in the communication sector will have excellent opportunities today. Your unique talents in fields such as writing, teaching, or speaking will emerge. You will show interest in learning new techniques, which will further enhance your intellect. New connections will form through social media, which will be beneficial to you in the future. Your intelligence will sharpen today. You will find logical solutions to any problem. This is a day for mental peace. Engaging in activities like meditation or reading will bring you tranquility.\nDiscussions about auspicious events will take place at home. Meetings with relatives will bring joy. Those interested in arts and music will have good opportunities today. Your creativity will emerge. Spending time with children will bring you satisfaction. You will focus on fulfilling your parents' needs. Your reputation in society will increase. The desire to help others will be strong. You will make new friends. You will excel in collaborative efforts and teamwork. Your leadership qualities will be evident. Journeys undertaken today will be beneficial. Spiritual inclination will increase. Temple visits will bring mental peace. All decisions you make today will yield excellent results. Innovative thoughts will guide you. You will think deeply before acting. Long-pending tasks will come to a conclusion today. There is a possibility of unexpected financial gain. It is advisable to make calm decisions regarding investment matters. Your self-confidence will increase. Clarity will be achieved in future planning. Discussions about new business ventures will take place. The help you offer to others today will bring you good fortune. You will direct your energy in the right direction and achieve success.",
    "career_ta": "தொழில் மற்றும் வியாபாரத்தில் நல்ல வளர்ச்சி காணப்படும். புதிய வாய்ப்புகள் உங்களைத் தேடி வரும். உங்கள் பேச்சாற்றல் உங்களுக்கு வெற்றியைப் பெற்றுத்தரும். சக ஊழியர்கள் மற்றும் மேலதிகாரிகளின் ஆதரவு கிடைக்கும். வணிகர்களுக்கு லாபம் அதிகரிக்கும். புதிய ஒப்பந்தங்களில் கையெழுத்திடும் வாய்ப்பு உண்டு. உங்கள் யோசனைகள் ஏற்றுக்கொள்ளப்பட்டு பாராட்டுக்களைப் பெறும். உங்களின் கடின உழைப்புக்கு நல்ல பலன் கிடைக்கும்.",
    "career_en": "Good growth will be seen in your career and business. New opportunities will seek you out. Your eloquence will bring you success. Support from colleagues and superiors will be available. Business people will see increased profits. There is a chance to sign new contracts. Your ideas will be accepted and receive praise. Your hard work will yield good results.",
    "finance_ta": "பொருளாதார நிலை ஸ்திரமாக இருக்கும். பண வரவு அதிகரிக்கும். புதிய முதலீடுகள் செய்வதற்கு முன் நன்கு ஆலோசிப்பது நல்லது. சேமிப்பு உயரும். வீண் செலவுகளைக் குறைப்பீர்கள். நிதி திட்டமிடலில் சிறந்து விளங்குவீர்கள். குடும்பத்தின் தேவைகளை சிறப்பாக பூர்த்தி செய்வீர்கள். பழைய கடன்கள் தீரும் வழி பிறக்கும்.",
    "finance_en": "The financial situation will be stable. Income will increase. It is advisable to consult thoroughly before making new investments. Savings will increase. You will reduce unnecessary expenses. You will excel in financial planning. You will effectively meet the needs of your family. A way to clear old debts will emerge.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மன அமைதியுடன் செயல்படுவீர்கள். சுவாசப் பயிற்சிகள் மற்றும் யோகா செய்வது நல்லது. சரியான உணவுப் பழக்கவழக்கங்களைப் பின்பற்றுவதன் மூலம் ஆரோக்கியத்தை மேம்படுத்தலாம். போதுமான ஓய்வு எடுப்பது அவசியம். மனநிறைவுடன் செயல்படுவதால் உடல் சோர்வு குறையும்.",
    "health_en": "Physical health will be stable. You will act with mental peace. Practicing breathing exercises and yoga is beneficial. You can improve health by following proper dietary habits. Sufficient rest is essential. Acting with contentment will reduce physical fatigue.",
    "lucky_number": 6,
    "lucky_color_ta": "வெள்ளை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "மிதுனம்",
    "sign_en": "Gemini",
    "date": "18-02-2026",
    "prediction_ta": "இன்று புதன்கிழமை, உங்கள் ராசிக்கு அதிபதியான புதனின் ஆதிக்கம் மிகுந்த நாள். மிதுன ராசி அன்பர்களே, இன்று உங்கள் புத்திசாலித்தனம் உச்சத்தை அடையும். தகவல் தொடர்பு மற்றும் புதிய விஷயங்களைக் கற்றுக்கொள்வதில் உங்களுக்கு மிகுந்த ஆர்வம் ஏற்படும். உங்களின் கூர்மையான அறிவாற்றல் மூலம் எந்த ஒரு சவாலையும் எளிதில் எதிர்கொள்வீர்கள். பலதரப்பட்ட மக்களுடன் கலந்துரையாடி புதிய அனுபவங்களைப் பெறுவீர்கள். புதிய திட்டங்களை வகுப்பதிலும், அவற்றை செயல்படுத்துவதிலும் வெற்றி காண்பீர்கள். உங்கள் பேச்சாற்றல் இன்று மிகவும் சிறப்பாக இருக்கும். பிறரை கவர்ந்து இழுக்கும் வகையில் உரையாடுவீர்கள். எழுத்துத் துறை, ஊடகம், கல்வி போன்ற துறைகளில் உள்ளவர்களுக்கு இன்று பொன்னான வாய்ப்புகள் அமையும். புதிய ஒப்பந்தங்கள் மற்றும் கூட்டணிகள் ஏற்பட வாய்ப்புள்ளது. உங்களின் யோசனைகள் ஏற்றுக்கொள்ளப்பட்டு பாராட்டுகளைப் பெறும். மனதில் அமைதியும், தெளிவும் நிறைந்திருக்கும். மனதை ஒருமுகப்படுத்தி செய்யும் காரியங்களில் வெற்றி நிச்சயம். மாணவர்கள் கல்வி சம்பந்தமான விஷயங்களில் சிறந்து விளங்குவார்கள். அவர்களின் கடின உழைப்புக்கு நல்ல பலன் கிடைக்கும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் பயனுள்ளதாக அமையும். குறிப்பாக கல்வி அல்லது தொழில் சார்ந்த பயணங்கள் வெற்றியைத் தரும். தியானம், வாசிப்பு போன்ற செயல்களில் ஈடுபடுவது உங்களுக்கு மன அமைதியை அளிக்கும்.\nகுடும்பத்தில் மகிழ்ச்சியான சூழ்நிலை நிலவும். உறவினர்களுடனான சந்திப்புகள் இனிமையாக இருக்கும். குறிப்பாக, இளைய சகோதர, சகோதரிகளின் ஆதரவு கிடைக்கும். குழந்தைகளுடன் மனம் விட்டுப் பேசுவது அவர்களுக்கு உற்சாகத்தை அளிக்கும். பெற்றோரின் உடல்நிலையில் கவனம் செலுத்துவீர்கள். கலை மற்றும் இலக்கியத் துறையில் உள்ளவர்களுக்கு இன்று நல்ல வாய்ப்புகள் அமையும். உங்கள் படைப்பாற்றல் இன்று உச்சத்தை அடையும். சமூக சேவைகளில் ஈடுபடுவோருக்கு நல்ல அங்கீகாரம் கிடைக்கும். தன்னார்வ தொண்டுகளில் ஆர்வம் காட்டுவீர்கள். இதனால் சமூகத்தில் உங்கள் மதிப்பு உயரும். உங்கள் மனதில் உள்ள நல்ல எண்ணங்களை வெளிப்படுத்த தயங்காதீர்கள். அவை பலருக்கும் பயனுள்ளதாக அமையும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். எதையும் ஆழமாக சிந்தித்து செயல்படுவீர்கள். மற்றவர்களுடன் இணைந்து பணியாற்றுவதில் வெற்றி காண்பீர்கள். கூட்டு முயற்சிகள் இன்று சிறப்பான பலனைத் தரும். நீண்டகாலமாக நிலுவையில் இருந்த காரியங்கள் இன்று ஒரு முடிவுக்கு வரும். எதிர்பாராத தனலாபம் உண்டாகும். முதலீடுகள் தொடர்பான விஷயங்களில் நிதானமாக முடிவெடுப்பது நல்லது. உங்களுக்கு புத்துணர்ச்சியும், புதிய ஆற்றலும் கிடைக்கும் நாள் இது. உங்களின் தன்னம்பிக்கை அதிகரிக்கும். எதிர்கால திட்டமிடல்களில் தெளிவு கிடைக்கும். புதிய தொழில் முயற்சிகள் பற்றிய ஆலோசனைகள் நடைபெறும். இன்று நீங்கள் எடுக்கும் முடிவுகள் சிறப்பான பலனைத் தரும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் மன அமைதியை அளிக்கும். இன்று நீங்கள் பிறருக்கு செய்யும் உதவிகள் உங்களுக்கு நன்மையை கொண்டு வரும். உங்கள் ஆற்றலை சரியான திசையில் செலுத்தி வெற்றி பெறுவீர்கள்.",
    "prediction_en": "Today is Wednesday, a day of strong influence from Mercury, your ruling planet. Gemini natives, today your intelligence will reach its peak. You will have immense interest in communication and learning new things. With your keen intellect, you will easily face any challenge. You will interact with various people and gain new experiences. You will succeed in formulating new plans and implementing them. Your eloquence will be exceptional today. You will converse in a charming manner. Those in writing, media, and education fields will have golden opportunities today. New contracts and alliances are likely to form. Your ideas will be accepted and praised. Your mind will be filled with peace and clarity. Success is certain in tasks undertaken with focus. Students will excel in educational matters. Their hard work will yield good results. Journeys undertaken today will be beneficial, especially those related to education or career, which will bring success. Engaging in activities like meditation and reading will bring you mental peace.\nA joyous atmosphere will prevail in the family. Meetings with relatives will be pleasant. In particular, you will receive support from younger siblings. Heart-to-heart conversations with children will boost their morale. You will pay attention to your parents' health. Those in arts and literature will have good opportunities today. Your creativity will reach its peak today. Those involved in social service will receive good recognition. You will show interest in volunteering, which will elevate your standing in society. Do not hesitate to express the good thoughts in your mind, as they will be beneficial to many. Innovative thoughts will guide you. You will think deeply before acting. You will succeed in working with others. Joint ventures will yield excellent results today. Long-pending tasks will come to a conclusion today. Unexpected financial gains are possible. It is advisable to make calm decisions regarding investment matters. This is a day when you will gain rejuvenation and new energy. Your self-confidence will increase. Clarity will be achieved in future planning. Discussions about new business ventures will take place. The decisions you make today will bring excellent results. Spiritual inclination will increase. Temple visits will provide peace of mind. The help you offer to others today will bring you good fortune. You will direct your energy in the right direction and achieve success.",
    "career_ta": "தொழில்ரீதியாக இன்று அனுகூலமான நாளாகும். உங்கள் புத்திசாலித்தனம் புதிய வாய்ப்புகளைப் பெற்றுத் தரும். பேச்சுவார்த்தைகளில் வெற்றி பெறுவீர்கள். அலுவலகத்தில் உங்கள் யோசனைகளுக்கு மதிப்பு கிடைக்கும். வணிகர்களுக்கு லாபம் அதிகரிக்கும். புதிய ஒப்பந்தங்கள் கையெழுத்தாகும். ஊடகத்துறை, எழுத்துப்பணி, கல்வி போன்ற துறைகளில் உள்ளவர்கள் சிறப்பான முன்னேற்றத்தைக் காண்பார்கள்.",
    "career_en": "Professionally, today is a favorable day. Your intelligence will bring new opportunities. You will succeed in negotiations. Your ideas will be valued in the office. Business people will see increased profits. New contracts will be signed. Those in media, writing, and education will see excellent progress.",
    "finance_ta": "பொருளாதார நிலை மேம்படும். புதிய முதலீடுகள் பற்றி சாதகமாக சிந்திப்பீர்கள். புத்திசாலித்தனமான முடிவுகள் நிதி நிலையில் நல்ல மாற்றங்களைக் கொண்டு வரும். சேமிப்பு உயரும். கடன்கள் தொடர்பான பிரச்சனைகளுக்கு தீர்வு காணப்படும். எதிர்பாராத வகையில் பண வரவுகள் உண்டாக வாய்ப்புள்ளது. செலவுகளைக் கட்டுப்படுத்துவதில் கவனம் செலுத்துவீர்கள்.",
    "finance_en": "The financial situation will improve. You will think favorably about new investments. Intelligent decisions will bring positive changes to your financial status. Savings will increase. Solutions will be found for debt-related problems. There is a possibility of unexpected income. You will focus on controlling expenses.",
    "health_ta": "ஆரோக்கியம் சிறப்பாக இருக்கும். மனத்தெளிவுடன் செயல்படுவீர்கள். தேவையற்ற மன அழுத்தத்தைக் குறைத்து, உற்சாகத்துடன் இருப்பீர்கள். யோகா மற்றும் பிராணாயாமம் போன்ற பயிற்சிகள் உங்களுக்கு நன்மை பயக்கும். சீரான உணவு மற்றும் போதுமான தூக்கம் உடல் ஆரோக்கியத்திற்கு மிகவும் அவசியம்.",
    "health_en": "Health will be excellent. You will act with mental clarity. You will reduce unnecessary stress and remain enthusiastic. Practices like yoga and pranayama will benefit you. A balanced diet and sufficient sleep are crucial for physical health.",
    "lucky_number": 5,
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "18-02-2026",
    "prediction_ta": "இன்று புதன்கிழமை, புதன் பகவானின் செல்வாக்கு இன்று கடக ராசி அன்பர்களுக்கு தகவல் தொடர்பு மற்றும் அறிவுத் துறையில் சிறப்பான முன்னேற்றத்தை அளிக்கும். உங்கள் மனதில் இருந்த குழப்பங்கள் நீங்கி, தெளிவான சிந்தனை உருவாகும். எந்த ஒரு விஷயத்திலும் ஆழமாக சிந்தித்து முடிவெடுப்பீர்கள். குடும்ப உறுப்பினர்களுடனும், நண்பர்களுடனும் இனிமையான உரையாடல்கள் நடைபெறும். உங்கள் பேச்சில் மென்மையும், அதே சமயம் உறுதியும் இருக்கும். பிறரின் உணர்வுகளைப் புரிந்து கொண்டு செயல்படுவீர்கள். இது உங்கள் உறவுகளை மேம்படுத்தும். புதிய விஷயங்களைக் கற்றுக் கொள்வதிலும், உங்களின் அறிவை மேம்படுத்துவதிலும் ஆர்வம் காட்டுவீர்கள். புத்தக வாசிப்பு, கல்வி சார்ந்த நிகழ்ச்சிகளில் பங்கேற்பது உங்களுக்கு பயனுள்ளதாக அமையும். மாணவர்கள் கல்வி சம்பந்தமான விஷயங்களில் சிறந்து விளங்குவார்கள். அவர்களின் கடின உழைப்புக்கு நல்ல பலன் கிடைக்கும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் பயனுள்ளதாக அமையும். குறிப்பாக கல்வி அல்லது தொழில் சார்ந்த பயணங்கள் வெற்றியைத் தரும். மன அமைதி கிடைக்கும் நாள் இது. தியானம், வாசிப்பு போன்ற செயல்களில் ஈடுபடுவது உங்களுக்கு மன அமைதியை அளிக்கும்.\nவீட்டில் மகிழ்ச்சியான சூழ்நிலை நிலவும். சுப காரியங்கள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். உறவினர்களுடனான சந்திப்புகள் இனிமையாக இருக்கும். குழந்தைகளுடன் மனம் விட்டுப் பேசுவது அவர்களுக்கு உற்சாகத்தை அளிக்கும். பெற்றோரின் உடல்நிலையில் கவனம் செலுத்துவீர்கள். கலை மற்றும் இலக்கியத் துறையில் உள்ளவர்களுக்கு இன்று நல்ல வாய்ப்புகள் அமையும். உங்கள் படைப்பாற்றல் இன்று உச்சத்தை அடையும். சமூக சேவைகளில் ஈடுபடுவோருக்கு நல்ல அங்கீகாரம் கிடைக்கும். தன்னார்வ தொண்டுகளில் ஆர்வம் காட்டுவீர்கள். இதனால் சமூகத்தில் உங்கள் மதிப்பு உயரும். உங்கள் மனதில் உள்ள நல்ல எண்ணங்களை வெளிப்படுத்த தயங்காதீர்கள். அவை பலருக்கும் பயனுள்ளதாக அமையும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். எதையும் ஆழமாக சிந்தித்து செயல்படுவீர்கள். மற்றவர்களுடன் இணைந்து பணியாற்றுவதில் வெற்றி காண்பீர்கள். கூட்டு முயற்சிகள் இன்று சிறப்பான பலனைத் தரும். நீண்டகாலமாக நிலுவையில் இருந்த காரியங்கள் இன்று ஒரு முடிவுக்கு வரும். எதிர்பாராத தனலாபம் உண்டாகும். முதலீடுகள் தொடர்பான விஷயங்களில் நிதானமாக முடிவெடுப்பது நல்லது. உங்களுக்கு புத்துணர்ச்சியும், புதிய ஆற்றலும் கிடைக்கும் நாள் இது. உங்களின் தன்னம்பிக்கை அதிகரிக்கும். எதிர்கால திட்டமிடல்களில் தெளிவு கிடைக்கும். புதிய தொழில் முயற்சிகள் பற்றிய ஆலோசனைகள் நடைபெறும். இன்று நீங்கள் எடுக்கும் முடிவுகள் சிறப்பான பலனைத் தரும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் மன அமைதியை அளிக்கும். இன்று நீங்கள் பிறருக்கு செய்யும் உதவிகள் உங்களுக்கு நன்மையை கொண்டு வரும். உங்கள் ஆற்றலை சரியான திசையில் செலுத்தி வெற்றி பெறுவீர்கள்.",
    "prediction_en": "As today is Wednesday, the influence of Mercury will bring excellent progress in communication and intellectual fields for Cancer natives. Confusions in your mind will dissipate, and clear thinking will emerge. You will deeply contemplate and make decisions in any matter. Pleasant conversations will take place with family members and friends. Your speech will be gentle yet firm. You will act with an understanding of others' feelings, which will improve your relationships. You will show interest in learning new things and enhancing your knowledge. Reading books and participating in educational programs will be beneficial to you. Students will excel in educational matters. Their hard work will yield good results. Journeys undertaken today will be beneficial, especially those related to education or career, which will bring success. This is a day for mental peace. Engaging in activities like meditation and reading will bring you tranquility.\nA joyous atmosphere will prevail in the family. Discussions about auspicious events will take place. Meetings with relatives will be pleasant. Heart-to-heart conversations with children will boost their morale. You will pay attention to your parents' health. Those in arts and literature will have good opportunities today. Your creativity will reach its peak today. Those involved in social service will receive good recognition. You will show interest in volunteering, which will elevate your standing in society. Do not hesitate to express the good thoughts in your mind, as they will be beneficial to many. Innovative thoughts will guide you. You will think deeply before acting. You will succeed in working with others. Joint ventures will yield excellent results today. Long-pending tasks will come to a conclusion today. Unexpected financial gains are possible. It is advisable to make calm decisions regarding investment matters. This is a day when you will gain rejuvenation and new energy. Your self-confidence will increase. Clarity will be achieved in future planning. Discussions about new business ventures will take place. The decisions you make today will bring excellent results. Spiritual inclination will increase. Temple visits will provide peace of mind. The help you offer to others today will bring you good fortune. You will direct your energy in the right direction and achieve success.",
    "career_ta": "தொழில்ரீதியாக இன்று வளர்ச்சி காணும் நாளாகும். உங்கள் பேச்சுத்திறமை மூலம் புதிய திட்டங்களில் வெற்றி பெறுவீர்கள். சக ஊழியர்களுடனும், மேலதிகாரிகளுடனும் நல்லுறவு நீடிக்கும். உங்கள் யோசனைகளுக்கு நல்ல வரவேற்பு கிடைக்கும். வணிகர்களுக்கு புதிய வாடிக்கையாளர்கள் கிடைப்பார்கள். நிதி சார்ந்த துறையில் இருப்பவர்களுக்கு இன்று நல்ல வாய்ப்புகள் அமையும். புதிய ஒப்பந்தங்கள் ஏற்படும்.",
    "career_en": "Professionally, today is a day of growth. You will succeed in new projects through your eloquence. Good relationships will continue with colleagues and superiors. Your ideas will receive a good reception. Business people will gain new clients. Those in finance will have good opportunities today. New contracts will be formed.",
    "finance_ta": "பொருளாதார நிலை திருப்திகரமாக இருக்கும். புதிய முதலீடுகள் பற்றி ஆலோசிப்பீர்கள். சேமிக்கும் எண்ணம் மேலோங்கும். குடும்பச் செலவுகளை சிறப்பாக நிர்வகிப்பீர்கள். எதிர்பாராத வரவுகள் உண்டாக வாய்ப்புள்ளது. நிதி திட்டமிடலில் நிதானமாக செயல்படுவது நல்லது. பழைய கடன்களை அடைக்க வாய்ப்புகள் அமையும்.",
    "finance_en": "The financial situation will be satisfactory. You will consider new investments. The desire to save will be strong. You will manage family expenses well. There is a possibility of unexpected income. It is good to act calmly in financial planning. Opportunities will arise to clear old debts.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் அமைதி நிலவும். மனநிறைவுடன் செயல்படுவதால் உடல் சோர்வு குறையும். மிதமான உடற்பயிற்சிகளை மேற்கொள்வது நல்லது. நீர்ச்சத்து நிறைந்த உணவுகளை உட்கொள்வது ஆரோக்கியத்திற்கு நல்லது. போதுமான ஓய்வு எடுப்பது மன அழுத்தத்தைக் குறைக்கும்.",
    "health_en": "Physical health will be stable. Peace of mind will prevail. Physical fatigue will reduce due to acting with contentment. Moderate exercises are beneficial. Consuming water-rich foods is good for health. Sufficient rest will reduce stress.",
    "lucky_number": 2,
    "lucky_color_ta": "வெள்ளி நிறம்",
    "lucky_color_en": "Silver"
  },
  {
    "sign_ta": "சிம்மம்",
    "sign_en": "Leo",
    "date": "18-02-2026",
    "prediction_ta": "இன்று புதன்கிழமை, புதன் பகவானின் ஆதிக்கம் சிம்ம ராசி அன்பர்களுக்கு அறிவுத்திறன் மற்றும் தகவல் தொடர்பில் நல்ல வாய்ப்புகளை உருவாக்கும். உங்கள் புத்திசாலித்தனம் இன்று பளிச்சிடும். மற்றவர்களுடன் தெளிவான மற்றும் உறுதியான முறையில் தொடர்புகொள்வீர்கள். உங்கள் கருத்துக்களுக்கு மதிப்பு கிடைக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். இது உங்களின் தனிப்பட்ட வளர்ச்சிக்கு வழிவகுக்கும். பல நாட்களாக தீர்க்கப்படாமல் இருந்த சில பிரச்சனைகளுக்கு இன்று ஒரு தெளிவான தீர்வு கிடைக்கும். உங்கள் மனது அமைதியுடன் காணப்படும். சக ஊழியர்களுடனும், குடும்ப உறுப்பினர்களுடனும் சுமுகமான உறவைப் பேணுவீர்கள். எந்த ஒரு காரியத்தையும் திட்டமிட்டு செயல்படுத்துவதில் வெற்றி காண்பீர்கள். உங்கள் நுண்ணறிவு மேம்படும். மாணவர்கள் கல்வி சம்பந்தமான விஷயங்களில் சிறந்து விளங்குவார்கள். ஆசிரியர்கள் மற்றும் வழிகாட்டிகளின் ஆதரவு கிடைக்கும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் பயனுள்ளதாக அமையும். மனத்திறனை மேம்படுத்தும் செயல்களில் ஈடுபடுவீர்கள். தியானம், யோகா போன்ற பயிற்சிகள் உங்களுக்கு மன அமைதியையும், புத்துணர்வையும் அளிக்கும். உங்களது கருத்துக்களுக்கு இன்று மிகுந்த மதிப்பு கிடைக்கும். பிறரின் உணர்வுகளைப் புரிந்து கொண்டு செயல்படுவீர்கள். சமூகத்தில் உங்கள் மதிப்பு உயரும். புதிய தொடர்புகள் ஏற்படும். இவை உங்களுக்கு பல வகையிலும் பயனுள்ளதாக அமையும். உங்கள் ஆளுமைத்திறன் வெளிப்படும் நாள் இது.\nகுடும்பத்தில் சுப நிகழ்ச்சிகள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். உறவினர்களுடனான சந்திப்புகள் மகிழ்ச்சியை அளிக்கும். குழந்தைகளுடன் நேரம் செலவிடுவது உங்களுக்கு மன நிறைவைத் தரும். பெற்றோரின் ஆரோக்கியத்தில் கவனம் செலுத்துவது நல்லது. அவர்களின் தேவைகளை பூர்த்தி செய்வதில் ஆர்வம் காட்டுவீர்கள். வீட்டில் அமைதியும், மகிழ்ச்சியும் நிறைந்திருக்கும். கலை மற்றும் இலக்கியத் துறையில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். உங்கள் படைப்பாற்றல் இன்று உச்சத்தை அடையும். சமூக சேவைகளில் ஈடுபடுவோருக்கு நல்ல அங்கீகாரம் கிடைக்கும். தன்னார்வ தொண்டுகளில் ஆர்வம் காட்டுவீர்கள். இதனால் சமூகத்தில் உங்கள் மதிப்பு உயரும். உங்கள் மனதில் உள்ள நல்ல எண்ணங்களை வெளிப்படுத்த தயங்காதீர்கள். அவை பலருக்கும் பயனுள்ளதாக அமையும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். எதையும் ஆழமாக சிந்தித்து செயல்படுவீர்கள். மற்றவர்களுடன் இணைந்து பணியாற்றுவதில் வெற்றி காண்பீர்கள். கூட்டு முயற்சிகள் இன்று சிறப்பான பலனைத் தரும். நீண்டகாலமாக நிலுவையில் இருந்த காரியங்கள் இன்று ஒரு முடிவுக்கு வரும். எதிர்பாராத தனலாபம் உண்டாகும். முதலீடுகள் தொடர்பான விஷயங்களில் நிதானமாக முடிவெடுப்பது நல்லது. உங்களுக்கு புத்துணர்ச்சியும், புதிய ஆற்றலும் கிடைக்கும் நாள் இது. உங்களின் தன்னம்பிக்கை அதிகரிக்கும். எதிர்கால திட்டமிடல்களில் தெளிவு கிடைக்கும். புதிய தொழில் முயற்சிகள் பற்றிய ஆலோசனைகள் நடைபெறும். இன்று நீங்கள் எடுக்கும் முடிவுகள் சிறப்பான பலனைத் தரும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் மன அமைதியை அளிக்கும். இன்று நீங்கள் பிறருக்கு செய்யும் உதவிகள் உங்களுக்கு நன்மையை கொண்டு வரும். உங்கள் ஆற்றலை சரியான திசையில் செலுத்தி வெற்றி பெறுவீர்கள்.",
    "prediction_en": "As today is Wednesday, the influence of Mercury will create good opportunities for Leo natives in intellectual and communication fields. Your intelligence will shine today. You will communicate with others clearly and decisively. Your ideas will be valued. You will show interest in learning new things, which will lead to your personal growth. A clear solution will be found today for some problems that have remained unresolved for many days. Your mind will be at peace. You will maintain cordial relationships with colleagues and family members. You will succeed in planning and executing any task. Your intelligence will improve. Students will excel in educational matters. Support from teachers and mentors will be available. Journeys undertaken today will be beneficial. You will engage in activities that enhance your mental capacity. Practices like meditation and yoga will bring you mental peace and rejuvenation. Your opinions will gain much value today. You will act with an understanding of others' feelings. Your reputation in society will increase. New connections will form, which will be beneficial to you in many ways. This is a day when your leadership qualities will be evident.\nDiscussions about auspicious events will take place in the family. Meetings with relatives will bring joy. Spending time with children will give you mental satisfaction. It is good to pay attention to your parents' health. You will show interest in fulfilling their needs. The home will be filled with peace and happiness. Good opportunities will arise for those in the arts and literature fields. Your creativity will reach its peak today. Those involved in social service will receive good recognition. You will show interest in volunteering, which will elevate your standing in society. Do not hesitate to express the good thoughts in your mind, as they will be beneficial to many. Innovative thoughts will guide you. You will think deeply before acting. You will succeed in working with others. Joint ventures will yield excellent results today. Long-pending tasks will come to a conclusion today. Unexpected financial gains are possible. It is advisable to make calm decisions regarding investment matters. This is a day when you will gain rejuvenation and new energy. Your self-confidence will increase. Clarity will be achieved in future planning. Discussions about new business ventures will take place. The decisions you make today will bring excellent results. Spiritual inclination will increase. Temple visits will provide peace of mind. The help you offer to others today will bring you good fortune. You will direct your energy in the right direction and achieve success.",
    "career_ta": "தொழில்ரீதியாக இன்று உங்களுக்கு நல்ல வாய்ப்புகள் அமையும். உங்கள் நிர்வாகத் திறமை வெளிப்படும். மேலதிகாரிகளின் பாராட்டைப் பெறுவீர்கள். புதிய திட்டங்களை முன்னெடுப்பதில் வெற்றி காண்பீர்கள். வணிகர்களுக்கு லாபம் அதிகரிக்கும். புதிய ஒப்பந்தங்கள் ஏற்படும். கூட்டாண்மை வணிகத்தில் நல்ல முன்னேற்றம் காணப்படும். உங்கள் தலைமைப் பண்பு வெளிப்படும் நாள் இது.",
    "career_en": "Professionally, you will have good opportunities today. Your administrative skills will be evident. You will receive praise from superiors. You will succeed in initiating new projects. Business people will see increased profits. New contracts will be formed. Good progress will be seen in partnership businesses. This is a day when your leadership qualities will be evident.",
    "finance_ta": "பொருளாதார நிலை சிறப்பாக இருக்கும். புதிய முதலீடுகள் பற்றி சாதகமாக சிந்திப்பீர்கள். நிதி திட்டமிடலில் சிறந்து விளங்குவீர்கள். எதிர்பாராத தனலாபம் உண்டாக வாய்ப்புள்ளது. சேமிப்பு உயரும். கடன்கள் தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். குடும்பத்தின் நிதித் தேவைகளை சிறப்பாக பூர்த்தி செய்வீர்கள்.",
    "finance_en": "The financial situation will be excellent. You will think favorably about new investments. You will excel in financial planning. There is a possibility of unexpected financial gain. Savings will increase. Good progress will be made in matters related to debts. You will effectively meet the financial needs of your family.",
    "health_ta": "ஆரோக்கியம் திருப்திகரமாக இருக்கும். மனதில் இருந்த சோர்வு நீங்கி, புத்துணர்ச்சியுடன் செயல்படுவீர்கள். உடற்பயிற்சி, யோகா போன்றவற்றை மேற்கொள்வது நல்லது. சீரான உணவுப் பழக்கவழக்கங்களைப் பின்பற்றுவீர்கள். மன அழுத்தத்தைக் குறைத்து, அமைதியுடன் செயல்படுவீர்கள்.",
    "health_en": "Health will be satisfactory. Mental fatigue will dissipate, and you will act with renewed energy. It is good to engage in exercises, yoga, etc. You will follow balanced dietary habits. You will reduce stress and act with peace.",
    "lucky_number": 1,
    "lucky_color_ta": "பொன் நிறம்",
    "lucky_color_en": "Golden"
  },
  {
    "sign_ta": "கன்னி",
    "sign_en": "Virgo",
    "date": "18-02-2026",
    "prediction_ta": "இன்று புதன்கிழமை, உங்கள் ராசிக்கு அதிபதியான புதன் பகவானின் ஆதிக்கம் இன்று கன்னி ராசி அன்பர்களுக்கு மிகுந்த சிறப்பானது. இன்று உங்கள் பகுப்பாய்வு திறனும், நுணுக்கமான சிந்தனையும் மேம்படும். எந்த ஒரு விஷயத்திலும் ஆழமாக சிந்தித்து, துல்லியமான முடிவுகளை எடுப்பீர்கள். தகவல் தொடர்பில் சிறந்து விளங்குவீர்கள். உங்கள் பேச்சிலும், எழுத்திலும் தெளிவும், நேர்மையும் காணப்படும். புதிய விஷயங்களைக் கற்றுக் கொள்வதில் ஆர்வம் காட்டுவீர்கள். இது உங்கள் அறிவுத்திறனை மேலும் மேம்படுத்தும். கல்வி சார்ந்த துறைகளில் உள்ளவர்களுக்கு இன்று பொன்னான வாய்ப்புகள் அமையும். மாணவர்கள் கல்வி சம்பந்தமான விஷயங்களில் சிறந்து விளங்குவார்கள். அவர்களின் கடின உழைப்புக்கு நல்ல பலன் கிடைக்கும். பல நாட்களாக தீர்க்கப்படாமல் இருந்த சில பிரச்சனைகளுக்கு இன்று ஒரு தெளிவான தீர்வு கிடைக்கும். உங்கள் மனது அமைதியுடன் காணப்படும். சக ஊழியர்களுடனும், குடும்ப உறுப்பினர்களுடனும் சுமுகமான உறவைப் பேணுவீர்கள். எந்த ஒரு காரியத்தையும் திட்டமிட்டு செயல்படுத்துவதில் வெற்றி காண்பீர்கள். உங்கள் நுண்ணறிவு மேம்படும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் பயனுள்ளதாக அமையும். மனத்திறனை மேம்படுத்தும் செயல்களில் ஈடுபடுவீர்கள். தியானம், யோகா போன்ற பயிற்சிகள் உங்களுக்கு மன அமைதியையும், புத்துணர்வையும் அளிக்கும். உங்களது கருத்துக்களுக்கு இன்று மிகுந்த மதிப்பு கிடைக்கும். பிறரின் உணர்வுகளைப் புரிந்து கொண்டு செயல்படுவீர்கள். சமூகத்தில் உங்கள் மதிப்பு உயரும். புதிய தொடர்புகள் ஏற்படும். இவை உங்களுக்கு பல வகையிலும் பயனுள்ளதாக அமையும். உங்கள் ஆளுமைத்திறன் வெளிப்படும் நாள் இது.\nகுடும்பத்தில் சுப நிகழ்ச்சிகள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். உறவினர்களுடனான சந்திப்புகள் மகிழ்ச்சியை அளிக்கும். குழந்தைகளுடன் நேரம் செலவிடுவது உங்களுக்கு மன நிறைவைத் தரும். பெற்றோரின் ஆரோக்கியத்தில் கவனம் செலுத்துவது நல்லது. அவர்களின் தேவைகளை பூர்த்தி செய்வதில் ஆர்வம் காட்டுவீர்கள். வீட்டில் அமைதியும், மகிழ்ச்சியும் நிறைந்திருக்கும். கலை மற்றும் இலக்கியத் துறையில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். உங்கள் படைப்பாற்றல் இன்று உச்சத்தை அடையும். சமூக சேவைகளில் ஈடுபடுவோருக்கு நல்ல அங்கீகாரம் கிடைக்கும். தன்னார்வ தொண்டுகளில் ஆர்வம் காட்டுவீர்கள். இதனால் சமூகத்தில் உங்கள் மதிப்பு உயரும். உங்கள் மனதில் உள்ள நல்ல எண்ணங்களை வெளிப்படுத்த தயங்காதீர்கள். அவை பலருக்கும் பயனுள்ளதாக அமையும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். எதையும் ஆழமாக சிந்தித்து செயல்படுவீர்கள். மற்றவர்களுடன் இணைந்து பணியாற்றுவதில் வெற்றி காண்பீர்கள். கூட்டு முயற்சிகள் இன்று சிறப்பான பலனைத் தரும். நீண்டகாலமாக நிலுவையில் இருந்த காரியங்கள் இன்று ஒரு முடிவுக்கு வரும். எதிர்பாராத தனலாபம் உண்டாகும். முதலீடுகள் தொடர்பான விஷயங்களில் நிதானமாக முடிவெடுப்பது நல்லது. உங்களுக்கு புத்துணர்ச்சியும், புதிய ஆற்றலும் கிடைக்கும் நாள் இது. உங்களின் தன்னம்பிக்கை அதிகரிக்கும். எதிர்கால திட்டமிடல்களில் தெளிவு கிடைக்கும். புதிய தொழில் முயற்சிகள் பற்றிய ஆலோசனைகள் நடைபெறும். இன்று நீங்கள் எடுக்கும் முடிவுகள் சிறப்பான பலனைத் தரும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் மன அமைதியை அளிக்கும். இன்று நீங்கள் பிறருக்கு செய்யும் உதவிகள் உங்களுக்கு நன்மையை கொண்டு வரும். உங்கள் ஆற்றலை சரியான திசையில் செலுத்தி வெற்றி பெறுவீர்கள்.",
    "prediction_en": "As today is Wednesday, the influence of Mercury, your ruling planet, will be exceptionally beneficial for Virgo natives. Today your analytical skills and meticulous thinking will improve. You will deeply contemplate and make accurate decisions in any matter. You will excel in communication. Clarity and honesty will be evident in your speech and writing. You will show interest in learning new things, which will further enhance your intellect. Those in education-related fields will have golden opportunities today. Students will excel in educational matters. Their hard work will yield good results. A clear solution will be found today for some problems that have remained unresolved for many days. Your mind will be at peace. You will maintain cordial relationships with colleagues and family members. You will succeed in planning and executing any task. Your intelligence will improve. Journeys undertaken today will be beneficial. You will engage in activities that enhance your mental capacity. Practices like meditation and yoga will bring you mental peace and rejuvenation. Your opinions will gain much value today. You will act with an understanding of others' feelings. Your reputation in society will increase. New connections will form, which will be beneficial to you in many ways. This is a day when your leadership qualities will be evident.\nDiscussions about auspicious events will take place in the family. Meetings with relatives will bring joy. Spending time with children will give you mental satisfaction. It is good to pay attention to your parents' health. You will show interest in fulfilling their needs. The home will be filled with peace and happiness. Good opportunities will arise for those in the arts and literature fields. Your creativity will reach its peak today. Those involved in social service will receive good recognition. You will show interest in volunteering, which will elevate your standing in society. Do not hesitate to express the good thoughts in your mind, as they will be beneficial to many. Innovative thoughts will guide you. You will think deeply before acting. You will succeed in working with others. Joint ventures will yield excellent results today. Long-pending tasks will come to a conclusion today. Unexpected financial gains are possible. It is advisable to make calm decisions regarding investment matters. This is a day when you will gain rejuvenation and new energy. Your self-confidence will increase. Clarity will be achieved in future planning. Discussions about new business ventures will take place. The decisions you make today will bring excellent results. Spiritual inclination will increase. Temple visits will provide peace of mind. The help you offer to others today will bring you good fortune. You will direct your energy in the right direction and achieve success.",
    "career_ta": "தொழில் மற்றும் வியாபாரத்தில் நல்ல வளர்ச்சி காணப்படும். உங்கள் பகுப்பாய்வுத் திறன் இன்று உங்களுக்கு வெற்றியைப் பெற்றுத்தரும். புதிய திட்டங்களைச் சிறப்பாக வகுத்து செயல்படுத்துவீர்கள். சக ஊழியர்கள் உங்கள் திறமையை பாராட்டுவார்கள். வணிகர்களுக்கு லாபம் அதிகரிக்கும். புதிய ஒப்பந்தங்கள் ஏற்படும். கல்வி, எழுத்து, கணக்கீடு போன்ற துறைகளில் உள்ளவர்களுக்கு சிறப்பான வாய்ப்புகள் அமையும்.",
    "career_en": "Good growth will be seen in your career and business. Your analytical skills will bring you success today. You will effectively formulate and implement new plans. Colleagues will appreciate your abilities. Business people will see increased profits. New contracts will be formed. Those in education, writing, and accounting will have excellent opportunities.",
    "finance_ta": "பொருளாதார நிலை ஸ்திரமாக இருக்கும். புத்திசாலித்தனமான முடிவுகள் நிதி நிலையில் நல்ல மாற்றங்களைக் கொண்டு வரும். புதிய முதலீடுகள் பற்றி ஆலோசிப்பீர்கள். சேமிப்பு உயரும். கடன்கள் தொடர்பான பிரச்சனைகளுக்கு தீர்வு காணப்படும். எதிர்பாராத வகையில் பண வரவுகள் உண்டாக வாய்ப்புள்ளது. செலவுகளைக் கட்டுப்படுத்துவதில் கவனம் செலுத்துவீர்கள்.",
    "finance_en": "The financial situation will be stable. Intelligent decisions will bring positive changes to your financial status. You will consider new investments. Savings will increase. Solutions will be found for debt-related problems. There is a possibility of unexpected income. You will focus on controlling expenses.",
    "health_ta": "ஆரோக்கியம் சிறப்பாக இருக்கும். மன அழுத்தம் குறைந்து, புத்துணர்ச்சியுடன் செயல்படுவீர்கள். உடல் நலத்தில் கூடுதல் கவனம் செலுத்துவது நல்லது. யோகா, தியானம் போன்ற பயிற்சிகள் உங்களுக்கு பலன் தரும். சீரான உணவுப் பழக்கவழக்கங்களைப் பின்பற்றுவதன் மூலம் ஆரோக்கியத்தை மேம்படுத்தலாம். புத்துணர்ச்சி தரும் பானங்களை அருந்துவது நல்லது.",
    "health_en": "Health will be excellent. Stress will reduce, and you will act with renewed vigor. It is good to pay extra attention to your physical well-being. Practices like yoga and meditation will benefit you. You can improve health by following proper dietary habits. It is good to drink refreshing beverages.",
    "lucky_number": 5,
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "18-02-2026",
    "prediction_ta": "இன்று புதன்கிழமை, புதன் பகவானின் ஆதிக்கம் துலாம் ராசி அன்பர்களுக்கு தகவல் தொடர்பு மற்றும் உறவுகளில் நல்லிணக்கத்தை உருவாக்கும். உங்கள் பேச்சில் இனிமையும், சமாதானப் போக்கும் மேலோங்கும். பிறருடன் சுமுகமாகப் பழகி, புதிய தொடர்புகளை ஏற்படுத்திக் கொள்வீர்கள். பல நாட்களாக தீர்க்கப்படாமல் இருந்த சில பிரச்சனைகளுக்கு இன்று ஒரு தெளிவான தீர்வு கிடைக்கும். உங்கள் மனது அமைதியுடன் காணப்படும். சக ஊழியர்களுடனும், குடும்ப உறுப்பினர்களுடனும் சுமுகமான உறவைப் பேணுவீர்கள். எந்த ஒரு காரியத்தையும் திட்டமிட்டு செயல்படுத்துவதில் வெற்றி காண்பீர்கள். உங்கள் நுண்ணறிவு மேம்படும். புதிய விஷயங்களை கற்றுக் கொள்வதில் ஆர்வம் காட்டுவீர்கள். மாணவர்கள் கல்வி சம்பந்தமான விஷயங்களில் சிறந்து விளங்குவார்கள். ஆசிரியர்கள் மற்றும் வழிகாட்டிகளின் ஆதரவு கிடைக்கும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் பயனுள்ளதாக அமையும். மனத்திறனை மேம்படுத்தும் செயல்களில் ஈடுபடுவீர்கள். தியானம், யோகா போன்ற பயிற்சிகள் உங்களுக்கு மன அமைதியையும், புத்துணர்வையும் அளிக்கும். உங்களது கருத்துக்களுக்கு இன்று மிகுந்த மதிப்பு கிடைக்கும். பிறரின் உணர்வுகளைப் புரிந்து கொண்டு செயல்படுவீர்கள். சமூகத்தில் உங்கள் மதிப்பு உயரும். புதிய தொடர்புகள் ஏற்படும். இவை உங்களுக்கு பல வகையிலும் பயனுள்ளதாக அமையும். உங்கள் ஆளுமைத்திறன் வெளிப்படும் நாள் இது.\nகுடும்பத்தில் சுப நிகழ்ச்சிகள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். உறவினர்களுடனான சந்திப்புகள் மகிழ்ச்சியை அளிக்கும். குழந்தைகளுடன் நேரம் செலவிடுவது உங்களுக்கு மன நிறைவைத் தரும். பெற்றோரின் ஆரோக்கியத்தில் கவனம் செலுத்துவது நல்லது. அவர்களின் தேவைகளை பூர்த்தி செய்வதில் ஆர்வம் காட்டுவீர்கள். வீட்டில் அமைதியும், மகிழ்ச்சியும் நிறைந்திருக்கும். கலை மற்றும் இலக்கியத் துறையில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். உங்கள் படைப்பாற்றல் இன்று உச்சத்தை அடையும். சமூக சேவைகளில் ஈடுபடுவோருக்கு நல்ல அங்கீகாரம் கிடைக்கும். தன்னார்வ தொண்டுகளில் ஆர்வம் காட்டுவீர்கள். இதனால் சமூகத்தில் உங்கள் மதிப்பு உயரும். உங்கள் மனதில் உள்ள நல்ல எண்ணங்களை வெளிப்படுத்த தயங்காதீர்கள். அவை பலருக்கும் பயனுள்ளதாக அமையும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். எதையும் ஆழமாக சிந்தித்து செயல்படுவீர்கள். மற்றவர்களுடன் இணைந்து பணியாற்றுவதில் வெற்றி காண்பீர்கள். கூட்டு முயற்சிகள் இன்று சிறப்பான பலனைத் தரும். நீண்டகாலமாக நிலுவையில் இருந்த காரியங்கள் இன்று ஒரு முடிவுக்கு வரும். எதிர்பாராத தனலாபம் உண்டாகும். முதலீடுகள் தொடர்பான விஷயங்களில் நிதானமாக முடிவெடுப்பது நல்லது. உங்களுக்கு புத்துணர்ச்சியும், புதிய ஆற்றலும் கிடைக்கும் நாள் இது. உங்களின் தன்னம்பிக்கை அதிகரிக்கும். எதிர்கால திட்டமிடல்களில் தெளிவு கிடைக்கும். புதிய தொழில் முயற்சிகள் பற்றிய ஆலோசனைகள் நடைபெறும். இன்று நீங்கள் எடுக்கும் முடிவுகள் சிறப்பான பலனைத் தரும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் மன அமைதியை அளிக்கும். இன்று நீங்கள் பிறருக்கு செய்யும் உதவிகள் உங்களுக்கு நன்மையை கொண்டு வரும். உங்கள் ஆற்றலை சரியான திசையில் செலுத்தி வெற்றி பெறுவீர்கள்.",
    "prediction_en": "As today is Wednesday, the influence of Mercury will create harmony in communication and relationships for Libra natives. Sweetness and a conciliatory approach will prevail in your speech. You will interact smoothly with others and establish new connections. A clear solution will be found today for some problems that have remained unresolved for many days. Your mind will be at peace. You will maintain cordial relationships with colleagues and family members. You will succeed in planning and executing any task. Your intelligence will improve. You will show interest in learning new things. Students will excel in educational matters. Support from teachers and mentors will be available. Journeys undertaken today will be beneficial. You will engage in activities that enhance your mental capacity. Practices like meditation and yoga will bring you mental peace and rejuvenation. Your opinions will gain much value today. You will act with an understanding of others' feelings. Your reputation in society will increase. New connections will form, which will be beneficial to you in many ways. This is a day when your leadership qualities will be evident.\nDiscussions about auspicious events will take place in the family. Meetings with relatives will bring joy. Spending time with children will give you mental satisfaction. It is good to pay attention to your parents' health. You will show interest in fulfilling their needs. The home will be filled with peace and happiness. Good opportunities will arise for those in the arts and literature fields. Your creativity will reach its peak today. Those involved in social service will receive good recognition. You will show interest in volunteering, which will elevate your standing in society. Do not hesitate to express the good thoughts in your mind, as they will be beneficial to many. Innovative thoughts will guide you. You will think deeply before acting. You will succeed in working with others. Joint ventures will yield excellent results today. Long-pending tasks will come to a conclusion today. Unexpected financial gains are possible. It is advisable to make calm decisions regarding investment matters. This is a day when you will gain rejuvenation and new energy. Your self-confidence will increase. Clarity will be achieved in future planning. Discussions about new business ventures will take place. The decisions you make today will bring excellent results. Spiritual inclination will increase. Temple visits will provide peace of mind. The help you offer to others today will bring you good fortune. You will direct your energy in the right direction and achieve success.",
    "career_ta": "தொழில்ரீதியாக இன்று அனுகூலமான நாளாகும். உங்கள் இராஜதந்திர பேச்சுவார்த்தைகள் வெற்றி பெறும். சக ஊழியர்களுடன் இணைந்து பணியாற்றி நல்ல பலனைப் பெறுவீர்கள். புதிய ஒப்பந்தங்களில் கையெழுத்திட வாய்ப்பு உண்டு. வணிகர்களுக்கு லாபம் அதிகரிக்கும். புதிய வாடிக்கையாளர்கள் கிடைப்பார்கள். கூட்டாண்மை வணிகத்தில் நல்லிணக்கம் காணப்படும்.",
    "career_en": "Professionally, today is a favorable day. Your diplomatic negotiations will succeed. You will work with colleagues and achieve good results. There is a chance to sign new contracts. Business people will see increased profits. New clients will be gained. Harmony will be seen in partnership businesses.",
    "finance_ta": "பொருளாதார நிலை சீராக இருக்கும். நிதி திட்டமிடலில் சிறந்து விளங்குவீர்கள். புதிய முதலீடுகள் பற்றி ஆலோசிப்பீர்கள். சேமிப்பு உயரும். குடும்பத்தின் நிதித் தேவைகளை சிறப்பாக பூர்த்தி செய்வீர்கள். வீண் செலவுகளைக் குறைத்து, வரவுக்கு ஏற்ப செலவுகளை மேற்கொள்வீர்கள். பழைய கடன்கள் தீரும் வழி பிறக்கும்.",
    "finance_en": "The financial situation will be stable. You will excel in financial planning. You will consider new investments. Savings will increase. You will effectively meet the financial needs of your family. You will reduce unnecessary expenses and spend according to your income. A way to clear old debts will emerge.",
    "health_ta": "ஆரோக்கியம் சிறப்பாக இருக்கும். மன அமைதியுடன் செயல்படுவீர்கள். யோகா, தியானம் போன்ற பயிற்சிகள் உங்களுக்கு பலன் தரும். சமச்சீரான உணவு பழக்கவழக்கங்களைப் பின்பற்றுவீர்கள். போதுமான ஓய்வு எடுப்பது மன அழுத்தத்தைக் குறைத்து, புத்துணர்ச்சியை அளிக்கும்.",
    "health_en": "Health will be excellent. You will act with mental peace. Practices like yoga and meditation will benefit you. You will follow balanced dietary habits. Sufficient rest will reduce stress and provide rejuvenation.",
    "lucky_number": 6,
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "விருச்சிகம்",
    "sign_en": "Scorpio",
    "date": "18-02-2026",
    "prediction_ta": "இன்று புதன்கிழமை, புதன் பகவானின் ஆதிக்கம் விருச்சிக ராசி அன்பர்களுக்கு அறிவுத்திறன் மற்றும் ஆராய்ச்சித்திறனில் சிறப்பான முன்னேற்றத்தை அளிக்கும். உங்கள் ஆழ்ந்த சிந்தனை இன்று பல புதிய வழிகளைக் கண்டறிய உதவும். ரகசியமான விஷயங்களை அறிந்து கொள்வதிலும், சிக்கலான பிரச்சனைகளுக்கு தீர்வு காண்பதிலும் ஆர்வம் காட்டுவீர்கள். உங்கள் பேச்சில் தெளிவும், ஆழமும் இருக்கும். புதிய தகவல்களை அறிந்து கொள்வதில் ஆர்வம் காட்டுவீர்கள். கல்வி மற்றும் ஆராய்ச்சித் துறையில் உள்ளவர்களுக்கு இன்று நல்ல வாய்ப்புகள் அமையும். மாணவர்கள் கல்வி சம்பந்தமான விஷயங்களில் சிறந்து விளங்குவார்கள். அவர்களின் கடின உழைப்புக்கு நல்ல பலன் கிடைக்கும். பல நாட்களாக தீர்க்கப்படாமல் இருந்த சில பிரச்சனைகளுக்கு இன்று ஒரு தெளிவான தீர்வு கிடைக்கும். உங்கள் மனது அமைதியுடன் காணப்படும். சக ஊழியர்களுடனும், குடும்ப உறுப்பினர்களுடனும் சுமுகமான உறவைப் பேணுவீர்கள். எந்த ஒரு காரியத்தையும் திட்டமிட்டு செயல்படுத்துவதில் வெற்றி காண்பீர்கள். உங்கள் நுண்ணறிவு மேம்படும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் பயனுள்ளதாக அமையும். மனத்திறனை மேம்படுத்தும் செயல்களில் ஈடுபடுவீர்கள். தியானம், யோகா போன்ற பயிற்சிகள் உங்களுக்கு மன அமைதியையும், புத்துணர்வையும் அளிக்கும். உங்களது கருத்துக்களுக்கு இன்று மிகுந்த மதிப்பு கிடைக்கும். பிறரின் உணர்வுகளைப் புரிந்து கொண்டு செயல்படுவீர்கள். சமூகத்தில் உங்கள் மதிப்பு உயரும். புதிய தொடர்புகள் ஏற்படும். இவை உங்களுக்கு பல வகையிலும் பயனுள்ளதாக அமையும். உங்கள் ஆளுமைத்திறன் வெளிப்படும் நாள் இது.\nகுடும்பத்தில் சுப நிகழ்ச்சிகள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். உறவினர்களுடனான சந்திப்புகள் மகிழ்ச்சியை அளிக்கும். குழந்தைகளுடன் நேரம் செலவிடுவது உங்களுக்கு மன நிறைவைத் தரும். பெற்றோரின் ஆரோக்கியத்தில் கவனம் செலுத்துவது நல்லது. அவர்களின் தேவைகளை பூர்த்தி செய்வதில் ஆர்வம் காட்டுவீர்கள். வீட்டில் அமைதியும், மகிழ்ச்சியும் நிறைந்திருக்கும். கலை மற்றும் இலக்கியத் துறையில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். உங்கள் படைப்பாற்றல் இன்று உச்சத்தை அடையும். சமூக சேவைகளில் ஈடுபடுவோருக்கு நல்ல அங்கீகாரம் கிடைக்கும். தன்னார்வ தொண்டுகளில் ஆர்வம் காட்டுவீர்கள். இதனால் சமூகத்தில் உங்கள் மதிப்பு உயரும். உங்கள் மனதில் உள்ள நல்ல எண்ணங்களை வெளிப்படுத்த தயங்காதீர்கள். அவை பலருக்கும் பயனுள்ளதாக அமையும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். எதையும் ஆழமாக சிந்தித்து செயல்படுவீர்கள். மற்றவர்களுடன் இணைந்து பணியாற்றுவதில் வெற்றி காண்பீர்கள். கூட்டு முயற்சிகள் இன்று சிறப்பான பலனைத் தரும். நீண்டகாலமாக நிலுவையில் இருந்த காரியங்கள் இன்று ஒரு முடிவுக்கு வரும். எதிர்பாராத தனலாபம் உண்டாகும். முதலீடுகள் தொடர்பான விஷயங்களில் நிதானமாக முடிவெடுப்பது நல்லது. உங்களுக்கு புத்துணர்ச்சியும், புதிய ஆற்றலும் கிடைக்கும் நாள் இது. உங்களின் தன்னம்பிக்கை அதிகரிக்கும். எதிர்கால திட்டமிடல்களில் தெளிவு கிடைக்கும். புதிய தொழில் முயற்சிகள் பற்றிய ஆலோசனைகள் நடைபெறும். இன்று நீங்கள் எடுக்கும் முடிவுகள் சிறப்பான பலனைத் தரும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் மன அமைதியை அளிக்கும். இன்று நீங்கள் பிறருக்கு செய்யும் உதவிகள் உங்களுக்கு நன்மையை கொண்டு வரும். உங்கள் ஆற்றலை சரியான திசையில் செலுத்தி வெற்றி பெறுவீர்கள்.",
    "prediction_en": "As today is Wednesday, the influence of Mercury will bring excellent progress in intellectual and research capabilities for Scorpio natives. Your deep thinking will help you discover many new paths today. You will show interest in uncovering secrets and solving complex problems. Clarity and depth will be present in your speech. You will be keen on learning new information. Those in education and research fields will have good opportunities today. Students will excel in educational matters. Their hard work will yield good results. A clear solution will be found today for some problems that have remained unresolved for many days. Your mind will be at peace. You will maintain cordial relationships with colleagues and family members. You will succeed in planning and executing any task. Your intelligence will improve. Journeys undertaken today will be beneficial. You will engage in activities that enhance your mental capacity. Practices like meditation and yoga will bring you mental peace and rejuvenation. Your opinions will gain much value today. You will act with an understanding of others' feelings. Your reputation in society will increase. New connections will form, which will be beneficial to you in many ways. This is a day when your leadership qualities will be evident.\nDiscussions about auspicious events will take place in the family. Meetings with relatives will bring joy. Spending time with children will give you mental satisfaction. It is good to pay attention to your parents' health. You will show interest in fulfilling their needs. The home will be filled with peace and happiness. Good opportunities will arise for those in the arts and literature fields. Your creativity will reach its peak today. Those involved in social service will receive good recognition. You will show interest in volunteering, which will elevate your standing in society. Do not hesitate to express the good thoughts in your mind, as they will be beneficial to many. Innovative thoughts will guide you. You will think deeply before acting. You will succeed in working with others. Joint ventures will yield excellent results today. Long-pending tasks will come to a conclusion today. Unexpected financial gains are possible. It is advisable to make calm decisions regarding investment matters. This is a day when you will gain rejuvenation and new energy. Your self-confidence will increase. Clarity will be achieved in future planning. Discussions about new business ventures will take place. The decisions you make today will bring excellent results. Spiritual inclination will increase. Temple visits will provide peace of mind. The help you offer to others today will bring you good fortune. You will direct your energy in the right direction and achieve success.",
    "career_ta": "தொழில் மற்றும் வியாபாரத்தில் நல்ல வளர்ச்சி காணப்படும். உங்கள் ஆழமான ஆராய்ச்சித் திறன் புதிய திட்டங்களில் வெற்றியைப் பெற்றுத்தரும். சக ஊழியர்களின் ஒத்துழைப்பு கிடைக்கும். புதிய ஒப்பந்தங்கள் ஏற்படும். ரகசியத் தகவல்களைக் கையாளும் துறைகளில் உள்ளவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் அமையும். உங்கள் புத்திசாலித்தனம் இன்று வெளிப்படும்.",
    "career_en": "Good growth will be seen in your career and business. Your deep research skills will bring success in new projects. You will receive cooperation from colleagues. New contracts will be formed. Those in fields dealing with confidential information will have excellent opportunities today. Your intelligence will be evident today.",
    "finance_ta": "பொருளாதார நிலை திருப்திகரமாக இருக்கும். புதிய முதலீடுகள் பற்றி ஆலோசிப்பீர்கள். சேமிப்பு உயரும். கடன்கள் தொடர்பான பிரச்சனைகளுக்கு தீர்வு காணப்படும். எதிர்பாராத வகையில் பண வரவுகள் உண்டாக வாய்ப்புள்ளது. நிதி திட்டமிடலில் நிதானமாக செயல்படுவது நல்லது. புத்திசாலித்தனமான முதலீடுகள் நல்ல பலனைத் தரும்.",
    "finance_en": "The financial situation will be satisfactory. You will consider new investments. Savings will increase. Solutions will be found for debt-related problems. There is a possibility of unexpected income. It is good to act calmly in financial planning. Intelligent investments will yield good results.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் அமைதி நிலவும். தேவையற்ற மன அழுத்தத்தைக் குறைத்து, உற்சாகத்துடன் இருப்பீர்கள். யோகா மற்றும் தியானம் செய்வது நல்லது. சரியான உணவுப் பழக்கவழக்கங்களைப் பின்பற்றுவதன் மூலம் ஆரோக்கியத்தை மேம்படுத்தலாம். போதுமான ஓய்வு எடுப்பது அவசியம்.",
    "health_en": "Physical health will be stable. Peace of mind will prevail. You will reduce unnecessary stress and remain enthusiastic. Practicing yoga and meditation is beneficial. You can improve health by following proper dietary habits. Sufficient rest is essential.",
    "lucky_number": 8,
    "lucky_color_ta": "சிவப்பு",
    "lucky_color_en": "Red"
  },
  {
    "sign_ta": "தனுசு",
    "sign_en": "Sagittarius",
    "date": "18-02-2026",
    "prediction_ta": "இன்று புதன்கிழமை, புதன் பகவானின் ஆதிக்கம் தனுசு ராசி அன்பர்களுக்கு புதிய அறிவு மற்றும் அனுபவங்களைத் தேடும் வாய்ப்புகளை உருவாக்கும். உங்கள் மனதில் தெளிவும், சிந்தனைகளில் புத்துணர்ச்சியும் மேலோங்கும். நீண்ட நாட்களாக நிலுவையில் இருந்த சில காரியங்களை இன்று திறம்பட முடிப்பீர்கள். உங்கள் ஆற்றலை சரியான திசையில் செலுத்தி வெற்றி காண்பீர்கள். குடும்ப உறுப்பினர்களுடனான உறவில் நல்லிணக்கம் ஏற்படும். உங்கள் பேச்சாற்றல் மூலம் பிறரை வசீகரிப்பீர்கள். தகவல் தொடர்பு துறையில் இருப்பவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் அமையும். எழுதுவது, கற்பிப்பது அல்லது பேசுவது போன்ற துறைகளில் உங்களின் தனித்திறமை வெளிப்படும். புதிய நுட்பங்களை கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். இது உங்கள் அறிவுத்திறனை மேலும் மேம்படுத்தும். சமூக வலைத்தளங்கள் மூலம் புதிய தொடர்புகள் ஏற்படும். இவை எதிர்காலத்தில் உங்களுக்கு பயனுள்ளதாக அமையும். உங்கள் நுண்ணறிவு இன்று கூர்மையடையும். எந்த ஒரு பிரச்சனைக்கும் தர்க்கரீதியான தீர்வுகளைக் காண்பீர்கள். மன அமைதி கிடைக்கும் நாள் இது. தியானம் அல்லது வாசிப்பு போன்ற செயல்களில் ஈடுபடுவது உங்களுக்கு மன அமைதியை அளிக்கும்.\nவீட்டில் சுப காரியங்கள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். உறவினர்களுடனான சந்திப்புகள் மன மகிழ்ச்சியை ஏற்படுத்தும். கலை மற்றும் இசை சார்ந்த துறைகளில் ஆர்வம் கொண்டவர்களுக்கு இன்று நல்ல வாய்ப்புகள் அமையும். உங்கள் படைப்பாற்றல் வெளிப்படும். குழந்தைகளுடன் நேரம் செலவிடுவது உங்களுக்கு மனநிறைவைத் தரும். பெற்றோரின் தேவைகளை நிறைவேற்றுவதில் கவனம் செலுத்துவீர்கள். சமூகத்தில் உங்கள் மதிப்பு உயரும். பிறருக்கு உதவ வேண்டும் என்ற எண்ணம் மேலோங்கும். புதிய நண்பர்களை உருவாக்குவீர்கள். கூட்டு முயற்சிகள் மற்றும் குழுப்பணிகளில் நீங்கள் சிறந்து விளங்குவீர்கள். உங்களின் தலைமைப் பண்பு வெளிப்படும். இன்று மேற்கொள்ளும் பயணங்கள் பயனுள்ளதாக அமையும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் மன அமைதியை அளிக்கும். இன்று நீங்கள் எடுக்கும் அனைத்து முடிவுகளும் சிறப்பான பலனைத் தரும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். எதையும் ஆழமாக சிந்தித்து செயல்படுவீர்கள். நீண்டகாலமாக நிலுவையில் இருந்த காரியங்கள் இன்று ஒரு முடிவுக்கு வரும். திடீர் தனலாபம் உண்டாக வாய்ப்புள்ளது. முதலீடுகள் தொடர்பான விஷயங்களில் நிதானமாக முடிவெடுப்பது நல்லது. உங்களின் தன்னம்பிக்கை அதிகரிக்கும். எதிர்கால திட்டமிடல்களில் தெளிவு கிடைக்கும். புதிய தொழில் முயற்சிகள் பற்றிய ஆலோசனைகள் நடைபெறும். இன்று நீங்கள் பிறருக்கு செய்யும் உதவிகள் உங்களுக்கு நன்மையை கொண்டு வரும். உங்கள் ஆற்றலை சரியான திசையில் செலுத்தி வெற்றி பெறுவீர்கள்.",
    "prediction_en": "As today is Wednesday, the influence of Mercury will create opportunities for Sagittarius natives to seek new knowledge and experiences. Clarity will prevail in your mind, and your thoughts will be rejuvenated. You will successfully complete some long-pending tasks today. You will channel your energy in the right direction and achieve success. Harmony will prevail in relationships with family members. You will charm others with your eloquence. Those in the communication sector will have excellent opportunities today. Your unique talents in fields such as writing, teaching, or speaking will emerge. You will show interest in learning new techniques, which will further enhance your intellect. New connections will form through social media, which will be beneficial to you in the future. Your intelligence will sharpen today. You will find logical solutions to any problem. This is a day for mental peace. Engaging in activities like meditation or reading will bring you tranquility.\nDiscussions about auspicious events will take place at home. Meetings with relatives will bring joy. Those interested in arts and music will have good opportunities today. Your creativity will emerge. Spending time with children will bring you satisfaction. You will focus on fulfilling your parents' needs. Your reputation in society will increase. The desire to help others will be strong. You will make new friends. You will excel in collaborative efforts and teamwork. Your leadership qualities will be evident. Journeys undertaken today will be beneficial. Spiritual inclination will increase. Temple visits will bring mental peace. All decisions you make today will yield excellent results. Innovative thoughts will guide you. You will think deeply before acting. Long-pending tasks will come to a conclusion today. There is a possibility of unexpected financial gain. It is advisable to make calm decisions regarding investment matters. Your self-confidence will increase. Clarity will be achieved in future planning. Discussions about new business ventures will take place. The help you offer to others today will bring you good fortune. You will direct your energy in the right direction and achieve success.",
    "career_ta": "தொழில் மற்றும் வியாபாரத்தில் இன்று நல்ல முன்னேற்றம் காணப்படும். உங்கள் விரிவான பார்வை புதிய திட்டங்களில் வெற்றியைப் பெற்றுத்தரும். புதிய ஒப்பந்தங்களில் கையெழுத்திட வாய்ப்பு உண்டு. வணிகர்களுக்கு லாபம் அதிகரிக்கும். வெளிநாட்டு தொடர்புகள் ஆதாயம் தரும். கல்வி, ஆராய்ச்சி, வெளியீடு போன்ற துறைகளில் உள்ளவர்களுக்கு சிறப்பான வாய்ப்புகள் அமையும்.",
    "career_en": "Good progress will be seen in your career and business today. Your broad perspective will bring success in new projects. There is a chance to sign new contracts. Business people will see increased profits. Foreign contacts will be beneficial. Those in education, research, and publishing will have excellent opportunities.",
    "finance_ta": "பொருளாதார நிலை திருப்திகரமாக இருக்கும். புதிய முதலீடுகள் பற்றி சாதகமாக சிந்திப்பீர்கள். சேமிக்கும் எண்ணம் மேலோங்கும். எதிர்பாராத தனலாபம் உண்டாக வாய்ப்புள்ளது. செலவுகளை கவனமாகக் கையாள்வீர்கள். நிதி திட்டமிடலில் சிறந்து விளங்குவீர்கள். நீண்டகால முதலீடுகள் பற்றி ஆலோசிப்பீர்கள்.",
    "finance_en": "The financial situation will be satisfactory. You will think favorably about new investments. The desire to save will be strong. There is a possibility of unexpected financial gain. You will manage expenses carefully. You will excel in financial planning. You will consider long-term investments.",
    "health_ta": "உடல் ஆரோக்கியம் சிறப்பாக இருக்கும். மன சோர்வு நீங்கி, புத்துணர்ச்சியுடன் செயல்படுவீர்கள். பயணங்கள் புத்துணர்ச்சியை அளிக்கும். தியானம், யோகா போன்ற பயிற்சிகள் மன அமைதியை அளிக்கும். சீரான உணவுப் பழக்கவழக்கங்களைப் பின்பற்றுவது உடல் ஆரோக்கியத்தை மேம்படுத்தும். போதுமான ஓய்வு எடுப்பது அவசியம்.",
    "health_en": "Physical health will be excellent. Mental fatigue will dissipate, and you will act with renewed energy. Travel will provide rejuvenation. Practices like meditation and yoga will bring mental peace. Following balanced dietary habits will improve physical health. Sufficient rest is essential.",
    "lucky_number": 3,
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "மகரம்",
    "sign_en": "Capricorn",
    "date": "18-02-2026",
    "prediction_ta": "இன்று புதன்கிழமை, புதன் பகவானின் ஆதிக்கம் மகர ராசி அன்பர்களுக்கு திட்டமிடல் மற்றும் நடைமுறை செயல்பாடுகளில் சிறப்பான முன்னேற்றத்தை அளிக்கும். இன்று உங்கள் மனது தெளிவுடனும், கூர்மையுடனும் காணப்படும். எந்த ஒரு காரியத்தையும் திட்டமிட்டு, ஒழுங்கமைத்து செயல்படுத்துவதில் வெற்றி காண்பீர்கள். உங்கள் பேச்சிலும், எழுத்திலும் தெளிவும், நேர்மையும் காணப்படும். புதிய விஷயங்களைக் கற்றுக் கொள்வதிலும், உங்களின் அறிவை மேம்படுத்துவதிலும் ஆர்வம் காட்டுவீர்கள். கடினமான பணிகளை எளிதில் முடிக்கும் ஆற்றல் உங்களுக்கு இன்று கிடைக்கும். கல்வி சார்ந்த துறைகளில் உள்ளவர்களுக்கு இன்று பொன்னான வாய்ப்புகள் அமையும். மாணவர்கள் கல்வி சம்பந்தமான விஷயங்களில் சிறந்து விளங்குவார்கள். அவர்களின் கடின உழைப்புக்கு நல்ல பலன் கிடைக்கும். பல நாட்களாக தீர்க்கப்படாமல் இருந்த சில பிரச்சனைகளுக்கு இன்று ஒரு தெளிவான தீர்வு கிடைக்கும். உங்கள் மனது அமைதியுடன் காணப்படும். சக ஊழியர்களுடனும், குடும்ப உறுப்பினர்களுடனும் சுமுகமான உறவைப் பேணுவீர்கள். உங்கள் நுண்ணறிவு மேம்படும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் பயனுள்ளதாக அமையும். மனத்திறனை மேம்படுத்தும் செயல்களில் ஈடுபடுவீர்கள். தியானம், யோகா போன்ற பயிற்சிகள் உங்களுக்கு மன அமைதியையும், புத்துணர்வையும் அளிக்கும். உங்களது கருத்துக்களுக்கு இன்று மிகுந்த மதிப்பு கிடைக்கும். பிறரின் உணர்வுகளைப் புரிந்து கொண்டு செயல்படுவீர்கள். சமூகத்தில் உங்கள் மதிப்பு உயரும். புதிய தொடர்புகள் ஏற்படும். இவை உங்களுக்கு பல வகையிலும் பயனுள்ளதாக அமையும். உங்கள் ஆளுமைத்திறன் வெளிப்படும் நாள் இது.\nகுடும்பத்தில் சுப நிகழ்ச்சிகள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். உறவினர்களுடனான சந்திப்புகள் மகிழ்ச்சியை அளிக்கும். குழந்தைகளுடன் நேரம் செலவிடுவது உங்களுக்கு மன நிறைவைத் தரும். பெற்றோரின் ஆரோக்கியத்தில் கவனம் செலுத்துவது நல்லது. அவர்களின் தேவைகளை பூர்த்தி செய்வதில் ஆர்வம் காட்டுவீர்கள். வீட்டில் அமைதியும், மகிழ்ச்சியும் நிறைந்திருக்கும். கலை மற்றும் இலக்கியத் துறையில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். உங்கள் படைப்பாற்றல் இன்று உச்சத்தை அடையும். சமூக சேவைகளில் ஈடுபடுவோருக்கு நல்ல அங்கீகாரம் கிடைக்கும். தன்னார்வ தொண்டுகளில் ஆர்வம் காட்டுவீர்கள். இதனால் சமூகத்தில் உங்கள் மதிப்பு உயரும். உங்கள் மனதில் உள்ள நல்ல எண்ணங்களை வெளிப்படுத்த தயங்காதீர்கள். அவை பலருக்கும் பயனுள்ளதாக அமையும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். எதையும் ஆழமாக சிந்தித்து செயல்படுவீர்கள். மற்றவர்களுடன் இணைந்து பணியாற்றுவதில் வெற்றி காண்பீர்கள். கூட்டு முயற்சிகள் இன்று சிறப்பான பலனைத் தரும். நீண்டகாலமாக நிலுவையில் இருந்த காரியங்கள் இன்று ஒரு முடிவுக்கு வரும். எதிர்பாராத தனலாபம் உண்டாகும். முதலீடுகள் தொடர்பான விஷயங்களில் நிதானமாக முடிவெடுப்பது நல்லது. உங்களுக்கு புத்துணர்ச்சியும், புதிய ஆற்றலும் கிடைக்கும் நாள் இது. உங்களின் தன்னம்பிக்கை அதிகரிக்கும். எதிர்கால திட்டமிடல்களில் தெளிவு கிடைக்கும். புதிய தொழில் முயற்சிகள் பற்றிய ஆலோசனைகள் நடைபெறும். இன்று நீங்கள் எடுக்கும் முடிவுகள் சிறப்பான பலனைத் தரும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் மன அமைதியை அளிக்கும். இன்று நீங்கள் பிறருக்கு செய்யும் உதவிகள் உங்களுக்கு நன்மையை கொண்டு வரும். உங்கள் ஆற்றலை சரியான திசையில் செலுத்தி வெற்றி பெறுவீர்கள்.",
    "prediction_en": "As today is Wednesday, the influence of Mercury will bring excellent progress in planning and practical activities for Capricorn natives. Today your mind will be clear and sharp. You will succeed in planning, organizing, and executing any task. Clarity and honesty will be evident in your speech and writing. You will show interest in learning new things and enhancing your knowledge. You will have the ability to easily complete difficult tasks today. Those in education-related fields will have golden opportunities today. Students will excel in educational matters. Their hard work will yield good results. A clear solution will be found today for some problems that have remained unresolved for many days. Your mind will be at peace. You will maintain cordial relationships with colleagues and family members. Your intelligence will improve. Journeys undertaken today will be beneficial. You will engage in activities that enhance your mental capacity. Practices like meditation and yoga will bring you mental peace and rejuvenation. Your opinions will gain much value today. You will act with an understanding of others' feelings. Your reputation in society will increase. New connections will form, which will be beneficial to you in many ways. This is a day when your leadership qualities will be evident.\nDiscussions about auspicious events will take place in the family. Meetings with relatives will bring joy. Spending time with children will give you mental satisfaction. It is good to pay attention to your parents' health. You will show interest in fulfilling their needs. The home will be filled with peace and happiness. Good opportunities will arise for those in the arts and literature fields. Your creativity will reach its peak today. Those involved in social service will receive good recognition. You will show interest in volunteering, which will elevate your standing in society. Do not hesitate to express the good thoughts in your mind, as they will be beneficial to many. Innovative thoughts will guide you. You will think deeply before acting. You will succeed in working with others. Joint ventures will yield excellent results today. Long-pending tasks will come to a conclusion today. Unexpected financial gains are possible. It is advisable to make calm decisions regarding investment matters. This is a day when you will gain rejuvenation and new energy. Your self-confidence will increase. Clarity will be achieved in future planning. Discussions about new business ventures will take place. The decisions you make today will bring excellent results. Spiritual inclination will increase. Temple visits will provide peace of mind. The help you offer to others today will bring you good fortune. You will direct your energy in the right direction and achieve success.",
    "career_ta": "தொழில்ரீதியாக இன்று அனுகூலமான நாளாகும். உங்கள் திட்டமிடல் திறனும், கடின உழைப்பும் நல்ல பலனைத் தரும். புதிய திட்டங்களைச் சிறப்பாக வகுத்து செயல்படுத்துவீர்கள். அலுவலகத்தில் உங்கள் யோசனைகளுக்கு மதிப்பு கிடைக்கும். வணிகர்களுக்கு லாபம் அதிகரிக்கும். புதிய ஒப்பந்தங்கள் கையெழுத்தாகும். நிர்வாகத் துறையில் உள்ளவர்களுக்கு சிறப்பான வாய்ப்புகள் அமையும்.",
    "career_en": "Professionally, today is a favorable day. Your planning skills and hard work will yield good results. You will effectively formulate and implement new plans. Your ideas will be valued in the office. Business people will see increased profits. New contracts will be signed. Those in administration will have excellent opportunities.",
    "finance_ta": "பொருளாதார நிலை ஸ்திரமாக இருக்கும். புத்திசாலித்தனமான முடிவுகள் நிதி நிலையில் நல்ல மாற்றங்களைக் கொண்டு வரும். புதிய முதலீடுகள் பற்றி ஆலோசிப்பீர்கள். சேமிப்பு உயரும். கடன்கள் தொடர்பான பிரச்சனைகளுக்கு தீர்வு காணப்படும். எதிர்பாராத வகையில் பண வரவுகள் உண்டாக வாய்ப்புள்ளது. செலவுகளைக் கட்டுப்படுத்துவதில் கவனம் செலுத்துவீர்கள்.",
    "finance_en": "The financial situation will be stable. Intelligent decisions will bring positive changes to your financial status. You will consider new investments. Savings will increase. Solutions will be found for debt-related problems. There is a possibility of unexpected income. You will focus on controlling expenses.",
    "health_ta": "ஆரோக்கியம் சிறப்பாக இருக்கும். மன அழுத்தம் குறைந்து, புத்துணர்ச்சியுடன் செயல்படுவீர்கள். உடல் நலத்தில் கூடுதல் கவனம் செலுத்துவது நல்லது. யோகா, தியானம் போன்ற பயிற்சிகள் உங்களுக்கு பலன் தரும். சீரான உணவுப் பழக்கவழக்கங்களைப் பின்பற்றுவதன் மூலம் ஆரோக்கியத்தை மேம்படுத்தலாம். புத்துணர்ச்சி தரும் பானங்களை அருந்துவது நல்லது.",
    "health_en": "Health will be excellent. Stress will reduce, and you will act with renewed vigor. It is good to pay extra attention to your physical well-being. Practices like yoga and meditation will benefit you. You can improve health by following proper dietary habits. It is good to drink refreshing beverages.",
    "lucky_number": 8,
    "lucky_color_ta": "சாம்பல்",
    "lucky_color_en": "Grey"
  },
  {
    "sign_ta": "கும்பம்",
    "sign_en": "Aquarius",
    "date": "18-02-2026",
    "prediction_ta": "இன்று புதன்கிழமை, புதன் பகவானின் ஆதிக்கம் கும்ப ராசி அன்பர்களுக்கு புதிய சிந்தனைகள் மற்றும் படைப்பாற்றலை அதிகரிக்கும். உங்கள் மனதில் புதுமையான யோசனைகள் தோன்றும். அதை மற்றவர்களுடன் பகிர்ந்து கொள்வதில் வெற்றி காண்பீர்கள். குழுவாக இணைந்து பணியாற்றுவதில் சிறந்து விளங்குவீர்கள். சமூக மற்றும் தொழில்நுட்பத் துறைகளில் உள்ளவர்களுக்கு இன்று நல்ல வாய்ப்புகள் அமையும். உங்கள் பேச்சிலும், எழுத்திலும் தெளிவும், நேர்மையும் காணப்படும். புதிய விஷயங்களைக் கற்றுக் கொள்வதிலும், உங்களின் அறிவை மேம்படுத்துவதிலும் ஆர்வம் காட்டுவீர்கள். கல்வி சார்ந்த துறைகளில் உள்ளவர்களுக்கு இன்று பொன்னான வாய்ப்புகள் அமையும். மாணவர்கள் கல்வி சம்பந்தமான விஷயங்களில் சிறந்து விளங்குவார்கள். அவர்களின் கடின உழைப்புக்கு நல்ல பலன் கிடைக்கும். பல நாட்களாக தீர்க்கப்படாமல் இருந்த சில பிரச்சனைகளுக்கு இன்று ஒரு தெளிவான தீர்வு கிடைக்கும். உங்கள் மனது அமைதியுடன் காணப்படும். சக ஊழியர்களுடனும், குடும்ப உறுப்பினர்களுடனும் சுமுகமான உறவைப் பேணுவீர்கள். எந்த ஒரு காரியத்தையும் திட்டமிட்டு செயல்படுத்துவதில் வெற்றி காண்பீர்கள். உங்கள் நுண்ணறிவு மேம்படும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் பயனுள்ளதாக அமையும். மனத்திறனை மேம்படுத்தும் செயல்களில் ஈடுபடுவீர்கள். தியானம், யோகா போன்ற பயிற்சிகள் உங்களுக்கு மன அமைதியையும், புத்துணர்வையும் அளிக்கும். உங்களது கருத்துக்களுக்கு இன்று மிகுந்த மதிப்பு கிடைக்கும். பிறரின் உணர்வுகளைப் புரிந்து கொண்டு செயல்படுவீர்கள். சமூகத்தில் உங்கள் மதிப்பு உயரும். புதிய தொடர்புகள் ஏற்படும். இவை உங்களுக்கு பல வகையிலும் பயனுள்ளதாக அமையும். உங்கள் ஆளுமைத்திறன் வெளிப்படும் நாள் இது.\nகுடும்பத்தில் சுப நிகழ்ச்சிகள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். உறவினர்களுடனான சந்திப்புகள் மகிழ்ச்சியை அளிக்கும். குழந்தைகளுடன் நேரம் செலவிடுவது உங்களுக்கு மன நிறைவைத் தரும். பெற்றோரின் ஆரோக்கியத்தில் கவனம் செலுத்துவது நல்லது. அவர்களின் தேவைகளை பூர்த்தி செய்வதில் ஆர்வம் காட்டுவீர்கள். வீட்டில் அமைதியும், மகிழ்ச்சியும் நிறைந்திருக்கும். கலை மற்றும் இலக்கியத் துறையில் உள்ளவர்களுக்கு நல்ல வாய்ப்புகள் அமையும். உங்கள் படைப்பாற்றல் இன்று உச்சத்தை அடையும். சமூக சேவைகளில் ஈடுபடுவோருக்கு நல்ல அங்கீகாரம் கிடைக்கும். தன்னார்வ தொண்டுகளில் ஆர்வம் காட்டுவீர்கள். இதனால் சமூகத்தில் உங்கள் மதிப்பு உயரும். உங்கள் மனதில் உள்ள நல்ல எண்ணங்களை வெளிப்படுத்த தயங்காதீர்கள். அவை பலருக்கும் பயனுள்ளதாக அமையும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். எதையும் ஆழமாக சிந்தித்து செயல்படுவீர்கள். மற்றவர்களுடன் இணைந்து பணியாற்றுவதில் வெற்றி காண்பீர்கள். கூட்டு முயற்சிகள் இன்று சிறப்பான பலனைத் தரும். நீண்டகாலமாக நிலுவையில் இருந்த காரியங்கள் இன்று ஒரு முடிவுக்கு வரும். எதிர்பாராத தனலாபம் உண்டாகும். முதலீடுகள் தொடர்பான விஷயங்களில் நிதானமாக முடிவெடுப்பது நல்லது. உங்களுக்கு புத்துணர்ச்சியும், புதிய ஆற்றலும் கிடைக்கும் நாள் இது. உங்களின் தன்னம்பிக்கை அதிகரிக்கும். எதிர்கால திட்டமிடல்களில் தெளிவு கிடைக்கும். புதிய தொழில் முயற்சிகள் பற்றிய ஆலோசனைகள் நடைபெறும். இன்று நீங்கள் எடுக்கும் முடிவுகள் சிறப்பான பலனைத் தரும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் மன அமைதியை அளிக்கும். இன்று நீங்கள் பிறருக்கு செய்யும் உதவிகள் உங்களுக்கு நன்மையை கொண்டு வரும். உங்கள் ஆற்றலை சரியான திசையில் செலுத்தி வெற்றி பெறுவீர்கள்.",
    "prediction_en": "As today is Wednesday, the influence of Mercury will enhance new ideas and creativity for Aquarius natives. Innovative thoughts will arise in your mind. You will succeed in sharing them with others. You will excel in working collaboratively. Those in social and technological fields will have good opportunities today. Clarity and honesty will be evident in your speech and writing. You will show interest in learning new things and enhancing your knowledge. Those in education-related fields will have golden opportunities today. Students will excel in educational matters. Their hard work will yield good results. A clear solution will be found today for some problems that have remained unresolved for many days. Your mind will be at peace. You will maintain cordial relationships with colleagues and family members. You will succeed in planning and executing any task. Your intelligence will improve. Journeys undertaken today will be beneficial. You will engage in activities that enhance your mental capacity. Practices like meditation and yoga will bring you mental peace and rejuvenation. Your opinions will gain much value today. You will act with an understanding of others' feelings. Your reputation in society will increase. New connections will form, which will be beneficial to you in many ways. This is a day when your leadership qualities will be evident.\nDiscussions about auspicious events will take place in the family. Meetings with relatives will bring joy. Spending time with children will give you mental satisfaction. It is good to pay attention to your parents' health. You will show interest in fulfilling their needs. The home will be filled with peace and happiness. Good opportunities will arise for those in the arts and literature fields. Your creativity will reach its peak today. Those involved in social service will receive good recognition. You will show interest in volunteering, which will elevate your standing in society. Do not hesitate to express the good thoughts in your mind, as they will be beneficial to many. Innovative thoughts will guide you. You will think deeply before acting. You will succeed in working with others. Joint ventures will yield excellent results today. Long-pending tasks will come to a conclusion today. Unexpected financial gains are possible. It is advisable to make calm decisions regarding investment matters. This is a day when you will gain rejuvenation and new energy. Your self-confidence will increase. Clarity will be achieved in future planning. Discussions about new business ventures will take place. The decisions you make today will bring excellent results. Spiritual inclination will increase. Temple visits will provide peace of mind. The help you offer to others today will bring you good fortune. You will direct your energy in the right direction and achieve success.",
    "career_ta": "தொழில் மற்றும் வியாபாரத்தில் நல்ல வளர்ச்சி காணப்படும். உங்கள் புதுமையான சிந்தனைகள் புதிய வாய்ப்புகளைப் பெற்றுத்தரும். குழுப்பணிகளில் சிறந்து விளங்குவீர்கள். சமூக மற்றும் தொழில்நுட்பத் துறைகளில் உள்ளவர்களுக்கு இன்று நல்ல வாய்ப்புகள் அமையும். புதிய ஒப்பந்தங்களில் கையெழுத்திட வாய்ப்பு உண்டு. உங்கள் யோசனைகள் ஏற்றுக்கொள்ளப்பட்டு பாராட்டுக்களைப் பெறும்.",
    "career_en": "Good growth will be seen in your career and business. Your innovative ideas will bring new opportunities. You will excel in teamwork. Those in social and technological fields will have good opportunities today. There is a chance to sign new contracts. Your ideas will be accepted and receive praise.",
    "finance_ta": "பொருளாதார நிலை சீராக இருக்கும். புதிய முதலீடுகள் பற்றி சாதகமாக சிந்திப்பீர்கள். புத்திசாலித்தனமான முடிவுகள் நிதி நிலையில் நல்ல மாற்றங்களைக் கொண்டு வரும். சேமிப்பு உயரும். கடன்கள் தொடர்பான பிரச்சனைகளுக்கு தீர்வு காணப்படும். எதிர்பாராத வகையில் பண வரவுகள் உண்டாக வாய்ப்புள்ளது. செலவுகளைக் கட்டுப்படுத்துவதில் கவனம் செலுத்துவீர்கள்.",
    "finance_en": "The financial situation will be stable. Intelligent decisions will bring positive changes to your financial status. You will consider new investments. Savings will increase. Solutions will be found for debt-related problems. There is a possibility of unexpected income. You will focus on controlling expenses.",
    "health_ta": "ஆரோக்கியம் சிறப்பாக இருக்கும். மன அழுத்தம் குறைந்து, புத்துணர்ச்சியுடன் செயல்படுவீர்கள். உடல் நலத்தில் கூடுதல் கவனம் செலுத்துவது நல்லது. யோகா, தியானம் போன்ற பயிற்சிகள் உங்களுக்கு பலன் தரும். பழங்கள், காய்கறிகள் நிறைந்த உணவை உட்கொள்வது உடல் ஆரோக்கியத்தை மேம்படுத்தும். புத்துணர்ச்சி தரும் பானங்களை அருந்துவது நல்லது.",
    "health_en": "Health will be excellent. Stress will reduce, and you will act with renewed vigor. It is good to pay extra attention to your physical well-being. Practices like yoga and meditation will benefit you. Consuming a diet rich in fruits and vegetables will improve physical health. It is good to drink refreshing beverages.",
    "lucky_number": 4,
    "lucky_color_ta": "ஊதா",
    "lucky_color_en": "Violet"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "18-02-2026",
    "prediction_ta": "இன்று புதன்கிழமை, புதன் பகவானின் ஆதிக்கம் மீன ராசி அன்பர்களுக்கு மனத்தெளிவையும், உள்ளுணர்வையும் மேம்படுத்தும். உங்கள் மனதில் இருந்த குழப்பங்கள் நீங்கி, தெளிவான சிந்தனை உருவாகும். எந்த ஒரு விஷயத்திலும் ஆழமாக சிந்தித்து முடிவெடுப்பீர்கள். குடும்ப உறுப்பினர்களுடனும், நண்பர்களுடனும் இனிமையான உரையாடல்கள் நடைபெறும். உங்கள் பேச்சில் மென்மையும், அதே சமயம் உறுதியும் இருக்கும். பிறரின் உணர்வுகளைப் புரிந்து கொண்டு செயல்படுவீர்கள். இது உங்கள் உறவுகளை மேம்படுத்தும். புதிய விஷயங்களைக் கற்றுக் கொள்வதிலும், உங்களின் அறிவை மேம்படுத்துவதிலும் ஆர்வம் காட்டுவீர்கள். புத்தக வாசிப்பு, கல்வி சார்ந்த நிகழ்ச்சிகளில் பங்கேற்பது உங்களுக்கு பயனுள்ளதாக அமையும். மாணவர்கள் கல்வி சம்பந்தமான விஷயங்களில் சிறந்து விளங்குவார்கள். அவர்களின் கடின உழைப்புக்கு நல்ல பலன் கிடைக்கும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள் பயனுள்ளதாக அமையும். குறிப்பாக கல்வி அல்லது தொழில் சார்ந்த பயணங்கள் வெற்றியைத் தரும். மன அமைதி கிடைக்கும் நாள் இது. தியானம், வாசிப்பு போன்ற செயல்களில் ஈடுபடுவது உங்களுக்கு மன அமைதியை அளிக்கும்.\nவீட்டில் மகிழ்ச்சியான சூழ்நிலை நிலவும். சுப காரியங்கள் பற்றிய பேச்சுவார்த்தைகள் நடைபெறும். உறவினர்களுடனான சந்திப்புகள் இனிமையாக இருக்கும். குழந்தைகளுடன் மனம் விட்டுப் பேசுவது அவர்களுக்கு உற்சாகத்தை அளிக்கும். பெற்றோரின் உடல்நிலையில் கவனம் செலுத்துவீர்கள். கலை மற்றும் இலக்கியத் துறையில் உள்ளவர்களுக்கு இன்று நல்ல வாய்ப்புகள் அமையும். உங்கள் படைப்பாற்றல் இன்று உச்சத்தை அடையும். சமூக சேவைகளில் ஈடுபடுவோருக்கு நல்ல அங்கீகாரம் கிடைக்கும். தன்னார்வ தொண்டுகளில் ஆர்வம் காட்டுவீர்கள். இதனால் சமூகத்தில் உங்கள் மதிப்பு உயரும். உங்கள் மனதில் உள்ள நல்ல எண்ணங்களை வெளிப்படுத்த தயங்காதீர்கள். அவை பலருக்கும் பயனுள்ளதாக அமையும். புதுமையான சிந்தனைகள் உங்களை வழிநடத்தும். எதையும் ஆழமாக சிந்தித்து செயல்படுவீர்கள். மற்றவர்களுடன் இணைந்து பணியாற்றுவதில் வெற்றி காண்பீர்கள். கூட்டு முயற்சிகள் இன்று சிறப்பான பலனைத் தரும். நீண்டகாலமாக நிலுவையில் இருந்த காரியங்கள் இன்று ஒரு முடிவுக்கு வரும். எதிர்பாராத தனலாபம் உண்டாகும். முதலீடுகள் தொடர்பான விஷயங்களில் நிதானமாக முடிவெடுப்பது நல்லது. உங்களுக்கு புத்துணர்ச்சியும், புதிய ஆற்றலும் கிடைக்கும் நாள் இது. உங்களின் தன்னம்பிக்கை அதிகரிக்கும். எதிர்கால திட்டமிடல்களில் தெளிவு கிடைக்கும். புதிய தொழில் முயற்சிகள் பற்றிய ஆலோசனைகள் நடைபெறும். இன்று நீங்கள் எடுக்கும் முடிவுகள் சிறப்பான பலனைத் தரும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனம் மன அமைதியை அளிக்கும். இன்று நீங்கள் பிறருக்கு செய்யும் உதவிகள் உங்களுக்கு நன்மையை கொண்டு வரும். உங்கள் ஆற்றலை சரியான திசையில் செலுத்தி வெற்றி பெறுவீர்கள்.",
    "prediction_en": "As today is Wednesday, the influence of Mercury will enhance mental clarity and intuition for Pisces natives. Confusions in your mind will dissipate, and clear thinking will emerge. You will deeply contemplate and make decisions in any matter. Pleasant conversations will take place with family members and friends. Your speech will be gentle yet firm. You will act with an understanding of others' feelings, which will improve your relationships. You will show interest in learning new things and enhancing your knowledge. Reading books and participating in educational programs will be beneficial to you. Students will excel in educational matters. Their hard work will yield good results. Journeys undertaken today will be beneficial, especially those related to education or career, which will bring success. This is a day for mental peace. Engaging in activities like meditation and reading will bring you tranquility.\nA joyous atmosphere will prevail in the family. Discussions about auspicious events will take place. Meetings with relatives will be pleasant. Heart-to-heart conversations with children will boost their morale. You will pay attention to your parents' health. Those in arts and literature will have good opportunities today. Your creativity will reach its peak today. Those involved in social service will receive good recognition. You will show interest in volunteering, which will elevate your standing in society. Do not hesitate to express the good thoughts in your mind, as they will be beneficial to many. Innovative thoughts will guide you. You will think deeply before acting. You will succeed in working with others. Joint ventures will yield excellent results today. Long-pending tasks will come to a conclusion today. Unexpected financial gains are possible. It is advisable to make calm decisions regarding investment matters. This is a day when you will gain rejuvenation and new energy. Your self-confidence will increase. Clarity will be achieved in future planning. Discussions about new business ventures will take place. The decisions you make today will bring excellent results. Spiritual inclination will increase. Temple visits will provide peace of mind. The help you offer to others today will bring you good fortune. You will direct your energy in the right direction and achieve success.",
    "career_ta": "தொழில்ரீதியாக இன்று வளர்ச்சி காணும் நாளாகும். உங்கள் உள்ளுணர்வு சரியான முடிவுகளை எடுக்க உதவும். சக ஊழியர்களின் ஒத்துழைப்பு கிடைக்கும். புதிய திட்டங்களில் உங்கள் யோசனைகள் ஏற்றுக்கொள்ளப்படும். கலை மற்றும் சேவைத் துறையில் உள்ளவர்களுக்கு இன்று நல்ல வாய்ப்புகள் அமையும். வணிகர்களுக்கு லாபம் அதிகரிக்கும். புதிய ஒப்பந்தங்கள் ஏற்படும்.",
    "career_en": "Professionally, today is a day of growth. Your intuition will help you make the right decisions. You will receive cooperation from colleagues. Your ideas will be accepted in new projects. Those in arts and service sectors will have good opportunities today. Business people will see increased profits. New contracts will be formed.",
    "finance_ta": "பொருளாதார நிலை திருப்திகரமாக இருக்கும். புதிய முதலீடுகள் பற்றி ஆலோசிப்பீர்கள். சேமிக்கும் எண்ணம் மேலோங்கும். குடும்பச் செலவுகளை சிறப்பாக நிர்வகிப்பீர்கள். எதிர்பாராத வரவுகள் உண்டாக வாய்ப்புள்ளது. நிதி திட்டமிடலில் நிதானமாக செயல்படுவது நல்லது. பழைய கடன்கள் தீரும் வழி பிறக்கும்.",
    "finance_en": "The financial situation will be satisfactory. You will consider new investments. The desire to save will be strong. You will manage family expenses well. There is a possibility of unexpected income. It is good to act calmly in financial planning. A way to clear old debts will emerge.",
    "health_ta": "உடல் ஆரோக்கியம் சீராக இருக்கும். மனதில் அமைதி நிலவும். மனநிறைவுடன் செயல்படுவதால் உடல் சோர்வு குறையும். மிதமான உடற்பயிற்சிகளை மேற்கொள்வது நல்லது. நீர்ச்சத்து நிறைந்த உணவுகளை உட்கொள்வது ஆரோக்கியத்திற்கு நல்லது. போதுமான ஓய்வு எடுப்பது மன அழுத்தத்தைக் குறைக்கும்.",
    "health_en": "Physical health will be stable. Peace of mind will prevail. Physical fatigue will reduce due to acting with contentment. Moderate exercises are beneficial. Consuming water-rich foods is good for health. Sufficient rest will reduce stress.",
    "lucky_number": 3,
    "lucky_color_ta": "இளஞ்சிவப்பு",
    "lucky_color_en": "Pink"
  }
]
