[
  {
    "sign_ta": "மேஷம்",
    "sign_en": "Aries",
    "date": "23-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்திற்கு உட்பட்ட நாள். இதனால் மேஷ ராசி அன்பர்களுக்கு மன அமைதியும், குடும்ப உறவுகளில் நல்லிணக்கமும் மிகுந்திருக்கும். உங்களது ஆற்றல் நிறைந்த மனம் இன்று சற்று அமைதியடைந்து, உள்முகச் சிந்தனைகளை மேற்கொள்ளத் தூண்டும். நீண்ட நாட்களாக நீங்கள் செய்யத் திட்டமிட்டிருந்த சில வீட்டு வேலைகளைச் செய்து முடிப்பதற்கான வாய்ப்புகள் இன்று அமையும். இல்லத்தில் சுபிட்சமும், மகிழ்ச்சியும் நிறைந்திருக்கும். அன்னையின் ஆரோக்கியத்தில் தனி கவனம் செலுத்துவது நல்லது. அவரிடம் அன்புடனும், பொறுமையுடனும் பேசுவது மன அமைதியைத் தரும். குடும்ப உறுப்பினர்களுடன் இணைந்து மேற்கொள்ளும் செயல்பாடுகள் வெற்றி பெறும். நண்பர்கள் மற்றும் உறவினர்களுடன் இனிமையான உரையாடல்கள் நிகழும். உங்கள் உணர்வுகளை சரியாகப் புரிந்துகொண்டு வெளிப்படுத்தும் ஆற்றல் இன்று கூடும். எந்தவொரு முக்கிய முடிவுகளையும் அவசரப்பட்டு எடுக்காமல், பொறுமையுடன் யோசித்து எடுப்பது சிறந்தது. மனதிற்குப் பிடித்த பொழுதுபோக்கு அம்சங்களில் ஈடுபடுவது புத்துணர்ச்சியை அளிக்கும். கலை மற்றும் இலக்கியத் துறையில் உள்ளவர்களுக்கு புதிய உத்வேகம் உண்டாகும். படைப்பாற்றல் பெருகி, புதிய சிந்தனைகள் உருவாகும். மனதின் அமைதி உடல் ஆரோக்கியத்திற்கும் வழிவகுக்கும் என்பதால், வீண் கவலைகளைத் தவிர்த்து, சந்தோஷமாக இருப்பதற்கான வழிமுறைகளைக் கண்டறியுங்கள். ஆன்மீகச் சிந்தனைகளில் ஈடுபடுவது மனதிற்குப் புத்துணர்ச்சியையும், அமைதியையும் வழங்கும். இன்று நீங்கள் செய்யும் தானதர்மங்கள், நல்ல பலன்களைத் தரும். குழந்தைகள் மற்றும் இளம் வயதினர் தங்கள் படிப்பில் கூடுதல் கவனம் செலுத்தி, நல்ல மதிப்பெண்கள் பெற வாய்ப்புள்ளது. மூத்தவர்களின் ஆசீர்வாதத்தைப் பெறுவது மிகுந்த நன்மை பயக்கும். இன்றைய நாள் உங்களுக்கு ஒரு நல்ல அனுபவத்தையும், புதிய கண்ணோட்டத்தையும் அளிக்கும். வீட்டின் சூழலை மேம்படுத்தவும், உங்கள் அன்புக்குரியவர்களுடன் ஆழமான தொடர்புகளை ஏற்படுத்தவும் இது ஒரு சிறந்த நாள். உங்கள் உள் மனதின் குரலுக்கு செவிசாய்த்து செயல்படுவது பல காரியங்களில் வெற்றியைத் தேடித்தரும். தன்னம்பிக்கையுடன் செயல்படுங்கள், உங்கள் முயற்சிகள் பலிக்கும். எதிர்பாராத சில சந்திப்புகள் உங்கள் மனதிற்கு மகிழ்ச்சி அளிக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது புதிய நண்பர்களைப் பெற வழிவகுக்கும். உங்கள் சிந்தனைகளில் தெளிவு பிறக்கும். இன்று நீங்கள் மேற்கொள்ளும் சிறு பயணங்கள் கூட மனதிற்கு அமைதியைத் தரும். வீட்டுச் சூழலைச் சீர்செய்வது மன மகிழ்ச்சியை அதிகரிக்கும். உங்கள் தினசரி பணிகளில் ஏற்படும் சிறு மாற்றங்கள் கூட பெரிய நல்ல விளைவுகளை ஏற்படுத்தலாம். இன்று நீங்கள் மேற்கொள்ளும் தியானம், யோகா போன்ற செயல்பாடுகள் மனதிற்கு மிகுந்த அமைதியையும், ஆற்றலையும் வழங்கும். தன்னம்பிக்கையுடன் கூடிய பொறுமையான அணுகுமுறை வெற்றிக்கு வழிவகுக்கும். இன்று நீங்கள் எதிர்கொள்ளும் சவால்கள் கூட, உங்கள் திறனை மேம்படுத்தும் வாய்ப்புகளாக அமையும். ஆகையால், ஒவ்வொரு செயலிலும் நேர்மறையான கண்ணோட்டத்துடன் ஈடுபடுங்கள். குடும்பப் பெரியோரின் அறிவுரைகளைக் கேட்டு நடப்பது, பிற்காலத்தில் நற்பலன்களைக் கொண்டு வரும். இன்றைய நாள் உங்களுக்கு ஒரு மகிழ்ச்சியான மற்றும் மனநிறைவான நாளாக அமையும்.",
    "prediction_en": "Today, Monday, is influenced by the Moon. For Aries natives, this day brings a sense of mental peace and harmony in family relationships. Your usually energetic mind may calm down today, prompting introspection. Opportunities may arise to complete some household tasks that you have been planning for a long time. Prosperity and joy will fill your home. It is advisable to pay special attention to your mother's health. Speaking to her with love and patience will bring mental peace. Activities undertaken with family members will be successful. Pleasant conversations will take place with friends and relatives. Your ability to understand and express your emotions will improve today. It is best to think carefully and patiently before making any important decisions, rather than rushing into them. Engaging in enjoyable hobbies will provide rejuvenation. Those in the arts and literature will find new inspiration. Creativity will flourish, and new ideas will emerge. Since mental peace also contributes to physical health, avoid unnecessary worries and find ways to be happy. Engaging in spiritual thoughts will bring refreshment and peace to the mind. Acts of charity you perform today will yield good results. Children and young people have the opportunity to focus more on their studies and achieve good marks. Receiving the blessings of elders will be very beneficial. Today will offer you a good experience and a new perspective. It is an excellent day to improve your home environment and build deeper connections with your loved ones. Listening to your inner voice will lead to success in many endeavors. Act with self-confidence; your efforts will bear fruit. Some unexpected encounters will bring joy to your heart. Participating in social events will lead to new friendships. Clarity will emerge in your thoughts. Even short trips undertaken today will bring peace to your mind. Improving the home environment will increase mental happiness. Even small changes in your daily routines can lead to significant positive outcomes. Engaging in activities like meditation and yoga today will provide immense peace and energy to the mind. A patient approach combined with self-confidence will lead to success. Even the challenges you face today will serve as opportunities to enhance your abilities. Therefore, engage in every task with a positive outlook. Following the advice of family elders will bring good results in the future. Today will be a happy and fulfilling day for you.",
    "career_ta": "உங்கள் பணியிடத்தில் அமைதியான சூழ்நிலை நிலவும். சகாக்களுடன் நல்லுறவு பேணுவது, குழுப்பணிகளை வெற்றிகரமாக முடிக்க உதவும். புதிய திட்டங்களில் ஈடுபட இன்று சிறந்த நாளாகும். உங்கள் கருத்துக்கள் ஏற்கப்படும். நேர்மறையான அணுகுமுறை வெற்றிக்கு வழிவகுக்கும்.",
    "career_en": "A calm atmosphere will prevail in your workplace. Maintaining good relationships with colleagues will help you successfully complete teamwork. Today is an excellent day to engage in new projects. Your ideas will be accepted. A positive approach will lead to success.",
    "finance_ta": "நிதிநிலை சீராக இருக்கும். எதிர்பாராத சிறு ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது. வீட்டின் தேவைகளுக்காகச் செலவு செய்வது மனதிற்கு திருப்தியை அளிக்கும். நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பதற்கான நல்ல நாள் இது. சேமிப்பு அதிகரிக்கும்.",
    "finance_en": "Financial stability will prevail. There is a possibility of unexpected small gains. Spending on household needs will bring mental satisfaction. This is a good day to think about long-term investments. Savings will increase.",
    "health_ta": "மன அமைதி உடல் ஆரோக்கியத்திற்கு வழிவகுக்கும். மனதை அமைதியாக வைத்துக்கொள்வது, உடல் சோர்வை நீக்கி புத்துணர்ச்சி அளிக்கும். போதுமான ஓய்வு எடுப்பது முக்கியம். தியானம், யோகா போன்ற பயிற்சிகள் நன்மை பயக்கும்.",
    "health_en": "Mental peace leads to physical health. Keeping the mind calm will remove physical fatigue and provide rejuvenation. Adequate rest is important. Practices like meditation and yoga will be beneficial.",
    "lucky_number": "9",
    "lucky_color_ta": "வெளிர் நீலம்",
    "lucky_color_en": "Light Blue"
  },
  {
    "sign_ta": "ரிஷபம்",
    "sign_en": "Taurus",
    "date": "23-02-2026",
    "prediction_ta": "சந்திரனின் ஆதிக்கம் நிறைந்த இந்த திங்கட்கிழமை, ரிஷப ராசி அன்பர்களுக்கு மனம் சார்ந்த விஷயங்களில் மிகுந்த கவனத்தைக் கோரும். உங்கள் உள்மன உணர்வுகளுக்கு இன்று முக்கியத்துவம் கொடுப்பது நன்மை பயக்கும். வீட்டை அழகுபடுத்துவதிலோ அல்லது குடும்ப உறுப்பினர்களுடன் நேரத்தைச் செலவிடுவதிலோ அதிக ஆர்வம் காட்டுவீர்கள். இன்று நீங்கள் உங்கள் அன்பானவர்களுடன் நல்லுறவை மேம்படுத்துவதற்கான வாய்ப்புகளைப் பெறுவீர்கள். அன்னையுடன் ஆழமான உரையாடல்களில் ஈடுபடுவது மனதிற்கு இதமளிக்கும். கடந்தகால நினைவுகள் உங்கள் மனதில் வந்து போகலாம், ஆனால் அதிலிருந்து பாடங்களைக் கற்றுக்கொண்டு முன்னேறுவது சிறந்தது. உணர்ச்சிப்பூர்வமான விஷயங்களில் சற்று பொறுமையுடன் செயல்படுவது முக்கியம். உங்கள் மனதில் தோன்றும் எண்ணங்களை தெளிவாக வெளிப்படுத்துவது உறவுகளில் உள்ள தவறான புரிதல்களை நீக்கும். கலை மற்றும் அழகியல் சார்ந்த விஷயங்களில் ஆர்வம் அதிகரிக்கும். இசையைக் கேட்பது அல்லது ஓவியம் வரைவது போன்ற பொழுதுபோக்குகள் உங்கள் மனதிற்கு அமைதியைத் தரும். வீட்டுச் சூழலை அமைதியாகவும், இனிமையாகவும் வைத்துக்கொள்வது மனதிற்கு மகிழ்ச்சி அளிக்கும். நிதி விஷயங்களில் இன்று நீங்கள் கவனமுடன் செயல்படுவீர்கள். ஒரு நல்ல நிதித் திட்டத்தை உருவாக்குவதற்கு இது உகந்த நாள். குடும்பத்தினருடன் இணைந்து மேற்கொள்ளும் திட்டங்கள் வெற்றி பெறும். நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பதற்கு இது ஒரு நல்ல நேரம். குழந்தைகளுடன் நேரம் செலவிடுவது உங்களுக்கு சந்தோஷத்தை அளிக்கும். உங்களின் பொறுமையான அணுகுமுறை இன்று பல விஷயங்களில் வெற்றிக்கு வழிவகுக்கும். உடல் ஆரோக்கியத்தில் சிறப்புக் கவனம் செலுத்துவது அவசியம். புதிய நண்பர்களைச் சந்திப்பதற்கான வாய்ப்புகள் உண்டு. சமூக நிகழ்வுகளில் பங்கேற்பது உங்களுக்கு புதிய அனுபவங்களை வழங்கும். உங்கள் தனிப்பட்ட திறமைகளை வெளிப்படுத்துவதற்கு இன்று ஒரு நல்ல நாள். மனதின் அமைதி உடல் ஆரோக்கியத்திற்கு இன்றியமையாதது என்பதால், தேவையற்ற மன அழுத்தத்தைத் தவிர்த்து, நேர்மறையாக சிந்தியுங்கள். இன்று நீங்கள் சந்திக்கும் சவால்கள் கூட, உங்களை மேலும் வலுப்படுத்தும். சிறிய பிரச்சினைகளைக் கூட பொறுமையுடன் அணுகி தீர்வு காண்பது நல்லது. பிறருக்கு உதவும் எண்ணம் இன்று அதிகரிக்கும். உங்கள் செயல்பாடு மற்றவர்களுக்கு ஒரு முன்னுதாரணமாக அமையும். இன்றைய நாள் உங்களுக்கு ஆக்கபூர்வமான மற்றும் மனநிறைவான பல அனுபவங்களை வழங்கும். உங்கள் வாழ்க்கையின் அடுத்தகட்ட வளர்ச்சிக்கு இது ஒரு நல்ல தொடக்கமாக அமையும். உங்கள் நம்பிக்கையும், உழைப்பும் வெற்றியைத் தேடித்தரும் என்பதில் சந்தேகமில்லை. இயற்கையுடன் நேரத்தைச் செலவிடுவது மனதிற்குப் புத்துணர்ச்சி அளிக்கும். வீட்டின் தோட்டத்தில் நேரத்தைச் செலவிடுவதோ அல்லது ஒரு குறுகிய பயணத்தை மேற்கொள்வதோ மனதிற்கு அமைதியைத் தரும்.",
    "prediction_en": "This Moon-influenced Monday requires significant attention to mental matters for Taurus natives. Prioritizing your inner feelings today will be beneficial. You will show greater interest in beautifying your home or spending time with family members. Today, you will have opportunities to improve your relationships with loved ones. Engaging in deep conversations with your mother will bring comfort to your mind. Past memories may come and go, but it is best to learn from them and move forward. It is important to act with patience in emotional matters. Clearly expressing your thoughts will remove misunderstandings in relationships. Your interest in arts and aesthetics will increase. Hobbies like listening to music or painting will bring peace to your mind. Keeping your home environment calm and pleasant will bring joy to your mind. You will act carefully in financial matters today. This is a suitable day to create a good financial plan. Projects undertaken with family members will be successful. This is a good time to think about long-term investments. Spending time with children will bring you happiness. Your patient approach will lead to success in many matters today. It is essential to pay special attention to physical health. There are opportunities to meet new friends. Participating in social events will provide you with new experiences. Today is a good day to showcase your unique talents. Since mental peace is crucial for physical health, avoid unnecessary stress and think positively. Even the challenges you face today will make you stronger. It is good to approach even small problems with patience and find solutions. The desire to help others will increase today. Your actions will serve as an example to others. Today will offer you many constructive and fulfilling experiences. This will be a good beginning for the next phase of your life's growth. There is no doubt that your confidence and hard work will bring success. Spending time with nature will rejuvenate your mind. Spending time in your home garden or taking a short trip will bring peace to your mind.",
    "career_ta": "பணியிடத்தில் உங்கள் கருத்துக்களுக்கு மதிப்பு கிடைக்கும். சகாக்களுடன் இணக்கமான சூழல் உருவாகும். புதிய பொறுப்புகளை ஏற்கத் தயங்காதீர்கள். உங்கள் திறமைகளை வெளிப்படுத்த இன்று நல்ல வாய்ப்புகள் அமையும். கூட்டு முயற்சிகள் சிறப்பாக அமையும்.",
    "career_en": "Your opinions will be valued in the workplace. A harmonious environment will develop with colleagues. Do not hesitate to take on new responsibilities. Today will present good opportunities to showcase your talents. Collaborative efforts will be successful.",
    "finance_ta": "நிதி மேலாண்மையில் கவனம் செலுத்துவீர்கள். குடும்பத்திற்கான அத்தியாவசியச் செலவுகள் சீராக இருக்கும். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவது எதிர்காலத்திற்கு நல்லது. எதிர்பாராத வருவாய்க்கான வாய்ப்புகள் உண்டு. சரியான திட்டமிடல் பலன் தரும்.",
    "finance_en": "You will focus on financial management. Essential household expenses will be stable. Focusing on savings plans is good for the future. There are opportunities for unexpected income. Proper planning will yield results.",
    "health_ta": "மன அழுத்தம் இல்லாமல் இருப்பது ஆரோக்கியத்திற்கு நல்லது. குடும்பத்துடன் நேரம் செலவிடுவது மனதிற்கு மகிழ்ச்சி அளிக்கும். மிதமான உடற்பயிற்சிகளை மேற்கொள்வது நல்லது. புத்துணர்ச்சியுடன் செயல்படுவீர்கள்.",
    "health_en": "Being stress-free is good for health. Spending time with family will bring joy to the mind. Engaging in moderate exercises is beneficial. You will act with renewed energy.",
    "lucky_number": "6",
    "lucky_color_ta": "வெள்ளை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "மிதுனம்",
    "sign_en": "Gemini",
    "date": "23-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் மிதுன ராசி அன்பர்கள் தங்கள் மனதின் ஆழமான உணர்வுகளைப் புரிந்துகொள்ளும் வாய்ப்பைப் பெறுவார்கள். தகவல்தொடர்புகளில் சற்று உணர்ச்சிப்பூர்வமான தொனி இருக்கலாம். உங்கள் குடும்பத்தினருடனும், குறிப்பாக உங்கள் தாயுடனும் இனிமையான உரையாடல்களில் ஈடுபட இது ஒரு சிறந்த நாள். இல்லற வாழ்வில் நல்லிணக்கம் மேலோங்கும். வீட்டில் ஒரு அமைதியான சூழலை உருவாக்குவதில் உங்கள் கவனம் செல்லும். உங்கள் கருத்துக்களை தெளிவாகவும், மென்மையாகவும் வெளிப்படுத்துவது உறவுகளைப் பலப்படுத்தும். நண்பர்களுடன் ஏற்படும் சிறுசிறு தவறான புரிதல்கள் பொறுமையுடன் கையாண்டால் தீர்ந்துவிடும். புதிய தகவல்களைத் தேடுவதிலும், அறிவை வளர்த்துக்கொள்வதிலும் ஆர்வம் காட்டுவீர்கள். பயணத் திட்டங்கள் பற்றி ஆலோசிப்பதற்கோ அல்லது குறுகிய தூரப் பயணங்களை மேற்கொள்வதற்கோ இது ஒரு உகந்த நாள். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கான ஆர்வம் அதிகரிக்கும். புத்தகங்களைப் படிப்பதன் மூலமோ அல்லது ஆவணப்படங்களைப் பார்ப்பதன் மூலமோ உங்கள் அறிவை வளர்த்துக்கொள்வீர்கள். சமூக ஊடகங்களில் ஆக்கபூர்வமான கருத்துக்களைப் பகிர்வதற்கு இது ஒரு சிறந்த நேரம். கலை மற்றும் பொழுதுபோக்கு சார்ந்த விஷயங்களில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி அளிக்கும். உங்கள் சகோதர சகோதரிகளுடன் நல்லுறவைப் பேணுவது முக்கியம். அவர்களுக்குத் தேவையான உதவிகளைச் செய்யத் தயங்க வேண்டாம். உங்கள் உள்ளுணர்வு இன்று சிறப்பாகச் செயல்படும் என்பதால், முக்கிய முடிவுகளை எடுக்கும் முன் உங்கள் மனதின் குரலுக்குச் செவிசாயுங்கள். நிதி விஷயங்களில் கவனமுடன் செயல்படுவது நல்லது. திட்டமிடப்படாத செலவுகளைத் தவிர்த்து, சேமிப்பை அதிகரிப்பதற்கான வழிகளைக் கண்டறியுங்கள். கடின உழைப்பும், நேர்மையான அணுகுமுறையும் இன்று உங்களுக்கு நற்பலன்களைத் தேடித்தரும். உங்கள் உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம். போதுமான ஓய்வும், சத்தான உணவும் உங்கள் மனதையும், உடலையும் சீராக வைத்திருக்கும். இன்று நீங்கள் மேற்கொள்ளும் தியானம் மற்றும் மூச்சுப் பயிற்சிகள் மனதிற்கு மிகுந்த அமைதியை வழங்கும். குழந்தைகள் தங்கள் படிப்பில் அதிக ஈடுபாட்டுடன் செயல்படுவார்கள். மூத்தவர்களின் ஆலோசனைகளைக் கேட்டு நடப்பது, உங்கள் வாழ்க்கைக்கு நல்ல வழிகாட்டுதலை வழங்கும். இன்றைய நாள் உங்களுக்கு ஒரு நேர்மறையான அனுபவத்தையும், உறவுகளில் உள்ள ஆழமான புரிதலையும் வழங்கும். உங்கள் சமூக வட்டாரத்தில் புதிய தொடர்புகளை ஏற்படுத்த இன்று ஒரு நல்ல வாய்ப்பு கிடைக்கும். உங்கள் திறமைகளை மேம்படுத்துவதற்கு இது ஒரு நல்ல நாள். மனதின் அமைதியை நிலைநிறுத்த முயற்சி செய்யுங்கள், அது உங்களுக்கு பல வழிகளில் நன்மை பயக்கும். இன்றைய நாள் உங்களுக்கு ஆக்கபூர்வமான சிந்தனைகளையும், சுறுசுறுப்பான செயல்பாடுகளையும் வழங்கும். நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலிலும் நேர்மறையான எண்ணத்துடன் ஈடுபடுவது வெற்றிக்கு வழிவகுக்கும்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Gemini natives will have the opportunity to understand their deeper emotions. Communication may carry a slightly emotional tone. This is an excellent day to engage in pleasant conversations with your family, especially your mother. Harmony will prevail in domestic life. Your focus will be on creating a peaceful atmosphere at home. Expressing your opinions clearly and gently will strengthen relationships. Minor misunderstandings with friends can be resolved with patience. You will show interest in seeking new information and enhancing your knowledge. This is a suitable day for discussing travel plans or undertaking short trips. The desire to learn new things will increase. You will expand your knowledge by reading books or watching documentaries. This is an excellent time to share constructive thoughts on social media. Engaging in arts and entertainment will rejuvenate your mind. It is important to maintain good relationships with your siblings. Do not hesitate to offer them necessary assistance. Your intuition will function well today, so listen to your inner voice before making important decisions. It is good to act carefully in financial matters. Avoid unplanned expenses and find ways to increase savings. Hard work and an honest approach will bring you good results today. It is essential to pay attention to your physical health. Adequate rest and nutritious food will keep your mind and body balanced. The meditation and breathing exercises you perform today will provide immense peace to your mind. Children will engage more deeply in their studies. Following the advice of elders will provide good guidance for your life. Today will bring you a positive experience and a deeper understanding in relationships. Today is a good opportunity to establish new connections in your social circle. This is a good day to enhance your skills. Try to maintain mental peace, as it will benefit you in many ways. Today will provide you with constructive thoughts and active engagement. Approaching every task with a positive mindset will lead to success.",
    "career_ta": "உங்கள் தகவல் தொடர்புத் திறன்கள் இன்று சிறப்பாக வெளிப்படும். குழுப்பணிகளில் உங்கள் யோசனைகள் ஏற்றுக்கொள்ளப்படும். புதிய திட்டங்களுக்கு நல்ல ஆதரவு கிடைக்கும். சக ஊழியர்களுடன் இணக்கமான உறவு மேலோங்கும். மனநிறைவுடன் செயல்படுவீர்கள்.",
    "career_en": "Your communication skills will shine today. Your ideas will be accepted in teamwork. New projects will receive good support. A harmonious relationship with colleagues will prevail. You will work with satisfaction.",
    "finance_ta": "நிதிநிலைமை சீராக இருக்கும். குடும்பத்தினருடன் நிதி தொடர்பான ஆலோசனைகளை மேற்கொள்வது நன்மை பயக்கும். சிறு சிறு முதலீடுகள் வருங்காலத்தில் நல்ல லாபம் தரும். தேவையற்ற செலவுகளைத் தவிர்ப்பது அவசியம். வருமானம் அதிகரிக்கும்.",
    "finance_en": "Financial situation will be stable. Consulting with family members regarding finances will be beneficial. Small investments will yield good profits in the future. Avoiding unnecessary expenses is essential. Income will increase.",
    "health_ta": "மனதிற்கு அமைதியை அளிக்கும் செயல்களில் ஈடுபடுங்கள். யோகா மற்றும் தியானம் உங்கள் மனநிலையை மேம்படுத்தும். குடும்பத்தினருடன் நேரம் செலவிடுவது மனதிற்கு இதமளிக்கும். சத்தான உணவை உட்கொண்டு ஆரோக்கியத்தைப் பேணுங்கள்.",
    "health_en": "Engage in activities that bring peace to your mind. Yoga and meditation will improve your mood. Spending time with family will bring comfort to your mind. Maintain good health by consuming nutritious food.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "23-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆட்சியின் கீழ் இருப்பதால், கடக ராசி அன்பர்களுக்கு இது ஒரு அற்புதமான நாள். உங்கள் ராசியின் அதிபதியே சந்திரன் என்பதால், இன்றைய தினம் உங்களுக்கு மிகுந்த மன அமைதியையும், உணர்வுப்பூர்வமான நிறைவையும் வழங்கும். குடும்ப உறவுகளில் ஆழமான பிணைப்பு ஏற்படும். வீட்டில் ஒரு இனிமையான, சுபிட்சமான சூழல் நிலவும். அன்னையுடன் செலவிடும் நேரம் உங்களுக்கு அளவற்ற மகிழ்ச்சியையும், ஆறுதலையும் அளிக்கும். உங்கள் உள்மன உணர்வுகளுக்கு இன்று முக்கியத்துவம் கொடுப்பது நன்மை பயக்கும். உங்கள் உள்ளுணர்வு இன்று மிகவும் சக்தி வாய்ந்ததாக இருக்கும், முக்கிய முடிவுகளை எடுக்கும்போது அதன் வழிகாட்டுதலைப் பின்பற்றுவது நல்லது. அன்பு மற்றும் பாசம் நிறைந்த இந்த நாள், உங்கள் இல்லற வாழ்க்கையை மேலும் சிறப்பாக்கும். வீட்டு அலங்காரப் பொருட்களை வாங்குவதற்கோ அல்லது உங்கள் இல்லத்தை அழகுபடுத்துவதற்கோ இது ஒரு சிறந்த நாள். நீண்ட நாட்களாக நீங்கள் சந்திக்க விரும்பிய நண்பர்கள் அல்லது உறவினர்களை இன்று சந்திக்க வாய்ப்பு உள்ளது. அவர்களிடம் மனம்திறந்து பேசுவது மனதிற்கு மகிழ்ச்சி அளிக்கும். கலை மற்றும் படைப்பாற்றல் சார்ந்த விஷயங்களில் ஈடுபடுவது உங்கள் மனதிற்குப் புத்துணர்ச்சி அளிக்கும். உங்கள் தனிப்பட்ட திறமைகளை வெளிப்படுத்துவதற்கு இது ஒரு நல்ல நாள். மற்றவர்களின் உணர்வுகளைப் புரிந்துகொண்டு அவர்களுக்கு உதவ முன்வருவீர்கள். உங்கள் கருணை மற்றும் இரக்க குணம் இன்று பலரை ஈர்க்கும். நிதி விஷயங்களில் இன்று நீங்கள் மிகுந்த கவனமுடன் செயல்படுவீர்கள். சேமிப்பை அதிகரிப்பதற்கும், எதிர்காலத்திற்கான நிதித் திட்டங்களை வகுப்பதற்கும் இது ஒரு நல்ல நாள். எதிர்பாராத ஆதாயங்கள் கிடைப்பதற்கான வாய்ப்புகள் உண்டு. ஆனால், எந்தவொரு பெரிய முதலீடுகளையும் செய்வதற்கு முன் நன்கு ஆலோசிப்பது அவசியம். உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது முக்கியம். சத்தான உணவையும், போதுமான ஓய்வையும் எடுத்துக்கொள்வது உங்கள் மனதையும், உடலையும் சீராக வைத்திருக்கும். நீர்ச்சத்து நிறைந்த உணவுகளை உட்கொள்வது நல்லது. குழந்தைகள் மற்றும் குடும்பத்தினருடன் நேரம் செலவிடுவது உங்களுக்கு மன அமைதியையும், மகிழ்ச்சியையும் அளிக்கும். மூத்தவர்களின் ஆசீர்வாதங்களைப் பெறுவது உங்களுக்கு நல்வழியைக் காட்டும். ஆன்மீகச் சிந்தனைகளில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சியையும், அமைதியையும் வழங்கும். இன்று நீங்கள் செய்யும் தானதர்மங்கள் உங்களுக்கு நற்பலன்களைத் தரும். இன்றைய நாள் உங்களுக்கு ஒரு அற்புதமான அனுபவத்தையும், ஆழமான உணர்வுப்பூர்வமான நிறைவையும் வழங்கும். உங்கள் உணர்வுகளை வெளிப்படுத்துவதிலும், பிறரின் உணர்வுகளைப் புரிந்துகொள்வதிலும் நீங்கள் சிறந்து விளங்குவீர்கள். சமூக நிகழ்வுகளில் பங்கேற்பது புதிய தொடர்புகளைப் பெற வழிவகுக்கும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். ஆகையால், ஒவ்வொரு செயலிலும் நேர்மறையான எண்ணத்துடன் ஈடுபடுங்கள். இன்று நீங்கள் மேற்கொள்ளும் தியானம், யோகா போன்ற செயல்பாடுகள் மனதிற்கு மிகுந்த அமைதியையும், ஆற்றலையும் வழங்கும். இன்று நீங்கள் குடும்பத்திற்காகச் செய்யும் காரியங்கள் அனைத்தும் வெற்றியடையும். உங்கள் அன்பான வார்த்தைகளும், செயல்களும் பிறருக்கு மகிழ்ச்சியை வழங்கும். எந்தவொரு சிறிய சவால்களையும் பொறுமையுடன் அணுகி, வெற்றி பெறுவீர்கள்.",
    "prediction_en": "Today, Monday, being under the rulership of the Moon, is a wonderful day for Cancer natives. Since the Moon is your zodiac sign's ruler, today will bring you immense mental peace and emotional fulfillment. Deep bonds will form in family relationships. A pleasant and prosperous atmosphere will prevail at home. Time spent with your mother will bring you boundless joy and comfort. Prioritizing your inner feelings today will be beneficial. Your intuition will be very powerful today, so it is good to follow its guidance when making important decisions. This day filled with love and affection will further enhance your domestic life. This is an excellent day to buy home decor items or beautify your home. You may have the opportunity to meet friends or relatives whom you have wished to see for a long time. Conversing openly with them will bring joy to your mind. Engaging in arts and creative activities will rejuvenate your mind. This is a good day to express your unique talents. You will understand others' feelings and come forward to help them. Your kindness and compassion will attract many today. You will act with great care in financial matters today. This is a good day to increase savings and formulate financial plans for the future. There are chances of unexpected gains. However, it is essential to consult thoroughly before making any major investments. Paying attention to physical health is important. Consuming nutritious food and getting adequate rest will keep your mind and body balanced. It is good to consume hydrating foods. Spending time with children and family members will bring you mental peace and happiness. Receiving the blessings of elders will guide you well. Engaging in spiritual thoughts will bring rejuvenation and peace to the mind. Acts of charity you perform today will bring you good results. Today will offer you a wonderful experience and deep emotional fulfillment. You will excel in expressing your feelings and understanding others' emotions. Participating in social events will lead to new connections. All your endeavors will be successful. Therefore, engage in every task with a positive mindset. The meditation and yoga you practice today will provide immense peace and energy to your mind. All the tasks you undertake for your family today will succeed. Your loving words and actions will bring joy to others. You will approach and overcome any small challenges with patience.",
    "career_ta": "பணியிடத்தில் நீங்கள் எடுக்கும் முடிவுகள் சாதகமான பலன் தரும். குழுப்பணிகளில் உங்கள் தலைமைப் பண்பு வெளிப்படும். சக ஊழியர்கள் உங்கள் கருத்துக்களுக்கு மதிப்பு அளிப்பார்கள். புதிய திட்டங்களுக்கு சிறப்பான ஆதரவு கிடைக்கும். புதிய வாய்ப்புகள் உருவாகும்.",
    "career_en": "Decisions you make in the workplace will yield favorable results. Your leadership qualities will be evident in teamwork. Colleagues will value your opinions. New projects will receive excellent support. New opportunities will arise.",
    "finance_ta": "நிதிநிலைமை மிகச் சிறப்பாக இருக்கும். எதிர்பாராத வகையில் ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது. குடும்பத்திற்கான செலவுகளை நிர்வகிப்பதில் திறமையாகச் செயல்படுவீர்கள். சேமிப்பை அதிகரிப்பதற்கான நல்ல நாள். முதலீடுகள் நல்ல பலன் தரும்.",
    "finance_en": "Financial situation will be excellent. There is a possibility of unexpected gains. You will skillfully manage household expenses. A good day to increase savings. Investments will yield good returns.",
    "health_ta": "உடல் மற்றும் மன ஆரோக்கியம் சீராக இருக்கும். மனதிற்கு அமைதியை அளிக்கும் செயல்களில் ஈடுபடுங்கள். நல்ல தூக்கமும், சத்தான உணவும் உங்கள் ஆரோக்கியத்தைப் பேணும். நீர்ச்சத்து மிகுந்த உணவுகளை எடுத்துக்கொள்வது நல்லது.",
    "health_en": "Physical and mental health will be stable. Engage in activities that bring peace to your mind. Good sleep and nutritious food will maintain your health. It is good to consume hydrating foods.",
    "lucky_number": "2",
    "lucky_color_ta": "பால் வெள்ளை",
    "lucky_color_en": "Milk White"
  },
  {
    "sign_ta": "சிம்மம்",
    "sign_en": "Leo",
    "date": "23-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரன் ஆளக்கூடிய நாள் என்பதால் சிம்ம ராசி அன்பர்களுக்கு சற்று உள்முகச் சிந்தனைகளும், மன அமைதியும் நிறைந்த நாளாக அமையும். பொதுவாக தலைமைப் பண்புடன் செயல்படும் நீங்கள், இன்று சற்று அமைதியாக இருந்து, உங்கள் உணர்வுகளைப் புரிந்துகொள்ள முயற்சிப்பீர்கள். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தாயுடன் ஆழமான உரையாடல்களில் ஈடுபட இது ஒரு நல்ல நாள். அவர்களின் அறிவுரைகள் உங்களுக்கு நல்வழிகாட்டும். வீட்டின் சூழலை மேம்படுத்துவதிலும், குடும்ப உறுப்பினர்களுடன் நல்லிணக்கத்தைப் பேணுவதிலும் உங்கள் கவனம் செல்லும். உங்கள் உள்ளுணர்வு இன்று மிகவும் சிறப்பாகச் செயல்படும் என்பதால், முக்கிய முடிவுகளை எடுக்கும் முன் உங்கள் மனதின் குரலுக்குச் செவிசாய்ப்பது நல்லது. நிதி விஷயங்களில் இன்று சற்று கவனமாகச் செயல்படுவது அவசியம். திட்டமிடப்படாத செலவுகளைத் தவிர்த்து, எதிர்காலத்திற்கான சேமிப்பை அதிகரிப்பதில் கவனம் செலுத்துங்கள். நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பதற்கு இது ஒரு நல்ல நேரம். கடன் தொடர்பான விஷயங்களை நேர்மறையான அணுகுமுறையுடன் கையாள வேண்டும். கடந்தகால அனுபவங்களில் இருந்து பாடங்களைக் கற்றுக்கொண்டு, எதிர்காலத்தை நோக்கி நம்பிக்கையுடன் நகர்வீர்கள். கலை மற்றும் படைப்பாற்றல் சார்ந்த விஷயங்களில் ஈடுபடுவது உங்கள் மனதிற்குப் புத்துணர்ச்சி அளிக்கும். உங்கள் தனிப்பட்ட திறமைகளை வெளிப்படுத்துவதற்கு இது ஒரு நல்ல நாள். சமூக நிகழ்வுகளில் பங்கேற்பது உங்களுக்கு புதிய அனுபவங்களை வழங்கும். புதிய நண்பர்களைச் சந்திப்பதற்கான வாய்ப்புகள் உண்டு. உங்கள் கருணை மற்றும் இரக்க குணம் இன்று பலரை ஈர்க்கும். உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது முக்கியம். போதுமான ஓய்வும், சத்தான உணவும் உங்கள் மனதையும், உடலையும் சீராக வைத்திருக்கும். மனம் சார்ந்த விஷயங்களில் ஏற்படும் குழப்பங்களைத் தெளிவுபடுத்திக்கொள்ள முயற்சி செய்யுங்கள். யோகா, தியானம் போன்ற பயிற்சிகள் மனதிற்கு அமைதியை அளிக்கும். குழந்தைகள் தங்கள் படிப்பில் அதிக ஈடுபாட்டுடன் செயல்படுவார்கள். மூத்தவர்களின் ஆசீர்வாதங்களைப் பெறுவது உங்களுக்கு நல்வழியைக் காட்டும். இன்றைய நாள் உங்களுக்கு ஒரு அமைதியான அனுபவத்தையும், ஆழமான உணர்வுப்பூர்வமான நிறைவையும் வழங்கும். உங்கள் உணர்வுகளை வெளிப்படுத்துவதிலும், பிறரின் உணர்வுகளைப் புரிந்துகொள்வதிலும் நீங்கள் சிறந்து விளங்குவீர்கள். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். ஆகையால், ஒவ்வொரு செயலிலும் நேர்மறையான எண்ணத்துடன் ஈடுபடுங்கள். இன்று நீங்கள் மேற்கொள்ளும் தியானம், யோகா போன்ற செயல்பாடுகள் மனதிற்கு மிகுந்த அமைதியையும், ஆற்றலையும் வழங்கும். இன்று நீங்கள் குடும்பத்திற்காகச் செய்யும் காரியங்கள் அனைத்தும் வெற்றியடையும். உங்கள் அன்பான வார்த்தைகளும், செயல்களும் பிறருக்கு மகிழ்ச்சியை வழங்கும். எந்தவொரு சிறிய சவால்களையும் பொறுமையுடன் அணுகி, வெற்றி பெறுவீர்கள். இன்றைய நாள் உங்களுக்கு ஒரு நல்ல அனுபவத்தையும், புதிய கண்ணோட்டத்தையும் அளிக்கும். வீட்டின் சூழலை மேம்படுத்தவும், உங்கள் அன்புக்குரியவர்களுடன் ஆழமான தொடர்புகளை ஏற்படுத்தவும் இது ஒரு சிறந்த நாள். உங்கள் உள் மனதின் குரலுக்கு செவிசாய்த்து செயல்படுவது பல காரியங்களில் வெற்றியைத் தேடித்தரும். தன்னம்பிக்கையுடன் செயல்படுங்கள், உங்கள் முயற்சிகள் பலிக்கும். எதிர்பாராத சில சந்திப்புகள் உங்கள் மனதிற்கு மகிழ்ச்சி அளிக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது புதிய நண்பர்களைப் பெற வழிவகுக்கும். உங்கள் சிந்தனைகளில் தெளிவு பிறக்கும். இன்று நீங்கள் மேற்கொள்ளும் சிறு பயணங்கள் கூட மனதிற்கு அமைதியைத் தரும். வீட்டுச் சூழலைச் சீர்செய்வது மன மகிழ்ச்சியை அதிகரிக்கும். உங்கள் தினசரி பணிகளில் ஏற்படும் சிறு மாற்றங்கள் கூட பெரிய நல்ல விளைவுகளை ஏற்படுத்தலாம்.",
    "prediction_en": "Today, Monday, being ruled by the Moon, will be a day filled with introspection and mental peace for Leo natives. You, who usually act with leadership qualities, will try to be calm today and understand your emotions. This is a good day to engage in deep conversations with family members, especially your mother. Their advice will guide you well. Your focus will be on improving the home environment and maintaining harmony with family members. Your intuition will function very well today, so it is good to listen to your inner voice before making important decisions. It is essential to act carefully in financial matters today. Avoid unplanned expenses and focus on increasing savings for the future. This is a good time to think about long-term investments. Debt-related matters should be handled with a positive approach. You will learn lessons from past experiences and move forward with confidence towards the future. Engaging in arts and creative activities will rejuvenate your mind. This is a good day to express your unique talents. Participating in social events will provide you with new experiences. There are opportunities to meet new friends. Your kindness and compassion will attract many today. Paying attention to physical health is important. Adequate rest and nutritious food will keep your mind and body balanced. Try to clarify any confusion in mental matters. Practices like yoga and meditation will bring peace to the mind. Children will engage more deeply in their studies. Receiving the blessings of elders will guide you well. Today will bring you a peaceful experience and deep emotional fulfillment. You will excel in expressing your feelings and understanding others' emotions. All your endeavors will be successful. Therefore, engage in every task with a positive mindset. The meditation and yoga you practice today will provide immense peace and energy to your mind. All the tasks you undertake for your family today will succeed. Your loving words and actions will bring joy to others. You will approach and overcome any small challenges with patience. Today will offer you a good experience and a new perspective. It is an excellent day to improve your home environment and build deeper connections with your loved ones. Listening to your inner voice will lead to success in many endeavors. Act with self-confidence; your efforts will bear fruit. Some unexpected encounters will bring joy to your heart. Participating in social events will lead to new friendships. Clarity will emerge in your thoughts. Even short trips undertaken today will bring peace to your mind. Improving the home environment will increase mental happiness. Even small changes in your daily routines can lead to significant positive outcomes.",
    "career_ta": "உங்கள் பணியிடத்தில் அமைதியான மற்றும் இணக்கமான சூழ்நிலை நிலவும். சகாக்களுடன் நல்லுறவைப் பேணுவது உங்கள் செயல்திறனை மேம்படுத்தும். புதிய திட்டங்களில் ஈடுபட இன்று சிறந்த நாளாகும். உங்கள் தலைமைப் பண்பு மென்மையாக வெளிப்படும். பொறுப்புடன் செயல்படுவீர்கள்.",
    "career_en": "A calm and harmonious atmosphere will prevail in your workplace. Maintaining good relationships with colleagues will enhance your performance. Today is an excellent day to engage in new projects. Your leadership qualities will be gently expressed. You will act responsibly.",
    "finance_ta": "நிதிநிலை சீராக இருக்கும். குடும்பத்திற்கான செலவுகளில் கவனமாகச் செயல்படுவீர்கள். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவது எதிர்காலத்திற்கு நல்லது. கடன் தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். புதிய வருவாய் ஆதாரங்கள் உருவாகும்.",
    "finance_en": "Financial stability will prevail. You will act carefully in household expenses. Focusing on savings plans is good for the future. Good progress will be made in debt-related matters. New sources of income will emerge.",
    "health_ta": "மனதிற்கு அமைதியை அளிக்கும் செயல்களில் ஈடுபடுவது அவசியம். போதுமான ஓய்வு எடுப்பது உடலுக்கும், மனதிற்கும் நல்லது. ஆரோக்கியமான உணவுப் பழக்கத்தைப் பின்பற்றுங்கள். இயற்கையுடன் நேரம் செலவிடுவது புத்துணர்ச்சி அளிக்கும்.",
    "health_en": "It is essential to engage in activities that bring peace to your mind. Adequate rest is good for both body and mind. Follow a healthy diet. Spending time with nature will rejuvenate you.",
    "lucky_number": "1",
    "lucky_color_ta": "ஆழமான சிவப்பு",
    "lucky_color_en": "Deep Red"
  },
  {
    "sign_ta": "கன்னி",
    "sign_en": "Virgo",
    "date": "23-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் கன்னி ராசி அன்பர்களுக்கு மனம் சார்ந்த விஷயங்களில் மிகுந்த தெளிவும், அமைதியும் நிலவும். உங்கள் அன்றாடப் பணிகளில் முழு ஈடுபாட்டுடன் செயல்படுவீர்கள். குறிப்பாக, வீட்டில் உள்ள வேலைகளைச் சீர்செய்வதிலும், இல்லற வாழ்க்கையை மேம்படுத்துவதிலும் உங்கள் கவனம் செல்லும். குடும்ப உறுப்பினர்களுடன் நல்லிணக்கத்தைப் பேணுவது உங்களுக்கு மன மகிழ்ச்சியை அளிக்கும். அன்னையுடன் ஆழமான உரையாடல்களில் ஈடுபடுவது மனதிற்கு இதமளிக்கும். உங்களின் அமைதியான அணுகுமுறை இன்று பல விஷயங்களில் வெற்றிக்கு வழிவகுக்கும். உங்கள் உள்ளுணர்வு இன்று சிறப்பாகச் செயல்படும் என்பதால், முக்கிய முடிவுகளை எடுக்கும் முன் உங்கள் மனதின் குரலுக்குச் செவிசாய்ப்பது நல்லது. சமூக நிகழ்வுகளில் பங்கேற்பது உங்களுக்கு புதிய அனுபவங்களை வழங்கும். புதிய நண்பர்களைச் சந்திப்பதற்கான வாய்ப்புகள் உண்டு. உங்கள் கருணை மற்றும் இரக்க குணம் இன்று பலரை ஈர்க்கும். நிதி விஷயங்களில் இன்று நீங்கள் மிகுந்த கவனமுடன் செயல்படுவீர்கள். சேமிப்பை அதிகரிப்பதற்கும், எதிர்காலத்திற்கான நிதித் திட்டங்களை வகுப்பதற்கும் இது ஒரு நல்ல நாள். எதிர்பாராத ஆதாயங்கள் கிடைப்பதற்கான வாய்ப்புகள் உண்டு. ஆனால், எந்தவொரு பெரிய முதலீடுகளையும் செய்வதற்கு முன் நன்கு ஆலோசிப்பது அவசியம். உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது முக்கியம். போதுமான ஓய்வும், சத்தான உணவும் உங்கள் மனதையும், உடலையும் சீராக வைத்திருக்கும். மனம் சார்ந்த விஷயங்களில் ஏற்படும் குழப்பங்களைத் தெளிவுபடுத்திக்கொள்ள முயற்சி செய்யுங்கள். யோகா, தியானம் போன்ற பயிற்சிகள் மனதிற்கு அமைதியை அளிக்கும். குழந்தைகள் தங்கள் படிப்பில் அதிக ஈடுபாட்டுடன் செயல்படுவார்கள். மூத்தவர்களின் ஆசீர்வாதங்களைப் பெறுவது உங்களுக்கு நல்வழியைக் காட்டும். இன்றைய நாள் உங்களுக்கு ஒரு அமைதியான அனுபவத்தையும், ஆழமான உணர்வுப்பூர்வமான நிறைவையும் வழங்கும். உங்கள் உணர்வுகளை வெளிப்படுத்துவதிலும், பிறரின் உணர்வுகளைப் புரிந்துகொள்வதிலும் நீங்கள் சிறந்து விளங்குவீர்கள். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். ஆகையால், ஒவ்வொரு செயலிலும் நேர்மறையான எண்ணத்துடன் ஈடுபடுங்கள். இன்று நீங்கள் மேற்கொள்ளும் தியானம், யோகா போன்ற செயல்பாடுகள் மனதிற்கு மிகுந்த அமைதியையும், ஆற்றலையும் வழங்கும். இன்று நீங்கள் குடும்பத்திற்காகச் செய்யும் காரியங்கள் அனைத்தும் வெற்றியடையும். உங்கள் அன்பான வார்த்தைகளும், செயல்களும் பிறருக்கு மகிழ்ச்சியை வழங்கும். எந்தவொரு சிறிய சவால்களையும் பொறுமையுடன் அணுகி, வெற்றி பெறுவீர்கள். இன்றைய நாள் உங்களுக்கு ஒரு நல்ல அனுபவத்தையும், புதிய கண்ணோட்டத்தையும் அளிக்கும். வீட்டின் சூழலை மேம்படுத்தவும், உங்கள் அன்புக்குரியவர்களுடன் ஆழமான தொடர்புகளை ஏற்படுத்தவும் இது ஒரு சிறந்த நாள். உங்கள் உள் மனதின் குரலுக்கு செவிசாய்த்து செயல்படுவது பல காரியங்களில் வெற்றியைத் தேடித்தரும். தன்னம்பிக்கையுடன் செயல்படுங்கள், உங்கள் முயற்சிகள் பலிக்கும். எதிர்பாராத சில சந்திப்புகள் உங்கள் மனதிற்கு மகிழ்ச்சி அளிக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது புதிய நண்பர்களைப் பெற வழிவகுக்கும். உங்கள் சிந்தனைகளில் தெளிவு பிறக்கும். இன்று நீங்கள் மேற்கொள்ளும் சிறு பயணங்கள் கூட மனதிற்கு அமைதியைத் தரும். வீட்டுச் சூழலைச் சீர்செய்வது மன மகிழ்ச்சியை அதிகரிக்கும். உங்கள் தினசரி பணிகளில் ஏற்படும் சிறு மாற்றங்கள் கூட பெரிய நல்ல விளைவுகளை ஏற்படுத்தலாம்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Virgo natives will experience great clarity and peace in mental matters. You will act with full dedication in your daily tasks. Specifically, your focus will be on organizing household chores and improving domestic life. Maintaining harmony with family members will bring you mental happiness. Engaging in deep conversations with your mother will bring comfort to your mind. Your calm approach will lead to success in many matters today. Your intuition will function well today, so it is good to listen to your inner voice before making important decisions. Participating in social events will provide you with new experiences. There are opportunities to meet new friends. Your kindness and compassion will attract many today. You will act with great care in financial matters today. This is a good day to increase savings and formulate financial plans for the future. There are chances of unexpected gains. However, it is essential to consult thoroughly before making any major investments. Paying attention to physical health is important. Adequate rest and nutritious food will keep your mind and body balanced. Try to clarify any confusion in mental matters. Practices like yoga and meditation will bring peace to the mind. Children will engage more deeply in their studies. Receiving the blessings of elders will guide you well. Today will bring you a peaceful experience and deep emotional fulfillment. You will excel in expressing your feelings and understanding others' emotions. All your endeavors will be successful. Therefore, engage in every task with a positive mindset. The meditation and yoga you practice today will provide immense peace and energy to your mind. All the tasks you undertake for your family today will succeed. Your loving words and actions will bring joy to others. You will approach and overcome any small challenges with patience. Today will offer you a good experience and a new perspective. It is an excellent day to improve your home environment and build deeper connections with your loved ones. Listening to your inner voice will lead to success in many endeavors. Act with self-confidence; your efforts will bear fruit. Some unexpected encounters will bring joy to your heart. Participating in social events will lead to new friendships. Clarity will emerge in your thoughts. Even short trips undertaken today will bring peace to your mind. Improving the home environment will increase mental happiness. Even small changes in your daily routines can lead to significant positive outcomes.",
    "career_ta": "பணியிடத்தில் உங்கள் கடின உழைப்பு அங்கீகரிக்கப்படும். சகாக்களுடன் இணக்கமான சூழல் உருவாகும். புதிய திட்டங்களில் உங்கள் பகுப்பாய்வுத் திறன் சிறப்பாகச் செயல்படும். மன நிறைவுடன் பணிகளைச் செய்து முடிப்பீர்கள். புதிய வாய்ப்புகள் காத்திருக்கும்.",
    "career_en": "Your hard work will be recognized in the workplace. A harmonious environment will develop with colleagues. Your analytical skills will perform well in new projects. You will complete tasks with satisfaction. New opportunities await.",
    "finance_ta": "நிதிநிலைமை சீராக இருக்கும். குடும்பத்திற்கான நிதி திட்டங்களில் கவனம் செலுத்துவீர்கள். சேமிப்பு அதிகரிக்கும். சிறு சிறு முதலீடுகள் நல்ல லாபம் தரும். வீட்டின் தேவைகளுக்காகச் செலவு செய்வது மனதிற்கு திருப்தி அளிக்கும்.",
    "finance_en": "Financial situation will be stable. You will focus on financial plans for the family. Savings will increase. Small investments will yield good profits. Spending on household needs will bring mental satisfaction.",
    "health_ta": "உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம். போதுமான ஓய்வும், சத்தான உணவும் உங்கள் ஆரோக்கியத்தைப் பேணும். மன அமைதிக்கு தியானம், யோகா போன்ற பயிற்சிகள் நன்மை பயக்கும். மனநிறைவுடன் செயல்படுவீர்கள்.",
    "health_en": "It is essential to pay attention to physical health. Adequate rest and nutritious food will maintain your health. Practices like meditation and yoga will be beneficial for mental peace. You will act with satisfaction.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "23-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் துலாம் ராசி அன்பர்கள் தங்கள் உறவுகளில் சமநிலையையும், நல்லிணக்கத்தையும் பேணுவதில் அதிக ஆர்வம் காட்டுவார்கள். உங்கள் மனம் அமைதியாகவும், உணர்வுப்பூர்வமாகவும் இருக்கும். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தாயுடன் இனிமையான உரையாடல்களில் ஈடுபட இது ஒரு சிறந்த நாள். இல்லற வாழ்வில் மகிழ்ச்சியும், சுபிட்சமும் நிறைந்திருக்கும். வீட்டில் ஒரு அமைதியான சூழலை உருவாக்குவதில் உங்கள் கவனம் செல்லும். உங்கள் கருத்துக்களை தெளிவாகவும், மென்மையாகவும் வெளிப்படுத்துவது உறவுகளைப் பலப்படுத்தும். நண்பர்களுடன் ஏற்படும் சிறுசிறு தவறான புரிதல்கள் பொறுமையுடன் கையாண்டால் தீர்ந்துவிடும். புதிய தகவல்களைத் தேடுவதிலும், அறிவை வளர்த்துக்கொள்வதிலும் ஆர்வம் காட்டுவீர்கள். சமூக நிகழ்வுகளில் பங்கேற்பது உங்களுக்கு புதிய அனுபவங்களை வழங்கும். புதிய நண்பர்களைச் சந்திப்பதற்கான வாய்ப்புகள் உண்டு. உங்கள் கருணை மற்றும் இரக்க குணம் இன்று பலரை ஈர்க்கும். நிதி விஷயங்களில் இன்று நீங்கள் மிகுந்த கவனமுடன் செயல்படுவீர்கள். சேமிப்பை அதிகரிப்பதற்கும், எதிர்காலத்திற்கான நிதித் திட்டங்களை வகுப்பதற்கும் இது ஒரு நல்ல நாள். எதிர்பாராத ஆதாயங்கள் கிடைப்பதற்கான வாய்ப்புகள் உண்டு. ஆனால், எந்தவொரு பெரிய முதலீடுகளையும் செய்வதற்கு முன் நன்கு ஆலோசிப்பது அவசியம். உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது முக்கியம். போதுமான ஓய்வும், சத்தான உணவும் உங்கள் மனதையும், உடலையும் சீராக வைத்திருக்கும். மனம் சார்ந்த விஷயங்களில் ஏற்படும் குழப்பங்களைத் தெளிவுபடுத்திக்கொள்ள முயற்சி செய்யுங்கள். யோகா, தியானம் போன்ற பயிற்சிகள் மனதிற்கு அமைதியை அளிக்கும். குழந்தைகள் தங்கள் படிப்பில் அதிக ஈடுபாட்டுடன் செயல்படுவார்கள். மூத்தவர்களின் ஆசீர்வாதங்களைப் பெறுவது உங்களுக்கு நல்வழியைக் காட்டும். இன்றைய நாள் உங்களுக்கு ஒரு அமைதியான அனுபவத்தையும், ஆழமான உணர்வுப்பூர்வமான நிறைவையும் வழங்கும். உங்கள் உணர்வுகளை வெளிப்படுத்துவதிலும், பிறரின் உணர்வுகளைப் புரிந்துகொள்வதிலும் நீங்கள் சிறந்து விளங்குவீர்கள். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். ஆகையால், ஒவ்வொரு செயலிலும் நேர்மறையான எண்ணத்துடன் ஈடுபடுங்கள். இன்று நீங்கள் மேற்கொள்ளும் தியானம், யோகா போன்ற செயல்பாடுகள் மனதிற்கு மிகுந்த அமைதியையும், ஆற்றலையும் வழங்கும். இன்று நீங்கள் குடும்பத்திற்காகச் செய்யும் காரியங்கள் அனைத்தும் வெற்றியடையும். உங்கள் அன்பான வார்த்தைகளும், செயல்களும் பிறருக்கு மகிழ்ச்சியை வழங்கும். எந்தவொரு சிறிய சவால்களையும் பொறுமையுடன் அணுகி, வெற்றி பெறுவீர்கள். இன்றைய நாள் உங்களுக்கு ஒரு நல்ல அனுபவத்தையும், புதிய கண்ணோட்டத்தையும் அளிக்கும். வீட்டின் சூழலை மேம்படுத்தவும், உங்கள் அன்புக்குரியவர்களுடன் ஆழமான தொடர்புகளை ஏற்படுத்தவும் இது ஒரு சிறந்த நாள். உங்கள் உள் மனதின் குரலுக்கு செவிசாய்த்து செயல்படுவது பல காரியங்களில் வெற்றியைத் தேடித்தரும். தன்னம்பிக்கையுடன் செயல்படுங்கள், உங்கள் முயற்சிகள் பலிக்கும். எதிர்பாராத சில சந்திப்புகள் உங்கள் மனதிற்கு மகிழ்ச்சி அளிக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது புதிய நண்பர்களைப் பெற வழிவகுக்கும். உங்கள் சிந்தனைகளில் தெளிவு பிறக்கும். இன்று நீங்கள் மேற்கொள்ளும் சிறு பயணங்கள் கூட மனதிற்கு அமைதியைத் தரும். வீட்டுச் சூழலைச் சீர்செய்வது மன மகிழ்ச்சியை அதிகரிக்கும். உங்கள் தினசரி பணிகளில் ஏற்படும் சிறு மாற்றங்கள் கூட பெரிய நல்ல விளைவுகளை ஏற்படுத்தலாம்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Libra natives will show greater interest in maintaining balance and harmony in their relationships. Your mind will be calm and emotional. This is an excellent day to engage in pleasant conversations with family members, especially your mother. Joy and prosperity will fill domestic life. Your focus will be on creating a peaceful atmosphere at home. Expressing your opinions clearly and gently will strengthen relationships. Minor misunderstandings with friends can be resolved with patience. You will show interest in seeking new information and enhancing your knowledge. Participating in social events will provide you with new experiences. There are opportunities to meet new friends. Your kindness and compassion will attract many today. You will act with great care in financial matters today. This is a good day to increase savings and formulate financial plans for the future. There are chances of unexpected gains. However, it is essential to consult thoroughly before making any major investments. Paying attention to physical health is important. Adequate rest and nutritious food will keep your mind and body balanced. Try to clarify any confusion in mental matters. Practices like yoga and meditation will bring peace to the mind. Children will engage more deeply in their studies. Receiving the blessings of elders will guide you well. Today will bring you a peaceful experience and deep emotional fulfillment. You will excel in expressing your feelings and understanding others' emotions. All your endeavors will be successful. Therefore, engage in every task with a positive mindset. The meditation and yoga you practice today will provide immense peace and energy to your mind. All the tasks you undertake for your family today will succeed. Your loving words and actions will bring joy to others. You will approach and overcome any small challenges with patience. Today will offer you a good experience and a new perspective. It is an excellent day to improve your home environment and build deeper connections with your loved ones. Listening to your inner voice will lead to success in many endeavors. Act with self-confidence; your efforts will bear fruit. Some unexpected encounters will bring joy to your heart. Participating in social events will lead to new friendships. Clarity will emerge in your thoughts. Even short trips undertaken today will bring peace to your mind. Improving the home environment will increase mental happiness. Even small changes in your daily routines can lead to significant positive outcomes.",
    "career_ta": "பணியிடத்தில் சமநிலையைப் பேணுவீர்கள். சகாக்களுடன் இணக்கமான உறவு உங்கள் பணியை எளிதாக்கும். புதிய திட்டங்களில் உங்கள் யோசனைகள் நல்ல வரவேற்பைப் பெறும். கூட்டு முயற்சிகள் சிறப்பாக அமையும். மனநிறைவுடன் செயல்படுவீர்கள்.",
    "career_en": "You will maintain balance in the workplace. Harmonious relationships with colleagues will ease your work. Your ideas will be well-received in new projects. Collaborative efforts will be successful. You will work with satisfaction.",
    "finance_ta": "நிதிநிலை சீராக இருக்கும். குடும்பத்திற்கான நிதித் தேவைகளை சிறப்பாகப் பூர்த்தி செய்வீர்கள். சேமிப்பை அதிகரிப்பதற்கான நல்ல நாள். கடன் தொடர்பான விஷயங்களில் முன்னேற்றம் ஏற்படும். புதிய வருவாய் ஆதாரங்கள் உருவாகும்.",
    "finance_en": "Financial stability will prevail. You will effectively meet financial needs for the family. A good day to increase savings. Progress will be made in debt-related matters. New sources of income will emerge.",
    "health_ta": "மன அமைதி உடல் ஆரோக்கியத்திற்கு வழிவகுக்கும். போதுமான ஓய்வு எடுப்பது உடலுக்கும், மனதிற்கும் நல்லது. சத்தான உணவையும், நீர்ச்சத்து நிறைந்த பானங்களையும் எடுத்துக்கொள்ளுங்கள். இயற்கையுடன் நேரம் செலவிடுவது புத்துணர்ச்சி அளிக்கும்.",
    "health_en": "Mental peace leads to physical health. Adequate rest is good for both body and mind. Consume nutritious food and hydrating beverages. Spending time with nature will rejuvenate you.",
    "lucky_number": "6",
    "lucky_color_ta": "வெள்ளை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "விருச்சிகம்",
    "sign_en": "Scorpio",
    "date": "23-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் விருச்சிக ராசி அன்பர்களுக்கு மனம் சார்ந்த விஷயங்களில் ஆழமான சிந்தனைகளும், உணர்வுப்பூர்வமான அனுபவங்களும் நிறைந்திருக்கும். உங்கள் உள்மன உணர்வுகளுக்கு இன்று முக்கியத்துவம் கொடுப்பது நன்மை பயக்கும். வீட்டை அழகுபடுத்துவதிலோ அல்லது குடும்ப உறுப்பினர்களுடன் நேரத்தைச் செலவிடுவதிலோ அதிக ஆர்வம் காட்டுவீர்கள். இன்று நீங்கள் உங்கள் அன்பானவர்களுடன் நல்லுறவை மேம்படுத்துவதற்கான வாய்ப்புகளைப் பெறுவீர்கள். அன்னையுடன் ஆழமான உரையாடல்களில் ஈடுபடுவது மனதிற்கு இதமளிக்கும். கடந்தகால நினைவுகள் உங்கள் மனதில் வந்து போகலாம், ஆனால் அதிலிருந்து பாடங்களைக் கற்றுக்கொண்டு முன்னேறுவது சிறந்தது. உணர்ச்சிப்பூர்வமான விஷயங்களில் சற்று பொறுமையுடன் செயல்படுவது முக்கியம். உங்கள் மனதில் தோன்றும் எண்ணங்களை தெளிவாக வெளிப்படுத்துவது உறவுகளில் உள்ள தவறான புரிதல்களை நீக்கும். கலை மற்றும் அழகியல் சார்ந்த விஷயங்களில் ஆர்வம் அதிகரிக்கும். இசையைக் கேட்பது அல்லது ஓவியம் வரைவது போன்ற பொழுதுபோக்குகள் உங்கள் மனதிற்கு அமைதியைத் தரும். வீட்டுச் சூழலை அமைதியாகவும், இனிமையாகவும் வைத்துக்கொள்வது மனதிற்கு மகிழ்ச்சி அளிக்கும். நிதி விஷயங்களில் இன்று நீங்கள் கவனமுடன் செயல்படுவீர்கள். ஒரு நல்ல நிதித் திட்டத்தை உருவாக்குவதற்கு இது உகந்த நாள். குடும்பத்தினருடன் இணைந்து மேற்கொள்ளும் திட்டங்கள் வெற்றி பெறும். நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பதற்கு இது ஒரு நல்ல நேரம். குழந்தைகளுடன் நேரம் செலவிடுவது உங்களுக்கு சந்தோஷத்தை அளிக்கும். உங்களின் பொறுமையான அணுகுமுறை இன்று பல விஷயங்களில் வெற்றிக்கு வழிவகுக்கும். உடல் ஆரோக்கியத்தில் சிறப்புக் கவனம் செலுத்துவது அவசியம். புதிய நண்பர்களைச் சந்திப்பதற்கான வாய்ப்புகள் உண்டு. சமூக நிகழ்வுகளில் பங்கேற்பது உங்களுக்கு புதிய அனுபவங்களை வழங்கும். உங்கள் தனிப்பட்ட திறமைகளை வெளிப்படுத்துவதற்கு இன்று ஒரு நல்ல நாள். மனதின் அமைதி உடல் ஆரோக்கியத்திற்கு இன்றியமையாதது என்பதால், தேவையற்ற மன அழுத்தத்தைத் தவிர்த்து, நேர்மறையாக சிந்தியுங்கள். இன்று நீங்கள் சந்திக்கும் சவால்கள் கூட, உங்களை மேலும் வலுப்படுத்தும். சிறிய பிரச்சினைகளைக் கூட பொறுமையுடன் அணுகி தீர்வு காண்பது நல்லது. பிறருக்கு உதவும் எண்ணம் இன்று அதிகரிக்கும். உங்கள் செயல்பாடு மற்றவர்களுக்கு ஒரு முன்னுதாரணமாக அமையும். இன்றைய நாள் உங்களுக்கு ஆக்கபூர்வமான மற்றும் மனநிறைவான பல அனுபவங்களை வழங்கும். உங்கள் வாழ்க்கையின் அடுத்தகட்ட வளர்ச்சிக்கு இது ஒரு நல்ல தொடக்கமாக அமையும். உங்கள் நம்பிக்கையும், உழைப்பும் வெற்றியைத் தேடித்தரும் என்பதில் சந்தேகமில்லை. இயற்கையுடன் நேரத்தைச் செலவிடுவது மனதிற்குப் புத்துணர்ச்சி அளிக்கும். வீட்டின் தோட்டத்தில் நேரத்தைச் செலவிடுவதோ அல்லது ஒரு குறுகிய பயணத்தை மேற்கொள்வதோ மனதிற்கு அமைதியைத் தரும். உங்கள் சிந்தனைகளில் தெளிவு பிறக்கும். இன்று நீங்கள் மேற்கொள்ளும் சிறு பயணங்கள் கூட மனதிற்கு அமைதியைத் தரும். வீட்டுச் சூழலைச் சீர்செய்வது மன மகிழ்ச்சியை அதிகரிக்கும். உங்கள் தினசரி பணிகளில் ஏற்படும் சிறு மாற்றங்கள் கூட பெரிய நல்ல விளைவுகளை ஏற்படுத்தலாம்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Scorpio natives will experience deep thoughts and emotional experiences in mental matters. Prioritizing your inner feelings today will be beneficial. You will show greater interest in beautifying your home or spending time with family members. Today, you will have opportunities to improve your relationships with loved ones. Engaging in deep conversations with your mother will bring comfort to your mind. Past memories may come and go, but it is best to learn from them and move forward. It is important to act with patience in emotional matters. Clearly expressing your thoughts will remove misunderstandings in relationships. Your interest in arts and aesthetics will increase. Hobbies like listening to music or painting will bring peace to your mind. Keeping your home environment calm and pleasant will bring joy to your mind. You will act carefully in financial matters today. This is a suitable day to create a good financial plan. Projects undertaken with family members will be successful. This is a good time to think about long-term investments. Spending time with children will bring you happiness. Your patient approach will lead to success in many matters today. It is essential to pay special attention to physical health. There are opportunities to meet new friends. Participating in social events will provide you with new experiences. Today is a good day to showcase your unique talents. Since mental peace is crucial for physical health, avoid unnecessary stress and think positively. Even the challenges you face today will make you stronger. It is good to approach even small problems with patience and find solutions. The desire to help others will increase today. Your actions will serve as an example to others. Today will offer you many constructive and fulfilling experiences. This will be a good beginning for the next phase of your life's growth. There is no doubt that your confidence and hard work will bring success. Spending time with nature will rejuvenate your mind. Spending time in your home garden or taking a short trip will bring peace to your mind. Clarity will emerge in your thoughts. Even short trips undertaken today will bring peace to your mind. Improving the home environment will increase mental happiness. Even small changes in your daily routines can lead to significant positive outcomes.",
    "career_ta": "உங்கள் பணியிடத்தில் அமைதியான சூழ்நிலை நிலவும். சகாக்களுடன் நல்லுறவு பேணுவது, குழுப்பணிகளை வெற்றிகரமாக முடிக்க உதவும். புதிய திட்டங்களில் ஈடுபட இன்று சிறந்த நாளாகும். உங்கள் கருத்துக்கள் ஏற்கப்படும். நேர்மறையான அணுகுமுறை வெற்றிக்கு வழிவகுக்கும்.",
    "career_en": "A calm atmosphere will prevail in your workplace. Maintaining good relationships with colleagues will help you successfully complete teamwork. Today is an excellent day to engage in new projects. Your ideas will be accepted. A positive approach will lead to success.",
    "finance_ta": "நிதிநிலை சீராக இருக்கும். எதிர்பாராத சிறு ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது. வீட்டின் தேவைகளுக்காகச் செலவு செய்வது மனதிற்கு திருப்தியை அளிக்கும். நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பதற்கான நல்ல நாள் இது. சேமிப்பு அதிகரிக்கும்.",
    "finance_en": "Financial stability will prevail. There is a possibility of unexpected small gains. Spending on household needs will bring mental satisfaction. This is a good day to think about long-term investments. Savings will increase.",
    "health_ta": "மன அமைதி உடல் ஆரோக்கியத்திற்கு வழிவகுக்கும். மனதை அமைதியாக வைத்துக்கொள்வது, உடல் சோர்வை நீக்கி புத்துணர்ச்சி அளிக்கும். போதுமான ஓய்வு எடுப்பது முக்கியம். தியானம், யோகா போன்ற பயிற்சிகள் நன்மை பயக்கும்.",
    "health_en": "Mental peace leads to physical health. Keeping the mind calm will remove physical fatigue and provide rejuvenation. Adequate rest is important. Practices like meditation and yoga will be beneficial.",
    "lucky_number": "9",
    "lucky_color_ta": "ஆழமான சிவப்பு",
    "lucky_color_en": "Deep Red"
  },
  {
    "sign_ta": "தனுசு",
    "sign_en": "Sagittarius",
    "date": "23-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் தனுசு ராசி அன்பர்கள் தங்கள் மனதில் ஒருவித அமைதியையும், உணர்வுப்பூர்வமான நிறைவையும் அனுபவிப்பார்கள். பொதுவாக சுதந்திர மனப்பான்மையுடன் இருக்கும் நீங்கள், இன்று குடும்ப உறவுகளுக்கும், இல்லற வாழ்க்கைக்கும் அதிக முக்கியத்துவம் கொடுப்பீர்கள். அன்னையுடன் ஆழமான உரையாடல்களில் ஈடுபட இது ஒரு சிறந்த நாள். அவர்களின் அறிவுரைகள் உங்களுக்கு நல்வழிகாட்டும். வீட்டின் சூழலை மேம்படுத்துவதிலும், குடும்ப உறுப்பினர்களுடன் நல்லிணக்கத்தைப் பேணுவதிலும் உங்கள் கவனம் செல்லும். உங்கள் உள்ளுணர்வு இன்று சிறப்பாகச் செயல்படும் என்பதால், முக்கிய முடிவுகளை எடுக்கும் முன் உங்கள் மனதின் குரலுக்குச் செவிசாய்ப்பது நல்லது. நிதி விஷயங்களில் இன்று சற்று கவனமாகச் செயல்படுவது அவசியம். திட்டமிடப்படாத செலவுகளைத் தவிர்த்து, எதிர்காலத்திற்கான சேமிப்பை அதிகரிப்பதில் கவனம் செலுத்துங்கள். நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பதற்கு இது ஒரு நல்ல நேரம். கடன் தொடர்பான விஷயங்களை நேர்மறையான அணுகுமுறையுடன் கையாள வேண்டும். கடந்தகால அனுபவங்களில் இருந்து பாடங்களைக் கற்றுக்கொண்டு, எதிர்காலத்தை நோக்கி நம்பிக்கையுடன் நகர்வீர்கள். கலை மற்றும் படைப்பாற்றல் சார்ந்த விஷயங்களில் ஈடுபடுவது உங்கள் மனதிற்குப் புத்துணர்ச்சி அளிக்கும். உங்கள் தனிப்பட்ட திறமைகளை வெளிப்படுத்துவதற்கு இது ஒரு நல்ல நாள். சமூக நிகழ்வுகளில் பங்கேற்பது உங்களுக்கு புதிய அனுபவங்களை வழங்கும். புதிய நண்பர்களைச் சந்திப்பதற்கான வாய்ப்புகள் உண்டு. உங்கள் கருணை மற்றும் இரக்க குணம் இன்று பலரை ஈர்க்கும். உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது முக்கியம். போதுமான ஓய்வும், சத்தான உணவும் உங்கள் மனதையும், உடலையும் சீராக வைத்திருக்கும். மனம் சார்ந்த விஷயங்களில் ஏற்படும் குழப்பங்களைத் தெளிவுபடுத்திக்கொள்ள முயற்சி செய்யுங்கள். யோகா, தியானம் போன்ற பயிற்சிகள் மனதிற்கு அமைதியை அளிக்கும். குழந்தைகள் தங்கள் படிப்பில் அதிக ஈடுபாட்டுடன் செயல்படுவார்கள். மூத்தவர்களின் ஆசீர்வாதங்களைப் பெறுவது உங்களுக்கு நல்வழியைக் காட்டும். இன்றைய நாள் உங்களுக்கு ஒரு அமைதியான அனுபவத்தையும், ஆழமான உணர்வுப்பூர்வமான நிறைவையும் வழங்கும். உங்கள் உணர்வுகளை வெளிப்படுத்துவதிலும், பிறரின் உணர்வுகளைப் புரிந்துகொள்வதிலும் நீங்கள் சிறந்து விளங்குவீர்கள். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். ஆகையால், ஒவ்வொரு செயலிலும் நேர்மறையான எண்ணத்துடன் ஈடுபடுங்கள். இன்று நீங்கள் மேற்கொள்ளும் தியானம், யோகா போன்ற செயல்பாடுகள் மனதிற்கு மிகுந்த அமைதியையும், ஆற்றலையும் வழங்கும். இன்று நீங்கள் குடும்பத்திற்காகச் செய்யும் காரியங்கள் அனைத்தும் வெற்றியடையும். உங்கள் அன்பான வார்த்தைகளும், செயல்களும் பிறருக்கு மகிழ்ச்சியை வழங்கும். எந்தவொரு சிறிய சவால்களையும் பொறுமையுடன் அணுகி, வெற்றி பெறுவீர்கள். இன்றைய நாள் உங்களுக்கு ஒரு நல்ல அனுபவத்தையும், புதிய கண்ணோட்டத்தையும் அளிக்கும். வீட்டின் சூழலை மேம்படுத்தவும், உங்கள் அன்புக்குரியவர்களுடன் ஆழமான தொடர்புகளை ஏற்படுத்தவும் இது ஒரு சிறந்த நாள். உங்கள் உள் மனதின் குரலுக்கு செவிசாய்த்து செயல்படுவது பல காரியங்களில் வெற்றியைத் தேடித்தரும். தன்னம்பிக்கையுடன் செயல்படுங்கள், உங்கள் முயற்சிகள் பலிக்கும். எதிர்பாராத சில சந்திப்புகள் உங்கள் மனதிற்கு மகிழ்ச்சி அளிக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது புதிய நண்பர்களைப் பெற வழிவகுக்கும். உங்கள் சிந்தனைகளில் தெளிவு பிறக்கும். இன்று நீங்கள் மேற்கொள்ளும் சிறு பயணங்கள் கூட மனதிற்கு அமைதியைத் தரும். வீட்டுச் சூழலைச் சீர்செய்வது மன மகிழ்ச்சியை அதிகரிக்கும். உங்கள் தினசரி பணிகளில் ஏற்படும் சிறு மாற்றங்கள் கூட பெரிய நல்ல விளைவுகளை ஏற்படுத்தலாம்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Sagittarius natives will experience a sense of peace and emotional fulfillment in their minds. You, who are usually independent, will today give more importance to family relationships and domestic life. This is an excellent day to engage in deep conversations with your mother. Their advice will guide you well. Your focus will be on improving the home environment and maintaining harmony with family members. Your intuition will function well today, so it is good to listen to your inner voice before making important decisions. It is essential to act carefully in financial matters today. Avoid unplanned expenses and focus on increasing savings for the future. This is a good time to think about long-term investments. Debt-related matters should be handled with a positive approach. You will learn lessons from past experiences and move forward with confidence towards the future. Engaging in arts and creative activities will rejuvenate your mind. This is a good day to express your unique talents. Participating in social events will provide you with new experiences. There are opportunities to meet new friends. Your kindness and compassion will attract many today. Paying attention to physical health is important. Adequate rest and nutritious food will keep your mind and body balanced. Try to clarify any confusion in mental matters. Practices like yoga and meditation will bring peace to the mind. Children will engage more deeply in their studies. Receiving the blessings of elders will guide you well. Today will bring you a peaceful experience and deep emotional fulfillment. You will excel in expressing your feelings and understanding others' emotions. All your endeavors will be successful. Therefore, engage in every task with a positive mindset. The meditation and yoga you practice today will provide immense peace and energy to your mind. All the tasks you undertake for your family today will succeed. Your loving words and actions will bring joy to others. You will approach and overcome any small challenges with patience. Today will offer you a good experience and a new perspective. It is an excellent day to improve your home environment and build deeper connections with your loved ones. Listening to your inner voice will lead to success in many endeavors. Act with self-confidence; your efforts will bear fruit. Some unexpected encounters will bring joy to your heart. Participating in social events will lead to new friendships. Clarity will emerge in your thoughts. Even short trips undertaken today will bring peace to your mind. Improving the home environment will increase mental happiness. Even small changes in your daily routines can lead to significant positive outcomes.",
    "career_ta": "பணியிடத்தில் உங்கள் மனசாட்சிக்கு இணங்கச் செயல்படுவீர்கள். சகாக்களுடன் நல்லுறவு மேலோங்கும். புதிய திட்டங்களில் ஈடுபட இன்று சிறந்த நாளாகும். உங்கள் கருத்துக்கள் ஏற்கப்படும். நேர்மறையான அணுகுமுறை வெற்றிக்கு வழிவகுக்கும்.",
    "career_en": "You will act according to your conscience in the workplace. Good relationships with colleagues will prevail. Today is an excellent day to engage in new projects. Your ideas will be accepted. A positive approach will lead to success.",
    "finance_ta": "நிதிநிலை சீராக இருக்கும். குடும்பத்திற்கான தேவைகளைச் சிறப்பாகப் பூர்த்தி செய்வீர்கள். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவது நல்லது. நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பதற்கான நல்ல நாள் இது. எதிர்பாராத வருவாய் ஆதாயங்கள் கிடைக்கும்.",
    "finance_en": "Financial stability will prevail. You will effectively meet household needs. Focusing on savings plans is good. This is a good day to think about long-term investments. Unexpected income gains will occur.",
    "health_ta": "மன அமைதி உடல் ஆரோக்கியத்திற்கு வழிவகுக்கும். மனதை அமைதியாக வைத்துக்கொள்வது, உடல் சோர்வை நீக்கி புத்துணர்ச்சி அளிக்கும். போதுமான ஓய்வு எடுப்பது முக்கியம். தியானம், யோகா போன்ற பயிற்சிகள் நன்மை பயக்கும்.",
    "health_en": "Mental peace leads to physical health. Keeping the mind calm will remove physical fatigue and provide rejuvenation. Adequate rest is important. Practices like meditation and yoga will be beneficial.",
    "lucky_number": "3",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "மகரம்",
    "sign_en": "Capricorn",
    "date": "23-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் மகர ராசி அன்பர்களுக்கு சற்று அமைதியான மற்றும் உள்முகச் சிந்தனைகள் நிறைந்த நாளாக அமையும். பொதுவாக நடைமுறை சார்ந்த அணுகுமுறையுடன் செயல்படும் நீங்கள், இன்று உணர்ச்சிப்பூர்வமான விஷயங்களுக்கு அதிக முக்கியத்துவம் கொடுப்பீர்கள். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தாயுடன் ஆழமான உரையாடல்களில் ஈடுபட இது ஒரு நல்ல நாள். அவர்களின் அறிவுரைகள் உங்களுக்கு நல்வழிகாட்டும். வீட்டின் சூழலை மேம்படுத்துவதிலும், குடும்ப உறுப்பினர்களுடன் நல்லிணக்கத்தைப் பேணுவதிலும் உங்கள் கவனம் செல்லும். உங்கள் உள்ளுணர்வு இன்று சிறப்பாகச் செயல்படும் என்பதால், முக்கிய முடிவுகளை எடுக்கும் முன் உங்கள் மனதின் குரலுக்குச் செவிசாய்ப்பது நல்லது. நிதி விஷயங்களில் இன்று சற்று கவனமாகச் செயல்படுவது அவசியம். திட்டமிடப்படாத செலவுகளைத் தவிர்த்து, எதிர்காலத்திற்கான சேமிப்பை அதிகரிப்பதில் கவனம் செலுத்துங்கள். நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பதற்கு இது ஒரு நல்ல நேரம். கடன் தொடர்பான விஷயங்களை நேர்மறையான அணுகுமுறையுடன் கையாள வேண்டும். கடந்தகால அனுபவங்களில் இருந்து பாடங்களைக் கற்றுக்கொண்டு, எதிர்காலத்தை நோக்கி நம்பிக்கையுடன் நகர்வீர்கள். கலை மற்றும் படைப்பாற்றல் சார்ந்த விஷயங்களில் ஈடுபடுவது உங்கள் மனதிற்குப் புத்துணர்ச்சி அளிக்கும். உங்கள் தனிப்பட்ட திறமைகளை வெளிப்படுத்துவதற்கு இது ஒரு நல்ல நாள். சமூக நிகழ்வுகளில் பங்கேற்பது உங்களுக்கு புதிய அனுபவங்களை வழங்கும். புதிய நண்பர்களைச் சந்திப்பதற்கான வாய்ப்புகள் உண்டு. உங்கள் கருணை மற்றும் இரக்க குணம் இன்று பலரை ஈர்க்கும். உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது முக்கியம். போதுமான ஓய்வும், சத்தான உணவும் உங்கள் மனதையும், உடலையும் சீராக வைத்திருக்கும். மனம் சார்ந்த விஷயங்களில் ஏற்படும் குழப்பங்களைத் தெளிவுபடுத்திக்கொள்ள முயற்சி செய்யுங்கள். யோகா, தியானம் போன்ற பயிற்சிகள் மனதிற்கு அமைதியை அளிக்கும். குழந்தைகள் தங்கள் படிப்பில் அதிக ஈடுபாட்டுடன் செயல்படுவார்கள். மூத்தவர்களின் ஆசீர்வாதங்களைப் பெறுவது உங்களுக்கு நல்வழியைக் காட்டும். இன்றைய நாள் உங்களுக்கு ஒரு அமைதியான அனுபவத்தையும், ஆழமான உணர்வுப்பூர்வமான நிறைவையும் வழங்கும். உங்கள் உணர்வுகளை வெளிப்படுத்துவதிலும், பிறரின் உணர்வுகளைப் புரிந்துகொள்வதிலும் நீங்கள் சிறந்து விளங்குவீர்கள். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். ஆகையால், ஒவ்வொரு செயலிலும் நேர்மறையான எண்ணத்துடன் ஈடுபடுங்கள். இன்று நீங்கள் மேற்கொள்ளும் தியானம், யோகா போன்ற செயல்பாடுகள் மனதிற்கு மிகுந்த அமைதியையும், ஆற்றலையும் வழங்கும். இன்று நீங்கள் குடும்பத்திற்காகச் செய்யும் காரியங்கள் அனைத்தும் வெற்றியடையும். உங்கள் அன்பான வார்த்தைகளும், செயல்களும் பிறருக்கு மகிழ்ச்சியை வழங்கும். எந்தவொரு சிறிய சவால்களையும் பொறுமையுடன் அணுகி, வெற்றி பெறுவீர்கள். இன்றைய நாள் உங்களுக்கு ஒரு நல்ல அனுபவத்தையும், புதிய கண்ணோட்டத்தையும் அளிக்கும். வீட்டின் சூழலை மேம்படுத்தவும், உங்கள் அன்புக்குரியவர்களுடன் ஆழமான தொடர்புகளை ஏற்படுத்தவும் இது ஒரு சிறந்த நாள். உங்கள் உள் மனதின் குரலுக்கு செவிசாய்த்து செயல்படுவது பல காரியங்களில் வெற்றியைத் தேடித்தரும். தன்னம்பிக்கையுடன் செயல்படுங்கள், உங்கள் முயற்சிகள் பலிக்கும். எதிர்பாராத சில சந்திப்புகள் உங்கள் மனதிற்கு மகிழ்ச்சி அளிக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது புதிய நண்பர்களைப் பெற வழிவகுக்கும். உங்கள் சிந்தனைகளில் தெளிவு பிறக்கும். இன்று நீங்கள் மேற்கொள்ளும் சிறு பயணங்கள் கூட மனதிற்கு அமைதியைத் தரும். வீட்டுச் சூழலைச் சீர்செய்வது மன மகிழ்ச்சியை அதிகரிக்கும். உங்கள் தினசரி பணிகளில் ஏற்படும் சிறு மாற்றங்கள் கூட பெரிய நல்ல விளைவுகளை ஏற்படுத்தலாம்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Capricorn natives will experience a somewhat calm and introspective day. You, who usually operate with a practical approach, will today give more importance to emotional matters. This is a good day to engage in deep conversations with family members, especially your mother. Their advice will guide you well. Your focus will be on improving the home environment and maintaining harmony with family members. Your intuition will function well today, so it is good to listen to your inner voice before making important decisions. It is essential to act carefully in financial matters today. Avoid unplanned expenses and focus on increasing savings for the future. This is a good time to think about long-term investments. Debt-related matters should be handled with a positive approach. You will learn lessons from past experiences and move forward with confidence towards the future. Engaging in arts and creative activities will rejuvenate your mind. This is a good day to express your unique talents. Participating in social events will provide you with new experiences. There are opportunities to meet new friends. Your kindness and compassion will attract many today. Paying attention to physical health is important. Adequate rest and nutritious food will keep your mind and body balanced. Try to clarify any confusion in mental matters. Practices like yoga and meditation will bring peace to the mind. Children will engage more deeply in their studies. Receiving the blessings of elders will guide you well. Today will bring you a peaceful experience and deep emotional fulfillment. You will excel in expressing your feelings and understanding others' emotions. All your endeavors will be successful. Therefore, engage in every task with a positive mindset. The meditation and yoga you practice today will provide immense peace and energy to your mind. All the tasks you undertake for your family today will succeed. Your loving words and actions will bring joy to others. You will approach and overcome any small challenges with patience. Today will offer you a good experience and a new perspective. It is an excellent day to improve your home environment and build deeper connections with your loved ones. Listening to your inner voice will lead to success in many endeavors. Act with self-confidence; your efforts will bear fruit. Some unexpected encounters will bring joy to your heart. Participating in social events will lead to new friendships. Clarity will emerge in your thoughts. Even short trips undertaken today will bring peace to your mind. Improving the home environment will increase mental happiness. Even small changes in your daily routines can lead to significant positive outcomes.",
    "career_ta": "பணியிடத்தில் உங்கள் பொறுப்புணர்வு அதிகரிக்கும். சக ஊழியர்களுடன் நல்லுறவைப் பேணுவது உங்கள் செயல்திறனை மேம்படுத்தும். புதிய திட்டங்களில் ஈடுபட இன்று சிறந்த நாளாகும். உங்கள் தலைமைப் பண்பு மென்மையாக வெளிப்படும். பொறுப்புடன் செயல்படுவீர்கள்.",
    "career_en": "Your sense of responsibility will increase in the workplace. Maintaining good relationships with colleagues will enhance your performance. Today is an excellent day to engage in new projects. Your leadership qualities will be gently expressed. You will act responsibly.",
    "finance_ta": "நிதிநிலை சீராக இருக்கும். குடும்பத்திற்கான செலவுகளில் கவனமாகச் செயல்படுவீர்கள். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவது எதிர்காலத்திற்கு நல்லது. கடன் தொடர்பான விஷயங்களில் நல்ல முன்னேற்றம் ஏற்படும். புதிய வருவாய் ஆதாரங்கள் உருவாகும்.",
    "finance_en": "Financial stability will prevail. You will act carefully in household expenses. Focusing on savings plans is good for the future. Good progress will be made in debt-related matters. New sources of income will emerge.",
    "health_ta": "மனதிற்கு அமைதியை அளிக்கும் செயல்களில் ஈடுபடுவது அவசியம். போதுமான ஓய்வு எடுப்பது உடலுக்கும், மனதிற்கும் நல்லது. ஆரோக்கியமான உணவுப் பழக்கத்தைப் பின்பற்றுங்கள். இயற்கையுடன் நேரம் செலவிடுவது புத்துணர்ச்சி அளிக்கும்.",
    "health_en": "It is essential to engage in activities that bring peace to your mind. Adequate rest is good for both body and mind. Follow a healthy diet. Spending time with nature will rejuvenate you.",
    "lucky_number": "8",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "கும்பம்",
    "sign_en": "Aquarius",
    "date": "23-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் கும்ப ராசி அன்பர்கள் தங்கள் மனதின் ஆழமான உணர்வுகளுக்கு முக்கியத்துவம் கொடுக்கும் வாய்ப்பைப் பெறுவார்கள். உங்கள் எண்ணங்கள் தெளிவு பெறும். இல்லற வாழ்வில் நல்லிணக்கம் மேலோங்கும். வீட்டில் ஒரு அமைதியான சூழலை உருவாக்குவதில் உங்கள் கவனம் செல்லும். உங்கள் கருத்துக்களை தெளிவாகவும், மென்மையாகவும் வெளிப்படுத்துவது உறவுகளைப் பலப்படுத்தும். நண்பர்களுடன் ஏற்படும் சிறுசிறு தவறான புரிதல்கள் பொறுமையுடன் கையாண்டால் தீர்ந்துவிடும். புதிய தகவல்களைத் தேடுவதிலும், அறிவை வளர்த்துக்கொள்வதிலும் ஆர்வம் காட்டுவீர்கள். பயணத் திட்டங்கள் பற்றி ஆலோசிப்பதற்கோ அல்லது குறுகிய தூரப் பயணங்களை மேற்கொள்வதற்கோ இது ஒரு உகந்த நாள். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கான ஆர்வம் அதிகரிக்கும். புத்தகங்களைப் படிப்பதன் மூலமோ அல்லது ஆவணப்படங்களைப் பார்ப்பதன் மூலமோ உங்கள் அறிவை வளர்த்துக்கொள்வீர்கள். சமூக ஊடகங்களில் ஆக்கபூர்வமான கருத்துக்களைப் பகிர்வதற்கு இது ஒரு சிறந்த நேரம். கலை மற்றும் பொழுதுபோக்கு சார்ந்த விஷயங்களில் ஈடுபடுவது மனதிற்கு புத்துணர்ச்சி அளிக்கும். உங்கள் சகோதர சகோதரிகளுடன் நல்லுறவைப் பேணுவது முக்கியம். அவர்களுக்குத் தேவையான உதவிகளைச் செய்யத் தயங்க வேண்டாம். உங்கள் உள்ளுணர்வு இன்று சிறப்பாகச் செயல்படும் என்பதால், முக்கிய முடிவுகளை எடுக்கும் முன் உங்கள் மனதின் குரலுக்குச் செவிசாயுங்கள். நிதி விஷயங்களில் கவனமுடன் செயல்படுவது நல்லது. திட்டமிடப்படாத செலவுகளைத் தவிர்த்து, சேமிப்பை அதிகரிப்பதற்கான வழிகளைக் கண்டறியுங்கள். கடின உழைப்பும், நேர்மையான அணுகுமுறையும் இன்று உங்களுக்கு நற்பலன்களைத் தேடித்தரும். உங்கள் உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம். போதுமான ஓய்வும், சத்தான உணவும் உங்கள் மனதையும், உடலையும் சீராக வைத்திருக்கும். இன்று நீங்கள் மேற்கொள்ளும் தியானம் மற்றும் மூச்சுப் பயிற்சிகள் மனதிற்கு மிகுந்த அமைதியை வழங்கும். குழந்தைகள் தங்கள் படிப்பில் அதிக ஈடுபாட்டுடன் செயல்படுவார்கள். மூத்தவர்களின் ஆலோசனைகளைக் கேட்டு நடப்பது, உங்கள் வாழ்க்கைக்கு நல்ல வழிகாட்டுதலை வழங்கும். இன்றைய நாள் உங்களுக்கு ஒரு நேர்மறையான அனுபவத்தையும், உறவுகளில் உள்ள ஆழமான புரிதலையும் வழங்கும். உங்கள் சமூக வட்டாரத்தில் புதிய தொடர்புகளை ஏற்படுத்த இன்று ஒரு நல்ல வாய்ப்பு கிடைக்கும். உங்கள் திறமைகளை மேம்படுத்துவதற்கு இது ஒரு நல்ல நாள். மனதின் அமைதியை நிலைநிறுத்த முயற்சி செய்யுங்கள், அது உங்களுக்கு பல வழிகளில் நன்மை பயக்கும். இன்றைய நாள் உங்களுக்கு ஆக்கபூர்வமான சிந்தனைகளையும், சுறுசுறுப்பான செயல்பாடுகளையும் வழங்கும். நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலிலும் நேர்மறையான எண்ணத்துடன் ஈடுபடுவது வெற்றிக்கு வழிவகுக்கும். அன்னையின் ஆரோக்கியத்தில் தனி கவனம் செலுத்துவது நல்லது. அவரிடம் அன்புடனும், பொறுமையுடனும் பேசுவது மன அமைதியைத் தரும். குடும்ப உறுப்பினர்களுடன் இணைந்து மேற்கொள்ளும் செயல்பாடுகள் வெற்றி பெறும். நண்பர்கள் மற்றும் உறவினர்களுடன் இனிமையான உரையாடல்கள் நிகழும். உங்கள் உணர்வுகளை சரியாகப் புரிந்துகொண்டு வெளிப்படுத்தும் ஆற்றல் இன்று கூடும். எந்தவொரு முக்கிய முடிவுகளையும் அவசரப்பட்டு எடுக்காமல், பொறுமையுடன் யோசித்து எடுப்பது சிறந்தது. மனதிற்குப் பிடித்த பொழுதுபோக்கு அம்சங்களில் ஈடுபடுவது புத்துணர்ச்சியை அளிக்கும். கலை மற்றும் இலக்கியத் துறையில் உள்ளவர்களுக்கு புதிய உத்வேகம் உண்டாகும். படைப்பாற்றல் பெருகி, புதிய சிந்தனைகள் உருவாகும். மனதின் அமைதி உடல் ஆரோக்கியத்திற்கும் வழிவகுக்கும் என்பதால், வீண் கவலைகளைத் தவிர்த்து, சந்தோஷமாக இருப்பதற்கான வழிமுறைகளைக் கண்டறியுங்கள். ஆன்மீகச் சிந்தனைகளில் ஈடுபடுவது மனதிற்குப் புத்துணர்ச்சியையும், அமைதியையும் வழங்கும். இன்று நீங்கள் செய்யும் தானதர்மங்கள், நல்ல பலன்களைத் தரும்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Aquarius natives will have the opportunity to prioritize their deep emotional feelings. Your thoughts will gain clarity. Harmony will prevail in domestic life. Your focus will be on creating a peaceful atmosphere at home. Expressing your opinions clearly and gently will strengthen relationships. Minor misunderstandings with friends can be resolved with patience. You will show interest in seeking new information and enhancing your knowledge. This is a suitable day for discussing travel plans or undertaking short trips. The desire to learn new things will increase. You will expand your knowledge by reading books or watching documentaries. This is an excellent time to share constructive thoughts on social media. Engaging in arts and entertainment will rejuvenate your mind. It is important to maintain good relationships with your siblings. Do not hesitate to offer them necessary assistance. Your intuition will function well today, so listen to your inner voice before making important decisions. It is good to act carefully in financial matters. Avoid unplanned expenses and find ways to increase savings. Hard work and an honest approach will bring you good results today. It is essential to pay attention to your physical health. Adequate rest and nutritious food will keep your mind and body balanced. The meditation and breathing exercises you perform today will provide immense peace to your mind. Children will engage more deeply in their studies. Following the advice of elders will provide good guidance for your life. Today will bring you a positive experience and a deeper understanding in relationships. Today is a good opportunity to establish new connections in your social circle. This is a good day to enhance your skills. Try to maintain mental peace, as it will benefit you in many ways. Today will provide you with constructive thoughts and active engagement. Approaching every task with a positive mindset will lead to success. It is advisable to pay special attention to your mother's health. Speaking to her with love and patience will bring mental peace. Activities undertaken with family members will be successful. Pleasant conversations will take place with friends and relatives. Your ability to understand and express your emotions will improve today. It is best to think carefully and patiently before making any important decisions, rather than rushing into them. Engaging in enjoyable hobbies will provide rejuvenation. Those in the arts and literature will find new inspiration. Creativity will flourish, and new ideas will emerge. Since mental peace also contributes to physical health, avoid unnecessary worries and find ways to be happy. Engaging in spiritual thoughts will bring refreshment and peace to the mind. Acts of charity you perform today will yield good results.",
    "career_ta": "உங்கள் பணியிடத்தில் புதிய யோசனைகள் உருவாகும். சகாக்களுடன் இணக்கமான உறவு மேலோங்கும். புதிய திட்டங்களில் ஈடுபட இன்று சிறந்த நாளாகும். உங்கள் கருத்துக்கள் ஏற்கப்படும். நேர்மறையான அணுகுமுறை வெற்றிக்கு வழிவகுக்கும்.",
    "career_en": "New ideas will emerge in your workplace. Harmonious relationships with colleagues will prevail. Today is an excellent day to engage in new projects. Your ideas will be accepted. A positive approach will lead to success.",
    "finance_ta": "நிதிநிலை சீராக இருக்கும். குடும்பத்திற்கான தேவைகளைப் பூர்த்தி செய்வீர்கள். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவது எதிர்காலத்திற்கு நல்லது. எதிர்பாராத வருவாய் ஆதாயங்கள் கிடைக்கும். சரியான திட்டமிடல் பலன் தரும்.",
    "finance_en": "Financial stability will prevail. You will meet household needs. Focusing on savings plans is good for the future. Unexpected income gains will occur. Proper planning will yield results.",
    "health_ta": "மன அமைதி உடல் ஆரோக்கியத்திற்கு வழிவகுக்கும். மனதை அமைதியாக வைத்துக்கொள்வது, உடல் சோர்வை நீக்கி புத்துணர்ச்சி அளிக்கும். போதுமான ஓய்வு எடுப்பது முக்கியம். தியானம், யோகா போன்ற பயிற்சிகள் நன்மை பயக்கும்.",
    "health_en": "Mental peace leads to physical health. Keeping the mind calm will remove physical fatigue and provide rejuvenation. Adequate rest is important. Practices like meditation and yoga will be beneficial.",
    "lucky_number": "4",
    "lucky_color_ta": "ஊதா",
    "lucky_color_en": "Purple"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "23-02-2026",
    "prediction_ta": "இன்று திங்கட்கிழமை, சந்திரனின் ஆதிக்கத்தில் மீன ராசி அன்பர்கள் தங்கள் ஆழ்மன உணர்வுகளுக்கு முக்கியத்துவம் கொடுக்கும் வாய்ப்பைப் பெறுவார்கள். உங்கள் மனம் அமைதியாகவும், உணர்வுப்பூர்வமாகவும் இருக்கும். குடும்ப உறுப்பினர்களுடன், குறிப்பாக தாயுடன் இனிமையான உரையாடல்களில் ஈடுபட இது ஒரு சிறந்த நாள். இல்லற வாழ்வில் மகிழ்ச்சியும், சுபிட்சமும் நிறைந்திருக்கும். வீட்டில் ஒரு அமைதியான சூழலை உருவாக்குவதில் உங்கள் கவனம் செல்லும். உங்கள் கருத்துக்களை தெளிவாகவும், மென்மையாகவும் வெளிப்படுத்துவது உறவுகளைப் பலப்படுத்தும். நண்பர்களுடன் ஏற்படும் சிறுசிறு தவறான புரிதல்கள் பொறுமையுடன் கையாண்டால் தீர்ந்துவிடும். புதிய தகவல்களைத் தேடுவதிலும், அறிவை வளர்த்துக்கொள்வதிலும் ஆர்வம் காட்டுவீர்கள். சமூக நிகழ்வுகளில் பங்கேற்பது உங்களுக்கு புதிய அனுபவங்களை வழங்கும். புதிய நண்பர்களைச் சந்திப்பதற்கான வாய்ப்புகள் உண்டு. உங்கள் கருணை மற்றும் இரக்க குணம் இன்று பலரை ஈர்க்கும். நிதி விஷயங்களில் இன்று நீங்கள் மிகுந்த கவனமுடன் செயல்படுவீர்கள். சேமிப்பை அதிகரிப்பதற்கும், எதிர்காலத்திற்கான நிதித் திட்டங்களை வகுப்பதற்கும் இது ஒரு நல்ல நாள். எதிர்பாராத ஆதாயங்கள் கிடைப்பதற்கான வாய்ப்புகள் உண்டு. ஆனால், எந்தவொரு பெரிய முதலீடுகளையும் செய்வதற்கு முன் நன்கு ஆலோசிப்பது அவசியம். உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது முக்கியம். போதுமான ஓய்வும், சத்தான உணவும் உங்கள் மனதையும், உடலையும் சீராக வைத்திருக்கும். மனம் சார்ந்த விஷயங்களில் ஏற்படும் குழப்பங்களைத் தெளிவுபடுத்திக்கொள்ள முயற்சி செய்யுங்கள். யோகா, தியானம் போன்ற பயிற்சிகள் மனதிற்கு அமைதியை அளிக்கும். குழந்தைகள் தங்கள் படிப்பில் அதிக ஈடுபாட்டுடன் செயல்படுவார்கள். மூத்தவர்களின் ஆசீர்வாதங்களைப் பெறுவது உங்களுக்கு நல்வழியைக் காட்டும். இன்றைய நாள் உங்களுக்கு ஒரு அமைதியான அனுபவத்தையும், ஆழமான உணர்வுப்பூர்வமான நிறைவையும் வழங்கும். உங்கள் உணர்வுகளை வெளிப்படுத்துவதிலும், பிறரின் உணர்வுகளைப் புரிந்துகொள்வதிலும் நீங்கள் சிறந்து விளங்குவீர்கள். உங்கள் முயற்சிகள் அனைத்தும் வெற்றி பெறும். ஆகையால், ஒவ்வொரு செயலிலும் நேர்மறையான எண்ணத்துடன் ஈடுபடுங்கள். இன்று நீங்கள் மேற்கொள்ளும் தியானம், யோகா போன்ற செயல்பாடுகள் மனதிற்கு மிகுந்த அமைதியையும், ஆற்றலையும் வழங்கும். இன்று நீங்கள் குடும்பத்திற்காகச் செய்யும் காரியங்கள் அனைத்தும் வெற்றியடையும். உங்கள் அன்பான வார்த்தைகளும், செயல்களும் பிறருக்கு மகிழ்ச்சியை வழங்கும். எந்தவொரு சிறிய சவால்களையும் பொறுமையுடன் அணுகி, வெற்றி பெறுவீர்கள். இன்றைய நாள் உங்களுக்கு ஒரு நல்ல அனுபவத்தையும், புதிய கண்ணோட்டத்தையும் அளிக்கும். வீட்டின் சூழலை மேம்படுத்தவும், உங்கள் அன்புக்குரியவர்களுடன் ஆழமான தொடர்புகளை ஏற்படுத்தவும் இது ஒரு சிறந்த நாள். உங்கள் உள் மனதின் குரலுக்கு செவிசாய்த்து செயல்படுவது பல காரியங்களில் வெற்றியைத் தேடித்தரும். தன்னம்பிக்கையுடன் செயல்படுங்கள், உங்கள் முயற்சிகள் பலிக்கும். எதிர்பாராத சில சந்திப்புகள் உங்கள் மனதிற்கு மகிழ்ச்சி அளிக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது புதிய நண்பர்களைப் பெற வழிவகுக்கும். உங்கள் சிந்தனைகளில் தெளிவு பிறக்கும். இன்று நீங்கள் மேற்கொள்ளும் சிறு பயணங்கள் கூட மனதிற்கு அமைதியைத் தரும். வீட்டுச் சூழலைச் சீர்செய்வது மன மகிழ்ச்சியை அதிகரிக்கும். உங்கள் தினசரி பணிகளில் ஏற்படும் சிறு மாற்றங்கள் கூட பெரிய நல்ல விளைவுகளை ஏற்படுத்தலாம்.",
    "prediction_en": "Today, Monday, under the influence of the Moon, Pisces natives will have the opportunity to prioritize their deep emotional feelings. Your mind will be calm and emotional. This is an excellent day to engage in pleasant conversations with family members, especially your mother. Joy and prosperity will fill domestic life. Your focus will be on creating a peaceful atmosphere at home. Expressing your opinions clearly and gently will strengthen relationships. Minor misunderstandings with friends can be resolved with patience. You will show interest in seeking new information and enhancing your knowledge. Participating in social events will provide you with new experiences. There are opportunities to meet new friends. Your kindness and compassion will attract many today. You will act with great care in financial matters today. This is a good day to increase savings and formulate financial plans for the future. There are chances of unexpected gains. However, it is essential to consult thoroughly before making any major investments. Paying attention to physical health is important. Adequate rest and nutritious food will keep your mind and body balanced. Try to clarify any confusion in mental matters. Practices like yoga and meditation will bring peace to the mind. Children will engage more deeply in their studies. Receiving the blessings of elders will guide you well. Today will bring you a peaceful experience and deep emotional fulfillment. You will excel in expressing your feelings and understanding others' emotions. All your endeavors will be successful. Therefore, engage in every task with a positive mindset. The meditation and yoga you practice today will provide immense peace and energy to your mind. All the tasks you undertake for your family today will succeed. Your loving words and actions will bring joy to others. You will approach and overcome any small challenges with patience. Today will offer you a good experience and a new perspective. It is an excellent day to improve your home environment and build deeper connections with your loved ones. Listening to your inner voice will lead to success in many endeavors. Act with self-confidence; your efforts will bear fruit. Some unexpected encounters will bring joy to your heart. Participating in social events will lead to new friendships. Clarity will emerge in your thoughts. Even short trips undertaken today will bring peace to your mind. Improving the home environment will increase mental happiness. Even small changes in your daily routines can lead to significant positive outcomes.",
    "career_ta": "உங்கள் பணியிடத்தில் படைப்பாற்றல் பெருகும். சகாக்களுடன் இணக்கமான உறவு மேலோங்கும். புதிய திட்டங்களில் ஈடுபட இன்று சிறந்த நாளாகும். உங்கள் கருத்துக்கள் ஏற்கப்படும். நேர்மறையான அணுகுமுறை வெற்றிக்கு வழிவகுக்கும்.",
    "career_en": "Creativity will flourish in your workplace. Harmonious relationships with colleagues will prevail. Today is an excellent day to engage in new projects. Your ideas will be accepted. A positive approach will lead to success.",
    "finance_ta": "நிதிநிலை சீராக இருக்கும். குடும்பத்திற்கான தேவைகளைப் பூர்த்தி செய்வீர்கள். சேமிப்பு திட்டங்களில் கவனம் செலுத்துவது எதிர்காலத்திற்கு நல்லது. எதிர்பாராத வருவாய் ஆதாயங்கள் கிடைக்கும். சரியான திட்டமிடல் பலன் தரும்.",
    "finance_en": "Financial stability will prevail. You will meet household needs. Focusing on savings plans is good for the future. Unexpected income gains will occur. Proper planning will yield results.",
    "health_ta": "மன அமைதி உடல் ஆரோக்கியத்திற்கு வழிவகுக்கும். மனதை அமைதியாக வைத்துக்கொள்வது, உடல் சோர்வை நீக்கி புத்துணர்ச்சி அளிக்கும். போதுமான ஓய்வு எடுப்பது முக்கியம். தியானம், யோகா போன்ற பயிற்சிகள் நன்மை பயக்கும்.",
    "health_en": "Mental peace leads to physical health. Keeping the mind calm will remove physical fatigue and provide rejuvenation. Adequate rest is important. Practices like meditation and yoga will be beneficial.",
    "lucky_number": "3",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  }
]
