[
  {
    "sign_ta": "மேஷம்",
    "sign_en": "Aries",
    "date": "15-02-2026",
    "prediction_ta": "மேஷ ராசி அன்பர்களே, இன்று ஞாயிற்றுக்கிழமை சூரிய பகவானின் ஆதிக்கம் நிறைந்த ஒரு சிறப்பு நாளாகும். உங்கள் ராசியின் இயற்கை குணமான தலைமைத்துவமும், துணிச்சலும் இன்று மேலோங்கி நிற்கும். உங்கள் மன உறுதியும், செயலில் உள்ள வேகமும் பலரையும் கவரும் விதத்தில் அமையும். சூரியனின் சக்தி உங்கள் ஆரோக்கியத்திலும், உடலிலும் ஒரு புத்துணர்ச்சியையும், புதிய ஆற்றலையும் அள்ளித்தரும். இன்று நீங்கள் எடுக்கும் முடிவுகளில் தெளிவும், உறுதியும் இருக்கும். குடும்பத்தில் ஒரு இனிமையான சூழல் நிலவும். தந்தையுடனான உறவில் மேலும் ஒரு நெருக்கம் ஏற்படும் வாய்ப்பு உள்ளது. அவரது வழிகாட்டுதல்கள் உங்களுக்குப் பெரும் பலனளிக்கும். சமூகத்தில் உங்களது மதிப்பு உயரும். உங்களுக்கான அங்கீகாரம் கிடைக்கும். பிறருக்கு வழிகாட்டும் பொறுப்பை நீங்கள் ஏற்க நேரிடலாம், அதனைத் திறம்பட செய்து முடிப்பீர்கள். உங்கள் தன்னம்பிக்கை அதிகரிக்கும் நாள் இது. ஒரு புதிய செயலைத் தொடங்கவோ அல்லது நீண்டகாலமாகத் தள்ளிப்போட்ட ஒரு வேலையை மீண்டும் தொடங்கவோ உகந்த நாளாகும். ஆன்மீக நாட்டம் அதிகரிக்கும். ஆலய தரிசனங்கள் மன அமைதியைத் தரும். உங்கள் மனதில் உள்ள ஆசைகள் நிறைவேற வழி பிறக்கும். கலை மற்றும் இலக்கியத் துறைகளில் ஆர்வம் கொண்டவர்கள், தங்கள் திறமைகளை வெளிப்படுத்த ஒரு நல்ல வாய்ப்பைப் பெறுவார்கள். மாணவர்கள் கல்வியில் சிறந்து விளங்க கடினமாக உழைக்க வேண்டியது அவசியம், ஆனால் அதற்கான பலன் நிச்சயம் கிடைக்கும். புதிய தகவல்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். மூத்தவர்களின் ஆசீர்வாதத்தைப் பெறுவது உங்கள் முன்னேற்றத்திற்கு வழிவகுக்கும். கடந்த கால அனுபவங்களை மனதில் கொண்டு எதிர்கால திட்டங்களை வகுப்பீர்கள். சுற்றியுள்ளவர்களுடன் நல்லுறவைப் பேணுவீர்கள். எந்த ஒரு சூழ்நிலையையும் நேர்மறையாக அணுகுவதன் மூலம் நீங்கள் வெற்றியடைவீர்கள். உங்கள் இலக்குகளை நோக்கிச் செயல்படுவதற்கு இது ஒரு சிறந்த நாள். உங்களின் நேர்மையான அணுகுமுறை பாராட்டுதலைப் பெறும். சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். உங்கள் ஆற்றலை சரியான திசையில் பயன்படுத்துவதன் மூலம் பெரிய வெற்றிகளை அடைய முடியும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு தடங்கலையும் தாண்டி சாதனைகள் புரியலாம். உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம், சரியான நேரத்தில் உணவு உட்கொண்டு போதிய ஓய்வு எடுப்பதன் மூலம் உங்கள் ஆற்றல் அதிகரிக்கும். இன்று நீங்கள் செய்யும் ஒவ்வொரு செயலும் நேர்மறையான விளைவுகளைத் தரும். ஒரு நீண்ட கால முதலீட்டைப் பற்றி சிந்திப்பதற்கான நல்ல நாள் இது. சமூக நலப் பணிகளில் ஈடுபடுவது மனநிறைவைத் தரும். பிறருக்கு உதவுவதில் மகிழ்ச்சி காண்பீர்கள். உங்கள் தலைமைப் பண்புகள் இன்று வெளிப்படும், அதனைச் சரியாகப் பயன்படுத்துவீர்கள். எந்த ஒரு வேலையையும் தள்ளிப் போடாமல் உடனடியாகச் செய்வதற்கான உத்வேகம் கிடைக்கும். உங்கள் ஆளுமைத் திறன் மெருகேறும். தைரியத்துடனும், தன்னம்பிக்கையுடனும் செயல்படுவதன் மூலம் இன்று உங்களுக்கு சிறப்பான வெற்றிகள் காத்திருக்கின்றன. புதிய உறவுகள் உருவாகலாம் அல்லது பழைய உறவுகள் புதுப்பிக்கப்படலாம். பொதுவாக, இன்றைய நாள் உங்களுக்கு மிகுந்த சாதகமான பலன்களைத் தரக்கூடிய ஒரு பொன்னான நாளாக அமையும். உங்கள் முயற்சிகளுக்கு வெற்றி நிச்சயம்.",
    "prediction_en": "Aries natives, today is a special Sunday, filled with the dominance of Lord Sun. Your inherent qualities of leadership and courage will be prominent today. Your mental determination and speed in action will be captivating to many. The Sun's energy will bring revitalization and new energy to your health and body. You will have clarity and firmness in the decisions you make today. A pleasant atmosphere will prevail in the family. There is a possibility of further closeness in your relationship with your father. His guidance will be of great benefit to you. Your reputation in society will increase, and you will receive recognition. You may have to take on the responsibility of guiding others, and you will execute it skillfully. This is a day when your self-confidence will increase. It is an auspicious day to start a new endeavor or to resume a long-postponed task. Spiritual inclination will increase. Temple visits will bring peace of mind. Ways will open for your heartfelt desires to be fulfilled. Those interested in arts and literature will get a good opportunity to showcase their talents. Students need to work hard to excel in their studies, but the results will certainly follow. You will show interest in learning new information. Receiving blessings from elders will pave the way for your progress. You will plan for the future by keeping past experiences in mind. You will maintain good relationships with those around you. By approaching every situation positively, you will achieve success. This is an excellent day to work towards your goals. Your honest approach will receive appreciation. You will be ready to face challenges. By directing your energy in the right direction, you can achieve great successes. If you act with self-confidence, you can overcome any obstacle and achieve accomplishments. It is essential to pay attention to your physical health; by eating on time and getting adequate rest, your energy will increase. Every action you take today will yield positive results. This is a good day to think about a long-term investment. Engaging in social welfare activities will bring mental satisfaction. You will find joy in helping others. Your leadership qualities will manifest today, and you will use them appropriately. You will gain the motivation to complete tasks immediately without procrastination. Your personality will be refined. By acting with courage and self-confidence, special successes await you today. New relationships may form, or old relationships may be rekindled. Generally, today will be a golden day bringing you very favorable outcomes. Success is certain for your endeavors.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் தலைமைப் பண்பு வெளிப்படும். புதிய திட்டங்களை முன்னின்று நடத்துவதற்கான வாய்ப்புகள் கிடைக்கும். உங்கள் கருத்துக்கள் ஏற்கப்பட்டு பாராட்டுதலைப் பெறும். சக ஊழியர்களுடன் சுமுகமான உறவு நீடிக்கும். உங்கள் பணிகள் குறித்த தெளிவும், நேர்மையும் உங்களுக்கு அங்கீகாரத்தைப் பெற்றுத்தரும்.",
    "career_en": "Your leadership qualities will shine at work. Opportunities to lead new projects will arise. Your ideas will be accepted and praised. A harmonious relationship with colleagues will continue. Your clarity and integrity in tasks will bring you recognition.",
    "finance_ta": "நிதிநிலைமை சீராகும். எதிர்பாராத வகையில் ஒரு சிறிய வருவாய் கிடைக்க வாய்ப்புள்ளது. தந்தையின் ஆலோசனை நிதி முடிவுகளை எடுக்க உதவும். எதிர்காலத்திற்கான முதலீடுகளைப் பற்றி சிந்திப்பதற்கான நல்ல நாள் இது. சேமிப்பு அதிகரிக்கும்.",
    "finance_en": "Financial situation will stabilize. There is a possibility of a small unexpected income. Your father's advice will help in making financial decisions. This is a good day to think about investments for the future. Savings will increase.",
    "health_ta": "உடல் ஆரோக்கியம் சீராகும். சூரிய நமஸ்காரம் போன்ற பயிற்சிகள் உங்களுக்கு புதிய ஆற்றலைத் தரும். மன அமைதி மேம்படும். போதிய ஓய்வு எடுத்துக்கொள்வது உங்கள் உடல்நலத்திற்கு நல்லது. நல்ல உணவுப் பழக்கம் ஆரோக்கியத்தை மேம்படுத்தும்.",
    "health_en": "Physical health will be stable. Practices like Surya Namaskaram will give you new energy. Mental peace will improve. Getting adequate rest is good for your health. Good dietary habits will enhance your well-being.",
    "lucky_number": "9",
    "lucky_color_ta": "அடர்சிவப்பு",
    "lucky_color_en": "Dark Red"
  },
  {
    "sign_ta": "ரிஷபம்",
    "sign_en": "Taurus",
    "date": "15-02-2026",
    "prediction_ta": "ரிஷப ராசி அன்பர்களே, இன்று ஞாயிற்றுக்கிழமை சூரிய பகவானின் ஒளி உங்கள் வாழ்வில் புதிய வெளிச்சத்தைப் பாய்ச்சும் நாளாகும். நீங்கள் இன்று சற்று அமைதியாகவும், நிதானமாகவும் செயல்படுவீர்கள். உங்கள் உள்ளுணர்வு மேலோங்கும். எந்த ஒரு செயலையும் ஆராய்ந்து செயல்படும் குணம் இன்று உங்களுக்குப் பலன் தரும். குடும்பத்தில் தந்தையின் ஆலோசனைகள் உங்களுக்குப் பெரும் வழிகாட்டியாக அமையும். அவரது அனுபவங்கள் உங்களுக்கு புதிய கண்ணோட்டங்களைத் தரும். நிதி விஷயங்களில் இன்று கவனமாகச் செயல்படுவது நல்லது. ஒரு புதிய திட்டத்தைத் தொடங்கும் முன் முழுமையாக ஆய்வு செய்வது அவசியம். கலை மற்றும் அழகு சார்ந்த விஷயங்களில் உங்கள் ஆர்வம் அதிகரிக்கும். வீட்டில் ஒரு புதிய அலங்காரப் பொருளை வாங்கலாம். உங்கள் தன்னம்பிக்கை உயரும். நண்பர்களுடன் நல்லுறவு பேணுவீர்கள். சமூகத்தில் உங்கள் நிலை உயரும். உங்களின் பொறுமை இன்று உங்களுக்குப் பெரும் பலமாக இருக்கும். எந்த ஒரு சவாலையும் புன்னகையுடன் எதிர்கொள்வீர்கள். நீண்டகாலமாகத் தீர்க்கப்படாமல் இருந்த ஒரு குடும்பப் பிரச்சனைக்கு இன்று தீர்வு காணப்படலாம். உங்கள் மனதில் இருந்த குழப்பங்கள் நீங்கி தெளிவு பிறக்கும். பிறருக்கு உதவுவதன் மூலம் நீங்கள் மன நிம்மதி அடைவீர்கள். ஆன்மீகச் சிந்தனைகள் உங்களுக்கு மன அமைதியைத் தரும். தியானம் செய்வது அல்லது ஆலயங்களுக்குச் செல்வது போன்ற செயல்களில் ஈடுபடலாம். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் உங்கள் உடல்நலத்தைப் பாதுகாக்க உதவும். இன்று நீங்கள் எடுக்கும் அனைத்து முயற்சிகளும் நேர்மறையான விளைவுகளைத் தரும். புதிய தொழில் வாய்ப்புகள் உருவாகலாம். அதனைப் பயன்படுத்திக்கொள்ள உங்கள் திறமைகளை வளர்த்துக்கொள்ள வேண்டும். உங்கள் எண்ணங்களை வெளிப்படுத்துவதில் தயக்கம் வேண்டாம். நேர்மையான உரையாடல் உறவுகளை மேம்படுத்தும். கடந்த கால தவறுகளில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவீர்கள். இன்று நீங்கள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கு அதிக முக்கியத்துவம் கொடுப்பீர்கள். உங்களின் தனித்திறமைகள் அங்கீகரிக்கப்படும். குடும்பத்தினர் மற்றும் நண்பர்களின் ஆதரவு உங்களுக்குப் பெரும் பலமாக அமையும். மனதில் நம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு கடினமான சூழ்நிலையையும் எளிதில் கடக்க முடியும். உங்களின் நேர்மையும், உழைப்பும் நிச்சயம் நல்ல பலன்களைத் தரும். ஒரு நல்ல நாளை உற்சாகத்துடன் வரவேற்று, அதனை முழுமையாகப் பயன்படுத்துங்கள். உங்கள் இலக்குகளை நோக்கி உறுதியுடன் செயல்படுங்கள். பொதுவான ஒரு இனிமையான நாளாக அமையும்.",
    "prediction_en": "Taurus natives, today is a Sunday, a day when the light of Lord Sun will cast new illumination upon your life. You will act with a certain calmness and composure today. Your intuition will be strong. Your tendency to thoroughly analyze any action before proceeding will benefit you today. In family matters, your father's advice will serve as a significant guide. His experiences will offer you new perspectives. It is good to act cautiously in financial matters today. A thorough review is essential before starting a new project. Your interest in arts and beauty-related matters will increase. You might buy a new decorative item for your home. Your self-confidence will rise. You will maintain good relationships with friends. Your social standing will improve. Your patience will be a great strength for you today. You will face any challenge with a smile. A long-standing family issue that has remained unresolved might find a solution today. Confusion in your mind will clear, bringing clarity. You will find peace of mind by helping others. Spiritual thoughts will bring you mental tranquility. You may engage in activities like meditation or visiting temples. It is important to pay attention to your health. Proper eating habits will help protect your well-being. All your efforts today will yield positive results. New career opportunities may arise. You should develop your skills to take advantage of them. Do not hesitate to express your thoughts. Honest communication will improve relationships. You will learn from past mistakes and refine your future. Today, you will give great importance to your personal growth. Your unique talents will be recognized. The support of family and friends will be a great strength for you. If you act with confidence, you can easily overcome any difficult situation. Your integrity and hard work will certainly bring good results. Welcome a good day with enthusiasm and make the most of it. Act with determination towards your goals. It will generally be a pleasant day.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் பொறுமையும், விடாமுயற்சியும் பாராட்டப்படும். புதிய பொறுப்புகள் உங்களை வந்தடையலாம். குழுப்பணிகளில் உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். மூத்த அதிகாரிகளின் வழிகாட்டுதல்கள் உங்கள் வளர்ச்சிக்கு உதவும். எந்த ஒரு செயலையும் நேர்மையுடன் அணுகுவீர்கள்.",
    "career_en": "Your patience and perseverance will be appreciated at work. New responsibilities may come your way. Your contribution will be important in team projects. The guidance of senior officials will aid your growth. You will approach every task with integrity.",
    "finance_ta": "நிதி விஷயங்களில் சற்று கவனத்துடன் செயல்பட வேண்டும். தேவையற்ற செலவுகளைத் தவிர்க்கவும். நீண்டகால முதலீடுகளைப் பற்றி ஆராயலாம். சேமிப்புக்கு முக்கியத்துவம் கொடுப்பது நல்லது. தந்தையின் நிதி ஆலோசனைகள் உங்களுக்குப் பயனுள்ளதாக அமையும்.",
    "finance_en": "You need to be a little cautious in financial matters. Avoid unnecessary expenses. You can research long-term investments. It is good to prioritize savings. Your father's financial advice will be useful to you.",
    "health_ta": "ஆரோக்கியத்தில் கவனம் தேவை. வழக்கமான உடற்பயிற்சிகளை மேற்கொள்வது நல்லது. மனதை அமைதியாக வைத்துக்கொள்வது உடல்நலத்திற்கு உகந்தது. ஊட்டச்சத்து நிறைந்த உணவுகளை உட்கொண்டு, போதிய ஓய்வு எடுங்கள்.",
    "health_en": "Attention to health is needed. It is good to engage in regular exercises. Keeping the mind peaceful is beneficial for health. Consume nutritious food and get adequate rest.",
    "lucky_number": "6",
    "lucky_color_ta": "வெள்ளி",
    "lucky_color_en": "Silver"
  },
  {
    "sign_ta": "மிதுனம்",
    "sign_en": "Gemini",
    "date": "15-02-2026",
    "prediction_ta": "மிதுன ராசி அன்பர்களே, இன்று ஞாயிற்றுக்கிழமை சூரியனின் ஆதிக்கம் உங்களின் சிந்தனைத் திறனையும், அறிவாற்றலையும் தூண்டிவிடும் ஒரு நல்ல நாளாகும். நீங்கள் புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். சுறுசுறுப்புடன் செயல்படுவீர்கள். பலதரப்பட்ட மக்களுடன் உரையாடுவதற்கான வாய்ப்புகள் கிடைக்கும். உங்கள் கருத்துக்கள் தெளிவாகவும், உறுதியாகவும் இருக்கும். தந்தையின் வழிகாட்டுதல் உங்களுக்கு ஒரு புதிய திசையைக் காட்டும். அவரது அனுபவங்கள் உங்கள் முடிவுகளை எடுக்க உதவும். புதிய முயற்சிகளுக்கு இது ஒரு நல்ல நாள். உங்கள் தன்னம்பிக்கை அதிகரிக்கும். சமூகத்தில் உங்கள் தொடர்பு வட்டம் விரிவடையும். புதிய நண்பர்களைச் சந்திப்பீர்கள். சகோதர சகோதரிகளுடன் உறவு மேம்படும். நீண்டகாலமாகத் தடைபட்டிருந்த வேலைகள் இன்று நல்ல முடிவை எட்டும். உங்கள் பேச்சாற்றல் பலரையும் கவரும். எந்த ஒரு சூழ்நிலையையும் உங்கள் அறிவுத்திறனால் சமாளிப்பீர்கள். மனதில் ஒருவித உற்சாகமும், புத்துணர்ச்சியும் நிறைந்திருக்கும். ஆன்மீகச் சிந்தனைகள் மன அமைதியைத் தரும். தியானம், யோகா போன்ற பயிற்சிகளில் ஈடுபடுவது நல்லது. உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும். சரியான நேரத்தில் உணவை உட்கொண்டு, போதிய ஓய்வு எடுப்பது அவசியம். எந்த ஒரு சவாலையும் நேர்மறையாக அணுகுவதன் மூலம் நீங்கள் வெற்றியடைவீர்கள். கலை மற்றும் இலக்கியத் துறைகளில் ஆர்வம் கொண்டவர்கள் தங்கள் திறமைகளை வெளிப்படுத்த ஒரு நல்ல வாய்ப்பைப் பெறுவார்கள். மாணவர்கள் கல்வியில் சிறந்து விளங்க கடினமாக உழைக்க வேண்டியது அவசியம், அதற்கான பலன் நிச்சயம் கிடைக்கும். புதிய தகவல்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். மூத்தவர்களின் ஆசீர்வாதத்தைப் பெறுவது உங்கள் முன்னேற்றத்திற்கு வழிவகுக்கும். கடந்த கால அனுபவங்களை மனதில் கொண்டு எதிர்கால திட்டங்களை வகுப்பீர்கள். சுற்றியுள்ளவர்களுடன் நல்லுறவைப் பேணுவீர்கள். எந்த ஒரு சூழ்நிலையையும் நேர்மறையாக அணுகுவதன் மூலம் நீங்கள் வெற்றியடைவீர்கள். உங்கள் இலக்குகளை நோக்கிச் செயல்படுவதற்கு இது ஒரு சிறந்த நாள். உங்களின் நேர்மையான அணுகுமுறை பாராட்டுதலைப் பெறும். சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். உங்கள் ஆற்றலை சரியான திசையில் பயன்படுத்துவதன் மூலம் பெரிய வெற்றிகளை அடைய முடியும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு தடங்கலையும் தாண்டி சாதனைகள் புரியலாம். இன்று நீங்கள் செய்யும் ஒவ்வொரு செயலும் நேர்மறையான விளைவுகளைத் தரும். ஒரு நீண்ட கால முதலீட்டைப் பற்றி சிந்திப்பதற்கான நல்ல நாள் இது. சமூக நலப் பணிகளில் ஈடுபடுவது மனநிறைவைத் தரும். பிறருக்கு உதவுவதில் மகிழ்ச்சி காண்பீர்கள். உங்கள் தலைமைப் பண்புகள் இன்று வெளிப்படும், அதனைச் சரியாகப் பயன்படுத்துவீர்கள். எந்த ஒரு வேலையையும் தள்ளிப் போடாமல் உடனடியாகச் செய்வதற்கான உத்வேகம் கிடைக்கும். உங்கள் ஆளுமைத் திறன் மெருகேறும். தைரியத்துடனும், தன்னம்பிக்கையுடனும் செயல்படுவதன் மூலம் இன்று உங்களுக்கு சிறப்பான வெற்றிகள் காத்திருக்கின்றன. புதிய உறவுகள் உருவாகலாம் அல்லது பழைய உறவுகள் புதுப்பிக்கப்படலாம். பொதுவாக, இன்றைய நாள் உங்களுக்கு மிகுந்த சாதகமான பலன்களைத் தரக்கூடிய ஒரு பொன்னான நாளாக அமையும். உங்கள் முயற்சிகளுக்கு வெற்றி நிச்சயம்.",
    "prediction_en": "Gemini natives, today is a Sunday, a good day when the Sun's dominance will stimulate your thinking ability and intellect. You will show interest in learning new things. You will act with agility. Opportunities to interact with various people will arise. Your opinions will be clear and firm. Your father's guidance will show you a new direction. His experiences will help you make decisions. This is a good day for new ventures. Your self-confidence will increase. Your social network will expand, and you will meet new friends. Relationships with siblings will improve. Tasks that have been long delayed will reach a good conclusion today. Your eloquence will attract many. You will handle any situation with your intelligence. A sense of enthusiasm and freshness will fill your mind. Spiritual thoughts will bring peace of mind. Engaging in practices like meditation and yoga is beneficial. You must pay attention to your health. It is essential to eat on time and get adequate rest. You will succeed by approaching any challenge positively. Those interested in arts and literature will get a good opportunity to showcase their talents. Students need to work hard to excel in their studies, and the results will certainly follow. You will show interest in learning new information. Receiving blessings from elders will pave the way for your progress. You will plan for the future by keeping past experiences in mind. You will maintain good relationships with those around you. By approaching every situation positively, you will achieve success. This is an excellent day to work towards your goals. Your honest approach will receive appreciation. You will be ready to face challenges. By directing your energy in the right direction, you can achieve great successes. If you act with self-confidence, you can overcome any obstacle and achieve accomplishments. Every action you take today will yield positive results. This is a good day to think about a long-term investment. Engaging in social welfare activities will bring mental satisfaction. You will find joy in helping others. Your leadership qualities will manifest today, and you will use them appropriately. You will gain the motivation to complete tasks immediately without procrastination. Your personality will be refined. By acting with courage and self-confidence, special successes await you today. New relationships may form, or old relationships may be rekindled. Generally, today will be a golden day bringing you very favorable outcomes. Success is certain for your endeavors.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் கருத்துக்கள் ஏற்றுக்கொள்ளப்படும். குழு விவாதங்களில் உங்கள் பங்கு முக்கியத்துவம் பெறும். புதிய திட்டங்களில் பங்கேற்க வாய்ப்புகள் கிடைக்கும். சக ஊழியர்களுடன் நல்ல புரிதல் ஏற்படும். உங்கள் அறிவுத்திறன் பாராட்டுதலைப் பெறும்.",
    "career_en": "Your ideas will be accepted at work. Your participation in group discussions will be important. Opportunities to participate in new projects will arise. Good understanding with colleagues will develop. Your intelligence will receive appreciation.",
    "finance_ta": "நிதி விஷயங்களில் தெளிவான முடிவுகளை எடுப்பீர்கள். சிறு முதலீடுகள் லாபம் தரும். எதிர்காலத்திற்கான நிதி திட்டங்களை வகுக்க இது ஒரு நல்ல நாள். தந்தையின் ஆலோசனை நிதி பாதுகாப்பை உறுதிப்படுத்தும். தேவையற்ற செலவுகளைக் கட்டுப்படுத்துவீர்கள்.",
    "finance_en": "You will make clear decisions in financial matters. Small investments will yield profit. This is a good day to formulate financial plans for the future. Your father's advice will ensure financial security. You will control unnecessary expenses.",
    "health_ta": "ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும். மன அழுத்தம் தவிர்க்க தியானம், யோகா போன்ற பயிற்சிகளை மேற்கொள்ளலாம். நல்ல உணவுப் பழக்கம் மற்றும் போதிய உறக்கம் அவசியம். உடல் ஆரோக்கியம் மேம்படும்.",
    "health_en": "Attention to health is needed. To avoid stress, you can practice meditation and yoga. Good dietary habits and adequate sleep are essential. Physical health will improve.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "15-02-2026",
    "prediction_ta": "கடக ராசி அன்பர்களே, இன்று ஞாயிற்றுக்கிழமை சூரியனின் ஆதிக்கம் உங்கள் உணர்வுகளைச் சீர்படுத்தி, மனதில் ஒரு தெளிவைக் கொண்டுவரும் நாளாகும். நீங்கள் இன்று சற்று ஆழ்ந்த சிந்தனைகளுடன் காணப்படுவீர்கள். குடும்ப உறவுகளுக்கு அதிக முக்கியத்துவம் கொடுப்பீர்கள். தந்தையுடனான உறவில் மேலும் ஒரு நெருக்கம் ஏற்படும். அவரது ஆலோசனைகள் உங்களுக்குப் பெரும் பலனளிக்கும். வீட்டின் சூழல் அமைதியாகவும், மகிழ்ச்சியாகவும் இருக்கும். உங்கள் தன்னம்பிக்கை மெதுவாக உயரும். மற்றவர்களின் உணர்வுகளுக்கு மதிப்பளிப்பீர்கள். சமூகத்தில் உங்கள் நற்பெயர் அதிகரிக்கும். புதிய நண்பர்களைச் சந்திப்பதற்கான வாய்ப்புகள் கிடைக்கும். நீண்டகாலமாகத் தள்ளிப்போட்ட வேலைகளை இன்று வெற்றிகரமாக முடிப்பீர்கள். உங்கள் மனதில் இருந்த குழப்பங்கள் நீங்கி தெளிவு பிறக்கும். பிறருக்கு உதவுவதன் மூலம் நீங்கள் மன நிம்மதி அடைவீர்கள். ஆன்மீகச் சிந்தனைகள் உங்களுக்கு மன அமைதியைத் தரும். தியானம் செய்வது அல்லது ஆலயங்களுக்குச் செல்வது போன்ற செயல்களில் ஈடுபடலாம். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் உங்கள் உடல்நலத்தைப் பாதுகாக்க உதவும். இன்று நீங்கள் எடுக்கும் அனைத்து முயற்சிகளும் நேர்மறையான விளைவுகளைத் தரும். புதிய தொழில் வாய்ப்புகள் உருவாகலாம். அதனைப் பயன்படுத்திக்கொள்ள உங்கள் திறமைகளை வளர்த்துக்கொள்ள வேண்டும். உங்கள் எண்ணங்களை வெளிப்படுத்துவதில் தயக்கம் வேண்டாம். நேர்மையான உரையாடல் உறவுகளை மேம்படுத்தும். கடந்த கால தவறுகளில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவீர்கள். இன்று நீங்கள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கு அதிக முக்கியத்துவம் கொடுப்பீர்கள். உங்களின் தனித்திறமைகள் அங்கீகரிக்கப்படும். குடும்பத்தினர் மற்றும் நண்பர்களின் ஆதரவு உங்களுக்குப் பெரும் பலமாக அமையும். மனதில் நம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு கடினமான சூழ்நிலையையும் எளிதில் கடக்க முடியும். உங்களின் நேர்மும், உழைப்பும் நிச்சயம் நல்ல பலன்களைத் தரும். ஒரு நல்ல நாளை உற்சாகத்துடன் வரவேற்று, அதனை முழுமையாகப் பயன்படுத்துங்கள். உங்கள் இலக்குகளை நோக்கி உறுதியுடன் செயல்படுங்கள். பொதுவான ஒரு இனிமையான நாளாக அமையும். உங்கள் உள்ளுணர்வு இன்று உங்களுக்குச் சரியான வழியைக் காட்டும். எந்த ஒரு செயலையும் தொடங்கும் முன் அதன் சாதக பாதகங்களை ஆராய்வது நல்லது. பிறருடன் இணைந்து செயல்படுவது உங்களுக்கு நன்மைகளைத் தரும். உங்கள் பொறுமையான அணுகுமுறை பாராட்டுதலைப் பெறும். குடும்ப உறுப்பினர்களின் ஆதரவு உங்களுக்குப் பெரும் பலமாக இருக்கும். உங்கள் மனதில் உள்ள ஆசைகள் நிறைவேற வழி பிறக்கும். கலை மற்றும் இலக்கியத் துறைகளில் ஆர்வம் கொண்டவர்கள், தங்கள் திறமைகளை வெளிப்படுத்த ஒரு நல்ல வாய்ப்பைப் பெறுவார்கள். மாணவர்கள் கல்வியில் சிறந்து விளங்க கடினமாக உழைக்க வேண்டியது அவசியம், ஆனால் அதற்கான பலன் நிச்சயம் கிடைக்கும். புதிய தகவல்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். மூத்தவர்களின் ஆசீர்வாதத்தைப் பெறுவது உங்கள் முன்னேற்றத்திற்கு வழிவகுக்கும். கடந்த கால அனுபவங்களை மனதில் கொண்டு எதிர்கால திட்டங்களை வகுப்பீர்கள். சுற்றியுள்ளவர்களுடன் நல்லுறவைப் பேணுவீர்கள். எந்த ஒரு சூழ்நிலையையும் நேர்மறையாக அணுகுவதன் மூலம் நீங்கள் வெற்றியடைவீர்கள். உங்கள் இலக்குகளை நோக்கிச் செயல்படுவதற்கு இது ஒரு சிறந்த நாள். உங்களின் நேர்மையான அணுகுமுறை பாராட்டுதலைப் பெறும். சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். உங்கள் ஆற்றலை சரியான திசையில் பயன்படுத்துவதன் மூலம் பெரிய வெற்றிகளை அடைய முடியும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு தடங்கலையும் தாண்டி சாதனைகள் புரியலாம்.",
    "prediction_en": "Cancer natives, today is a Sunday, a day when the Sun's dominance will regulate your emotions and bring clarity to your mind. You will appear to be in deep thought today. You will give great importance to family relationships. There will be further closeness in your relationship with your father. His advice will be of great benefit to you. The home environment will be peaceful and happy. Your self-confidence will slowly increase. You will respect the feelings of others. Your good reputation in society will grow. Opportunities to meet new friends will arise. You will successfully complete long-postponed tasks today. Confusion in your mind will clear, bringing clarity. You will find peace of mind by helping others. Spiritual thoughts will bring you mental tranquility. You may engage in activities like meditation or visiting temples. It is important to pay attention to your health. Proper eating habits will help protect your well-being. All your efforts today will yield positive results. New career opportunities may arise. You should develop your skills to take advantage of them. Do not hesitate to express your thoughts. Honest communication will improve relationships. You will learn from past mistakes and refine your future. Today, you will give great importance to your personal growth. Your unique talents will be recognized. The support of family and friends will be a great strength for you. If you act with confidence, you can easily overcome any difficult situation. Your integrity and hard work will certainly bring good results. Welcome a good day with enthusiasm and make the most of it. Act with determination towards your goals. It will generally be a pleasant day. Your intuition will guide you correctly today. It is good to analyze the pros and cons of any action before starting it. Working with others will bring you benefits. Your patient approach will receive appreciation. The support of family members will be a great strength for you. Ways will open for your heartfelt desires to be fulfilled. Those interested in arts and literature will get a good opportunity to showcase their talents. Students need to work hard to excel in their studies, but the results will certainly follow. You will show interest in learning new information. Receiving blessings from elders will pave the way for your progress. You will plan for the future by keeping past experiences in mind. You will maintain good relationships with those around you. By approaching every situation positively, you will achieve success. This is an excellent day to work towards your goals. Your honest approach will receive appreciation. You will be ready to face challenges. By directing your energy in the right direction, you can achieve great successes. If you act with self-confidence, you can overcome any obstacle and achieve accomplishments.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் அர்ப்பணிப்பு பாராட்டுதலைப் பெறும். புதிய பொறுப்புகள் உங்களை வந்தடையலாம். குழுப்பணிகளில் உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். மூத்த அதிகாரிகளின் வழிகாட்டுதல்கள் உங்கள் வளர்ச்சிக்கு உதவும். உங்கள் பொறுமைக்கும், கடின உழைப்புக்கும் பலன் உண்டு.",
    "career_en": "Your dedication will be appreciated at work. New responsibilities may come your way. Your contribution will be important in team projects. The guidance of senior officials will aid your growth. Your patience and hard work will be rewarded.",
    "finance_ta": "நிதி நிலைமை சீராகும். குடும்பத்தின் ஆதரவு நிதி முடிவுகளை எடுக்க உதவும். சேமிப்புக்கு முக்கியத்துவம் கொடுப்பீர்கள். புதிய முதலீடுகளைப் பற்றி சிந்திக்கும்போது தந்தையின் ஆலோசனையைப் பெறுவது நல்லது. தேவையற்ற செலவுகளைக் கட்டுப்படுத்துவீர்கள்.",
    "finance_en": "Financial situation will stabilize. Family support will help in making financial decisions. You will prioritize savings. It is good to seek your father's advice when considering new investments. You will control unnecessary expenses.",
    "health_ta": "உடல் ஆரோக்கியம் சீராகும். மன அமைதி மேம்படும். நல்ல உணவுப் பழக்கங்களை கடைப்பிடித்து, போதிய ஓய்வு எடுப்பது நல்லது. தியானம் மற்றும் மூச்சுப் பயிற்சிகள் மனதை அமைதிப்படுத்தும். நீர்ச்சத்து நிறைந்த உணவுகளை உட்கொள்வது முக்கியம்.",
    "health_en": "Physical health will be stable. Mental peace will improve. It is good to follow good dietary habits and get adequate rest. Meditation and breathing exercises will calm the mind. Consuming hydrating foods is important.",
    "lucky_number": "2",
    "lucky_color_ta": "வெள்ளை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "சிம்மம்",
    "sign_en": "Leo",
    "date": "15-02-2026",
    "prediction_ta": "சிம்ம ராசி அன்பர்களே, இன்று ஞாயிற்றுக்கிழமை உங்களின் ஆளுமை கிரகமான சூரியனின் ஆதிக்கம் நிறைந்த நாள். உங்கள் தன்னம்பிக்கையும், தலைமைப் பண்பும் இன்று உச்சத்தில் இருக்கும். நீங்கள் செய்யும் ஒவ்வொரு செயலிலும் ஒரு நேர்மறையான ஆற்றல் வெளிப்படும். உங்களின் துணிச்சல் பலரையும் கவரும். இன்று நீங்கள் ஒரு தலைவராகச் செயல்படுவீர்கள், மற்றவர்களுக்கு வழிகாட்டுவீர்கள். தந்தையுடனான உறவு மேலும் பலமடையும். அவரது வழிகாட்டுதல்கள் உங்கள் முன்னேற்றத்திற்கு உதவும். சமூகத்தில் உங்கள் மதிப்பு உயரும், அங்கீகாரம் கிடைக்கும். புதிய முயற்சிகளைத் தொடங்க இது ஒரு சிறந்த நாள். உங்கள் ஆரோக்கியம் சீராகும், புத்துணர்ச்சியுடன் செயல்படுவீர்கள். ஒரு நீண்டகாலமாகத் தள்ளிப்போன திட்டம் இன்று நல்ல முடிவை எட்டும். உங்கள் மனதில் உள்ள ஆசைகள் நிறைவேற வழி பிறக்கும். கலை மற்றும் இலக்கியத் துறைகளில் ஆர்வம் கொண்டவர்கள், தங்கள் திறமைகளை வெளிப்படுத்த ஒரு நல்ல வாய்ப்பைப் பெறுவார்கள். மாணவர்கள் கல்வியில் சிறந்து விளங்க கடினமாக உழைக்க வேண்டியது அவசியம், அதற்கான பலன் நிச்சயம் கிடைக்கும். புதிய தகவல்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். மூத்தவர்களின் ஆசீர்வாதத்தைப் பெறுவது உங்கள் முன்னேற்றத்திற்கு வழிவகுக்கும். கடந்த கால அனுபவங்களை மனதில் கொண்டு எதிர்கால திட்டங்களை வகுப்பீர்கள். சுற்றியுள்ளவர்களுடன் நல்லுறவைப் பேணுவீர்கள். எந்த ஒரு சூழ்நிலையையும் நேர்மறையாக அணுகுவதன் மூலம் நீங்கள் வெற்றியடைவீர்கள். உங்கள் இலக்குகளை நோக்கிச் செயல்படுவதற்கு இது ஒரு சிறந்த நாள். உங்களின் நேர்மையான அணுகுமுறை பாராட்டுதலைப் பெறும். சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். உங்கள் ஆற்றலை சரியான திசையில் பயன்படுத்துவதன் மூலம் பெரிய வெற்றிகளை அடைய முடியும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு தடங்கலையும் தாண்டி சாதனைகள் புரியலாம். உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம், சரியான நேரத்தில் உணவு உட்கொண்டு போதிய ஓய்வு எடுப்பதன் மூலம் உங்கள் ஆற்றல் அதிகரிக்கும். இன்று நீங்கள் செய்யும் ஒவ்வொரு செயலும் நேர்மறையான விளைவுகளைத் தரும். ஒரு நீண்ட கால முதலீட்டைப் பற்றி சிந்திப்பதற்கான நல்ல நாள் இது. சமூக நலப் பணிகளில் ஈடுபடுவது மனநிறைவைத் தரும். பிறருக்கு உதவுவதில் மகிழ்ச்சி காண்பீர்கள். உங்கள் தலைமைப் பண்புகள் இன்று வெளிப்படும், அதனைச் சரியாகப் பயன்படுத்துவீர்கள். எந்த ஒரு வேலையையும் தள்ளிப் போடாமல் உடனடியாகச் செய்வதற்கான உத்வேகம் கிடைக்கும். உங்கள் ஆளுமைத் திறன் மெருகேறும். தைரியத்துடனும், தன்னம்பிக்கையுடனும் செயல்படுவதன் மூலம் இன்று உங்களுக்கு சிறப்பான வெற்றிகள் காத்திருக்கின்றன. புதிய உறவுகள் உருவாகலாம் அல்லது பழைய உறவுகள் புதுப்பிக்கப்படலாம். ஒரு முக்கிய முடிவை எடுப்பதற்கான நல்ல நாள் இது. குடும்பத்தில் மகிழ்ச்சியும், நல்லிணக்கமும் நிறைந்திருக்கும். உங்கள் எண்ணங்களை வெளிப்படையாகப் பகிர்ந்து கொள்வதன் மூலம் உறவுகள் மேம்படும். உங்கள் படைப்புத் திறன்கள் வெளிப்படும். பொதுவாக, இன்று உங்களுக்கு மிகவும் சாதகமான மற்றும் பலனளிக்கும் ஒரு நாளாக அமையும். உங்கள் கனவுகளை நனவாக்க ஒரு நல்ல வாய்ப்பு கிடைக்கும்.",
    "prediction_en": "Leo natives, today is a Sunday, a day dominated by the Sun, your ruling planet. Your self-confidence and leadership qualities will be at their peak today. A positive energy will emanate from every action you take. Your courage will attract many. Today, you will act as a leader, guiding others. Your relationship with your father will strengthen further. His guidance will aid your progress. Your reputation in society will increase, and you will receive recognition. This is an excellent day to start new ventures. Your health will be stable, and you will act with renewed energy. A long-postponed project will reach a good conclusion today. Ways will open for your heartfelt desires to be fulfilled. Those interested in arts and literature will get a good opportunity to showcase their talents. Students need to work hard to excel in their studies, and the results will certainly follow. You will show interest in learning new information. Receiving blessings from elders will pave the way for your progress. You will plan for the future by keeping past experiences in mind. You will maintain good relationships with those around you. By approaching every situation positively, you will achieve success. This is an excellent day to work towards your goals. Your honest approach will receive appreciation. You will be ready to face challenges. By directing your energy in the right direction, you can achieve great successes. If you act with self-confidence, you can overcome any obstacle and achieve accomplishments. It is essential to pay attention to your physical health; by eating on time and getting adequate rest, your energy will increase. Every action you take today will yield positive results. This is a good day to think about a long-term investment. Engaging in social welfare activities will bring mental satisfaction. You will find joy in helping others. Your leadership qualities will manifest today, and you will use them appropriately. You will gain the motivation to complete tasks immediately without procrastination. Your personality will be refined. By acting with courage and self-confidence, special successes await you today. New relationships may form, or old relationships may be rekindled. This is a good day to make an important decision. Happiness and harmony will fill your family. Relationships will improve by openly sharing your thoughts. Your creative abilities will shine. Generally, today will be a very favorable and rewarding day for you. You will get a good opportunity to realize your dreams.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் தலைமைத்துவம் பாராட்டப்படும். புதிய பொறுப்புகளை ஏற்க நேரிடலாம், அதனைத் திறம்பட செய்வீர்கள். சக ஊழியர்களின் ஆதரவு உங்களுக்குக் கிடைக்கும். உங்களின் ஆக்கப்பூர்வமான யோசனைகள் அங்கீகரிக்கப்படும். உங்கள் தொழில் வாழ்க்கையில் முன்னேற்றம் ஏற்படும்.",
    "career_en": "Your leadership will be appreciated at work. You may have to take on new responsibilities, which you will execute skillfully. Support from colleagues will be available to you. Your creative ideas will be recognized. Progress will occur in your professional life.",
    "finance_ta": "நிதி நிலைமை சிறப்பாக இருக்கும். புதிய வருவாய் ஆதாரங்கள் உருவாகலாம். சேமிப்பு அதிகரிக்கும். தந்தையின் ஆலோசனை நிதி ஆதாயத்திற்கு வழிவகுக்கும். நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பதற்கான நல்ல நாள் இது.",
    "finance_en": "Financial situation will be excellent. New sources of income may emerge. Savings will increase. Your father's advice will lead to financial gains. This is a good day to think about long-term investments.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். புத்துணர்ச்சியுடன் செயல்படுவீர்கள். சூரிய நமஸ்காரம் போன்ற பயிற்சிகள் உங்களுக்கு புதிய ஆற்றலைத் தரும். மன அமைதி மேம்படும். நல்ல உணவுப் பழக்கவழக்கங்கள் ஆரோக்கியத்தைப் பாதுகாக்கும்.",
    "health_en": "Physical health will improve. You will act with renewed energy. Practices like Surya Namaskaram will give you new energy. Mental peace will improve. Good dietary habits will protect your health.",
    "lucky_number": "1",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "கன்னி",
    "sign_en": "Virgo",
    "date": "15-02-2026",
    "prediction_ta": "கன்னி ராசி அன்பர்களே, இன்று ஞாயிற்றுக்கிழமை சூரியனின் ஆதிக்கம் உங்கள் அன்றாடச் செயல்களில் தெளிவையும், நேர்மறையான அணுகுமுறையையும் கொண்டுவரும் நாளாகும். நீங்கள் இன்று சற்று ஆழ்ந்த சிந்தனைகளுடன் காணப்படுவீர்கள். எந்த ஒரு செயலையும் திட்டமிட்டுச் செய்வீர்கள். உங்கள் பகுப்பாய்வு திறன் இன்று சிறப்பாகச் செயல்படும். தந்தையின் ஆலோசனைகள் உங்களுக்குப் பெரும் வழிகாட்டியாக அமையும். அவரது அனுபவங்கள் உங்களுக்கு புதிய கண்ணோட்டங்களைத் தரும். நிதி விஷயங்களில் இன்று கவனமாகச் செயல்படுவது நல்லது. ஒரு புதிய திட்டத்தைத் தொடங்கும் முன் முழுமையாக ஆய்வு செய்வது அவசியம். உங்கள் தன்னம்பிக்கை உயரும். நண்பர்களுடன் நல்லுறவு பேணுவீர்கள். சமூகத்தில் உங்கள் நிலை உயரும். உங்களின் பொறுமை இன்று உங்களுக்குப் பெரும் பலமாக இருக்கும். எந்த ஒரு சவாலையும் புன்னகையுடன் எதிர்கொள்வீர்கள். நீண்டகாலமாகத் தீர்க்கப்படாமல் இருந்த ஒரு குடும்பப் பிரச்சனைக்கு இன்று தீர்வு காணப்படலாம். உங்கள் மனதில் இருந்த குழப்பங்கள் நீங்கி தெளிவு பிறக்கும். பிறருக்கு உதவுவதன் மூலம் நீங்கள் மன நிம்மதி அடைவீர்கள். ஆன்மீகச் சிந்தனைகள் உங்களுக்கு மன அமைதியைத் தரும். தியானம் செய்வது அல்லது ஆலயங்களுக்குச் செல்வது போன்ற செயல்களில் ஈடுபடலாம். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் உங்கள் உடல்நலத்தைப் பாதுகாக்க உதவும். இன்று நீங்கள் எடுக்கும் அனைத்து முயற்சிகளும் நேர்மறையான விளைவுகளைத் தரும். புதிய தொழில் வாய்ப்புகள் உருவாகலாம். அதனைப் பயன்படுத்திக்கொள்ள உங்கள் திறமைகளை வளர்த்துக்கொள்ள வேண்டும். உங்கள் எண்ணங்களை வெளிப்படுத்துவதில் தயக்கம் வேண்டாம். நேர்மையான உரையாடல் உறவுகளை மேம்படுத்தும். கடந்த கால தவறுகளில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவீர்கள். இன்று நீங்கள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கு அதிக முக்கியத்துவம் கொடுப்பீர்கள். உங்களின் தனித்திறமைகள் அங்கீகரிக்கப்படும். குடும்பத்தினர் மற்றும் நண்பர்களின் ஆதரவு உங்களுக்குப் பெரும் பலமாக அமையும். மனதில் நம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு கடினமான சூழ்நிலையையும் எளிதில் கடக்க முடியும். உங்களின் நேர்மும், உழைப்பும் நிச்சயம் நல்ல பலன்களைத் தரும். ஒரு நல்ல நாளை உற்சாகத்துடன் வரவேற்று, அதனை முழுமையாகப் பயன்படுத்துங்கள். உங்கள் இலக்குகளை நோக்கி உறுதியுடன் செயல்படுங்கள். பொதுவான ஒரு இனிமையான நாளாக அமையும். உங்களின் கடின உழைப்புக்கான பலனை இன்று காண்பீர்கள். வேலையில் ஒரு புதிய பொறுப்பை ஏற்க நேரிடலாம், அதனைத் திறம்பட செய்வீர்கள். உங்கள் சிந்தனைத் திறன் மேம்படும். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். சமூகத்தில் உங்கள் நிலை உயரும். நீண்டகாலமாகத் தீர்க்கப்படாமல் இருந்த ஒரு பிரச்சனைக்கு இன்று தீர்வு காண்பீர்கள். உங்கள் தன்னம்பிக்கை அதிகரிக்கும். குடும்பத்தில் ஒரு இனிமையான சூழல் நிலவும். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம். நல்ல உணவுப் பழக்கவழக்கங்கள் உங்கள் உடல்நலத்தைப் பாதுகாக்க உதவும். இன்று நீங்கள் எடுக்கும் அனைத்து முயற்சிகளும் நேர்மறையான விளைவுகளைத் தரும். பிறருடன் இணைந்து செயல்படுவது உங்களுக்கு நன்மைகளைத் தரும். உங்கள் பொறுமையான அணுகுமுறை பாராட்டுதலைப் பெறும். குடும்ப உறுப்பினர்களின் ஆதரவு உங்களுக்குப் பெரும் பலமாக இருக்கும். உங்கள் மனதில் உள்ள ஆசைகள் நிறைவேற வழி பிறக்கும். கலை மற்றும் இலக்கியத் துறைகளில் ஆர்வம் கொண்டவர்கள், தங்கள் திறமைகளை வெளிப்படுத்த ஒரு நல்ல வாய்ப்பைப் பெறுவார்கள். மாணவர்கள் கல்வியில் சிறந்து விளங்க கடினமாக உழைக்க வேண்டியது அவசியம், ஆனால் அதற்கான பலன் நிச்சயம் கிடைக்கும். புதிய தகவல்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். மூத்தவர்களின் ஆசீர்வாதத்தைப் பெறுவது உங்கள் முன்னேற்றத்திற்கு வழிவகுக்கும். கடந்த கால அனுபவங்களை மனதில் கொண்டு எதிர்கால திட்டங்களை வகுப்பீர்கள். சுற்றியுள்ளவர்களுடன் நல்லுறவைப் பேணுவீர்கள். எந்த ஒரு சூழ்நிலையையும் நேர்மறையாக அணுகுவதன் மூலம் நீங்கள் வெற்றியடைவீர்கள். உங்கள் இலக்குகளை நோக்கிச் செயல்படுவதற்கு இது ஒரு சிறந்த நாள். உங்களின் நேர்மையான அணுகுமுறை பாராட்டுதலைப் பெறும். சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். உங்கள் ஆற்றலை சரியான திசையில் பயன்படுத்துவதன் மூலம் பெரிய வெற்றிகளை அடைய முடியும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு தடங்கலையும் தாண்டி சாதனைகள் புரியலாம்.",
    "prediction_en": "Virgo natives, today is a Sunday, a day when the Sun's dominance will bring clarity and a positive approach to your daily activities. You will appear to be in deep thought today. You will plan every action meticulously. Your analytical skills will perform exceptionally well today. Your father's advice will serve as a significant guide. His experiences will offer you new perspectives. It is good to act cautiously in financial matters today. A thorough review is essential before starting a new project. Your self-confidence will rise. You will maintain good relationships with friends. Your social standing will improve. Your patience will be a great strength for you today. You will face any challenge with a smile. A long-standing family issue that has remained unresolved might find a solution today. Confusion in your mind will clear, bringing clarity. You will find peace of mind by helping others. Spiritual thoughts will bring you mental tranquility. You may engage in activities like meditation or visiting temples. It is important to pay attention to your health. Proper eating habits will help protect your well-being. All your efforts today will yield positive results. New career opportunities may arise. You should develop your skills to take advantage of them. Do not hesitate to express your thoughts. Honest communication will improve relationships. You will learn from past mistakes and refine your future. Today, you will give great importance to your personal growth. Your unique talents will be recognized. The support of family and friends will be a great strength for you. If you act with confidence, you can easily overcome any difficult situation. Your integrity and hard work will certainly bring good results. Welcome a good day with enthusiasm and make the most of it. Act with determination towards your goals. It will generally be a pleasant day. You will see the results of your hard work today. You may have to take on a new responsibility at work, which you will execute skillfully. Your thinking ability will improve. You will show interest in learning new things. Your social standing will improve. You will find a solution to a long-standing problem today. Your self-confidence will increase. A pleasant atmosphere will prevail in the family. It is essential to pay attention to your health. Good dietary habits will help protect your well-being. All your efforts today will yield positive results. Working with others will bring you benefits. Your patient approach will receive appreciation. The support of family members will be a great strength for you. Ways will open for your heartfelt desires to be fulfilled. Those interested in arts and literature will get a good opportunity to showcase their talents. Students need to work hard to excel in their studies, but the results will certainly follow. You will show interest in learning new information. Receiving blessings from elders will pave the way for your progress. You will plan for the future by keeping past experiences in mind. You will maintain good relationships with those around you. By approaching every situation positively, you will achieve success. This is an excellent day to work towards your goals. Your honest approach will receive appreciation. You will be ready to face challenges. By directing your energy in the right direction, you can achieve great successes. If you act with self-confidence, you can overcome any obstacle and achieve accomplishments.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் கடின உழைப்பு அங்கீகரிக்கப்படும். புதிய பொறுப்புகளை ஏற்க நேரிடலாம், அதனைத் திறம்பட செய்வீர்கள். உங்கள் பகுப்பாய்வு திறன் பாராட்டப்படும். மூத்த அதிகாரிகளின் வழிகாட்டுதல்கள் உங்களுக்குப் பயனுள்ளதாக அமையும். உங்கள் வேலைத் திறனை மேம்படுத்துவீர்கள்.",
    "career_en": "Your hard work will be recognized at work. You may have to take on new responsibilities, which you will execute skillfully. Your analytical skills will be appreciated. The guidance of senior officials will be beneficial to you. You will improve your work efficiency.",
    "finance_ta": "நிதி நிலைமை சீராக இருக்கும். சேமிப்புக்கு முக்கியத்துவம் கொடுப்பீர்கள். புதிய முதலீடுகளைப் பற்றி சிந்திக்கும் முன் முழுமையான ஆய்வு அவசியம். தந்தையின் ஆலோசனை நிதி ஆதாயத்திற்கு வழிவகுக்கும். தேவையற்ற செலவுகளைக் கட்டுப்படுத்துவீர்கள்.",
    "finance_en": "Financial situation will be stable. You will prioritize savings. Thorough research is essential before considering new investments. Your father's advice will lead to financial gains. You will control unnecessary expenses.",
    "health_ta": "ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும். நல்ல உணவுப் பழக்கங்கள் மற்றும் வழக்கமான உடற்பயிற்சிகளை மேற்கொள்ள வேண்டும். மன அமைதிக்கு தியானம் உதவும். போதிய ஓய்வு எடுப்பது உடல்நலத்திற்கு நல்லது.",
    "health_en": "Attention to health is needed. Good dietary habits and regular exercises should be followed. Meditation will help with mental peace. Getting adequate rest is good for physical health.",
    "lucky_number": "5",
    "lucky_color_ta": "சாம்பல்",
    "lucky_color_en": "Grey"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "15-02-2026",
    "prediction_ta": "துலாம் ராசி அன்பர்களே, இன்று ஞாயிற்றுக்கிழமை சூரியனின் ஆதிக்கம் உங்கள் உறவுகளில் நல்லிணக்கத்தையும், சமநிலையையும் கொண்டுவரும் நாளாகும். நீங்கள் இன்று சற்று அமைதியாகவும், நிதானமாகவும் செயல்படுவீர்கள். பிறருடன் இணைந்து செயல்படுவதற்கான வாய்ப்புகள் கிடைக்கும். உங்கள் தன்னம்பிக்கை அதிகரிக்கும். குடும்பத்தில் தந்தையின் ஆலோசனைகள் உங்களுக்குப் பெரும் வழிகாட்டியாக அமையும். அவரது அனுபவங்கள் உங்களுக்கு புதிய கண்ணோட்டங்களைத் தரும். நிதி விஷயங்களில் இன்று கவனமாகச் செயல்படுவது நல்லது. ஒரு புதிய திட்டத்தைத் தொடங்கும் முன் முழுமையாக ஆய்வு செய்வது அவசியம். கலை மற்றும் அழகு சார்ந்த விஷயங்களில் உங்கள் ஆர்வம் அதிகரிக்கும். வீட்டில் ஒரு புதிய அலங்காரப் பொருளை வாங்கலாம். உங்கள் தன்னம்பிக்கை உயரும். நண்பர்களுடன் நல்லுறவு பேணுவீர்கள். சமூகத்தில் உங்கள் நிலை உயரும். உங்களின் பொறுமை இன்று உங்களுக்குப் பெரும் பலமாக இருக்கும். எந்த ஒரு சவாலையும் புன்னகையுடன் எதிர்கொள்வீர்கள். நீண்டகாலமாகத் தீர்க்கப்படாமல் இருந்த ஒரு குடும்பப் பிரச்சனைக்கு இன்று தீர்வு காணப்படலாம். உங்கள் மனதில் இருந்த குழப்பங்கள் நீங்கி தெளிவு பிறக்கும். பிறருக்கு உதவுவதன் மூலம் நீங்கள் மன நிம்மதி அடைவீர்கள். ஆன்மீகச் சிந்தனைகள் உங்களுக்கு மன அமைதியைத் தரும். தியானம் செய்வது அல்லது ஆலயங்களுக்குச் செல்வது போன்ற செயல்களில் ஈடுபடலாம். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் உங்கள் உடல்நலத்தைப் பாதுகாக்க உதவும். இன்று நீங்கள் எடுக்கும் அனைத்து முயற்சிகளும் நேர்மறையான விளைவுகளைத் தரும். புதிய தொழில் வாய்ப்புகள் உருவாகலாம். அதனைப் பயன்படுத்திக்கொள்ள உங்கள் திறமைகளை வளர்த்துக்கொள்ள வேண்டும். உங்கள் எண்ணங்களை வெளிப்படுத்துவதில் தயக்கம் வேண்டாம். நேர்மையான உரையாடல் உறவுகளை மேம்படுத்தும். கடந்த கால தவறுகளில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவீர்கள். இன்று நீங்கள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கு அதிக முக்கியத்துவம் கொடுப்பீர்கள். உங்களின் தனித்திறமைகள் அங்கீகரிக்கப்படும். குடும்பத்தினர் மற்றும் நண்பர்களின் ஆதரவு உங்களுக்குப் பெரும் பலமாக அமையும். மனதில் நம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு கடினமான சூழ்நிலையையும் எளிதில் கடக்க முடியும். உங்களின் நேர்மும், உழைப்பும் நிச்சயம் நல்ல பலன்களைத் தரும். ஒரு நல்ல நாளை உற்சாகத்துடன் வரவேற்று, அதனை முழுமையாகப் பயன்படுத்துங்கள். உங்கள் இலக்குகளை நோக்கி உறுதியுடன் செயல்படுங்கள். பொதுவான ஒரு இனிமையான நாளாக அமையும். கூட்டு முயற்சிகள் இன்று உங்களுக்கு வெற்றியைத் தேடித்தரும். புதிய உறவுகள் உருவாகலாம் அல்லது பழைய உறவுகள் புதுப்பிக்கப்படலாம். உங்கள் மனதில் உள்ள ஆசைகள் நிறைவேற வழி பிறக்கும். கலை மற்றும் இலக்கியத் துறைகளில் ஆர்வம் கொண்டவர்கள், தங்கள் திறமைகளை வெளிப்படுத்த ஒரு நல்ல வாய்ப்பைப் பெறுவார்கள். மாணவர்கள் கல்வியில் சிறந்து விளங்க கடினமாக உழைக்க வேண்டியது அவசியம், ஆனால் அதற்கான பலன் நிச்சயம் கிடைக்கும். புதிய தகவல்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். மூத்தவர்களின் ஆசீர்வாதத்தைப் பெறுவது உங்கள் முன்னேற்றத்திற்கு வழிவகுக்கும். கடந்த கால அனுபவங்களை மனதில் கொண்டு எதிர்கால திட்டங்களை வகுப்பீர்கள். சுற்றியுள்ளவர்களுடன் நல்லுறவைப் பேணுவீர்கள். எந்த ஒரு சூழ்நிலையையும் நேர்மறையாக அணுகுவதன் மூலம் நீங்கள் வெற்றியடைவீர்கள். உங்கள் இலக்குகளை நோக்கிச் செயல்படுவதற்கு இது ஒரு சிறந்த நாள். உங்களின் நேர்மையான அணுகுமுறை பாராட்டுதலைப் பெறும். சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். உங்கள் ஆற்றலை சரியான திசையில் பயன்படுத்துவதன் மூலம் பெரிய வெற்றிகளை அடைய முடியும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு தடங்கலையும் தாண்டி சாதனைகள் புரியலாம்.",
    "prediction_en": "Libra natives, today is a Sunday, a day when the Sun's dominance will bring harmony and balance to your relationships. You will act with a certain calmness and composure today. Opportunities to work with others will arise. Your self-confidence will increase. In family matters, your father's advice will serve as a significant guide. His experiences will offer you new perspectives. It is good to act cautiously in financial matters today. A thorough review is essential before starting a new project. Your interest in arts and beauty-related matters will increase. You might buy a new decorative item for your home. Your self-confidence will rise. You will maintain good relationships with friends. Your social standing will improve. Your patience will be a great strength for you today. You will face any challenge with a smile. A long-standing family issue that has remained unresolved might find a solution today. Confusion in your mind will clear, bringing clarity. You will find peace of mind by helping others. Spiritual thoughts will bring you mental tranquility. You may engage in activities like meditation or visiting temples. It is important to pay attention to your health. Proper eating habits will help protect your well-being. All your efforts today will yield positive results. New career opportunities may arise. You should develop your skills to take advantage of them. Do not hesitate to express your thoughts. Honest communication will improve relationships. You will learn from past mistakes and refine your future. Today, you will give great importance to your personal growth. Your unique talents will be recognized. The support of family and friends will be a great strength for you. If you act with confidence, you can easily overcome any difficult situation. Your integrity and hard work will certainly bring good results. Welcome a good day with enthusiasm and make the most of it. Act with determination towards your goals. It will generally be a pleasant day. Joint ventures will bring you success today. New relationships may form, or old relationships may be rekindled. Ways will open for your heartfelt desires to be fulfilled. Those interested in arts and literature will get a good opportunity to showcase their talents. Students need to work hard to excel in their studies, but the results will certainly follow. You will show interest in learning new information. Receiving blessings from elders will pave the way for your progress. You will plan for the future by keeping past experiences in mind. You will maintain good relationships with those around you. By approaching every situation positively, you will achieve success. This is an excellent day to work towards your goals. Your honest approach will receive appreciation. You will be ready to face challenges. By directing your energy in the right direction, you can achieve great successes. If you act with self-confidence, you can overcome any obstacle and achieve accomplishments.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் இராஜதந்திரம் பாராட்டப்படும். குழுப்பணிகளில் உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும். புதிய ஒப்பந்தங்களை மேற்கொள்ள வாய்ப்புகள் கிடைக்கும். சக ஊழியர்களுடன் நல்ல உறவு நீடிக்கும். உங்கள் சமநிலையான அணுகுமுறை பாராட்டுதலைப் பெறும்.",
    "career_en": "Your diplomacy will be appreciated at work. Your contribution in team projects will be important. Opportunities to undertake new contracts will arise. Good relationships with colleagues will continue. Your balanced approach will receive appreciation.",
    "finance_ta": "நிதி நிலைமை சீராகும். புதிய முதலீடுகளைப் பற்றி சிந்திக்கும் முன் முழுமையான ஆய்வு அவசியம். தந்தையின் ஆலோசனை நிதி ஆதாயத்திற்கு வழிவகுக்கும். சேமிப்புக்கு முக்கியத்துவம் கொடுப்பீர்கள். நிதி திட்டங்களை வகுக்க இது ஒரு நல்ல நாள்.",
    "finance_en": "Financial situation will stabilize. Thorough research is essential before considering new investments. Your father's advice will lead to financial gains. You will prioritize savings. This is a good day to formulate financial plans.",
    "health_ta": "உடல் ஆரோக்கியம் சீராகும். மன அமைதி மேம்படும். மன அழுத்தத்தைக் குறைக்க தியானம், யோகா போன்ற பயிற்சிகளை மேற்கொள்ளலாம். நல்ல உணவுப் பழக்கவழக்கங்கள் மற்றும் போதிய ஓய்வு அவசியம். புத்துணர்ச்சியுடன் இருப்பீர்கள்.",
    "health_en": "Physical health will be stable. Mental peace will improve. To reduce stress, you can practice meditation and yoga. Good dietary habits and adequate rest are essential. You will feel revitalized.",
    "lucky_number": "6",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "விருச்சிகம்",
    "sign_en": "Scorpio",
    "date": "15-02-2026",
    "prediction_ta": "விருச்சிக ராசி அன்பர்களே, இன்று ஞாயிற்றுக்கிழமை சூரியனின் ஆதிக்கம் உங்கள் உள் வலிமையையும், உறுதியையும் வெளிப்படுத்தும் நாளாகும். நீங்கள் இன்று சற்று ஆழ்ந்த சிந்தனைகளுடன் காணப்படுவீர்கள். எந்த ஒரு செயலையும் ஆராய்ந்து செயல்படும் குணம் இன்று உங்களுக்குப் பலன் தரும். உங்கள் தன்னம்பிக்கை அதிகரிக்கும். குடும்பத்தில் தந்தையின் ஆலோசனைகள் உங்களுக்குப் பெரும் வழிகாட்டியாக அமையும். அவரது அனுபவங்கள் உங்களுக்கு புதிய கண்ணோட்டங்களைத் தரும். நிதி விஷயங்களில் இன்று கவனமாகச் செயல்படுவது நல்லது. ஒரு புதிய திட்டத்தைத் தொடங்கும் முன் முழுமையாக ஆய்வு செய்வது அவசியம். கலை மற்றும் அழகு சார்ந்த விஷயங்களில் உங்கள் ஆர்வம் அதிகரிக்கும். வீட்டில் ஒரு புதிய அலங்காரப் பொருளை வாங்கலாம். உங்கள் தன்னம்பிக்கை உயரும். நண்பர்களுடன் நல்லுறவு பேணுவீர்கள். சமூகத்தில் உங்கள் நிலை உயரும். உங்களின் பொறுமை இன்று உங்களுக்குப் பெரும் பலமாக இருக்கும். எந்த ஒரு சவாலையும் புன்னகையுடன் எதிர்கொள்வீர்கள். நீண்டகாலமாகத் தீர்க்கப்படாமல் இருந்த ஒரு குடும்பப் பிரச்சனைக்கு இன்று தீர்வு காணப்படலாம். உங்கள் மனதில் இருந்த குழப்பங்கள் நீங்கி தெளிவு பிறக்கும். பிறருக்கு உதவுவதன் மூலம் நீங்கள் மன நிம்மதி அடைவீர்கள். ஆன்மீகச் சிந்தனைகள் உங்களுக்கு மன அமைதியைத் தரும். தியானம் செய்வது அல்லது ஆலயங்களுக்குச் செல்வது போன்ற செயல்களில் ஈடுபடலாம். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் உங்கள் உடல்நலத்தைப் பாதுகாக்க உதவும். இன்று நீங்கள் எடுக்கும் அனைத்து முயற்சிகளும் நேர்மறையான விளைவுகளைத் தரும். புதிய தொழில் வாய்ப்புகள் உருவாகலாம். அதனைப் பயன்படுத்திக்கொள்ள உங்கள் திறமைகளை வளர்த்துக்கொள்ள வேண்டும். உங்கள் எண்ணங்களை வெளிப்படுத்துவதில் தயக்கம் வேண்டாம். நேர்மையான உரையாடல் உறவுகளை மேம்படுத்தும். கடந்த கால தவறுகளில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவீர்கள். இன்று நீங்கள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கு அதிக முக்கியத்துவம் கொடுப்பீர்கள். உங்களின் தனித்திறமைகள் அங்கீகரிக்கப்படும். குடும்பத்தினர் மற்றும் நண்பர்களின் ஆதரவு உங்களுக்குப் பெரும் பலமாக அமையும். மனதில் நம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு கடினமான சூழ்நிலையையும் எளிதில் கடக்க முடியும். உங்களின் நேர்மும், உழைப்பும் நிச்சயம் நல்ல பலன்களைத் தரும். ஒரு நல்ல நாளை உற்சாகத்துடன் வரவேற்று, அதனை முழுமையாகப் பயன்படுத்துங்கள். உங்கள் இலக்குகளை நோக்கி உறுதியுடன் செயல்படுங்கள். பொதுவான ஒரு இனிமையான நாளாக அமையும். உங்கள் மனதில் உள்ள ஆசைகள் நிறைவேற வழி பிறக்கும். கலை மற்றும் இலக்கியத் துறைகளில் ஆர்வம் கொண்டவர்கள், தங்கள் திறமைகளை வெளிப்படுத்த ஒரு நல்ல வாய்ப்பைப் பெறுவார்கள். மாணவர்கள் கல்வியில் சிறந்து விளங்க கடினமாக உழைக்க வேண்டியது அவசியம், ஆனால் அதற்கான பலன் நிச்சயம் கிடைக்கும். புதிய தகவல்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். மூத்தவர்களின் ஆசீர்வாதத்தைப் பெறுவது உங்கள் முன்னேற்றத்திற்கு வழிவகுக்கும். கடந்த கால அனுபவங்களை மனதில் கொண்டு எதிர்கால திட்டங்களை வகுப்பீர்கள். சுற்றியுள்ளவர்களுடன் நல்லுறவைப் பேணுவீர்கள். எந்த ஒரு சூழ்நிலையையும் நேர்மறையாக அணுகுவதன் மூலம் நீங்கள் வெற்றியடைவீர்கள். உங்கள் இலக்குகளை நோக்கிச் செயல்படுவதற்கு இது ஒரு சிறந்த நாள். உங்களின் நேர்மையான அணுகுமுறை பாராட்டுதலைப் பெறும். சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். உங்கள் ஆற்றலை சரியான திசையில் பயன்படுத்துவதன் மூலம் பெரிய வெற்றிகளை அடைய முடியும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு தடங்கலையும் தாண்டி சாதனைகள் புரியலாம்.",
    "prediction_en": "Scorpio natives, today is a Sunday, a day when the Sun's dominance will reveal your inner strength and determination. You will appear to be in deep thought today. Your tendency to thoroughly analyze any action before proceeding will benefit you today. Your self-confidence will increase. In family matters, your father's advice will serve as a significant guide. His experiences will offer you new perspectives. It is good to act cautiously in financial matters today. A thorough review is essential before starting a new project. Your interest in arts and beauty-related matters will increase. You might buy a new decorative item for your home. Your self-confidence will rise. You will maintain good relationships with friends. Your social standing will improve. Your patience will be a great strength for you today. You will face any challenge with a smile. A long-standing family issue that has remained unresolved might find a solution today. Confusion in your mind will clear, bringing clarity. You will find peace of mind by helping others. Spiritual thoughts will bring you mental tranquility. You may engage in activities like meditation or visiting temples. It is important to pay attention to your health. Proper eating habits will help protect your well-being. All your efforts today will yield positive results. New career opportunities may arise. You should develop your skills to take advantage of them. Do not hesitate to express your thoughts. Honest communication will improve relationships. You will learn from past mistakes and refine your future. Today, you will give great importance to your personal growth. Your unique talents will be recognized. The support of family and friends will be a great strength for you. If you act with confidence, you can easily overcome any difficult situation. Your integrity and hard work will certainly bring good results. Welcome a good day with enthusiasm and make the most of it. Act with determination towards your goals. It will generally be a pleasant day. Ways will open for your heartfelt desires to be fulfilled. Those interested in arts and literature will get a good opportunity to showcase their talents. Students need to work hard to excel in their studies, but the results will certainly follow. You will show interest in learning new information. Receiving blessings from elders will pave the way for your progress. You will plan for the future by keeping past experiences in mind. You will maintain good relationships with those around you. By approaching every situation positively, you will achieve success. This is an excellent day to work towards your goals. Your honest approach will receive appreciation. You will be ready to face challenges. By directing your energy in the right direction, you can achieve great successes. If you act with self-confidence, you can overcome any obstacle and achieve accomplishments.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் மன உறுதி பாராட்டுதலைப் பெறும். புதிய சவால்களை எதிர்கொள்ளத் தயங்க மாட்டீர்கள். உங்கள் திட்டமிடல் திறன் மேம்படும். மூத்த அதிகாரிகளின் வழிகாட்டுதல்கள் உங்களுக்குப் பயனுள்ளதாக அமையும். உங்கள் கடின உழைப்புக்கான பலன் உண்டு.",
    "career_en": "Your determination will be appreciated at work. You will not hesitate to face new challenges. Your planning skills will improve. The guidance of senior officials will be beneficial to you. Your hard work will be rewarded.",
    "finance_ta": "நிதி நிலைமை சீராகும். புதிய முதலீடுகளைப் பற்றி சிந்திக்கும் முன் முழுமையான ஆய்வு அவசியம். தந்தையின் ஆலோசனை நிதி ஆதாயத்திற்கு வழிவகுக்கும். சேமிப்புக்கு முக்கியத்துவம் கொடுப்பீர்கள். தேவையற்ற செலவுகளைக் கட்டுப்படுத்துவீர்கள்.",
    "finance_en": "Financial situation will stabilize. Thorough research is essential before considering new investments. Your father's advice will lead to financial gains. You will prioritize savings. You will control unnecessary expenses.",
    "health_ta": "ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும். மன அழுத்தத்தைக் குறைக்க தியானம், யோகா போன்ற பயிற்சிகளை மேற்கொள்ளலாம். நல்ல உணவுப் பழக்கவழக்கங்கள் மற்றும் போதிய ஓய்வு அவசியம். உடல் ஆரோக்கியம் மேம்படும்.",
    "health_en": "Attention to health is needed. To reduce stress, you can practice meditation and yoga. Good dietary habits and adequate rest are essential. Physical health will improve.",
    "lucky_number": "9",
    "lucky_color_ta": "கத்தரிப்பூ",
    "lucky_color_en": "Indigo"
  },
  {
    "sign_ta": "தனுசு",
    "sign_en": "Sagittarius",
    "date": "15-02-2026",
    "prediction_ta": "தனுசு ராசி அன்பர்களே, இன்று ஞாயிற்றுக்கிழமை சூரிய பகவானின் ஆதிக்கம் உங்கள் நம்பிக்கையையும், நேர்மறையான எண்ணங்களையும் அதிகரிக்கும் நாளாகும். நீங்கள் இன்று மிகுந்த உற்சாகத்துடன் செயல்படுவீர்கள். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். சமூகத்தில் உங்கள் மதிப்பு உயரும், அங்கீகாரம் கிடைக்கும். தந்தையின் வழிகாட்டுதல் உங்களுக்குப் பெரும் பலனளிக்கும். அவரது அனுபவங்கள் உங்கள் முடிவுகளை எடுக்க உதவும். புதிய முயற்சிகளைத் தொடங்க இது ஒரு சிறந்த நாள். உங்கள் தன்னம்பிக்கை அதிகரிக்கும். நண்பர்களுடன் நல்லுறவு பேணுவீர்கள். நீண்டகாலமாகத் தடைபட்டிருந்த வேலைகள் இன்று நல்ல முடிவை எட்டும். உங்கள் பேச்சாற்றல் பலரையும் கவரும். எந்த ஒரு சூழ்நிலையையும் உங்கள் அறிவுத்திறனால் சமாளிப்பீர்கள். மனதில் ஒருவித உற்சாகமும், புத்துணர்ச்சியும் நிறைந்திருக்கும். ஆன்மீகச் சிந்தனைகள் மன அமைதியைத் தரும். தியானம், யோகா போன்ற பயிற்சிகளில் ஈடுபடுவது நல்லது. உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும். சரியான நேரத்தில் உணவை உட்கொண்டு, போதிய ஓய்வு எடுப்பது அவசியம். எந்த ஒரு சவாலையும் நேர்மறையாக அணுகுவதன் மூலம் நீங்கள் வெற்றியடைவீர்கள். கலை மற்றும் இலக்கியத் துறைகளில் ஆர்வம் கொண்டவர்கள் தங்கள் திறமைகளை வெளிப்படுத்த ஒரு நல்ல வாய்ப்பைப் பெறுவார்கள். மாணவர்கள் கல்வியில் சிறந்து விளங்க கடினமாக உழைக்க வேண்டியது அவசியம், அதற்கான பலன் நிச்சயம் கிடைக்கும். புதிய தகவல்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். மூத்தவர்களின் ஆசீர்வாதத்தைப் பெறுவது உங்கள் முன்னேற்றத்திற்கு வழிவகுக்கும். கடந்த கால அனுபவங்களை மனதில் கொண்டு எதிர்கால திட்டங்களை வகுப்பீர்கள். சுற்றியுள்ளவர்களுடன் நல்லுறவைப் பேணுவீர்கள். எந்த ஒரு சூழ்நிலையையும் நேர்மறையாக அணுகுவதன் மூலம் நீங்கள் வெற்றியடைவீர்கள். உங்கள் இலக்குகளை நோக்கிச் செயல்படுவதற்கு இது ஒரு சிறந்த நாள். உங்களின் நேர்மையான அணுகுமுறை பாராட்டுதலைப் பெறும். சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். உங்கள் ஆற்றலை சரியான திசையில் பயன்படுத்துவதன் மூலம் பெரிய வெற்றிகளை அடைய முடியும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு தடங்கலையும் தாண்டி சாதனைகள் புரியலாம். உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம், சரியான நேரத்தில் உணவு உட்கொண்டு போதிய ஓய்வு எடுப்பதன் மூலம் உங்கள் ஆற்றல் அதிகரிக்கும். இன்று நீங்கள் செய்யும் ஒவ்வொரு செயலும் நேர்மறையான விளைவுகளைத் தரும். ஒரு நீண்ட கால முதலீட்டைப் பற்றி சிந்திப்பதற்கான நல்ல நாள் இது. சமூக நலப் பணிகளில் ஈடுபடுவது மனநிறைவைத் தரும். பிறருக்கு உதவுவதில் மகிழ்ச்சி காண்பீர்கள். உங்கள் தலைமைப் பண்புகள் இன்று வெளிப்படும், அதனைச் சரியாகப் பயன்படுத்துவீர்கள். எந்த ஒரு வேலையையும் தள்ளிப் போடாமல் உடனடியாகச் செய்வதற்கான உத்வேகம் கிடைக்கும். உங்கள் ஆளுமைத் திறன் மெருகேறும். தைரியத்துடனும், தன்னம்பிக்கையுடனும் செயல்படுவதன் மூலம் இன்று உங்களுக்கு சிறப்பான வெற்றிகள் காத்திருக்கின்றன. புதிய உறவுகள் உருவாகலாம் அல்லது பழைய உறவுகள் புதுப்பிக்கப்படலாம். ஒரு முக்கிய முடிவை எடுப்பதற்கான நல்ல நாள் இது. குடும்பத்தில் மகிழ்ச்சியும், நல்லிணக்கமும் நிறைந்திருக்கும். உங்கள் எண்ணங்களை வெளிப்படையாகப் பகிர்ந்து கொள்வதன் மூலம் உறவுகள் மேம்படும். உங்கள் படைப்புத் திறன்கள் வெளிப்படும். பொதுவாக, இன்று உங்களுக்கு மிகவும் சாதகமான மற்றும் பலனளிக்கும் ஒரு நாளாக அமையும். உங்கள் கனவுகளை நனவாக்க ஒரு நல்ல வாய்ப்பு கிடைக்கும். பயணங்கள் மேற்கொள்ளும் வாய்ப்பு உண்டு, அவை உங்களுக்குப் புத்துணர்ச்சியையும், புதிய அனுபவங்களையும் தரும்.",
    "prediction_en": "Sagittarius natives, today is a Sunday, a day when the dominance of Lord Sun will increase your confidence and positive thoughts. You will act with great enthusiasm today. You will show interest in learning new things. Your reputation in society will increase, and you will receive recognition. Your father's guidance will be of great benefit to you. His experiences will help you make decisions. This is an excellent day to start new ventures. Your self-confidence will increase. You will maintain good relationships with friends. Tasks that have been long delayed will reach a good conclusion today. Your eloquence will attract many. You will handle any situation with your intelligence. A sense of enthusiasm and freshness will fill your mind. Spiritual thoughts will bring peace of mind. Engaging in practices like meditation and yoga is beneficial. You must pay attention to your health. It is essential to eat on time and get adequate rest. You will succeed by approaching any challenge positively. Those interested in arts and literature will get a good opportunity to showcase their talents. Students need to work hard to excel in their studies, and the results will certainly follow. You will show interest in learning new information. Receiving blessings from elders will pave the way for your progress. You will plan for the future by keeping past experiences in mind. You will maintain good relationships with those around you. By approaching every situation positively, you will achieve success. This is an excellent day to work towards your goals. Your honest approach will receive appreciation. You will be ready to face challenges. By directing your energy in the right direction, you can achieve great successes. If you act with self-confidence, you can overcome any obstacle and achieve accomplishments. It is essential to pay attention to your physical health; by eating on time and getting adequate rest, your energy will increase. Every action you take today will yield positive results. This is a good day to think about a long-term investment. Engaging in social welfare activities will bring mental satisfaction. You will find joy in helping others. Your leadership qualities will manifest today, and you will use them appropriately. You will gain the motivation to complete tasks immediately without procrastination. Your personality will be refined. By acting with courage and self-confidence, special successes await you today. New relationships may form, or old relationships may be rekindled. This is a good day to make an important decision. Happiness and harmony will fill your family. Relationships will improve by openly sharing your thoughts. Your creative abilities will shine. Generally, today will be a very favorable and rewarding day for you. You will get a good opportunity to realize your dreams. There is a possibility of travel, which will bring you revitalization and new experiences.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் நேர்மறை எண்ணங்கள் வெற்றியைத் தேடித்தரும். புதிய திட்டங்களில் பங்கேற்க வாய்ப்புகள் கிடைக்கும். உங்கள் கருத்துக்கள் ஏற்கப்பட்டு பாராட்டுதலைப் பெறும். சக ஊழியர்களுடன் நல்லுறவு நீடிக்கும். உங்கள் பணிகள் குறித்த தெளிவும், நேர்மையும் உங்களுக்கு அங்கீகாரத்தைப் பெற்றுத்தரும்.",
    "career_en": "Your positive thoughts will bring success at work. Opportunities to participate in new projects will arise. Your ideas will be accepted and praised. Good relationships with colleagues will continue. Your clarity and integrity in tasks will bring you recognition.",
    "finance_ta": "நிதி நிலைமை சிறப்பாக இருக்கும். புதிய வருவாய் ஆதாரங்கள் உருவாகலாம். சேமிப்பு அதிகரிக்கும். தந்தையின் ஆலோசனை நிதி ஆதாயத்திற்கு வழிவகுக்கும். நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பதற்கான நல்ல நாள் இது.",
    "finance_en": "Financial situation will be excellent. New sources of income may emerge. Savings will increase. Your father's advice will lead to financial gains. This is a good day to think about long-term investments.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். புத்துணர்ச்சியுடன் செயல்படுவீர்கள். சூரிய நமஸ்காரம் போன்ற பயிற்சிகள் உங்களுக்கு புதிய ஆற்றலைத் தரும். மன அமைதி மேம்படும். நல்ல உணவுப் பழக்கவழக்கங்கள் ஆரோக்கியத்தைப் பாதுகாக்கும். நீண்ட தூர நடைப்பயிற்சிகள் புத்துணர்ச்சி தரும்.",
    "health_en": "Physical health will improve. You will act with renewed energy. Practices like Surya Namaskaram will give you new energy. Mental peace will improve. Good dietary habits will protect your health. Long walks will bring revitalization.",
    "lucky_number": "3",
    "lucky_color_ta": "பொன்",
    "lucky_color_en": "Gold"
  },
  {
    "sign_ta": "மகரம்",
    "sign_en": "Capricorn",
    "date": "15-02-2026",
    "prediction_ta": "மகர ராசி அன்பர்களே, இன்று ஞாயிற்றுக்கிழமை சூரியனின் ஆதிக்கம் உங்கள் பொறுமையையும், கடின உழைப்பையும் மேலும் மெருகேற்றும் நாளாகும். நீங்கள் இன்று சற்று ஆழ்ந்த சிந்தனைகளுடன் காணப்படுவீர்கள். எந்த ஒரு செயலையும் திட்டமிட்டுச் செய்வீர்கள். உங்கள் ஒழுக்கமும், விடாமுயற்சியும் இன்று உங்களுக்குப் பலன் தரும். தந்தையின் ஆலோசனைகள் உங்களுக்குப் பெரும் வழிகாட்டியாக அமையும். அவரது அனுபவங்கள் உங்களுக்கு புதிய கண்ணோட்டங்களைத் தரும். நிதி விஷயங்களில் இன்று கவனமாகச் செயல்படுவது நல்லது. ஒரு புதிய திட்டத்தைத் தொடங்கும் முன் முழுமையாக ஆய்வு செய்வது அவசியம். உங்கள் தன்னம்பிக்கை உயரும். நண்பர்களுடன் நல்லுறவு பேணுவீர்கள். சமூகத்தில் உங்கள் நிலை உயரும். உங்களின் பொறுமை இன்று உங்களுக்குப் பெரும் பலமாக இருக்கும். எந்த ஒரு சவாலையும் புன்னகையுடன் எதிர்கொள்வீர்கள். நீண்டகாலமாகத் தீர்க்கப்படாமல் இருந்த ஒரு குடும்பப் பிரச்சனைக்கு இன்று தீர்வு காணப்படலாம். உங்கள் மனதில் இருந்த குழப்பங்கள் நீங்கி தெளிவு பிறக்கும். பிறருக்கு உதவுவதன் மூலம் நீங்கள் மன நிம்மதி அடைவீர்கள். ஆன்மீகச் சிந்தனைகள் உங்களுக்கு மன அமைதியைத் தரும். தியானம் செய்வது அல்லது ஆலயங்களுக்குச் செல்வது போன்ற செயல்களில் ஈடுபடலாம். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் உங்கள் உடல்நலத்தைப் பாதுகாக்க உதவும். இன்று நீங்கள் எடுக்கும் அனைத்து முயற்சிகளும் நேர்மறையான விளைவுகளைத் தரும். புதிய தொழில் வாய்ப்புகள் உருவாகலாம். அதனைப் பயன்படுத்திக்கொள்ள உங்கள் திறமைகளை வளர்த்துக்கொள்ள வேண்டும். உங்கள் எண்ணங்களை வெளிப்படுத்துவதில் தயக்கம் வேண்டாம். நேர்மையான உரையாடல் உறவுகளை மேம்படுத்தும். கடந்த கால தவறுகளில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவீர்கள். இன்று நீங்கள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கு அதிக முக்கியத்துவம் கொடுப்பீர்கள். உங்களின் தனித்திறமைகள் அங்கீகரிக்கப்படும். குடும்பத்தினர் மற்றும் நண்பர்களின் ஆதரவு உங்களுக்குப் பெரும் பலமாக அமையும். மனதில் நம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு கடினமான சூழ்நிலையையும் எளிதில் கடக்க முடியும். உங்களின் நேர்மும், உழைப்பும் நிச்சயம் நல்ல பலன்களைத் தரும். ஒரு நல்ல நாளை உற்சாகத்துடன் வரவேற்று, அதனை முழுமையாகப் பயன்படுத்துங்கள். உங்கள் இலக்குகளை நோக்கி உறுதியுடன் செயல்படுங்கள். பொதுவான ஒரு இனிமையான நாளாக அமையும். உங்களின் கடின உழைப்புக்கான பலனை இன்று காண்பீர்கள். வேலையில் ஒரு புதிய பொறுப்பை ஏற்க நேரிடலாம், அதனைத் திறம்பட செய்வீர்கள். உங்கள் சிந்தனைத் திறன் மேம்படும். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். சமூகத்தில் உங்கள் நிலை உயரும். நீண்டகாலமாகத் தீர்க்கப்படாமல் இருந்த ஒரு பிரச்சனைக்கு இன்று தீர்வு காண்பீர்கள். உங்கள் தன்னம்பிக்கை அதிகரிக்கும். குடும்பத்தில் ஒரு இனிமையான சூழல் நிலவும். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம். நல்ல உணவுப் பழக்கவழக்கங்கள் உங்கள் உடல்நலத்தைப் பாதுகாக்க உதவும். இன்று நீங்கள் எடுக்கும் அனைத்து முயற்சிகளும் நேர்மறையான விளைவுகளைத் தரும். பிறருடன் இணைந்து செயல்படுவது உங்களுக்கு நன்மைகளைத் தரும். உங்கள் பொறுமையான அணுகுமுறை பாராட்டுதலைப் பெறும். குடும்ப உறுப்பினர்களின் ஆதரவு உங்களுக்குப் பெரும் பலமாக இருக்கும். உங்கள் மனதில் உள்ள ஆசைகள் நிறைவேற வழி பிறக்கும். கலை மற்றும் இலக்கியத் துறைகளில் ஆர்வம் கொண்டவர்கள், தங்கள் திறமைகளை வெளிப்படுத்த ஒரு நல்ல வாய்ப்பைப் பெறுவார்கள். மாணவர்கள் கல்வியில் சிறந்து விளங்க கடினமாக உழைக்க வேண்டியது அவசியம், ஆனால் அதற்கான பலன் நிச்சயம் கிடைக்கும். புதிய தகவல்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். மூத்தவர்களின் ஆசீர்வாதத்தைப் பெறுவது உங்கள் முன்னேற்றத்திற்கு வழிவகுக்கும். கடந்த கால அனுபவங்களை மனதில் கொண்டு எதிர்கால திட்டங்களை வகுப்பீர்கள். சுற்றியுள்ளவர்களுடன் நல்லுறவைப் பேணுவீர்கள். எந்த ஒரு சூழ்நிலையையும் நேர்மறையாக அணுகுவதன் மூலம் நீங்கள் வெற்றியடைவீர்கள். உங்கள் இலக்குகளை நோக்கிச் செயல்படுவதற்கு இது ஒரு சிறந்த நாள். உங்களின் நேர்மையான அணுகுமுறை பாராட்டுதலைப் பெறும். சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். உங்கள் ஆற்றலை சரியான திசையில் பயன்படுத்துவதன் மூலம் பெரிய வெற்றிகளை அடைய முடியும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு தடங்கலையும் தாண்டி சாதனைகள் புரியலாம்.",
    "prediction_en": "Capricorn natives, today is a Sunday, a day when the Sun's dominance will further refine your patience and hard work. You will appear to be in deep thought today. You will plan every action meticulously. Your discipline and perseverance will benefit you today. Your father's advice will serve as a significant guide. His experiences will offer you new perspectives. It is good to act cautiously in financial matters today. A thorough review is essential before starting a new project. Your self-confidence will rise. You will maintain good relationships with friends. Your social standing will improve. Your patience will be a great strength for you today. You will face any challenge with a smile. A long-standing family issue that has remained unresolved might find a solution today. Confusion in your mind will clear, bringing clarity. You will find peace of mind by helping others. Spiritual thoughts will bring you mental tranquility. You may engage in activities like meditation or visiting temples. It is important to pay attention to your health. Proper eating habits will help protect your well-being. All your efforts today will yield positive results. New career opportunities may arise. You should develop your skills to take advantage of them. Do not hesitate to express your thoughts. Honest communication will improve relationships. You will learn from past mistakes and refine your future. Today, you will give great importance to your personal growth. Your unique talents will be recognized. The support of family and friends will be a great strength for you. If you act with confidence, you can easily overcome any difficult situation. Your integrity and hard work will certainly bring good results. Welcome a good day with enthusiasm and make the most of it. Act with determination towards your goals. It will generally be a pleasant day. You will see the results of your hard work today. You may have to take on a new responsibility at work, which you will execute skillfully. Your thinking ability will improve. You will show interest in learning new things. Your social standing will improve. You will find a solution to a long-standing problem today. Your self-confidence will increase. A pleasant atmosphere will prevail in the family. It is essential to pay attention to your health. Good dietary habits will help protect your well-being. All your efforts today will yield positive results. Working with others will bring you benefits. Your patient approach will receive appreciation. The support of family members will be a great strength for you. Ways will open for your heartfelt desires to be fulfilled. Those interested in arts and literature will get a good opportunity to showcase their talents. Students need to work hard to excel in their studies, but the results will certainly follow. You will show interest in learning new information. Receiving blessings from elders will pave the way for your progress. You will plan for the future by keeping past experiences in mind. You will maintain good relationships with those around you. By approaching every situation positively, you will achieve success. This is an excellent day to work towards your goals. Your honest approach will receive appreciation. You will be ready to face challenges. By directing your energy in the right direction, you can achieve great successes. If you act with self-confidence, you can overcome any obstacle and achieve accomplishments.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் விடாமுயற்சி பாராட்டப்படும். புதிய பொறுப்புகளை ஏற்க நேரிடலாம், அதனைத் திறம்பட செய்வீர்கள். உங்கள் திட்டமிடல் திறன் மேம்படும். மூத்த அதிகாரிகளின் வழிகாட்டுதல்கள் உங்களுக்குப் பயனுள்ளதாக அமையும். உங்கள் வேலைத் திறனை மேம்படுத்துவீர்கள்.",
    "career_en": "Your perseverance will be appreciated at work. You may have to take on new responsibilities, which you will execute skillfully. Your planning skills will improve. The guidance of senior officials will be beneficial to you. You will improve your work efficiency.",
    "finance_ta": "நிதி நிலைமை சீராக இருக்கும். புதிய முதலீடுகளைப் பற்றி சிந்திக்கும் முன் முழுமையான ஆய்வு அவசியம். தந்தையின் ஆலோசனை நிதி ஆதாயத்திற்கு வழிவகுக்கும். சேமிப்புக்கு முக்கியத்துவம் கொடுப்பீர்கள். தேவையற்ற செலவுகளைக் கட்டுப்படுத்துவீர்கள்.",
    "finance_en": "Financial situation will be stable. Thorough research is essential before considering new investments. Your father's advice will lead to financial gains. You will prioritize savings. You will control unnecessary expenses.",
    "health_ta": "ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும். நல்ல உணவுப் பழக்கங்கள் மற்றும் வழக்கமான உடற்பயிற்சிகளை மேற்கொள்ள வேண்டும். மன அமைதிக்கு தியானம் உதவும். போதிய ஓய்வு எடுப்பது உடல்நலத்திற்கு நல்லது. எலும்புகள் மற்றும் மூட்டுகளில் கவனம் தேவை.",
    "health_en": "Attention to health is needed. Good dietary habits and regular exercises should be followed. Meditation will help with mental peace. Getting adequate rest is good for physical health. Attention to bones and joints is required.",
    "lucky_number": "8",
    "lucky_color_ta": "கருப்பு",
    "lucky_color_en": "Black"
  },
  {
    "sign_ta": "கும்பம்",
    "sign_en": "Aquarius",
    "date": "15-02-2026",
    "prediction_ta": "கும்ப ராசி அன்பர்களே, இன்று ஞாயிற்றுக்கிழமை சூரியனின் ஆதிக்கம் உங்கள் புதுமையான சிந்தனைகளையும், சமூகப் பார்வையையும் ஊக்குவிக்கும் நாளாகும். நீங்கள் இன்று புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். சுறுசுறுப்புடன் செயல்படுவீர்கள். பலதரப்பட்ட மக்களுடன் உரையாடுவதற்கான வாய்ப்புகள் கிடைக்கும். உங்கள் கருத்துக்கள் தெளிவாகவும், உறுதியாகவும் இருக்கும். தந்தையின் வழிகாட்டுதல் உங்களுக்கு ஒரு புதிய திசையைக் காட்டும். அவரது அனுபவங்கள் உங்கள் முடிவுகளை எடுக்க உதவும். புதிய முயற்சிகளுக்கு இது ஒரு நல்ல நாள். உங்கள் தன்னம்பிக்கை அதிகரிக்கும். சமூகத்தில் உங்கள் தொடர்பு வட்டம் விரிவடையும். புதிய நண்பர்களைச் சந்திப்பீர்கள். சகோதர சகோதரிகளுடன் உறவு மேம்படும். நீண்டகாலமாகத் தடைபட்டிருந்த வேலைகள் இன்று நல்ல முடிவை எட்டும். உங்கள் பேச்சாற்றல் பலரையும் கவரும். எந்த ஒரு சூழ்நிலையையும் உங்கள் அறிவுத்திறனால் சமாளிப்பீர்கள். மனதில் ஒருவித உற்சாகமும், புத்துணர்ச்சியும் நிறைந்திருக்கும். ஆன்மீகச் சிந்தனைகள் மன அமைதியைத் தரும். தியானம், யோகா போன்ற பயிற்சிகளில் ஈடுபடுவது நல்லது. உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும். சரியான நேரத்தில் உணவை உட்கொண்டு, போதிய ஓய்வு எடுப்பது அவசியம். எந்த ஒரு சவாலையும் நேர்மறையாக அணுகுவதன் மூலம் நீங்கள் வெற்றியடைவீர்கள். கலை மற்றும் இலக்கியத் துறைகளில் ஆர்வம் கொண்டவர்கள் தங்கள் திறமைகளை வெளிப்படுத்த ஒரு நல்ல வாய்ப்பைப் பெறுவார்கள். மாணவர்கள் கல்வியில் சிறந்து விளங்க கடினமாக உழைக்க வேண்டியது அவசியம், அதற்கான பலன் நிச்சயம் கிடைக்கும். புதிய தகவல்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். மூத்தவர்களின் ஆசீர்வாதத்தைப் பெறுவது உங்கள் முன்னேற்றத்திற்கு வழிவகுக்கும். கடந்த கால அனுபவங்களை மனதில் கொண்டு எதிர்கால திட்டங்களை வகுப்பீர்கள். சுற்றியுள்ளவர்களுடன் நல்லுறவைப் பேணுவீர்கள். எந்த ஒரு சூழ்நிலையையும் நேர்மறையாக அணுகுவதன் மூலம் நீங்கள் வெற்றியடைவீர்கள். உங்கள் இலக்குகளை நோக்கிச் செயல்படுவதற்கு இது ஒரு சிறந்த நாள். உங்களின் நேர்மையான அணுகுமுறை பாராட்டுதலைப் பெறும். சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். உங்கள் ஆற்றலை சரியான திசையில் பயன்படுத்துவதன் மூலம் பெரிய வெற்றிகளை அடைய முடியும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு தடங்கலையும் தாண்டி சாதனைகள் புரியலாம். உடல் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம், சரியான நேரத்தில் உணவு உட்கொண்டு போதிய ஓய்வு எடுப்பதன் மூலம் உங்கள் ஆற்றல் அதிகரிக்கும். இன்று நீங்கள் செய்யும் ஒவ்வொரு செயலும் நேர்மறையான விளைவுகளைத் தரும். ஒரு நீண்ட கால முதலீட்டைப் பற்றி சிந்திப்பதற்கான நல்ல நாள் இது. சமூக நலப் பணிகளில் ஈடுபடுவது மனநிறைவைத் தரும். பிறருக்கு உதவுவதில் மகிழ்ச்சி காண்பீர்கள். உங்கள் தலைமைப் பண்புகள் இன்று வெளிப்படும், அதனைச் சரியாகப் பயன்படுத்துவீர்கள். எந்த ஒரு வேலையையும் தள்ளிப் போடாமல் உடனடியாகச் செய்வதற்கான உத்வேகம் கிடைக்கும். உங்கள் ஆளுமைத் திறன் மெருகேறும். தைரியத்துடனும், தன்னம்பிக்கையுடனும் செயல்படுவதன் மூலம் இன்று உங்களுக்கு சிறப்பான வெற்றிகள் காத்திருக்கின்றன. புதிய உறவுகள் உருவாகலாம் அல்லது பழைய உறவுகள் புதுப்பிக்கப்படலாம். ஒரு முக்கிய முடிவை எடுப்பதற்கான நல்ல நாள் இது. குடும்பத்தில் மகிழ்ச்சியும், நல்லிணக்கமும் நிறைந்திருக்கும். உங்கள் எண்ணங்களை வெளிப்படையாகப் பகிர்ந்து கொள்வதன் மூலம் உறவுகள் மேம்படும். உங்கள் படைப்புத் திறன்கள் வெளிப்படும். பொதுவாக, இன்று உங்களுக்கு மிகவும் சாதகமான மற்றும் பலனளிக்கும் ஒரு நாளாக அமையும். உங்கள் கனவுகளை நனவாக்க ஒரு நல்ல வாய்ப்பு கிடைக்கும்.",
    "prediction_en": "Aquarius natives, today is a Sunday, a day when the Sun's dominance will encourage your innovative thinking and social vision. You will show interest in learning new things today. You will act with agility. Opportunities to interact with various people will arise. Your opinions will be clear and firm. Your father's guidance will show you a new direction. His experiences will help you make decisions. This is a good day for new ventures. Your self-confidence will increase. Your social network will expand, and you will meet new friends. Relationships with siblings will improve. Tasks that have been long delayed will reach a good conclusion today. Your eloquence will attract many. You will handle any situation with your intelligence. A sense of enthusiasm and freshness will fill your mind. Spiritual thoughts will bring peace of mind. Engaging in practices like meditation and yoga is beneficial. You must pay attention to your health. It is essential to eat on time and get adequate rest. You will succeed by approaching any challenge positively. Those interested in arts and literature will get a good opportunity to showcase their talents. Students need to work hard to excel in their studies, and the results will certainly follow. You will show interest in learning new information. Receiving blessings from elders will pave the way for your progress. You will plan for the future by keeping past experiences in mind. You will maintain good relationships with those around you. By approaching every situation positively, you will achieve success. This is an excellent day to work towards your goals. Your honest approach will receive appreciation. You will be ready to face challenges. By directing your energy in the right direction, you can achieve great successes. If you act with self-confidence, you can overcome any obstacle and achieve accomplishments. It is essential to pay attention to your physical health; by eating on time and getting adequate rest, your energy will increase. Every action you take today will yield positive results. This is a good day to think about a long-term investment. Engaging in social welfare activities will bring mental satisfaction. You will find joy in helping others. Your leadership qualities will manifest today, and you will use them appropriately. You will gain the motivation to complete tasks immediately without procrastination. Your personality will be refined. By acting with courage and self-confidence, special successes await you today. New relationships may form, or old relationships may be rekindled. This is a good day to make an important decision. Happiness and harmony will fill your family. Relationships will improve by openly sharing your thoughts. Your creative abilities will shine. Generally, today will be a very favorable and rewarding day for you. You will get a good opportunity to realize your dreams.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் புதுமையான சிந்தனைகள் பாராட்டப்படும். குழு விவாதங்களில் உங்கள் பங்கு முக்கியத்துவம் பெறும். புதிய திட்டங்களில் பங்கேற்க வாய்ப்புகள் கிடைக்கும். சக ஊழியர்களுடன் நல்ல புரிதல் ஏற்படும். உங்கள் அறிவுத்திறன் பாராட்டுதலைப் பெறும்.",
    "career_en": "Your innovative ideas will be appreciated at work. Your participation in group discussions will be important. Opportunities to participate in new projects will arise. Good understanding with colleagues will develop. Your intelligence will receive appreciation.",
    "finance_ta": "நிதி விஷயங்களில் தெளிவான முடிவுகளை எடுப்பீர்கள். சிறு முதலீடுகள் லாபம் தரும். எதிர்காலத்திற்கான நிதி திட்டங்களை வகுக்க இது ஒரு நல்ல நாள். தந்தையின் நிதி ஆலோசனைகள் உங்களுக்குப் பயனுள்ளதாக அமையும். தேவையற்ற செலவுகளைக் கட்டுப்படுத்துவீர்கள்.",
    "finance_en": "You will make clear decisions in financial matters. Small investments will yield profit. This is a good day to formulate financial plans for the future. Your father's financial advice will be useful to you. You will control unnecessary expenses.",
    "health_ta": "ஆரோக்கியத்தில் கவனம் செலுத்த வேண்டும். மன அழுத்தம் தவிர்க்க தியானம், யோகா போன்ற பயிற்சிகளை மேற்கொள்ளலாம். நல்ல உணவுப் பழக்கம் மற்றும் போதிய உறக்கம் அவசியம். உடல் ஆரோக்கியம் மேம்படும்.",
    "health_en": "Attention to health is needed. To avoid stress, you can practice meditation and yoga. Good dietary habits and adequate sleep are essential. Physical health will improve.",
    "lucky_number": "4",
    "lucky_color_ta": "வானநீலம்",
    "lucky_color_en": "Sky Blue"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "15-02-2026",
    "prediction_ta": "மீன ராசி அன்பர்களே, இன்று ஞாயிற்றுக்கிழமை சூரியனின் ஆதிக்கம் உங்கள் உள்ளுணர்வையும், கருணையையும் மேம்படுத்தும் நாளாகும். நீங்கள் இன்று சற்று அமைதியாகவும், நிதானமாகவும் செயல்படுவீர்கள். உங்கள் உள்ளுணர்வு மேலோங்கும். எந்த ஒரு செயலையும் ஆராய்ந்து செயல்படும் குணம் இன்று உங்களுக்குப் பலன் தரும். குடும்பத்தில் தந்தையின் ஆலோசனைகள் உங்களுக்குப் பெரும் வழிகாட்டியாக அமையும். அவரது அனுபவங்கள் உங்களுக்கு புதிய கண்ணோட்டங்களைத் தரும். நிதி விஷயங்களில் இன்று கவனமாகச் செயல்படுவது நல்லது. ஒரு புதிய திட்டத்தைத் தொடங்கும் முன் முழுமையாக ஆய்வு செய்வது அவசியம். கலை மற்றும் அழகு சார்ந்த விஷயங்களில் உங்கள் ஆர்வம் அதிகரிக்கும். வீட்டில் ஒரு புதிய அலங்காரப் பொருளை வாங்கலாம். உங்கள் தன்னம்பிக்கை உயரும். நண்பர்களுடன் நல்லுறவு பேணுவீர்கள். சமூகத்தில் உங்கள் நிலை உயரும். உங்களின் பொறுமை இன்று உங்களுக்குப் பெரும் பலமாக இருக்கும். எந்த ஒரு சவாலையும் புன்னகையுடன் எதிர்கொள்வீர்கள். நீண்டகாலமாகத் தீர்க்கப்படாமல் இருந்த ஒரு குடும்பப் பிரச்சனைக்கு இன்று தீர்வு காணப்படலாம். உங்கள் மனதில் இருந்த குழப்பங்கள் நீங்கி தெளிவு பிறக்கும். பிறருக்கு உதவுவதன் மூலம் நீங்கள் மன நிம்மதி அடைவீர்கள். ஆன்மீகச் சிந்தனைகள் உங்களுக்கு மன அமைதியைத் தரும். தியானம் செய்வது அல்லது ஆலயங்களுக்குச் செல்வது போன்ற செயல்களில் ஈடுபடலாம். உங்கள் ஆரோக்கியத்தில் கவனம் செலுத்துவது அவசியம். சரியான உணவுப் பழக்கவழக்கங்கள் உங்கள் உடல்நலத்தைப் பாதுகாக்க உதவும். இன்று நீங்கள் எடுக்கும் அனைத்து முயற்சிகளும் நேர்மறையான விளைவுகளைத் தரும். புதிய தொழில் வாய்ப்புகள் உருவாகலாம். அதனைப் பயன்படுத்திக்கொள்ள உங்கள் திறமைகளை வளர்த்துக்கொள்ள வேண்டும். உங்கள் எண்ணங்களை வெளிப்படுத்துவதில் தயக்கம் வேண்டாம். நேர்மையான உரையாடல் உறவுகளை மேம்படுத்தும். கடந்த கால தவறுகளில் இருந்து பாடம் கற்றுக்கொண்டு, எதிர்காலத்தை செம்மைப்படுத்துவீர்கள். இன்று நீங்கள் உங்கள் தனிப்பட்ட வளர்ச்சிக்கு அதிக முக்கியத்துவம் கொடுப்பீர்கள். உங்களின் தனித்திறமைகள் அங்கீகரிக்கப்படும். குடும்பத்தினர் மற்றும் நண்பர்களின் ஆதரவு உங்களுக்குப் பெரும் பலமாக அமையும். மனதில் நம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு கடினமான சூழ்நிலையையும் எளிதில் கடக்க முடியும். உங்களின் நேர்மும், உழைப்பும் நிச்சயம் நல்ல பலன்களைத் தரும். ஒரு நல்ல நாளை உற்சாகத்துடன் வரவேற்று, அதனை முழுமையாகப் பயன்படுத்துங்கள். உங்கள் இலக்குகளை நோக்கி உறுதியுடன் செயல்படுங்கள். பொதுவான ஒரு இனிமையான நாளாக அமையும். உங்கள் உள்ளுணர்வு இன்று உங்களுக்குச் சரியான வழியைக் காட்டும். எந்த ஒரு செயலையும் தொடங்கும் முன் அதன் சாதக பாதகங்களை ஆராய்வது நல்லது. பிறருடன் இணைந்து செயல்படுவது உங்களுக்கு நன்மைகளைத் தரும். உங்கள் பொறுமையான அணுகுமுறை பாராட்டுதலைப் பெறும். குடும்ப உறுப்பினர்களின் ஆதரவு உங்களுக்குப் பெரும் பலமாக இருக்கும். உங்கள் மனதில் உள்ள ஆசைகள் நிறைவேற வழி பிறக்கும். கலை மற்றும் இலக்கியத் துறைகளில் ஆர்வம் கொண்டவர்கள், தங்கள் திறமைகளை வெளிப்படுத்த ஒரு நல்ல வாய்ப்பைப் பெறுவார்கள். மாணவர்கள் கல்வியில் சிறந்து விளங்க கடினமாக உழைக்க வேண்டியது அவசியம், ஆனால் அதற்கான பலன் நிச்சயம் கிடைக்கும். புதிய தகவல்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். மூத்தவர்களின் ஆசீர்வாதத்தைப் பெறுவது உங்கள் முன்னேற்றத்திற்கு வழிவகுக்கும். கடந்த கால அனுபவங்களை மனதில் கொண்டு எதிர்கால திட்டங்களை வகுப்பீர்கள். சுற்றியுள்ளவர்களுடன் நல்லுறவைப் பேணுவீர்கள். எந்த ஒரு சூழ்நிலையையும் நேர்மறையாக அணுகுவதன் மூலம் நீங்கள் வெற்றியடைவீர்கள். உங்கள் இலக்குகளை நோக்கிச் செயல்படுவதற்கு இது ஒரு சிறந்த நாள். உங்களின் நேர்மையான அணுகுமுறை பாராட்டுதலைப் பெறும். சவால்களை எதிர்கொள்ள நீங்கள் தயாராக இருப்பீர்கள். உங்கள் ஆற்றலை சரியான திசையில் பயன்படுத்துவதன் மூலம் பெரிய வெற்றிகளை அடைய முடியும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு தடங்கலையும் தாண்டி சாதனைகள் புரியலாம்.",
    "prediction_en": "Pisces natives, today is a Sunday, a day when the Sun's dominance will enhance your intuition and compassion. You will act with a certain calmness and composure today. Your intuition will be strong. Your tendency to thoroughly analyze any action before proceeding will benefit you today. In family matters, your father's advice will serve as a significant guide. His experiences will offer you new perspectives. It is good to act cautiously in financial matters today. A thorough review is essential before starting a new project. Your interest in arts and beauty-related matters will increase. You might buy a new decorative item for your home. Your self-confidence will rise. You will maintain good relationships with friends. Your social standing will improve. Your patience will be a great strength for you today. You will face any challenge with a smile. A long-standing family issue that has remained unresolved might find a solution today. Confusion in your mind will clear, bringing clarity. You will find peace of mind by helping others. Spiritual thoughts will bring you mental tranquility. You may engage in activities like meditation or visiting temples. It is important to pay attention to your health. Proper eating habits will help protect your well-being. All your efforts today will yield positive results. New career opportunities may arise. You should develop your skills to take advantage of them. Do not hesitate to express your thoughts. Honest communication will improve relationships. You will learn from past mistakes and refine your future. Today, you will give great importance to your personal growth. Your unique talents will be recognized. The support of family and friends will be a great strength for you. If you act with confidence, you can easily overcome any difficult situation. Your integrity and hard work will certainly bring good results. Welcome a good day with enthusiasm and make the most of it. Act with determination towards your goals. It will generally be a pleasant day. Your intuition will guide you correctly today. It is good to analyze the pros and cons of any action before starting it. Working with others will bring you benefits. Your patient approach will receive appreciation. The support of family members will be a great strength for you. Ways will open for your heartfelt desires to be fulfilled. Those interested in arts and literature will get a good opportunity to showcase their talents. Students need to work hard to excel in their studies, but the results will certainly follow. You will show interest in learning new information. Receiving blessings from elders will pave the way for your progress. You will plan for the future by keeping past experiences in mind. You will maintain good relationships with those around you. By approaching every situation positively, you will achieve success. This is an excellent day to work towards your goals. Your honest approach will receive appreciation. You will be ready to face challenges. By directing your energy in the right direction, you can achieve great successes. If you act with self-confidence, you can overcome any obstacle and achieve accomplishments.",
    "career_ta": "வேலை செய்யும் இடத்தில் உங்கள் படைப்பாற்றல் பாராட்டப்படும். புதிய திட்டங்களில் பங்கேற்க வாய்ப்புகள் கிடைக்கும். உங்கள் கருத்துக்கள் ஏற்கப்பட்டு பாராட்டுதலைப் பெறும். சக ஊழியர்களுடன் நல்லுறவு நீடிக்கும். உங்கள் பணிகள் குறித்த தெளிவும், நேர்மையும் உங்களுக்கு அங்கீகாரத்தைப் பெற்றுத்தரும்.",
    "career_en": "Your creativity will be appreciated at work. Opportunities to participate in new projects will arise. Your ideas will be accepted and praised. Good relationships with colleagues will continue. Your clarity and integrity in tasks will bring you recognition.",
    "finance_ta": "நிதி நிலைமை சீராக இருக்கும். புதிய வருவாய் ஆதாரங்கள் உருவாகலாம். சேமிப்பு அதிகரிக்கும். தந்தையின் ஆலோசனை நிதி ஆதாயத்திற்கு வழிவகுக்கும். நீண்டகால முதலீடுகளைப் பற்றி சிந்திப்பதற்கான நல்ல நாள் இது. தேவையற்ற செலவுகளைக் கட்டுப்படுத்துவீர்கள்.",
    "finance_en": "Financial situation will be excellent. New sources of income may emerge. Savings will increase. Your father's advice will lead to financial gains. This is a good day to think about long-term investments. You will control unnecessary expenses.",
    "health_ta": "உடல் ஆரோக்கியம் மேம்படும். புத்துணர்ச்சியுடன் செயல்படுவீர்கள். மன அமைதி மேம்படும். நல்ல உணவுப் பழக்கவழக்கங்கள் ஆரோக்கியத்தைப் பாதுகாக்கும். தியானம் மற்றும் மூச்சுப் பயிற்சிகள் மனதை அமைதிப்படுத்தும். நீர்ச்சத்து நிறைந்த உணவுகளை உட்கொள்வது முக்கியம்.",
    "health_en": "Physical health will improve. You will act with renewed energy. Mental peace will improve. Good dietary habits will protect your health. Meditation and breathing exercises will calm the mind. Consuming hydrating foods is important.",
    "lucky_number": "7",
    "lucky_color_ta": "மெரூன்",
    "lucky_color_en": "Maroon"
  }
]
