[
 {
  "sign_ta": "மேஷம்",
  "sign_en": "Aries",
  "date": "19-02-2026",
  "prediction_ta": "இன்று வியாழக்கிழமை, குரு பகவானின் அருள் மேலோங்கி நிற்கும் ஒரு பொன்னாள். மேஷ ராசிக்காரர்களே, உங்கள் இயல்பான துணிச்சலும், வீரியமும் இன்று ஞானத்தின் ஒளியால் பிரகாசிக்கும். எந்த ஒரு செயலிலும் நீங்கள் எடுக்கும் புதிய முயற்சிகள் குரு பகவானின் துணையுடன் வெற்றியை நோக்கிய பயணமாக மாறும். உங்கள் மனதில் ஆழ்ந்த தெளிவும், விரிவான சிந்தனை ஓட்டமும் இன்று குடிகொண்டிருக்கும். உங்களின் தலைமைப் பண்பு இன்று மிகச்சிறந்த முறையில் வெளிப்படும். பல சூழ்நிலைகளில் நீங்கள் முன்னின்று வழிநடத்தும் அரிய வாய்ப்புகள் உங்களுக்குக் கிடைக்கும். இதனால், உங்கள் சமூக வட்டத்திலும், பணியிடத்திலும் ஒரு மரியாதைக்குரிய இடத்தைப் பெறுவீர்கள். புதிய அறிவைப் பெறுவதிலும், உங்களை மேம்படுத்திக் கொள்வதிலும் மிகுந்த ஆர்வம் காட்டுவீர்கள். ஆன்மிகக் கருத்துக்களிலும், தத்துவ விசாரணைகளிலும் ஈடுபடுவீர்கள். சிலருக்கு உயர் கல்விக்கான வழிகள் இன்று தெளிவாகத் தெரியும். அது தொடர்பான புதிய வாய்ப்புகளும் தேடி வரும். இதுவரை நீங்கள் எடுக்கத் தயங்கிய முக்கியமான முடிவுகளை இன்று முழு நம்பிக்கையுடனும், விவேகத்துடனும் எடுப்பீர்கள். அத்தகைய முடிவுகள் உங்களுக்கு நீண்டகாலத்திற்கு நன்மை பயப்பவையாக அமையும். குடும்ப உறவுகளில் அன்பும், ஆதரவும் அதிகரிக்கும். குறிப்பாக, உங்கள் குடும்பத்தில் உள்ள மூத்தவர்களிடமிருந்து மதிப்புமிக்க ஆலோசனைகளையும், வழிகாட்டுதலையும் பெறுவீர்கள். அவர்களின் அனுபவ ஞானம் உங்களுக்கு ஒரு கலங்கரை விளக்கமாக அமையும். உங்கள் மனதில் அமைதியும், ஆனந்தமும் நிறைந்திருக்கும். பழைய நண்பர்களுடன் மீண்டும் இணைவதற்கான வாய்ப்புகள் ஏற்படும், அது உங்களுக்கு மனநிறைவைத் தரும். புதிய நண்பர்களின் அறிமுகம் உங்களுக்கு நன்மை பயக்கும். சமுதாய நலனில் நீங்கள் இன்று அதிக அக்கறை செலுத்துவீர்கள். தொண்டு நிறுவனங்களுக்கு உதவுவதிலும், சமூகப் பணிகளிலும் உங்களை ஈடுபடுத்திக் கொள்வீர்கள். இது உங்களுக்கு ஆன்ம திருப்தியையும், மன நிம்மதியையும் தரும். இன்று நீங்கள் மேற்கொள்ளும் பயணங்கள், குறிப்பாக அறிவுசார் தேடல்களுக்கான பயணங்கள், உங்களுக்குப் புதிய அனுபவங்களையும், அரிய தகவல்களையும் வழங்கும். அது உங்கள் அறிவை விரிவுபடுத்தும். எதிர்காலத்திற்கான திட்டமிடல்களை மேற்கொள்வதற்கும், நீண்டகால இலக்குகளை வகுப்பதற்கும் இது ஒரு மிகச் சிறந்த நாளாகும். உங்கள் இலக்குகளை அடைவதற்கான தெளிவான பாதையை இன்று நீங்கள் காண்பீர்கள். உங்களின் நேர்மறை எண்ணங்களும், நம்பிக்கையான அணுகுமுறையும் இன்று பல நல்ல வாய்ப்புகளை உங்களிடம் கொண்டு சேர்க்கும். ஆரோக்கியத்தில் சிறப்பு கவனம் செலுத்துவீர்கள். உடற்பயிற்சிகளையும், ஆழ்ந்த தியானப் பயிற்சிகளையும் மேற்கொள்வதன் மூலம் உங்கள் உடல் நலத்தையும், மன நலத்தையும் மேம்படுத்துவீர்கள். சவால்கள் எது வந்தாலும், அதனை மிகுந்த நம்பிக்கையுடன் எதிர்கொள்வீர்கள். எந்த ஒரு கடினமான சூழ்நிலையையும் உங்களுக்குச் சாதகமாக மாற்றும் அசாத்திய திறமை உங்களுக்கு உண்டு என்பதை இன்று உணர்வீர்கள். உங்களின் செயல் திறனும், விவேகமும் இன்று பலராலும் பாராட்டப்படும். உங்களுடைய அனுபவங்களையும், கற்றுக்கொண்ட பாடங்களையும் மற்றவர்களுடன் பகிர்வதன் மூலம் அவர்களுக்கும் நீங்கள் ஒரு வழிகாட்டியாக அமைவீர்கள். சமூக ஊடகங்களில் நீங்கள் பகிரும் கருத்துகள் நல்ல வரவேற்பைப் பெறும். குடும்பத்தினருடன் மகிழ்ச்சியான தருணங்களை கழிப்பீர்கள். குழந்தைகளின் கல்வி வளர்ச்சிக்கு உறுதுணையாக இருப்பீர்கள். அவர்களின் மறைந்திருக்கும் திறமைகளை அடையாளம் கண்டு, அவற்றை வளர்ப்பதற்கு உற்சாகம் அளிப்பீர்கள். இன்று நீங்கள் எடுக்கும் ஒவ்வொரு முயற்சியும் வெற்றியை நோக்கிய பயணமாக அமையும். குரு பகவானின் அருளும், உங்கள் உழைப்பும் உங்களை வெற்றிப் பாதைக்கு அழைத்துச் செல்லும். நம்பிக்கையுடன் செயல்படுங்கள், பிரகாசமான எதிர்காலம் உங்களுக்குக் காத்திருக்கிறது.",
  "prediction_en": "Today is Thursday, a golden day graced by the benevolent influence of Jupiter. Aries natives, your natural courage and vigor will shine brightly today with the light of wisdom. Any new endeavors you undertake will, with Jupiter's support, transform into a journey towards success. A deep clarity and expansive thought process will reside in your mind today. Your leadership qualities will manifest in an excellent manner. You will receive valuable opportunities to lead from the front in many situations. Consequently, you will attain a respectable position in your social circle and workplace. You will show great interest in acquiring new knowledge and enhancing yourself. You will engage in spiritual thoughts and philosophical inquiries. For some, paths to higher education will become clear today, and related new opportunities will come your way. Important decisions that you hesitated to make until now will be taken today with full confidence and prudence. Such decisions will prove beneficial to you in the long run. Love and support will increase in family relationships. Specifically, you will receive valuable advice and guidance from the elders in your family. Their experiential wisdom will serve as a beacon for you. Your mind will be filled with peace and joy. Opportunities to reconnect with old friends may arise, bringing you contentment. The introduction of new friends will prove beneficial. You will show greater concern for social welfare today. You will involve yourself in helping charitable organizations and participating in social work. This will bring you spiritual satisfaction and mental peace. Journeys you undertake today, particularly those for intellectual pursuits, will provide you with new experiences and rare information, expanding your knowledge. This is an excellent day for making future plans and setting long-term goals. You will see a clear path to achieving your objectives today. Your positive thoughts and confident approach will bring many good opportunities to you. You will pay special attention to your health. By practicing physical exercises and deep meditation, you will improve both your physical and mental well-being. No matter what challenges arise, you will face them with immense confidence. Today, you will realize that you possess an extraordinary ability to turn any difficult situation to your advantage. Your efficiency and wisdom will be appreciated by many. By sharing your experiences and learned lessons with others, you will also serve as a guide for them. Your opinions shared on social media will receive a good reception. You will spend joyful moments with family members. You will be supportive of your children's educational growth. You will identify their hidden talents and encourage them to develop them. Every effort you make today will be a journey towards success. The grace of Jupiter and your hard work will lead you on the path to victory. Act with confidence, a bright future awaits you.",
  "career_ta": "பணியிடத்தில் புதிய பொறுப்புகள் தேடி வரும். உங்கள் தலைமைப் பண்பு பாராட்டப்படும். திட்டமிட்டு செயல்படுவதன் மூலம் அசைக்க முடியாத வெற்றிகளைப் பெறுவீர்கள். புதிய தொழில் வாய்ப்புகளும், உயர்வுகளும் உண்டாகும்.",
  "career_en": "New responsibilities will come your way at work. Your leadership qualities will be appreciated. By acting with a plan, you will achieve unwavering success. New business opportunities and promotions will arise.",
  "finance_ta": "நிதிநிலை மேம்படும். சேமிப்பு அதிகரிப்பதற்கான வாய்ப்புகள் உண்டு. ஞானமான முதலீடுகளின் மூலம் ஆதாயம் காண்பீர்கள். எதிர்பாராத பண வரவும் இன்று சாத்தியம்.",
  "finance_en": "Financial status will improve. Opportunities for increased savings exist. You will gain profit through wise investments. Unexpected monetary gains are also possible today.",
  "health_ta": "ஆரோக்கியத்தில் உற்சாகம் நிறைந்திருக்கும். யோகா மற்றும் தியானம் மேற்கொள்வதன் மூலம் மன அமைதியைப் பெறுவீர்கள். சீரான உணவுப் பழக்கம் ஆரோக்கியத்தை மேம்படுத்தும்.",
  "health_en": "You will feel energetic in terms of health. You will attain mental peace by practicing yoga and meditation. A balanced diet will enhance your well-being.",
  "lucky_number": "9",
  "lucky_color_ta": "சிவப்பு",
  "lucky_color_en": "Red"
 },
 {
  "sign_ta": "ரிஷபம்",
  "sign_en": "Taurus",
  "date": "19-02-2026",
  "prediction_ta": "இன்று வியாழக்கிழமை, குரு பகவானின் ஆதிக்கம் நிறைந்த நாள், ரிஷப ராசிக்காரர்களே. உங்கள் உறுதியான மனப்பான்மையும், விடாமுயற்சியும் இன்று குருவின் அருளால் மேலும் வலுப்பெறும். உங்களின் உழைப்பிற்கு ஏற்ற பலன்களை இன்று நீங்கள் முழுமையாகப் பெறுவீர்கள். நிதி சம்பந்தப்பட்ட விஷயங்களில் ஒரு தெளிவான அணுகுமுறையை மேற்கொள்வீர்கள். உங்கள் மனதில் அமைதியும், நேர்மறையான சிந்தனைகளும் மேலோங்கும். குடும்ப உறவுகளில் இணக்கமும், அன்பும் அதிகரிக்கும். குறிப்பாக, குடும்ப உறுப்பினர்களின் ஆதரவும், ஒத்துழைப்பும் உங்களுக்கு மன நிறைவைத் தரும். புதிய முதலீடுகளை மேற்கொள்வதற்கும், நீண்டகாலத் திட்டங்களை வகுப்பதற்கும் இது ஒரு உகந்த நாளாகும். உங்கள் அனுபவ அறிவைப் பயன்படுத்தி சரியான முடிவுகளை எடுப்பீர்கள். சொத்து சம்பந்தப்பட்ட விஷயங்களில் சாதகமான முடிவுகள் கிடைக்கும். உங்களின் கலைத்திறனும், ரசனை உணர்வும் இன்று மேம்படும். அழகு கலைகள், இசை, ஓவியம் போன்ற துறைகளில் ஆர்வம் காட்டுவீர்கள். அது உங்களுக்கு மன அமைதியையும், புத்துணர்வையும் அளிக்கும். பணியிடத்தில் உங்களின் பொறுப்புணர்வும், அர்ப்பணிப்பும் பாராட்டப்படும். புதிய பொறுப்புகள் அல்லது பதவிகள் தேடி வரும். சக ஊழியர்களுடன் நல்லுறவு பேணுவீர்கள். கூட்டு முயற்சிகள் வெற்றியைத் தரும். உங்கள் இலக்குகளை அடைவதற்கான தெளிவான பாதையை இன்று நீங்கள் காண்பீர்கள். எதிர்காலத்திற்கான திட்டமிடல்களை மேற்கொள்வதற்கு இது ஒரு மிகச் சிறந்த நாளாகும். ஆன்மிக நாட்டமும், தர்ம சிந்தனைகளும் இன்று அதிகரிக்கும். பெரியோர்களின் ஆலோசனைகளை ஏற்று செயல்படுவீர்கள். அது உங்களுக்கு மேலும் நன்மைகளைத் தரும். சமூகத்தில் உங்கள் மதிப்பு உயரும். தொண்டு நிறுவனங்களுக்கு உதவுவதிலும், பிறருக்கு நன்மைகளைச் செய்வதிலும் ஆர்வம் காட்டுவீர்கள். இது உங்களுக்கு ஆன்ம திருப்தியையும், மன நிம்மதியையும் தரும். கல்வித் துறையில் உள்ளவர்களுக்கு புதிய வாய்ப்புகளும், வெற்றிகளும் உண்டாகும். ஆராய்ச்சி மாணவர்களுக்கு இன்று புதிய சிந்தனைகள் உதயமாகும். வெளிநாட்டுப் பயணங்களுக்கான வாய்ப்புகள் ஏற்படும். அது உங்கள் அறிவை விரிவுபடுத்தும். ஆரோக்கியத்தில் நல்ல முன்னேற்றம் காணப்படும். உணவு முறைகளில் கவனம் செலுத்துவீர்கள். உடற்பயிற்சிகளை மேற்கொள்வதன் மூலம் உடல் நலத்தை மேம்படுத்துவீர்கள். மன அமைதியுடன் செயல்படுவீர்கள். புதிய நட்பு வட்டங்கள் உங்களுக்கு நன்மை பயக்கும். அவர்களின் மூலம் புதிய சிந்தனைகளையும், தகவல்களையும் பெறுவீர்கள். குடும்பத்தினருடன் மகிழ்ச்சியான தருணங்களை கழிப்பீர்கள். குழந்தைகளின் கல்வி வளர்ச்சிக்கு உறுதுணையாக இருப்பீர்கள். அவர்களின் திறமைகளை அடையாளம் கண்டு ஊக்குவிப்பீர்கள். இன்று நீங்கள் எடுக்கும் ஒவ்வொரு முயற்சியும் வெற்றியை நோக்கிய பயணமாக அமையும். குரு பகவானின் அருளும், உங்கள் உழைப்பும் உங்களை வெற்றிப் பாதைக்கு அழைத்துச் செல்லும். நம்பிக்கையுடன் செயல்படுங்கள், பிரகாசமான எதிர்காலம் உங்களுக்குக் காத்திருக்கிறது.",
  "prediction_en": "Today is Thursday, a day imbued with the benevolent influence of Jupiter for Taurus natives. Your steadfast resolve and perseverance will be further strengthened today by Jupiter's grace. You will fully reap the rewards commensurate with your hard work. You will adopt a clear approach in financial matters. Peace of mind and positive thoughts will prevail. Harmony and love will increase in family relationships. Specifically, the support and cooperation of family members will bring you great satisfaction. This is an auspicious day for making new investments and formulating long-term plans. You will make sound decisions using your experiential knowledge. Favorable outcomes will be achieved in matters related to property. Your artistic talents and aesthetic sense will improve today. You will show interest in fine arts, music, and painting, which will bring you mental peace and rejuvenation. At your workplace, your sense of responsibility and dedication will be appreciated. New responsibilities or positions may come your way. You will maintain good relationships with colleagues. Joint ventures will bring success. Today you will see a clear path to achieving your goals. This is an excellent day for future planning. Spiritual inclination and charitable thoughts will increase today. You will accept and act upon the advice of elders, which will bring you further benefits. Your social standing will rise. You will show interest in helping charitable organizations and doing good for others. Those in the field of education will find new opportunities and successes. Research students will experience new ideas today. Opportunities for foreign travel may arise, which will expand your knowledge. Good progress will be seen in health. You will pay attention to your diet. You will improve your physical health by engaging in exercises. You will act with peace of mind. New social circles will benefit you, through which you will gain new ideas and information. You will spend joyful moments with family members. You will be supportive of your children's educational growth. You will identify their hidden talents and encourage them. Every effort you make today will be a journey towards success. The grace of Jupiter and your hard work will lead you on the path to victory. Act with confidence, a bright future awaits you.",
  "career_ta": "உங்கள் கடின உழைப்பிற்கு அங்கீகாரம் கிடைக்கும். புதிய திட்டங்களுக்கு தலைமையேற்கும் வாய்ப்புகள் ஏற்படும். உயர் அதிகாரிகளின் ஆதரவு பெற்று, தொழிலில் முன்னேற்றம் காண்பீர்கள்.",
  "career_en": "Your hard work will be recognized. Opportunities to lead new projects will arise. You will gain support from higher authorities and achieve progress in your career.",
  "finance_ta": "நிதி நிர்வாகத்தில் திறம்பட செயல்படுவீர்கள். சேமிப்பை அதிகரிக்க வழி வகுப்பீர்கள். எதிர்பாராத லாபங்கள் கிடைக்க வாய்ப்புள்ளது. நீண்டகால முதலீடுகள் சிறந்த பலன் தரும்.",
  "finance_en": "You will manage your finances effectively. You will pave the way for increased savings. There is a possibility of unexpected gains. Long-term investments will yield excellent results.",
  "health_ta": "ஆரோக்கியத்தில் நல்ல முன்னேற்றம் காணப்படும். மன அமைதிக்கு வழி வகுக்கும் தியானப் பயிற்சிகளை மேற்கொள்வீர்கள். உடலின் சீரான இயக்கத்திற்கு கவனம் செலுத்துவீர்கள்.",
  "health_en": "Good progress will be seen in health. You will engage in meditation practices that lead to mental peace. You will pay attention to the smooth functioning of your body.",
  "lucky_number": "6",
  "lucky_color_ta": "வெள்ளை",
  "lucky_color_en": "White"
 },
 {
  "sign_ta": "மிதுனம்",
  "sign_en": "Gemini",
  "date": "19-02-2026",
  "prediction_ta": "இன்று வியாழக்கிழமை, குரு பகவானின் ஆதிக்கம் மேலோங்கி நிற்கும் ஒரு நாள், மிதுன ராசிக்காரர்களே. உங்கள் இயல்பான அறிவுக்கூர்மையும், தகவல்தொடர்புத் திறனும் இன்று குருவின் அருளால் மேலும் சிறப்புடன் வெளிப்படும். புதிய தகவல்களை அறிந்துகொள்வதிலும், அதனை மற்றவர்களுடன் பகிர்ந்துகொள்வதிலும் மிகுந்த ஆர்வம் காட்டுவீர்கள். உங்களின் சிந்தனைகள் விரிவடையும். தெளிவான முடிவுகளை எடுப்பீர்கள். கல்வித் துறையில் உள்ளவர்களுக்கு இன்று சிறப்பான நாளாக அமையும். புதிய பாடங்களைக் கற்றுக்கொள்வதிலும், ஆராய்ச்சிகளிலும் ஈடுபடுவீர்கள். அது உங்களுக்கு பெரும் வெற்றியைத் தேடித் தரும். சமூக வலைத்தளங்களில் உங்களின் கருத்துகள் வரவேற்பைப் பெறும். பொது மேடைகளில் பேசுவதற்கான வாய்ப்புகள் கிடைக்கும். அது உங்களின் ஆளுமையை வெளிப்படுத்தும். பணியிடத்தில் புதிய திட்டங்களை முன்னின்று நடத்தும் வாய்ப்புகள் ஏற்படும். உங்கள் யோசனைகள் பாராட்டப்படும். சக ஊழியர்களுடன் இணைந்து செயல்படுவதன் மூலம் பெரும் வெற்றிகளை அடைவீர்கள். வியாபாரத்தில் புதிய யுக்திகளைப் பயன்படுத்தி லாபம் ஈட்டுவீர்கள். பயணங்கள் மேற்கொள்வதற்கான வாய்ப்புகள் உண்டாகும். குறிப்பாக, கல்வி சார்ந்த அல்லது வணிகம் சார்ந்த பயணங்கள் உங்களுக்கு நன்மையைத் தரும். புதிய நட்புகள் உருவாகும். அவர்களின் மூலம் புதிய கண்ணோட்டங்களையும், தகவல்களையும் பெறுவீர்கள். குடும்ப உறவுகளில் அன்பும், புரிதலும் அதிகரிக்கும். சகோதர சகோதரிகளுடன் இணக்கமான சூழல் நிலவும். அவர்களின் வளர்ச்சிக்கு நீங்கள் உறுதுணையாக இருப்பீர்கள். மூத்தவர்களின் ஆலோசனைகளை ஏற்று செயல்படுவீர்கள். அது உங்களுக்கு மேலும் நன்மைகளைத் தரும். ஆன்மிக நாட்டமும், தத்துவ விசாரணைகளும் இன்று அதிகரிக்கும். மனதில் அமைதியும், நேர்மறை எண்ணங்களும் மேலோங்கும். சமுதாய நலனில் அக்கறை செலுத்துவீர்கள். தொண்டு நிறுவனங்களுக்கு உதவுவதிலும், பிறருக்கு நன்மைகளைச் செய்வதிலும் ஆர்வம் காட்டுவீர்கள். இது உங்களுக்கு ஆன்ம திருப்தியையும், மன நிம்மதியையும் தரும். எதிர்காலத்திற்கான திட்டமிடல்களை மேற்கொள்வதற்கும், நீண்டகால இலக்குகளை வகுப்பதற்கும் இது ஒரு மிகச் சிறந்த நாளாகும். உங்கள் இலக்குகளை அடைவதற்கான தெளிவான பாதையை இன்று நீங்கள் காண்பீர்கள். உங்களின் நேர்மறை எண்ணங்களும், நம்பிக்கையான அணுகுமுறையும் இன்று பல நல்ல வாய்ப்புகளை உங்களிடம் கொண்டு சேர்க்கும். ஆரோக்கியத்தில் சிறப்பு கவனம் செலுத்துவீர்கள். மனதை ஒருமுகப்படுத்தும் பயிற்சிகளை மேற்கொள்வதன் மூலம் மன அழுத்தத்தைக் குறைத்து, அமைதியைப் பெறுவீர்கள். சீரான உணவுப் பழக்கம் உங்கள் ஆரோக்கியத்தை மேம்படுத்தும். இன்றைய நாள் உங்களுக்கு பல நல்ல திருப்பங்களையும், முன்னேற்றங்களையும் கொண்டு வரும். நம்பிக்கையுடன் செயல்படுங்கள், வெற்றி நிச்சயம்.",
  "prediction_en": "Today is Thursday, a day where the influence of Jupiter prevails for Gemini natives. Your inherent intelligence and communication skills will shine even more brightly today with Jupiter's grace. You will show great interest in acquiring new information and sharing it with others. Your thoughts will expand, and you will make clear decisions. This will be an excellent day for those in the field of education. You will engage in learning new subjects and research, which will bring you great success. Your opinions will be well-received on social media. Opportunities to speak on public platforms will arise, showcasing your personality. At the workplace, opportunities to lead new projects will emerge. Your ideas will be appreciated. By collaborating with colleagues, you will achieve great successes. In business, you will earn profits by employing new strategies. Opportunities for travel will arise. Specifically, educational or business-related travels will benefit you. New friendships will form, through which you will gain new perspectives and information. Love and understanding will increase in family relationships. A harmonious environment will prevail among siblings. You will be supportive of their growth. You will accept and act upon the advice of elders, which will bring you further benefits. Spiritual inclination and philosophical inquiries will increase today. Peace of mind and positive thoughts will dominate. You will show concern for social welfare. You will be interested in helping charitable organizations and doing good for others. This will bring you spiritual satisfaction and mental peace. This is an excellent day for making future plans and setting long-term goals. You will see a clear path to achieving your objectives today. Your positive thoughts and confident approach will bring many good opportunities to you. You will pay special attention to your health. By practicing mindfulness exercises, you will reduce stress and attain peace. A balanced diet will improve your health. Today will bring you many good turns and advancements. Act with confidence, success is certain.",
  "career_ta": "பணியிடத்தில் புதிய திட்டங்களுக்கு உங்கள் யோசனைகள் பெரிதும் உதவும். உங்கள் தொடர்புத்திறன் மூலம் பல காரியங்களை சாதிப்பீர்கள். புதிய ஒப்பந்தங்கள் கையெழுத்தாகும்.",
  "career_en": "Your ideas will be very helpful for new projects at work. You will achieve many things through your communication skills. New agreements will be signed.",
  "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். புத்திசாலித்தனமான முடிவுகளின் மூலம் சேமிப்பை அதிகரிப்பீர்கள். சிறு முதலீடுகள் மூலம் லாபம் பெறுவீர்கள். செலவுகளைக் கட்டுப்படுத்துவதில் வெற்றி காண்பீர்கள்.",
  "finance_en": "Financial situation will be stable. You will increase savings through intelligent decisions. You will gain profit through small investments. You will succeed in controlling expenses.",
  "health_ta": "மன அமைதிக்கு முக்கியத்துவம் கொடுப்பீர்கள். மனதை இலகுவாக்கும் பயிற்சிகள் உங்கள் ஆரோக்கியத்திற்கு உதவும். சீரான தூக்கமும், பழச்சாறுகளும் புத்துணர்ச்சி அளிக்கும்.",
  "health_en": "You will prioritize mental peace. Practices that ease your mind will help your health. Regular sleep and fruit juices will provide rejuvenation.",
  "lucky_number": "5",
  "lucky_color_ta": "பச்சை",
  "lucky_color_en": "Green"
 },
 {
  "sign_ta": "கடகம்",
  "sign_en": "Cancer",
  "date": "19-02-2026",
  "prediction_ta": "இன்று வியாழக்கிழமை, குரு பகவானின் ஆதிக்கம் நிறைந்த நாள், கடக ராசிக்காரர்களே. உங்கள் உணர்ச்சிபூர்வமான இயல்பும், பாதுகாப்பு உணர்வும் இன்று குருவின் அருளால் நேர்மறையான திசையில் அமையும். குடும்பம் மற்றும் தனிப்பட்ட வாழ்க்கையில் அமைதியையும், நல்லிணக்கத்தையும் பேணுவீர்கள். உங்கள் உள்ளுணர்வு இன்று மிகச் சிறப்பாக செயல்படும். முக்கியமான முடிவுகளை எடுப்பதற்கு உங்கள் உள்ளுணர்வை நம்புவீர்கள். அது உங்களுக்கு சரியான பாதையைக் காட்டும். குடும்ப உறவுகளில் அன்பும், ஆதரவும் அதிகரிக்கும். குறிப்பாக, தாயார் மற்றும் குடும்ப மூத்தவர்களின் ஆலோசனைகள் உங்களுக்கு மிகுந்த நன்மைகளைத் தரும். அவர்களுடனான பிணைப்பு இன்று மேலும் வலுப்பெறும். வீட்டு சூழலில் மகிழ்ச்சியும், அமைதியும் நிறைந்திருக்கும். புதிய வீடு கட்டுதல் அல்லது புதுப்பித்தல் போன்ற எண்ணங்கள் மேலோங்கும். அது தொடர்பான திட்டமிடல்களை மேற்கொள்வீர்கள். நிதி சம்பந்தப்பட்ட விஷயங்களில் ஒரு தெளிவான அணுகுமுறையை மேற்கொள்வீர்கள். உங்கள் சேமிப்பை அதிகரிப்பதற்கான வாய்ப்புகள் உண்டாகும். நீண்டகால முதலீடுகள் சிறந்த பலனைத் தரும். பணியிடத்தில் உங்களின் அர்ப்பணிப்பும், பொறுப்புணர்வும் பாராட்டப்படும். புதிய பொறுப்புகள் அல்லது பதவிகள் தேடி வரும். அது உங்களுக்கு முன்னேற்றத்தைத் தரும். ஆன்மிக நாட்டமும், தர்ம சிந்தனைகளும் இன்று அதிகரிக்கும். பெரியோர்களின் ஆலோசனைகளை ஏற்று செயல்படுவீர்கள். அது உங்களுக்கு மேலும் நன்மைகளைத் தரும். சமூகத்தில் உங்கள் மதிப்பு உயரும். தொண்டு நிறுவனங்களுக்கு உதவுவதிலும், பிறருக்கு நன்மைகளைச் செய்வதிலும் ஆர்வம் காட்டுவீர்கள். இது உங்களுக்கு ஆன்ம திருப்தியையும், மன நிம்மதியையும் தரும். கல்வித் துறையில் உள்ளவர்களுக்கு புதிய வாய்ப்புகளும், வெற்றிகளும் உண்டாகும். ஆராய்ச்சிகள் மற்றும் உயர்கல்விக்கான வழிகள் இன்று தெளிவாகத் தெரியும். அது தொடர்பான புதிய வாய்ப்புகளும் தேடி வரும். வெளிநாட்டுப் பயணங்களுக்கான வாய்ப்புகள் ஏற்படும். அது உங்கள் அறிவை விரிவுபடுத்தும். ஆரோக்கியத்தில் நல்ல முன்னேற்றம் காணப்படும். உணவுக் கட்டுப்பாடு, யோகா மற்றும் தியானப் பயிற்சிகளை மேற்கொள்வதன் மூலம் உடல் நலத்தையும், மன நலத்தையும் மேம்படுத்துவீர்கள். மன அமைதியுடன் செயல்படுவீர்கள். புதிய நட்பு வட்டங்கள் உங்களுக்கு நன்மை பயக்கும். அவர்களின் மூலம் புதிய சிந்தனைகளையும், தகவல்களையும் பெறுவீர்கள். குடும்பத்தினருடன் மகிழ்ச்சியான தருணங்களை கழிப்பீர்கள். குழந்தைகளின் கல்வி வளர்ச்சிக்கு உறுதுணையாக இருப்பீர்கள். அவர்களின் திறமைகளை அடையாளம் கண்டு ஊக்குவிப்பீர்கள். இன்று நீங்கள் எடுக்கும் ஒவ்வொரு முயற்சியும் வெற்றியை நோக்கிய பயணமாக அமையும். குரு பகவானின் அருளும், உங்கள் உழைப்பும் உங்களை வெற்றிப் பாதைக்கு அழைத்துச் செல்லும். நம்பிக்கையுடன் செயல்படுங்கள், பிரகாசமான எதிர்காலம் உங்களுக்குக் காத்திருக்கிறது.",
  "prediction_en": "Today is Thursday, a day full of Jupiter's influence for Cancer natives. Your emotional nature and protective instinct will align in a positive direction today with Jupiter's grace. You will maintain peace and harmony in your family and personal life. Your intuition will work exceptionally well today. You will trust your intuition to make important decisions, and it will show you the right path. Love and support will increase in family relationships. Specifically, the advice of your mother and family elders will bring you immense benefits. Your bond with them will strengthen further today. Happiness and peace will fill the home environment. Thoughts of building a new house or renovating will prevail. You will undertake related planning. You will adopt a clear approach in financial matters. Opportunities to increase your savings will arise. Long-term investments will yield excellent results. At your workplace, your dedication and sense of responsibility will be appreciated. By working collaboratively with colleagues, you will achieve great successes. New responsibilities or positions may come your way, bringing you advancement. Spiritual inclination and charitable thoughts will increase today. You will accept and act upon the advice of elders, which will bring you further benefits. Your social standing will rise. You will show interest in helping charitable organizations and doing good for others. Those in the field of education will find new opportunities and successes. Paths for research and higher education will become clear today, and related new opportunities will come your way. Opportunities for foreign travel may arise, which will expand your knowledge. Good progress will be seen in health. By adhering to dietary control, yoga, and meditation practices, you will improve both your physical and mental well-being. You will act with peace of mind. New social circles will benefit you, through which you will gain new ideas and information. You will spend joyful moments with family members. You will be supportive of your children's educational growth. You will identify their hidden talents and encourage them. Every effort you make today will be a journey towards success. The grace of Jupiter and your hard work will lead you on the path to victory. Act with confidence, a bright future awaits you.",
  "career_ta": "பணியிடத்தில் உங்கள் அர்ப்பணிப்பு பாராட்டப்படும். குழுவாக செயல்படும் வாய்ப்புகளில் சிறந்து விளங்குவீர்கள். புதிய வாய்ப்புகள் உங்கள் திறமையை வெளிப்படுத்தும்.",
  "career_en": "Your dedication will be appreciated at work. You will excel in opportunities to work as part of a team. New opportunities will showcase your talent.",
  "finance_ta": "நிதிநிலைமை ஸ்திரமாக இருக்கும். சேமிப்பை அதிகரிக்க புதிய வழிகள் தோன்றும். குடும்பத்திற்காக மேற்கொள்ளும் முதலீடுகள் லாபம் தரும். எதிர்காலத்திற்கான திட்டமிடல் இன்று சிறக்கும்.",
  "finance_en": "Financial situation will be stable. New ways to increase savings will emerge. Investments made for the family will yield profits. Planning for the future will be excellent today.",
  "health_ta": "மன அமைதிக்கு முக்கியத்துவம் கொடுப்பீர்கள். தியானம் மற்றும் யோகா பயிற்சிகள் நல்ல பலன் தரும். குடும்பத்துடன் செலவிடும் நேரம் மனநலத்தை மேம்படுத்தும்.",
  "health_en": "You will prioritize mental peace. Meditation and yoga practices will yield good results. Time spent with family will improve mental health.",
  "lucky_number": "2",
  "lucky_color_ta": "வெள்ளை",
  "lucky_color_en": "White"
 },
 {
  "sign_ta": "சிம்மம்",
  "sign_en": "Leo",
  "date": "19-02-2026",
  "prediction_ta": "இன்று வியாழக்கிழமை, குரு பகவானின் பொற்கரங்கள் சிம்ம ராசிக்குச் சாதகமாக அமையும் நாள். உங்கள் இயல்பான தலைமைப் பண்பும், ஆளுமையும் இன்று குருவின் அருளால் மேலும் ஒளிரும். தன்னம்பிக்கையுடன் செயல்படுவீர்கள். எந்த ஒரு சூழ்நிலையையும் திறம்பட சமாளிக்கும் ஆற்றலைப் பெறுவீர்கள். புதிய திட்டங்களை முன்னெடுத்துச் செல்வதற்கும், சவால்களை எதிர்கொள்வதற்கும் இது ஒரு உகந்த நாளாகும். உங்கள் யோசனைகள் பாராட்டப்படும். மற்றவர்களுக்கு வழிகாட்டியாக அமைவீர்கள். சமூகத்திலும், பணியிடத்திலும் உங்கள் மதிப்பு உயரும். நீங்கள் மேற்கொள்ளும் முயற்சிகள் அனைத்தும் வெற்றியை நோக்கிய பயணமாக அமையும். கல்வி மற்றும் அறிவுசார் தேடல்களில் ஆர்வம் காட்டுவீர்கள். உயர் கல்விக்கான வாய்ப்புகள் கூடிவரும். வெளிநாட்டுக் கல்வி பற்றிய சிந்தனைகள் மேலோங்கும். ஆன்மிகப் பெரியோர்களின் ஆலோசனைகளைப் பெறுவீர்கள். அது உங்களுக்கு மன அமைதியையும், தெளிவையும் தரும். குடும்ப உறவுகளில் அன்பும், ஆதரவும் அதிகரிக்கும். குறிப்பாக, குழந்தைகள் மூலம் மகிழ்ச்சியான செய்திகள் கிடைக்கும். அவர்களின் வளர்ச்சிக்கு நீங்கள் உறுதுணையாக இருப்பீர்கள். புதிய நண்பர்களின் அறிமுகம் நன்மையைத் தரும். அவர்களின் மூலம் புதிய கண்ணோட்டங்களையும், தகவல்களையும் பெறுவீர்கள். சமூகத்தில் உங்கள் செல்வாக்கு அதிகரிக்கும். பல சமுதாயப் பணிகளில் உங்களை ஈடுபடுத்திக் கொள்வீர்கள். இது உங்களுக்கு ஆன்ம திருப்தியையும், மன நிம்மதியையும் தரும். பணியிடத்தில் புதிய பொறுப்புகள் தேடி வரும். உங்கள் திறமையும், உழைப்பும் அங்கீகரிக்கப்படும். உயர் அதிகாரிகளின் ஆதரவு பெற்று, தொழிலில் முன்னேற்றம் காண்பீர்கள். வியாபாரத்தில் புதிய யுக்திகளைப் பயன்படுத்தி லாபம் ஈட்டுவீர்கள். பயணங்கள் மேற்கொள்வதற்கான வாய்ப்புகள் உண்டாகும். குறிப்பாக, வணிகம் சார்ந்த பயணங்கள் உங்களுக்கு நன்மையைத் தரும். நிதி நிலைமை ஸ்திரமாக இருக்கும். புத்திசாலித்தனமான முடிவுகளின் மூலம் சேமிப்பை அதிகரிப்பீர்கள். நீண்டகால முதலீடுகள் சிறந்த பலன் தரும். ஆரோக்கியத்தில் நல்ல முன்னேற்றம் காணப்படும். உணவுக் கட்டுப்பாடு, யோகா மற்றும் தியானப் பயிற்சிகளை மேற்கொள்வதன் மூலம் உடல் நலத்தையும், மன நலத்தையும் மேம்படுத்துவீர்கள். மன அமைதியுடன் செயல்படுவீர்கள். இன்றைய நாள் உங்களுக்கு பல நல்ல திருப்பங்களையும், முன்னேற்றங்களையும் கொண்டு வரும். நம்பிக்கையுடன் செயல்படுங்கள், பிரகாசமான எதிர்காலம் உங்களுக்குக் காத்திருக்கிறது. குரு பகவானின் அருளும், உங்கள் உழைப்பும் உங்களை வெற்றிப் பாதைக்கு அழைத்துச் செல்லும்.",
  "prediction_en": "Today is Thursday, a day when Jupiter's golden hands will be favorable to Leo natives. Your inherent leadership qualities and charisma will shine even brighter today with Jupiter's grace. You will act with self-confidence and gain the ability to effectively handle any situation. This is an opportune day for initiating new projects and facing challenges. Your ideas will be appreciated, and you will serve as a guide for others. Your prestige will increase in society and at your workplace. All your endeavors will be a journey towards success. You will show interest in education and intellectual pursuits. Opportunities for higher education will increase, and thoughts about overseas education will prevail. You will receive advice from spiritual elders, which will bring you peace of mind and clarity. Love and support will increase in family relationships. Specifically, joyful news will come through children, and you will be supportive of their growth. The introduction of new friends will be beneficial, through whom you will gain new perspectives and information. Your influence in society will grow, and you will involve yourself in many social activities, bringing you spiritual satisfaction and mental peace. New responsibilities will come your way at work. Your talent and hard work will be recognized. You will gain support from higher authorities and achieve career advancement. In business, you will earn profits by employing new strategies. Opportunities for travel will arise, especially business-related trips which will benefit you. The financial situation will be stable. You will increase savings through intelligent decisions. Long-term investments will yield excellent results. Good progress will be seen in health. By adhering to dietary control, yoga, and meditation practices, you will improve both your physical and mental well-being. You will act with peace of mind. Today will bring you many good turns and advancements. Act with confidence, a bright future awaits you. The grace of Jupiter and your hard work will lead you on the path to victory.",
  "career_ta": "புதிய தலைமைப் பொறுப்புகள் தேடி வரும். உங்கள் படைப்பாற்றல் அங்கீகரிக்கப்படும். சவாலான திட்டங்களை வெற்றிகரமாக முடிப்பீர்கள். தொழில் வளர்ச்சிக்கு உகந்த நாள்.",
  "career_en": "New leadership roles will come your way. Your creativity will be recognized. You will successfully complete challenging projects. An auspicious day for career growth.",
  "finance_ta": "நிதிநிலைமை மிகவும் சிறப்பாக இருக்கும். உங்கள் முதலீடுகள் பெருகும். வருமானத்தை அதிகரிக்க புதிய வழிகளைக் கண்டறிவீர்கள். சேமிப்புத் திட்டங்கள் ஆதாயம் தரும்.",
  "finance_en": "Financial situation will be excellent. Your investments will grow. You will discover new ways to increase income. Savings plans will yield benefits.",
  "health_ta": "உடல் ஆரோக்கியம் சிறக்கும். புத்துணர்ச்சியுடன் செயல்படுவீர்கள். விளையாட்டுகளில் ஈடுபடுவது மனதிற்கு உற்சாகம் தரும். ஆரோக்கியமான உணவுப் பழக்கங்களை மேற்கொள்வீர்கள்.",
  "health_en": "Physical health will be excellent. You will act with renewed energy. Engaging in sports will bring joy to your mind. You will adopt healthy eating habits.",
  "lucky_number": "1",
  "lucky_color_ta": "ஆரஞ்சு",
  "lucky_color_en": "Orange"
 },
 {
  "sign_ta": "கன்னி",
  "sign_en": "Virgo",
  "date": "19-02-2026",
  "prediction_ta": "இன்று வியாழக்கிழமை, குரு பகவானின் ஆதிக்கம் நிறைந்த ஒரு நாள், கன்னி ராசிக்காரர்களே. உங்கள் நுணுக்கமான பகுப்பாய்வுத் திறனும், ஒழுங்கமைக்கும் ஆற்றலும் இன்று குருவின் அருளால் மேலும் கூர்மையடையும். எந்த ஒரு செயலிலும் ஒரு தெளிவான அணுகுமுறையை மேற்கொள்வீர்கள். உங்கள் மனதில் அமைதியும், நேர்மறையான சிந்தனைகளும் மேலோங்கும். பணியிடத்தில் உங்களின் திறமையும், உழைப்பும் பாராட்டப்படும். புதிய பொறுப்புகள் அல்லது பதவிகள் தேடி வரும். சக ஊழியர்களுடன் இணைந்து செயல்படுவதன் மூலம் பெரும் வெற்றிகளை அடைவீர்கள். உங்கள் இலக்குகளை அடைவதற்கான தெளிவான பாதையை இன்று நீங்கள் காண்பீர்கள். கல்வித் துறையில் உள்ளவர்களுக்கு இன்று சிறப்பான நாளாக அமையும். புதிய பாடங்களைக் கற்றுக்கொள்வதிலும், ஆராய்ச்சிகளிலும் ஈடுபடுவீர்கள். அது உங்களுக்கு பெரும் வெற்றியைத் தேடித் தரும். புதிய தகவல்களை அறிந்துகொள்வதிலும், அதனை மற்றவர்களுடன் பகிர்ந்துகொள்வதிலும் மிகுந்த ஆர்வம் காட்டுவீர்கள். ஆரோக்கியத்தில் சிறப்பு கவனம் செலுத்துவீர்கள். உணவு முறைகளில் கவனம் செலுத்துவீர்கள். உடற்பயிற்சிகளை மேற்கொள்வதன் மூலம் உடல் நலத்தை மேம்படுத்துவீர்கள். மன அமைதியுடன் செயல்படுவீர்கள். குடும்ப உறவுகளில் அன்பும், புரிதலும் அதிகரிக்கும். குடும்ப உறுப்பினர்களின் ஆதரவும், ஒத்துழைப்பும் உங்களுக்கு மன நிறைவைத் தரும். புதிய முதலீடுகளை மேற்கொள்வதற்கும், நீண்டகாலத் திட்டங்களை வகுப்பதற்கும் இது ஒரு உகந்த நாளாகும். உங்கள் அனுபவ அறிவைப் பயன்படுத்தி சரியான முடிவுகளை எடுப்பீர்கள். சொத்து சம்பந்தப்பட்ட விஷயங்களில் சாதகமான முடிவுகள் கிடைக்கும். ஆன்மிக நாட்டமும், தர்ம சிந்தனைகளும் இன்று அதிகரிக்கும். பெரியோர்களின் ஆலோசனைகளை ஏற்று செயல்படுவீர்கள். அது உங்களுக்கு மேலும் நன்மைகளைத் தரும். சமூகத்தில் உங்கள் மதிப்பு உயரும். தொண்டு நிறுவனங்களுக்கு உதவுவதிலும், பிறருக்கு நன்மைகளைச் செய்வதிலும் ஆர்வம் காட்டுவீர்கள். இது உங்களுக்கு ஆன்ம திருப்தியையும், மன நிம்மதியையும் தரும். எதிர்காலத்திற்கான திட்டமிடல்களை மேற்கொள்வதற்கும், நீண்டகால இலக்குகளை வகுப்பதற்கும் இது ஒரு மிகச் சிறந்த நாளாகும். உங்களின் நேர்மறை எண்ணங்களும், நம்பிக்கையான அணுகுமுறையும் இன்று பல நல்ல வாய்ப்புகளை உங்களிடம் கொண்டு சேர்க்கும். சவால்கள் எது வந்தாலும், அதனை மிகுந்த நம்பிக்கையுடன் எதிர்கொள்வீர்கள். எந்த ஒரு கடினமான சூழ்நிலையையும் உங்களுக்குச் சாதகமாக மாற்றும் அசாத்திய திறமை உங்களுக்கு உண்டு என்பதை இன்று உணர்வீர்கள். இன்று நீங்கள் எடுக்கும் ஒவ்வொரு முயற்சியும் வெற்றியை நோக்கிய பயணமாக அமையும். குரு பகவானின் அருளும், உங்கள் உழைப்பும் உங்களை வெற்றிப் பாதைக்கு அழைத்துச் செல்லும். நம்பிக்கையுடன் செயல்படுங்கள், பிரகாசமான எதிர்காலம் உங்களுக்குக் காத்திருக்கிறது.",
  "prediction_en": "Today is Thursday, a day filled with the influence of Jupiter for Virgo natives. Your meticulous analytical skills and organizing abilities will be further sharpened today by Jupiter's grace. You will adopt a clear approach in every task. Peace of mind and positive thoughts will prevail in your mind. At the workplace, your talent and hard work will be appreciated. New responsibilities or positions may come your way. By working collaboratively with colleagues, you will achieve great successes. Today, you will see a clear path to achieving your goals. This will be an excellent day for those in the field of education. You will engage in learning new subjects and research, which will bring you great success. You will show keen interest in acquiring new information and sharing it with others. You will pay special attention to your health. You will focus on your diet and improve your physical health through exercises. You will act with peace of mind. Love and understanding will increase in family relationships. The support and cooperation of family members will bring you contentment. This is an auspicious day for making new investments and formulating long-term plans. You will make sound decisions using your experiential knowledge. Favorable outcomes will be achieved in matters related to property. Spiritual inclination and charitable thoughts will increase today. You will accept and act upon the advice of elders, which will bring you further benefits. Your social standing will rise. You will show interest in helping charitable organizations and doing good for others, bringing you spiritual satisfaction and mental peace. This is an excellent day for making future plans and setting long-term goals. Your positive thoughts and confident approach will bring many good opportunities to you. No matter what challenges arise, you will face them with immense confidence. Today, you will realize that you possess an extraordinary ability to turn any difficult situation to your advantage. Every effort you make today will be a journey towards success. The grace of Jupiter and your hard work will lead you on the path to victory. Act with confidence, a bright future awaits you.",
  "career_ta": "உங்கள் உழைப்பிற்கு அங்கீகாரம் கிடைக்கும். புதிய திட்டங்களை வெற்றிகரமாக நிர்வகிப்பீர்கள். அணியுடன் இணைந்து செயல்பட்டு சிறப்பான முடிவுகளைப் பெறுவீர்கள்.",
  "career_en": "Your hard work will be recognized. You will successfully manage new projects. You will achieve excellent results by working with the team.",
  "finance_ta": "நிதி திட்டமிடுதலில் சிறந்து விளங்குவீர்கள். சேமிப்பை அதிகரிக்க நல்ல வாய்ப்புகள் உருவாகும். வருமானப் பெருக்கத்திற்கு வழி காண்பீர்கள். நிதானமான முதலீடுகள் ஆதாயம் தரும்.",
  "finance_en": "You will excel in financial planning. Good opportunities to increase savings will arise. You will find ways to increase income. Prudent investments will yield benefits.",
  "health_ta": "ஆரோக்கியமான உணவுப் பழக்கங்களை மேற்கொள்வீர்கள். மன அழுத்தத்தைக் குறைக்க தியானம் உதவும். சீரான உடற்பயிற்சி உங்கள் உடல் நலத்தை மேம்படுத்தும்.",
  "health_en": "You will adopt healthy eating habits. Meditation will help reduce stress. Regular exercise will improve your physical health.",
  "lucky_number": "5",
  "lucky_color_ta": "நீலம்",
  "lucky_color_en": "Blue"
 },
 {
  "sign_ta": "துலாம்",
  "sign_en": "Libra",
  "date": "19-02-2026",
  "prediction_ta": "இன்று வியாழக்கிழமை, குரு பகவானின் ஆசீர்வாதம் துலாம் ராசிக்காரர்களுக்குக் கிடைக்கும் ஒரு பொன்னான நாள். உங்கள் இயல்பான சமநிலை உணர்வும், இணக்கமான அணுகுமுறையும் இன்று குருவின் அருளால் மேலும் பிரகாசிக்கும். உறவுகளில் நல்லிணக்கம் மேலோங்கும். சமூகத்தில் உங்கள் மதிப்பு உயரும். புதிய நட்புகள் உருவாகும். பழைய நண்பர்களுடனான உறவும் வலுப்பெறும். உங்களுடைய ஆளுமைத்திறன் அனைவராலும் பாராட்டப்படும். இராஜதந்திர அணுகுமுறையுடன் பல காரியங்களை சாதிப்பீர்கள். எந்த ஒரு சூழ்நிலையையும் நேர்மறையாக மாற்றுவதற்கான ஆற்றலைப் பெறுவீர்கள். திருமணம் போன்ற சுப காரியங்கள் பற்றிய சிந்தனைகள் மேலோங்கும். குடும்பத்தில் மகிழ்ச்சியும், அமைதியும் நிறைந்திருக்கும். நிதி சம்பந்தப்பட்ட விஷயங்களில் ஒரு தெளிவான அணுகுமுறையை மேற்கொள்வீர்கள். உங்கள் சேமிப்பை அதிகரிப்பதற்கான வாய்ப்புகள் உண்டாகும். நீண்டகால முதலீடுகள் சிறந்த பலனைத் தரும். பணியிடத்தில் உங்களின் சமரசப் போக்கும், திறம்பட செயல்படும் ஆற்றலும் பாராட்டப்படும். புதிய பொறுப்புகள் அல்லது பதவிகள் தேடி வரும். சக ஊழியர்களுடன் இணைந்து செயல்படுவதன் மூலம் பெரும் வெற்றிகளை அடைவீர்கள். கூட்டு முயற்சிகள் வெற்றியைத் தரும். உங்கள் இலக்குகளை அடைவதற்கான தெளிவான பாதையை இன்று நீங்கள் காண்பீர்கள். கல்வித் துறையில் உள்ளவர்களுக்கு புதிய வாய்ப்புகளும், வெற்றிகளும் உண்டாகும். ஆராய்ச்சிகள் மற்றும் உயர்கல்விக்கான வழிகள் இன்று தெளிவாகத் தெரியும். அது தொடர்பான புதிய வாய்ப்புகளும் தேடி வரும். ஆன்மிக நாட்டமும், தர்ம சிந்தனைகளும் இன்று அதிகரிக்கும். பெரியோர்களின் ஆலோசனைகளை ஏற்று செயல்படுவீர்கள். அது உங்களுக்கு மேலும் நன்மைகளைத் தரும். சமூகத்தில் உங்கள் மதிப்பு உயரும். தொண்டு நிறுவனங்களுக்கு உதவுவதிலும், பிறருக்கு நன்மைகளைச் செய்வதிலும் ஆர்வம் காட்டுவீர்கள். இது உங்களுக்கு ஆன்ம திருப்தியையும், மன நிம்மதியையும் தரும். எதிர்காலத்திற்கான திட்டமிடல்களை மேற்கொள்வதற்கும், நீண்டகால இலக்குகளை வகுப்பதற்கும் இது ஒரு மிகச் சிறந்த நாளாகும். உங்களின் நேர்மறை எண்ணங்களும், நம்பிக்கையான அணுகுமுறையும் இன்று பல நல்ல வாய்ப்புகளை உங்களிடம் கொண்டு சேர்க்கும். ஆரோக்கியத்தில் சிறப்பு கவனம் செலுத்துவீர்கள். உடற்பயிற்சிகளை மேற்கொள்வதன் மூலம் உடல் நலத்தை மேம்படுத்துவீர்கள். மன அமைதியுடன் செயல்படுவீர்கள். இன்றைய நாள் உங்களுக்கு பல நல்ல திருப்பங்களையும், முன்னேற்றங்களையும் கொண்டு வரும். நம்பிக்கையுடன் செயல்படுங்கள், வெற்றி நிச்சயம்.",
  "prediction_en": "Today is Thursday, a golden day when the blessings of Jupiter will be bestowed upon Libra natives. Your inherent sense of balance and harmonious approach will shine even brighter today with Jupiter's grace. Harmony will prevail in relationships, and your social standing will increase. New friendships will form, and relationships with old friends will also strengthen. Your personality and diplomatic skills will be appreciated by all. You will achieve many things through a diplomatic approach, gaining the ability to transform any situation positively. Thoughts about auspicious events like marriage will prevail. Happiness and peace will fill the family. You will adopt a clear approach in financial matters. Opportunities to increase your savings will arise. Long-term investments will yield excellent results. At the workplace, your conciliatory approach and efficient performance will be appreciated. New responsibilities or positions may come your way. By working collaboratively with colleagues, you will achieve great successes. Joint ventures will bring success. Today, you will see a clear path to achieving your goals. This will be an excellent day for those in the field of education. New opportunities and successes will arise, and paths for research and higher education will become clear today. Related new opportunities will also come your way. Spiritual inclination and charitable thoughts will increase today. You will accept and act upon the advice of elders, which will bring you further benefits. Your social standing will rise. You will show interest in helping charitable organizations and doing good for others, bringing you spiritual satisfaction and mental peace. This is an excellent day for making future plans and setting long-term goals. Your positive thoughts and confident approach will bring many good opportunities to you. You will pay special attention to your health. By engaging in exercises, you will improve your physical health. You will act with peace of mind. Today will bring you many good turns and advancements. Act with confidence, success is certain.",
  "career_ta": "பணிச்சூழலில் இணக்கமான உறவுகளைப் பேணுவீர்கள். உங்கள் யோசனைகள் ஏற்றுக்கொள்ளப்பட்டு, புதிய திட்டங்களில் பங்கெடுப்பீர்கள். தலைமைப் பண்பு வெளிப்படும்.",
  "career_en": "You will maintain harmonious relationships in the work environment. Your ideas will be accepted, and you will participate in new projects. Leadership qualities will emerge.",
  "finance_ta": "நிதிநிலைமையில் சமநிலை காணப்படும். ஞானமான முடிவுகளின் மூலம் சேமிப்பை அதிகரிப்பீர்கள். கூட்டு முயற்சிகள் மூலம் நிதி ஆதாயம் பெறுவீர்கள். செலவுகளைக் கட்டுப்படுத்துவீர்கள்.",
  "finance_en": "Financial situation will be balanced. You will increase savings through wise decisions. You will gain financial benefits through joint ventures. You will control expenses.",
  "health_ta": "மன அமைதிக்கு முக்கியத்துவம் கொடுப்பீர்கள். உடற்பயிற்சிகளை மேற்கொள்வது மன அழுத்தத்தைக் குறைக்கும். புதிய ஆற்றல் பெருகும். நல்ல உணவுப் பழக்கங்கள் ஆரோக்கியத்தை மேம்படுத்தும்.",
  "health_en": "You will prioritize mental peace. Engaging in exercises will reduce stress. New energy will increase. Good eating habits will improve health.",
  "lucky_number": "6",
  "lucky_color_ta": "இளஞ்சிவப்பு",
  "lucky_color_en": "Pink"
 },
 {
  "sign_ta": "விருச்சிகம்",
  "sign_en": "Scorpio",
  "date": "19-02-2026",
  "prediction_ta": "இன்று வியாழக்கிழமை, குரு பகவானின் அருள் விருச்சிக ராசிக்காரர்களுக்குக் கிடைக்கும் நாள். உங்கள் ஆழ்ந்த புரிதலும், உள்நோக்கும் இன்று குருவின் அருளால் மேலும் தெளிவடையும். எந்த ஒரு பிரச்சனைக்கும் ஆழமான தீர்வுகளைக் காண்பீர்கள். உங்கள் மன உறுதியும், விடாமுயற்சியும் இன்று வெற்றியை நோக்கிய பயணமாக அமையும். புதிய திட்டங்களை முன்னெடுத்துச் செல்வதற்கும், சவால்களை எதிர்கொள்வதற்கும் இது ஒரு உகந்த நாளாகும். உங்கள் யோசனைகள் பாராட்டப்படும். மற்றவர்களுக்கு வழிகாட்டியாக அமைவீர்கள். சமூகத்திலும், பணியிடத்திலும் உங்கள் மதிப்பு உயரும். நீங்கள் மேற்கொள்ளும் முயற்சிகள் அனைத்தும் வெற்றியை நோக்கிய பயணமாக அமையும். நிதி சம்பந்தப்பட்ட விஷயங்களில் ஒரு தெளிவான அணுகுமுறையை மேற்கொள்வீர்கள். உங்கள் சேமிப்பை அதிகரிப்பதற்கான வாய்ப்புகள் உண்டாகும். நீண்டகால முதலீடுகள் சிறந்த பலனைத் தரும். மறைமுகமான வழிகளில் ஆதாயம் கிடைக்க வாய்ப்புள்ளது. பணியிடத்தில் உங்களின் அர்ப்பணிப்பும், பொறுப்புணர்வும் பாராட்டப்படும். புதிய பொறுப்புகள் அல்லது பதவிகள் தேடி வரும். சக ஊழியர்களுடன் இணைந்து செயல்படுவதன் மூலம் பெரும் வெற்றிகளை அடைவீர்கள். கூட்டு முயற்சிகள் வெற்றியைத் தரும். உங்கள் இலக்குகளை அடைவதற்கான தெளிவான பாதையை இன்று நீங்கள் காண்பீர்கள். கல்வித் துறையில் உள்ளவர்களுக்கு புதிய வாய்ப்புகளும், வெற்றிகளும் உண்டாகும். ஆராய்ச்சிகள் மற்றும் உயர்கல்விக்கான வழிகள் இன்று தெளிவாகத் தெரியும். அது தொடர்பான புதிய வாய்ப்புகளும் தேடி வரும். ஆன்மிக நாட்டமும், தர்ம சிந்தனைகளும் இன்று அதிகரிக்கும். பெரியோர்களின் ஆலோசனைகளை ஏற்று செயல்படுவீர்கள். அது உங்களுக்கு மேலும் நன்மைகளைத் தரும். சமூகத்தில் உங்கள் மதிப்பு உயரும். தொண்டு நிறுவனங்களுக்கு உதவுவதிலும், பிறருக்கு நன்மைகளைச் செய்வதிலும் ஆர்வம் காட்டுவீர்கள். இது உங்களுக்கு ஆன்ம திருப்தியையும், மன நிம்மதியையும் தரும். எதிர்காலத்திற்கான திட்டமிடல்களை மேற்கொள்வதற்கும், நீண்டகால இலக்குகளை வகுப்பதற்கும் இது ஒரு மிகச் சிறந்த நாளாகும். உங்களின் நேர்மறை எண்ணங்களும், நம்பிக்கையான அணுகுமுறையும் இன்று பல நல்ல வாய்ப்புகளை உங்களிடம் கொண்டு சேர்க்கும். ஆரோக்கியத்தில் சிறப்பு கவனம் செலுத்துவீர்கள். உடற்பயிற்சிகளை மேற்கொள்வதன் மூலம் உடல் நலத்தை மேம்படுத்துவீர்கள். மன அமைதியுடன் செயல்படுவீர்கள். இன்றைய நாள் உங்களுக்கு பல நல்ல திருப்பங்களையும், முன்னேற்றங்களையும் கொண்டு வரும். நம்பிக்கையுடன் செயல்படுங்கள், பிரகாசமான எதிர்காலம் உங்களுக்குக் காத்திருக்கிறது. குரு பகவானின் அருளும், உங்கள் உழைப்பும் உங்களை வெற்றிப் பாதைக்கு அழைத்துச் செல்லும்.",
  "prediction_en": "Today is Thursday, a day when the grace of Jupiter will be bestowed upon Scorpio natives. Your deep understanding and introspection will become even clearer today with Jupiter's blessing. You will find profound solutions to any problem. Your mental resolve and perseverance will become a journey towards success today. This is an opportune day for initiating new projects and facing challenges. Your ideas will be appreciated, and you will serve as a guide for others. Your prestige will increase in society and at your workplace. All your endeavors will be a journey towards success. You will adopt a clear approach in financial matters. Opportunities to increase your savings will arise. Long-term investments will yield excellent results. There is a possibility of gaining benefits through indirect means. At the workplace, your dedication and sense of responsibility will be appreciated. New responsibilities or positions may come your way. By working collaboratively with colleagues, you will achieve great successes. Joint ventures will bring success. Today, you will see a clear path to achieving your goals. For those in the field of education, new opportunities and successes will arise. Paths for research and higher education will become clear today, and related new opportunities will also come your way. Spiritual inclination and charitable thoughts will increase today. You will accept and act upon the advice of elders, which will bring you further benefits. Your social standing will rise. You will show interest in helping charitable organizations and doing good for others, bringing you spiritual satisfaction and mental peace. This is an excellent day for making future plans and setting long-term goals. Your positive thoughts and confident approach will bring many good opportunities to you. You will pay special attention to your health. By engaging in exercises, you will improve your physical health. You will act with peace of mind. Today will bring you many good turns and advancements. Act with confidence, a bright future awaits you. The grace of Jupiter and your hard work will lead you on the path to victory.",
  "career_ta": "புதிய திட்டங்களில் உங்கள் ஆய்வாற்றல் பெரிதும் உதவும். சவால்களைத் துணிச்சலுடன் எதிர்கொண்டு வெற்றி பெறுவீர்கள். புதிய வாய்ப்புகள் உங்கள் திறமையை வெளிப்படுத்தும்.",
  "career_en": "Your analytical skills will be very helpful in new projects. You will face challenges courageously and achieve success. New opportunities will showcase your talent.",
  "finance_ta": "நிதிநிலைமை மேம்படும். மறைமுக வழிகளில் ஆதாயம் கிடைக்க வாய்ப்புள்ளது. ஞானமான முதலீடுகளின் மூலம் வருமானத்தைப் பெருக்குவீர்கள். சேமிப்பு அதிகரிக்கும்.",
  "finance_en": "Financial situation will improve. There is a possibility of gaining benefits through indirect means. You will increase income through wise investments. Savings will increase.",
  "health_ta": "மனதிற்குப் புத்துணர்ச்சி அளிக்கும் பயிற்சிகளை மேற்கொள்வீர்கள். உடல் ஆரோக்கியத்தில் நல்ல முன்னேற்றம் காணப்படும். சீரான தூக்கம் மன அமைதிக்கு உதவும்.",
  "health_en": "You will engage in practices that rejuvenate your mind. Good progress will be seen in physical health. Regular sleep will help mental peace.",
  "lucky_number": "8",
  "lucky_color_ta": "மெரூன்",
  "lucky_color_en": "Maroon"
 },
 {
  "sign_ta": "தனுசு",
  "sign_en": "Sagittarius",
  "date": "19-02-2026",
  "prediction_ta": "இன்று வியாழக்கிழமை, குரு பகவானின் ஆதிக்கம் நிறைந்த நாள். தனுசு ராசிக்காரர்களே, குரு பகவான் உங்கள் ராசியின் அதிபதியாக இருப்பதால், இன்று உங்களுக்கு சிறப்பான நாளாக அமையும். உங்களின் இயல்பான நேர்மறை சிந்தனையும், சுதந்திர உணர்வும் இன்று பன்மடங்கு பெருகும். புதிய அறிவு தேடல்களில் ஈடுபடுவீர்கள். தொலைநோக்குப் பார்வையுடன் முடிவுகளை எடுப்பீர்கள். புதிய சாகசங்களை மேற்கொள்வதற்கும், பயணங்கள் செய்வதற்கும் இது ஒரு உகந்த நாளாகும். வெளிநாட்டுக் கல்வி, அல்லது வெளிநாட்டு வேலை வாய்ப்புகள் பற்றிய சிந்தனைகள் மேலோங்கும். அவை தொடர்பான முயற்சிகள் வெற்றியைத் தரும். ஆன்மிக நாட்டமும், தத்துவ விசாரணைகளும் இன்று அதிகரிக்கும். பெரியோர்களின் ஆலோசனைகளைப் பெறுவீர்கள். அது உங்களுக்கு மன அமைதியையும், தெளிவையும் தரும். சமூகத்தில் உங்கள் மதிப்பு உயரும். தொண்டு நிறுவனங்களுக்கு உதவுவதிலும், பிறருக்கு நன்மைகளைச் செய்வதிலும் ஆர்வம் காட்டுவீர்கள். இது உங்களுக்கு ஆன்ம திருப்தியையும், மன நிம்மதியையும் தரும். பணியிடத்தில் உங்களின் நேர்மறை அணுகுமுறை பாராட்டப்படும். புதிய பொறுப்புகள் அல்லது பதவிகள் தேடி வரும். உயர் அதிகாரிகளின் ஆதரவு பெற்று, தொழிலில் முன்னேற்றம் காண்பீர்கள். சக ஊழியர்களுடன் இணைந்து செயல்படுவதன் மூலம் பெரும் வெற்றிகளை அடைவீர்கள். குடும்ப உறவுகளில் அன்பும், ஆதரவும் அதிகரிக்கும். குறிப்பாக, குழந்தைகள் மூலம் மகிழ்ச்சியான செய்திகள் கிடைக்கும். அவர்களின் வளர்ச்சிக்கு நீங்கள் உறுதுணையாக இருப்பீர்கள். புதிய நண்பர்களின் அறிமுகம் நன்மையைத் தரும். அவர்களின் மூலம் புதிய கண்ணோட்டங்களையும், தகவல்களையும் பெறுவீர்கள். நிதி நிலைமை ஸ்திரமாக இருக்கும். புத்திசாலித்தனமான முடிவுகளின் மூலம் சேமிப்பை அதிகரிப்பீர்கள். நீண்டகால முதலீடுகள் சிறந்த பலன் தரும். ஆரோக்கியத்தில் நல்ல முன்னேற்றம் காணப்படும். உடற்பயிற்சிகளை மேற்கொள்வதன் மூலம் உடல் நலத்தையும், மன நலத்தையும் மேம்படுத்துவீர்கள். மன அமைதியுடன் செயல்படுவீர்கள். இன்றைய நாள் உங்களுக்கு பல நல்ல திருப்பங்களையும், முன்னேற்றங்களையும் கொண்டு வரும். நம்பிக்கையுடன் செயல்படுங்கள், பிரகாசமான எதிர்காலம் உங்களுக்குக் காத்திருக்கிறது. குரு பகவானின் அருளும், உங்கள் உழைப்பும் உங்களை வெற்றிப் பாதைக்கு அழைத்துச் செல்லும்.",
  "prediction_en": "Today is Thursday, a day filled with the dominant influence of Jupiter. Sagittarius natives, as Jupiter is the lord of your sign, today will be a special day for you. Your natural positive thinking and sense of freedom will multiply today. You will engage in the pursuit of new knowledge and make decisions with a long-term vision. This is an opportune day for undertaking new adventures and traveling. Thoughts about overseas education or job opportunities will prevail, and related efforts will lead to success. Spiritual inclination and philosophical inquiries will increase today. You will receive advice from elders, which will bring you peace of mind and clarity. Your social standing will rise. You will show interest in helping charitable organizations and doing good for others, bringing you spiritual satisfaction and mental peace. At the workplace, your positive approach will be appreciated. New responsibilities or positions may come your way. You will gain support from higher authorities and achieve career advancement. By working collaboratively with colleagues, you will achieve great successes. Love and support will increase in family relationships. Specifically, joyful news will come through children, and you will be supportive of their growth. The introduction of new friends will be beneficial, through whom you will gain new perspectives and information. The financial situation will be stable. You will increase savings through intelligent decisions. Long-term investments will yield excellent results. Good progress will be seen in health. By engaging in exercises, you will improve both your physical and mental well-being. You will act with peace of mind. Today will bring you many good turns and advancements. Act with confidence, a bright future awaits you. The grace of Jupiter and your hard work will lead you on the path to victory.",
  "career_ta": "புதிய வாய்ப்புகள் உங்களைத் தேடி வரும். உங்கள் தொலைநோக்குப் பார்வை பணியிடத்தில் பாராட்டப்படும். வெளிநாட்டுத் தொடர்புடைய வேலை வாய்ப்புகள் இன்று உருவாகலாம்.",
  "career_en": "New opportunities will come looking for you. Your long-term vision will be appreciated at work. Foreign-related job opportunities may arise today.",
  "finance_ta": "நிதிநிலைமை மிகவும் சாதகமாக இருக்கும். உங்கள் முதலீடுகள் பெருகும். சேமிப்பு திட்டங்கள் மூலம் பெரும் ஆதாயம் பெறுவீர்கள். புதிய வருமான வழிகள் உருவாகும்.",
  "finance_en": "Financial situation will be very favorable. Your investments will grow. You will gain significant benefits through savings plans. New income streams will emerge.",
  "health_ta": "உடல் ஆரோக்கியம் சிறக்கும். ஆற்றல் நிறைந்த நாள். மனதிற்கு உற்சாகம் தரும் செயல்களில் ஈடுபடுவீர்கள். சீரான உடற்பயிற்சிகள் உடல் நலத்தை மேம்படுத்தும்.",
  "health_en": "Physical health will be excellent. An energetic day. You will engage in activities that bring joy to your mind. Regular exercises will improve physical health.",
  "lucky_number": "3",
  "lucky_color_ta": "மஞ்சள்",
  "lucky_color_en": "Yellow"
 },
 {
  "sign_ta": "மகரம்",
  "sign_en": "Capricorn",
  "date": "19-02-2026",
  "prediction_ta": "இன்று வியாழக்கிழமை, குரு பகவானின் ஆதிக்கம் மகர ராசிக்காரர்களுக்குச் சாதகமாக அமையும் நாள். உங்கள் கடின உழைப்பும், ஒழுக்கமும் இன்று குருவின் அருளால் மேலும் வலுப்பெறும். நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலிலும் ஒரு தெளிவான திட்டமிடலுடன் செயல்படுவீர்கள். பொறுப்புணர்வும், அர்ப்பணிப்பும் பணியிடத்தில் பாராட்டப்படும். புதிய பொறுப்புகள் அல்லது பதவிகள் தேடி வரும். உயர் அதிகாரிகளின் ஆதரவு பெற்று, தொழிலில் முன்னேற்றம் காண்பீர்கள். உங்கள் இலக்குகளை அடைவதற்கான தெளிவான பாதையை இன்று நீங்கள் காண்பீர்கள். எதிர்காலத்திற்கான திட்டமிடல்களை மேற்கொள்வதற்கு இது ஒரு மிகச் சிறந்த நாளாகும். நிதி நிலைமை ஸ்திரமாக இருக்கும். புத்திசாலித்தனமான முடிவுகளின் மூலம் சேமிப்பை அதிகரிப்பீர்கள். நீண்டகால முதலீடுகள் சிறந்த பலனைத் தரும். சொத்து சம்பந்தப்பட்ட விஷயங்களில் சாதகமான முடிவுகள் கிடைக்கும். குடும்ப உறவுகளில் அன்பும், ஆதரவும் அதிகரிக்கும். குறிப்பாக, குடும்ப உறுப்பினர்களின் ஒத்துழைப்பு உங்களுக்கு மன நிறைவைத் தரும். மூத்தவர்களின் ஆலோசனைகளை ஏற்று செயல்படுவீர்கள். அது உங்களுக்கு மேலும் நன்மைகளைத் தரும். சமூகத்தில் உங்கள் மதிப்பு உயரும். தொண்டு நிறுவனங்களுக்கு உதவுவதிலும், பிறருக்கு நன்மைகளைச் செய்வதிலும் ஆர்வம் காட்டுவீர்கள். இது உங்களுக்கு ஆன்ம திருப்தியையும், மன நிம்மதியையும் தரும். கல்வித் துறையில் உள்ளவர்களுக்கு புதிய வாய்ப்புகளும், வெற்றிகளும் உண்டாகும். ஆராய்ச்சிகள் மற்றும் உயர்கல்விக்கான வழிகள் இன்று தெளிவாகத் தெரியும். அது தொடர்பான புதிய வாய்ப்புகளும் தேடி வரும். ஆன்மிக நாட்டமும், தர்ம சிந்தனைகளும் இன்று அதிகரிக்கும். பெரியோர்களின் ஆலோசனைகளை ஏற்று செயல்படுவீர்கள். அது உங்களுக்கு மேலும் நன்மைகளைத் தரும். உங்களின் நேர்மறை எண்ணங்களும், நம்பிக்கையான அணுகுமுறையும் இன்று பல நல்ல வாய்ப்புகளை உங்களிடம் கொண்டு சேர்க்கும். ஆரோக்கியத்தில் சிறப்பு கவனம் செலுத்துவீர்கள். உடற்பயிற்சிகளை மேற்கொள்வதன் மூலம் உடல் நலத்தை மேம்படுத்துவீர்கள். மன அமைதியுடன் செயல்படுவீர்கள். இன்றைய நாள் உங்களுக்கு பல நல்ல திருப்பங்களையும், முன்னேற்றங்களையும் கொண்டு வரும். நம்பிக்கையுடன் செயல்படுங்கள், பிரகாசமான எதிர்காலம் உங்களுக்குக் காத்திருக்கிறது. குரு பகவானின் அருளும், உங்கள் உழைப்பும் உங்களை வெற்றிப் பாதைக்கு அழைத்துச் செல்லும்.",
  "prediction_en": "Today is Thursday, a day when the influence of Jupiter will be favorable to Capricorn natives. Your hard work and discipline will be further strengthened today by Jupiter's grace. You will act with clear planning in every endeavor you undertake. Your sense of responsibility and dedication will be appreciated at work. New responsibilities or positions may come your way. You will gain support from higher authorities and achieve career advancement. Today, you will see a clear path to achieving your goals. This is an excellent day for making future plans. The financial situation will be stable. You will increase savings through intelligent decisions. Long-term investments will yield excellent results. Favorable outcomes will be achieved in matters related to property. Love and support will increase in family relationships. Specifically, the cooperation of family members will bring you contentment. You will accept and act upon the advice of elders, which will bring you further benefits. Your social standing will rise. You will show interest in helping charitable organizations and doing good for others, bringing you spiritual satisfaction and mental peace. For those in the field of education, new opportunities and successes will arise. Paths for research and higher education will become clear today, and related new opportunities will also come your way. Spiritual inclination and charitable thoughts will increase today. You will accept and act upon the advice of elders, which will bring you further benefits. Your positive thoughts and confident approach will bring many good opportunities to you. You will pay special attention to your health. By engaging in exercises, you will improve your physical health. You will act with peace of mind. Today will bring you many good turns and advancements. Act with confidence, a bright future awaits you. The grace of Jupiter and your hard work will lead you on the path to victory.",
  "career_ta": "உங்கள் உழைப்பும், அர்ப்பணிப்பும் இன்று உயர் அதிகாரிகளால் பாராட்டப்படும். புதிய பொறுப்புகள் உங்களைத் தேடி வரும். தொழில் ரீதியான இலக்குகளை எளிதாக அடைவீர்கள்.",
  "career_en": "Your hard work and dedication will be appreciated by higher authorities today. New responsibilities will come your way. You will easily achieve professional goals.",
  "finance_ta": "நிதிநிலைமை மிகவும் ஸ்திரமாக இருக்கும். சிக்கனமான திட்டங்கள் மூலம் சேமிப்பை அதிகரிப்பீர்கள். நீண்டகால முதலீடுகள் சிறந்த லாபம் தரும். நிதி பாதுகாப்பு உறுதி செய்யப்படும்.",
  "finance_en": "Financial situation will be very stable. You will increase savings through frugal plans. Long-term investments will yield excellent profits. Financial security will be ensured.",
  "health_ta": "ஆரோக்கியத்தில் நேர்மறையான மாற்றங்கள் ஏற்படும். மன அமைதியுடன் செயல்படுவீர்கள். யோகா, நடைப்பயிற்சி போன்ற உடற்பயிற்சிகள் உடல் நலத்தை மேம்படுத்தும்.",
  "health_en": "Positive changes will occur in health. You will act with mental peace. Exercises like yoga and walking will improve physical health.",
  "lucky_number": "8",
  "lucky_color_ta": "நீலம்",
  "lucky_color_en": "Blue"
 },
 {
  "sign_ta": "கும்பம்",
  "sign_en": "Aquarius",
  "date": "19-02-2026",
  "prediction_ta": "இன்று வியாழக்கிழமை, குரு பகவானின் ஆசீர்வாதம் கும்ப ராசிக்காரர்களுக்குக் கிடைக்கும் நாள். உங்கள் புதுமையான சிந்தனைகளும், சமூக அக்கறையும் இன்று குருவின் அருளால் மேலும் ஒளிரும். புதிய கண்டுபிடிப்புகளிலும், தொழில்நுட்பத் துறையிலும் நீங்கள் சிறந்து விளங்குவீர்கள். சமூக நலனில் அக்கறை செலுத்துவீர்கள். தொண்டு நிறுவனங்களுக்கு உதவுவதிலும், பிறருக்கு நன்மைகளைச் செய்வதிலும் ஆர்வம் காட்டுவீர்கள். இது உங்களுக்கு ஆன்ம திருப்தியையும், மன நிம்மதியையும் தரும். புதிய நண்பர்களின் அறிமுகம் நன்மையைத் தரும். அவர்களின் மூலம் புதிய கண்ணோட்டங்களையும், தகவல்களையும் பெறுவீர்கள். கல்வி மற்றும் அறிவுசார் தேடல்களில் ஆர்வம் காட்டுவீர்கள். உயர் கல்விக்கான வாய்ப்புகள் கூடிவரும். வெளிநாட்டுக் கல்வி பற்றிய சிந்தனைகள் மேலோங்கும். ஆன்மிகப் பெரியோர்களின் ஆலோசனைகளைப் பெறுவீர்கள். அது உங்களுக்கு மன அமைதியையும், தெளிவையும் தரும். பணியிடத்தில் உங்களின் புதுமையான யோசனைகள் பாராட்டப்படும். புதிய திட்டங்களுக்கு தலைமையேற்கும் வாய்ப்புகள் ஏற்படும். சக ஊழியர்களுடன் இணைந்து செயல்படுவதன் மூலம் பெரும் வெற்றிகளை அடைவீர்கள். கூட்டு முயற்சிகள் வெற்றியைத் தரும். உங்கள் இலக்குகளை அடைவதற்கான தெளிவான பாதையை இன்று நீங்கள் காண்பீர்கள். குடும்ப உறவுகளில் அன்பும், ஆதரவும் அதிகரிக்கும். குறிப்பாக, குடும்ப உறுப்பினர்களின் ஒத்துழைப்பு உங்களுக்கு மன நிறைவைத் தரும். மூத்தவர்களின் ஆலோசனைகளை ஏற்று செயல்படுவீர்கள். அது உங்களுக்கு மேலும் நன்மைகளைத் தரும். நிதி நிலைமை ஸ்திரமாக இருக்கும். புத்திசாலித்தனமான முடிவுகளின் மூலம் சேமிப்பை அதிகரிப்பீர்கள். நீண்டகால முதலீடுகள் சிறந்த பலனைத் தரும். ஆரோக்கியத்தில் நல்ல முன்னேற்றம் காணப்படும். உணவுக் கட்டுப்பாடு, யோகா மற்றும் தியானப் பயிற்சிகளை மேற்கொள்வதன் மூலம் உடல் நலத்தையும், மன நலத்தையும் மேம்படுத்துவீர்கள். மன அமைதியுடன் செயல்படுவீர்கள். இன்றைய நாள் உங்களுக்கு பல நல்ல திருப்பங்களையும், முன்னேற்றங்களையும் கொண்டு வரும். நம்பிக்கையுடன் செயல்படுங்கள், பிரகாசமான எதிர்காலம் உங்களுக்குக் காத்திருக்கிறது. குரு பகவானின் அருளும், உங்கள் உழைப்பும் உங்களை வெற்றிப் பாதைக்கு அழைத்துச் செல்லும்.",
  "prediction_en": "Today is Thursday, a day when the blessings of Jupiter will be bestowed upon Aquarius natives. Your innovative thoughts and social concern will shine even brighter today with Jupiter's grace. You will excel in new discoveries and the field of technology. You will show concern for social welfare and be interested in helping charitable organizations and doing good for others, bringing you spiritual satisfaction and mental peace. The introduction of new friends will be beneficial, through whom you will gain new perspectives and information. You will show interest in education and intellectual pursuits. Opportunities for higher education will increase, and thoughts about overseas education will prevail. You will receive advice from spiritual elders, which will bring you peace of mind and clarity. At the workplace, your innovative ideas will be appreciated. Opportunities to lead new projects will arise. By working collaboratively with colleagues, you will achieve great successes. Joint ventures will bring success. Today, you will see a clear path to achieving your goals. Love and support will increase in family relationships. Specifically, the cooperation of family members will bring you contentment. You will accept and act upon the advice of elders, which will bring you further benefits. The financial situation will be stable. You will increase savings through intelligent decisions. Long-term investments will yield excellent results. Good progress will be seen in health. By adhering to dietary control, yoga, and meditation practices, you will improve both your physical and mental well-being. You will act with peace of mind. Today will bring you many good turns and advancements. Act with confidence, a bright future awaits you. The grace of Jupiter and your hard work will lead you on the path to victory.",
  "career_ta": "புதிய, புதுமையான திட்டங்களில் உங்கள் பங்களிப்பு பாராட்டப்படும். தொழில்நுட்பத் துறையில் சிறந்து விளங்குவீர்கள். குழுப் பணிகளில் தலைமை வகிக்கும் வாய்ப்புகள் உருவாகும்.",
  "career_en": "Your contribution to new, innovative projects will be appreciated. You will excel in the field of technology. Opportunities to lead team projects will arise.",
  "finance_ta": "நிதிநிலைமை மேம்படும். புதிய முதலீடுகள் மூலம் லாபம் பெறுவீர்கள். சமூக நலனுக்காக செலவு செய்யும் வாய்ப்புகள் உண்டாகும். நீண்டகால திட்டங்கள் ஆதாயம் தரும்.",
  "finance_en": "Financial situation will improve. You will gain profit through new investments. Opportunities to spend for social welfare will arise. Long-term plans will yield benefits.",
  "health_ta": "மனதிற்குப் புத்துணர்ச்சி அளிக்கும் செயல்களில் ஈடுபடுவீர்கள். உடல் ஆரோக்கியத்தில் நல்ல முன்னேற்றம் காணப்படும். சமூகத்துடன் இணைந்திருப்பது மனநலத்தை மேம்படுத்தும்.",
  "health_en": "You will engage in activities that rejuvenate your mind. Good progress will be seen in physical health. Connecting with society will improve mental health.",
  "lucky_number": "4",
  "lucky_color_ta": "நீலம்",
  "lucky_color_en": "Blue"
 },
 {
  "sign_ta": "மீனம்",
  "sign_en": "Pisces",
  "date": "19-02-2026",
  "prediction_ta": "இன்று வியாழக்கிழமை, குரு பகவானின் அருள் மீனம் ராசிக்காரர்களுக்குக் கிடைக்கும் நாள். குரு பகவான் உங்கள் ராசியின் அதிபதியாக இருப்பதால், இன்று உங்களுக்கு சிறப்பான நாளாக அமையும். உங்களின் இயல்பான கருணையும், ஆன்மிக நாட்டமும் இன்று குருவின் அருளால் மேலும் வலுப்பெறும். உங்களின் உள்ளுணர்வு இன்று மிகச் சிறப்பாக செயல்படும். முக்கியமான முடிவுகளை எடுப்பதற்கு உங்கள் உள்ளுணர்வை நம்புவீர்கள். அது உங்களுக்கு சரியான பாதையைக் காட்டும். கலை மற்றும் படைப்பாற்றல் துறைகளில் நீங்கள் சிறந்து விளங்குவீர்கள். புதிய எண்ணங்கள் உருவாகும். அவற்றை செயல்படுத்துவதன் மூலம் வெற்றி காண்பீர்கள். ஆன்மிகத் தேடல்களில் ஈடுபடுவீர்கள். தியானம், யோகா போன்ற பயிற்சிகள் உங்களுக்கு மன அமைதியையும், தெளிவையும் தரும். பெரியோர்களின் ஆலோசனைகளைப் பெறுவீர்கள். அது உங்களுக்கு மன அமைதியையும், தெளிவையும் தரும். சமூகத்தில் உங்கள் மதிப்பு உயரும். தொண்டு நிறுவனங்களுக்கு உதவுவதிலும், பிறருக்கு நன்மைகளைச் செய்வதிலும் ஆர்வம் காட்டுவீர்கள். இது உங்களுக்கு ஆன்ம திருப்தியையும், மன நிம்மதியையும் தரும். பணியிடத்தில் உங்களின் மென்மையான அணுகுமுறையும், அனைவரையும் அனுசரித்துப் போகும் பண்பும் பாராட்டப்படும். புதிய பொறுப்புகள் அல்லது பதவிகள் தேடி வரும். சக ஊழியர்களுடன் இணைந்து செயல்படுவதன் மூலம் பெரும் வெற்றிகளை அடைவீர்கள். குடும்ப உறவுகளில் அன்பும், ஆதரவும் அதிகரிக்கும். குறிப்பாக, குடும்ப உறுப்பினர்களின் ஒத்துழைப்பு உங்களுக்கு மன நிறைவைத் தரும். மூத்தவர்களின் ஆலோசனைகளை ஏற்று செயல்படுவீர்கள். அது உங்களுக்கு மேலும் நன்மைகளைத் தரும். நிதி நிலைமை ஸ்திரமாக இருக்கும். புத்திசாலித்தனமான முடிவுகளின் மூலம் சேமிப்பை அதிகரிப்பீர்கள். நீண்டகால முதலீடுகள் சிறந்த பலனைத் தரும். ஆரோக்கியத்தில் நல்ல முன்னேற்றம் காணப்படும். உணவுக் கட்டுப்பாடு, யோகா மற்றும் தியானப் பயிற்சிகளை மேற்கொள்வதன் மூலம் உடல் நலத்தையும், மன நலத்தையும் மேம்படுத்துவீர்கள். மன அமைதியுடன் செயல்படுவீர்கள். இன்றைய நாள் உங்களுக்கு பல நல்ல திருப்பங்களையும், முன்னேற்றங்களையும் கொண்டு வரும். நம்பிக்கையுடன் செயல்படுங்கள், பிரகாசமான எதிர்காலம் உங்களுக்குக் காத்திருக்கிறது. குரு பகவானின் அருளும், உங்கள் உழைப்பும் உங்களை வெற்றிப் பாதைக்கு அழைத்துச் செல்லும்.",
  "prediction_en": "Today is Thursday, a day when the grace of Jupiter will be bestowed upon Pisces natives. As Jupiter is the lord of your sign, today will be a special day for you. Your natural compassion and spiritual inclination will be further strengthened today by Jupiter's grace. Your intuition will work exceptionally well today. You will trust your intuition to make important decisions, and it will show you the right path. You will excel in arts and creative fields. New ideas will emerge, and you will achieve success by implementing them. You will engage in spiritual pursuits. Practices like meditation and yoga will bring you mental peace and clarity. You will receive advice from elders, which will bring you peace of mind and clarity. Your social standing will rise. You will show interest in helping charitable organizations and doing good for others, bringing you spiritual satisfaction and mental peace. At the workplace, your gentle approach and accommodating nature will be appreciated. New responsibilities or positions may come your way. By working collaboratively with colleagues, you will achieve great successes. Love and support will increase in family relationships. Specifically, the cooperation of family members will bring you contentment. You will accept and act upon the advice of elders, which will bring you further benefits. The financial situation will be stable. You will increase savings through intelligent decisions. Long-term investments will yield excellent results. Good progress will be seen in health. By adhering to dietary control, yoga and meditation practices, you will improve both your physical and mental well-being. You will act with peace of mind. Today will bring you many good turns and advancements. Act with confidence, a bright future awaits you. The grace of Jupiter and your hard work will lead you on the path to victory.",
  "career_ta": "உங்கள் படைப்பாற்றல் பணியிடத்தில் அங்கீகரிக்கப்படும். மற்றவர்களுடன் இணக்கமாக செயல்பட்டு இலக்குகளை அடைவீர்கள். புதிய திட்டங்களில் உங்கள் பங்களிப்பு முக்கியத்துவம் பெறும்.",
  "career_en": "Your creativity will be recognized at work. You will achieve goals by working harmoniously with others. Your contribution to new projects will gain importance.",
  "finance_ta": "நிதிநிலைமை சீராக இருக்கும். ஞானமான முடிவுகளின் மூலம் சேமிப்பை அதிகரிப்பீர்கள். ஆன்மிகப் பணிகளுக்காக செலவு செய்யும் வாய்ப்புகள் உண்டாகும். நீண்டகால முதலீடுகள் ஆதாயம் தரும்.",
  "finance_en": "Financial situation will be stable. You will increase savings through wise decisions. Opportunities to spend for spiritual activities will arise. Long-term investments will yield benefits.",
  "health_ta": "மன அமைதிக்கு முக்கியத்துவம் கொடுப்பீர்கள். தியானம் மற்றும் மன அமைதிக்கான பயிற்சிகள் உங்கள் ஆரோக்கியத்தை மேம்படுத்தும். நீர்ச்சத்து நிறைந்த உணவுகள் உடலுக்கு நல்லது.",
  "health_en": "You will prioritize mental peace. Meditation and practices for mental peace will improve your health. Water-rich foods are good for the body.",
  "lucky_number": "3",
  "lucky_color_ta": "பொன் நிறம்",
  "lucky_color_en": "Gold"
 }
]
