[{"content":{"parts":[{"text":"```json\n[\n  {\n    \"sign_en\": \"Aries\",\n    \"sign_ta\": \"மேஷம்\",\n    \"date\": \"2026-01-23\",\n    \"forecast_en\": \"A highly productive and dynamic day awaits you. Your energy levels are high, making it an excellent time to tackle challenging tasks and take the initiative on new projects.\",\n    \"forecast_ta\": \"இன்றைய நாள் உங்களுக்கு மிகச் சிறந்த ஆற்றல் மிக்க மற்றும் துடிப்பான நாளாக அமையும். உங்கள் ஆற்றல் மிக அதிகமாக இருப்பதால், சவாலான பணிகளைச் சமாளிக்கவும் புதிய திட்டங்களில் முன்னெடுத்துச் செல்லவும் இது சரியான தருணமாகும்.\",\n    \"career_en\": \"Leadership opportunities may arise. Do not hesitate to voice your opinions. Your quick decision-making skills will be highly valued by superiors.\",\n    \"career_ta\": \"தலைமைப் பதவிகள் குறித்த வாய்ப்புகள் கிடைக்கலாம். உங்கள் கருத்துக்களை எடுத்துரைக்கத் தயங்க வேண்டாம். உங்கள் துரிதமான முடிவெடுக்கும் திறன் உயர் அதிகாரிகளால் பாராட்டப்படும்.\",\n    \"finance_en\": \"Financial stability is strong, but impulsive spending should be avoided. A small, calculated investment made today could yield long-term gains.\",\n    \"finance_ta\": \"பொருள்நிலை உறுதியாக உள்ளது, எனினும் ஆவேசமான செலவுகளைத் தவிர்க்க வேண்டும். இன்று செய்யும் சிறிய, திட்டமிட்ட முதலீடு நீண்ட கால நன்மைகளைத் தரக்கூடும்.\",\n    \"health_en\": \"Focus on channeling your abundant energy through structured physical activity. Ensure you stay hydrated throughout the day.\",\n    \"health_ta\": \"உங்கள் அதிகப்படியான ஆற்றலை முறையான உடற்பயிற்சி மூலம் செலுத்துவதில் கவனம் செலுத்துங்கள். நாள் முழுவதும் நீர்ச்சத்து குறையாமல் பார்த்துக்கொள்ளவும்.\",\n    \"lucky_number\": \"9\",\n    \"lucky_color_en\": \"Red\",\n    \"lucky_color_ta\": \"சிவப்பு\"\n  },\n  {\n    \"sign_en\": \"Taurus\",\n    \"sign_ta\": \"இடபம்\",\n    \"date\": \"2026-01-23\",\n    \"forecast_en\": \"Focus on stability and steady progress today. Patience will be your biggest asset, especially when dealing with complex personal matters. A calm approach ensures success.\",\n    \"forecast_ta\": \"இன்று உறுதியிலும் நிலைத்த வளர்ச்சியிலும் கவனம் தேவை. சிக்கலான சொந்த விஷயங்களைக் கையாளும்போது பொறுமை உங்கள் மிகப்பெரிய பலமாக அமையும். அமைதியான அணுகுமுறை வெற்றியை உறுதி செய்யும்.\",\n    \"career_en\": \"Detailed and practical work brings recognition. Avoid rushing decisions and focus instead on meticulously planning the next steps for a major project.\",\n    \"career_ta\": \"நுணுக்கமான மற்றும் நடைமுறை சார்ந்த பணிகள் மூலம் அங்கீகாரம் கிடைக்கும். முடிவுகளை எடுப்பதில் அவசரப்படுவதைத் தவிர்த்து, ஒரு பெரிய திட்டத்தின் அடுத்த நடவடிக்கைகளை நுட்பமாகத் திட்டமிடுவதில் கவனம் செலுத்துங்கள்.\",\n    \"finance_en\": \"This is a favorable day for budgeting and reviewing long-term savings plans. Avoid lending large sums of money today.\",\n    \"finance_ta\": \"இது வரவு செலவுத் திட்டத்தை உருவாக்குவதற்கும், நீண்ட கால சேமிப்புத் திட்டங்களை மறுபரிசீலனை செய்வதற்கும் உகந்த நாளாகும். இன்று பெரிய தொகையைக் கடனாகக் கொடுப்பதைத் தவிர்க்கவும்.\",\n    \"health_en\": \"Stress levels might be slightly elevated. Incorporate short breaks and gentle stretching into your routine to maintain physical ease.\",\n    \"health_ta\": \"மன அழுத்தத்தின் அளவு சற்றுக் கூடுதலாக இருக்கலாம். உடல் நலத்தைப் பராமரிக்க உங்கள் வழக்கத்தில் சிறிய இடைவேளைகளையும் மென்மையான நீட்சியையும் (ஸ்ட்ரெச்சிங்) சேர்த்துக் கொள்ளுங்கள்.\",\n    \"lucky_number\": \"6\",\n    \"lucky_color_en\": \"Emerald Green\",\n    \"lucky_color_ta\": \"மரகதப் பச்சை\"\n  },\n  {\n    \"sign_en\": \"Gemini\",\n    \"sign_ta\": \"மிதுனம்\",\n    \"date\": \"2026-01-23\",\n    \"forecast_en\": \"Communication flows freely today, making it an excellent time for networking and connecting with new people. Your quick wit is highly attractive.\",\n    \"forecast_ta\": \"இன்று தகவல் பரிமாற்றம் தடையின்றி இருக்கும், இது புதியவர்களுடன் வலைப்பின்னலை ஏற்படுத்தவும் தொடர்பு கொள்ளவும் மிகச் சிறந்த நேரமாகும். உங்கள் விரைவான நகைச்சுவை உணர்வு கவர்ச்சியாக இருக்கும்.\",\n    \"career_en\": \"Meetings, negotiations, and presentations are favored. Use your persuasive skills to finalize contracts or gain support for innovative ideas.\",\n    \"career_ta\": \"கூட்டங்கள், பேச்சுவார்த்தைகள் மற்றும் விளக்கக்காட்சிகள் வெற்றி பெறும். ஒப்பந்தங்களை இறுதி செய்ய அல்லது புதுமையான கருத்துக்களுக்கு ஆதரவைப் பெற உங்கள் வாதத் திறமையைப் பயன்படுத்துங்கள்.\",\n    \"finance_en\": \"Look out for unexpected short-term gains related to contracts or consulting work. Be careful not to overcommit financially based on future promises.\",\n    \"finance_ta\": \"ஒப்பந்தங்கள் அல்லது ஆலோசனைப் பணிகள் மூலம் எதிர்பார்க்காத குறுகிய கால ஆதாயங்களைக் காணலாம். எதிர்கால வாக்குறுதிகளின் அடிப்படையில் நிதி ரீதியாக அதிகமாக உறுதியளிப்பதைத் தவிர்க்கவும்.\",\n    \"health_en\": \"Mental stimulation is required. Engage in puzzles or learning a new skill to keep your mind sharp. Monitor your nervous energy.\",\n    \"health_ta\": \"மனதிற்கு தூண்டுதல் தேவைப்படுகிறது. உங்கள் மனதை கூர்மையாக வைத்திருக்க புதிர்கள் அல்லது ஒரு புதிய திறமையைக் கற்றுக்கொள்வதில் ஈடுபடுங்கள். நரம்பு சார்ந்த ஆற்றலை கவனிக்கவும்.\",\n    \"lucky_number\": \"5\",\n    \"lucky_color_en\": \"Yellow\",\n    \"lucky_color_ta\": \"மஞ்சள்\"\n  },\n  {\n    \"sign_en\": \"Cancer\",\n    \"sign_ta\": \"கடகம்\",\n    \"date\": \"2026-01-23\",\n    \"forecast_en\": \"Emotional security and domestic matters take center stage. Trust your intuition today, especially when dealing with family or close personal relationships.\",\n    \"forecast_ta\": \"உணர்ச்சிப் பாதுகாப்பு மற்றும் குடும்ப விஷயங்கள் இன்று முதன்மையாக இருக்கும். குறிப்பாக குடும்பம் அல்லது நெருங்கிய சொந்த உறவுகளைக் கையாளும்போது உங்கள் உள்ளுணர்வை நம்புங்கள்.\",\n    \"career_en\": \"While you may prefer to work behind the scenes, your efforts in creating a supportive work environment will be noticed. Intuition guides important decisions better than logic.\",\n    \"career_ta\": \"நீங்கள் திரைக்குப் பின்னால் வேலை செய்ய விரும்பினாலும், ஆதரவான பணிச்சூழலை உருவாக்குவதில் நீங்கள் எடுக்கும் முயற்சிகள் கவனிக்கப்படும். தர்க்கத்தை விட உள்ளுணர்வு முக்கியமான முடிவுகளுக்கு சிறப்பாக வழிகாட்டும்.\",\n    \"finance_en\": \"Good day for matters related to property, mortgages, or managing home expenses. A family member might offer sound financial advice.\",\n    \"finance_ta\": \"சொத்து, அடமானங்கள் அல்லது வீட்டுச் செலவுகளை நிர்வகிப்பது தொடர்பான விஷயங்களுக்கு இது நல்ல நாள். ஒரு குடும்ப உறுப்பினர் சரியான பொருள்நிலை ஆலோசனையை வழங்கலாம்.\",\n    \"health_en\": \"Prioritize comfort and rest. Nourishing meals and quality sleep are essential to replenish your emotional reserves.\",\n    \"health_ta\": \"ஆறுதலையும் ஓய்வையும் முதன்மைப்படுத்துங்கள். உங்கள் உணர்ச்சிசார் இருப்புகளை நிரப்ப சத்தான உணவும் தரமான உறக்கமும் அத்தியாவசியமானவை.\",\n    \"lucky_number\": \"2\",\n    \"lucky_color_en\": \"Silver\",\n    \"lucky_color_ta\": \"வெள்ளி நிறம்\"\n  },\n  {\n    \"sign_en\": \"Leo\",\n    \"sign_ta\": \"சிம்மம்\",\n    \"date\": \"2026-01-23\",\n    \"forecast_en\": \"Your natural charisma and confidence shine brightly today. This is the time to take the spotlight and display your creative talents to a wider audience.\",\n    \"forecast_ta\": \"உங்கள் இயல்பான கவர்ச்சியும் தன்னம்பிக்கையும் இன்று பிரகாசமாக ஜொலிக்கும். இது கவன ஈர்ப்பு மையத்தில் இருக்கவும், உங்கள் படைப்புத் திறமைகளை ஒரு பெரிய பார்வையாளர்களுக்கு வெளிப்படுத்தவும் உரிய நேரமாகும்.\",\n    \"career_en\": \"Excellent day for launching creative projects or presenting your work. Authority figures are receptive to your innovative ideas. Lead with generosity.\",\n    \"career_ta\": \"படைப்புத் திட்டங்களைத் தொடங்க அல்லது உங்கள் வேலையை முன்வைக்க சிறந்த நாள். அதிகார நபர்கள் உங்கள் புதுமையான யோசனைகளை ஏற்றுக் கொள்வார்கள். பெருந்தன்மையுடன் தலைமை தாங்குங்கள்.\",\n    \"finance_en\": \"While income potential is high, watch out for excessive spending on luxury items or entertainment. Stick to your budget goals.\",\n    \"finance_ta\": \"வருமானத்திற்கான சாத்தியம் அதிகமாக இருந்தாலும், ஆடம்பரப் பொருட்கள் அல்லது பொழுதுபோக்கிற்காக அதிகப்படியான செலவு செய்வதில் கவனம் தேவை. உங்கள் வரவு செலவுத் திட்ட இலக்குகளைப் பின்பற்றுங்கள்.\",\n    \"health_en\": \"Maintain moderate exercise and avoid overexertion. Mental relaxation through hobbies will improve overall well-being.\",\n    \"health_ta\": \"மிதமான உடற்பயிற்சியைப் பராமரிக்கவும், அதிகப்படியான சோர்வைத் தவிர்க்கவும். பொழுதுபோக்கின் மூலம் மனதை தளர்த்துவது ஒட்டுமொத்த நலவாழ்வை மேம்படுத்தும்.\",\n    \"lucky_number\": \"1\",\n    \"lucky_color_en\": \"Gold\",\n    \"lucky_color_ta\": \"பொன்னிறம்\"\n  },\n  {\n    \"sign_en\": \"Virgo\",\n    \"sign_ta\": \"கன்னி\",\n    \"date\": \"2026-01-23\",\n    \"forecast_en\": \"Efficiency is the theme of the day. Focus on organizing your environment, tackling administrative tasks, and refining your routines. Detail work brings great satisfaction.\",\n    \"forecast_ta\": \"செயல்திறனே இன்றைய முக்கிய விஷயமாகும். உங்கள் சுற்றுச்சூழலை ஒழுங்கமைத்தல், நிர்வாகப் பணிகளைச் சமாளித்தல் மற்றும் உங்கள் தினசரி அட்டவணையைச் செம்மைப்படுத்துதல் ஆகியவற்றில் கவனம் செலுத்துங்கள். நுணுக்கமான வேலைகள் பெரிய மனநிறைவைத் தரும்.\",\n    \"career_en\": \"Your ability to notice details proves invaluable. It's a prime time for editing, quality control, or tackling complex analytical work that others might overlook.\",\n    \"career_ta\": \"விவரங்களை கவனிக்க உங்களால் இயலுவது விலைமதிப்பற்றதாக அமையும். இது திருத்தம், தரக் கட்டுப்பாடு அல்லது மற்றவர்கள் கவனிக்கத் தவறும் சிக்கலான பகுப்பாய்வுப் பணிகளைச் சமாளிப்பதற்கு ஒரு சிறந்த நேரமாகும்.\",\n    \"finance_en\": \"Reviewing your expenditures today could reveal potential savings. Pay close attention to small, recurring bills that might be draining your resources.\",\n    \"finance_ta\": \"இன்று உங்கள் செலவுகளை மறுபரிசீலனை செய்வது சேமிப்பிற்கான சாத்தியங்களை வெளிப்படுத்தலாம். உங்கள் வளங்களைச் செலவழிக்கும் சிறிய, மீண்டும் மீண்டும் வரும் கட்டணங்களில் அதிக கவனம் செலுத்துங்கள்.\",\n    \"health_en\": \"Focus on clean eating and improving your digestive health. Reducing unnecessary stimulation will help calm your nerves.\",\n    \"health_ta\": \"சுகாதாரமான உணவை உண்பதிலும், செரிமான ஆரோக்கியத்தை மேம்படுத்துவதிலும் கவனம் செலுத்துங்கள். தேவையற்ற தூண்டுதல்களைக் குறைப்பது உங்கள் நரம்புகளை அமைதிப்படுத்த உதவும்.\",\n    \"lucky_number\": \"5\",\n    \"lucky_color_en\": \"Navy Blue\",\n    \"lucky_color_ta\": \"கரும் நீலம்\"\n  },\n  {\n    \"sign_en\": \"Libra\",\n    \"sign_ta\": \"துலாம்\",\n    \"date\": \"2026-01-23\",\n    \"forecast_en\": \"Harmony in relationships, both professional and personal, is paramount. You are called upon to use your diplomatic skills to mediate minor disagreements and foster cooperation.\",\n    \"forecast_ta\": \"தொழில் மற்றும் தனிப்பட்ட உறவுகளில் இணக்கம் இன்று முதன்மையானது. சிறிய கருத்து வேறுபாடுகளைத் தீர்க்கவும் ஒத்துழைப்பை வளர்க்கவும் உங்கள் இராஜதந்திரத் திறன்களைப் பயன்படுத்த நீங்கள் அழைக்கப்படுவீர்கள்.\",\n    \"career_en\": \"Partnerships and joint ventures are highly favored. Negotiations will proceed smoothly if you maintain fairness and listen to the counterparty's needs.\",\n    \"career_ta\": \"கூட்டாண்மை மற்றும் கூட்டுத் தொழில் முயற்சிகள் மிகவும் சாதகமானவை. நீங்கள் நேர்மையைப் பேணினால் மற்றும் மற்ற தரப்பினரின் தேவைகளைக் கேட்டறிந்தால் பேச்சுவார்த்தைகள் சுமூகமாக நடைபெறும்.\",\n    \"finance_en\": \"Financial matters related to a partner or spouse may require your attention. Ensure that shared resources are managed transparently.\",\n    \"finance_ta\": \"கூட்டாளர் அல்லது துணையுடன் தொடர்புடைய பொருள்நிலை விஷயங்கள் உங்கள் கவனத்தை ஈர்க்கலாம். பகிரப்பட்ட வளங்கள் வெளிப்படையாக நிர்வகிக்கப்படுவதை உறுதிப்படுத்திக் கொள்ளுங்கள்.\",\n    \"health_en\": \"Seek balance between work and rest. Engaging in peaceful, aesthetically pleasing activities will help soothe your mind.\",\n    \"health_ta\": \"வேலைக்கும் ஓய்வுக்கும் இடையில் சமநிலையை நாடுங்கள். அமைதியான, அழகியல் சார்ந்த நடவடிக்கைகளில் ஈடுபடுவது உங்கள் மனதை அமைதிப்படுத்த உதவும்.\",\n    \"lucky_number\": \"6\",\n    \"lucky_color_en\": \"Pink\",\n    \"lucky_color_ta\": \"இளஞ்சிவப்பு\"\n  },\n  {\n    \"sign_en\": \"Scorpio\",\n    \"sign_ta\": \"விருச்சிகம்\",\n    \"date\": \"2026-01-23\",\n    \"forecast_en\": \"This is a day for deep introspection and transformation. You possess the focus required to uncover hidden truths or solve complex emotional puzzles. Trust your intense inner guidance.\",\n    \"forecast_ta\": \"இது ஆழ்ந்த உள்நோக்கு மற்றும் மாற்றம் காணும் நாளாகும். மறைந்திருக்கும் உண்மைகளைக் கண்டறிய அல்லது சிக்கலான உணர்ச்சி சார்ந்த புதிர்களைத் தீர்க்கத் தேவையான கவனம் உங்களிடம் உள்ளது. உங்கள் தீவிரமான உள் வழிகாட்டலை நம்புங்கள்.\",\n    \"career_en\": \"Excellent for research, investigation, or work involving shared resources or contracts. Avoid power struggles; focus on strategic moves instead.\",\n    \"career_ta\": \"ஆராய்ச்சி, விசாரணை அல்லது பகிரப்பட்ட வளங்கள் அல்லது ஒப்பந்தங்கள் தொடர்பான பணிகளுக்கு இது மிகச் சிறந்தது. அதிகாரப் போராட்டங்களைத் தவிர்த்து, அதற்குப் பதிலாக வியூக நகர்வுகளில் கவனம் செலுத்துங்கள்.\",\n    \"finance_en\": \"Matters concerning taxes, debts, or inheritances may surface and require immediate handling. Take the time to settle outstanding financial obligations.\",\n    \"finance_ta\": \"வரிகள், கடன்கள் அல்லது மரபுரிமைகள் தொடர்பான விஷயங்கள் மேலெழலாம் மற்றும் உடனடி கவனிப்பு தேவைப்படலாம். நிலுவையில் உள்ள பொருள்நிலை கடமைகளைத் தீர்க்க நேரம் ஒதுக்குங்கள்.\",\n    \"health_en\": \"Release emotional tension through journaling or intense exercise. Ensure you are getting adequate sleep to handle the day's intensity.\",\n    \"health_ta\": \"எழுத்து வடிவத்திலோ அல்லது தீவிர உடற்பயிற்சியின் மூலமோ உணர்ச்சி சார்ந்த அழுத்தத்தை விடுவிக்கவும். அன்றைய தீவிரமான பணிகளைச் சமாளிக்க போதுமான உறக்கத்தைப் பெறுவதை உறுதிப்படுத்திக் கொள்ளுங்கள்.\",\n    \"lucky_number\": \"9\",\n    \"lucky_color_en\": \"Maroon\",\n    \"lucky_color_ta\": \"கரும்சிவப்பு\"\n  },\n  {\n    \"sign_en\": \"Sagittarius\",\n    \"sign_ta\": \"தனுசு\",\n    \"date\": \"2026-01-23\",\n    \"forecast_en\": \"Optimism and expansion mark your day. Focus on higher learning, philosophy, or connecting with people from distant places. Your thirst for knowledge is strong.\",\n    \"forecast_ta\": \"ஆர்வமும் விரிவுபடுத்தலும் உங்கள் நாளைக் குறிக்கிறது. உயர் கல்வி, தத்துவம் அல்லது தொலைதூர இடங்களில் உள்ளவர்களுடன் தொடர்பு கொள்வதில் கவனம் செலுத்துங்கள். அறிவிற்கான உங்கள் தாகம் வலுவாக உள்ளது.\",\n    \"career_en\": \"If your work involves education, publishing, or international relations, you will see great success. Be open to new perspectives offered by mentors or colleagues.\",\n    \"career_ta\": \"உங்கள் பணி கல்வி, வெளியீடு அல்லது அனைத்துலக உறவுகளை உள்ளடக்கியதாக இருந்தால், நீங்கள் சிறந்த வெற்றியைக் காண்பீர்கள். வழிகாட்டிகள் அல்லது சகாக்கள் வழங்கும் புதிய பார்வைகளுக்குத் தயாராக இருங்கள்.\",\n    \"finance_en\": \"A good day for long-term financial planning or investing in future education. Be mindful of expenses related to travel or distant ventures.\",\n    \"finance_ta\": \"நீண்ட கால பொருள்நிலை திட்டமிடல் அல்லது எதிர்காலக் கல்விக்காக முதலீடு செய்வதற்கு இது ஒரு நல்ல நாள். பயணம் அல்லது தொலைதூர முயற்சிகள் தொடர்பான செலவுகளில் விழிப்புடன் இருங்கள்.\",\n    \"health_en\": \"Outdoor activities and fresh air are highly beneficial. Avoid sedentary habits and prioritize movement to boost your mood.\",\n    \"health_ta\": \"வெளிப்புற நடவடிக்கைகள் மற்றும் புதிய காற்று மிகவும் நன்மை பயக்கும். ஒரே இடத்தில் அமர்ந்திருக்கும் பழக்கங்களைத் தவிர்த்து, உங்கள் மனநிலையை அதிகரிக்க இயக்கத்திற்கு முன்னுரிமை கொடுங்கள்.\",\n    \"lucky_number\": \"3\",\n    \"lucky_color_en\": \"Purple\",\n    \"lucky_color_ta\": \"ஊதா\"\n  },\n  {\n    \"sign_en\": \"Capricorn\",\n    \"sign_ta\": \"மகரம்\",\n    \"date\": \"2026-01-23\",\n    \"forecast_en\": \"Discipline and ambition drive your success today. Focus on achieving concrete goals and structuring your time efficiently. Authority figures will recognize your reliability.\",\n    \"forecast_ta\": \"கட்டுப்பாடும் லட்சியமும் இன்று உங்கள் வெற்றியை இயக்குகின்றன. உறுதியான இலக்குகளை அடைவதிலும், உங்கள் நேரத்தை திறமையாக ஒழுங்கமைப்பதிலும் கவனம் செலுத்துங்கள். அதிகார நபர்கள் உங்கள் நம்பகத்தன்மையை அங்கீகரிப்பார்கள்.\",\n    \"career_en\": \"This is a prime time to seek promotion or take on greater responsibilities. Your commitment to duty is unparalleled. Focus on building enduring professional relationships.\",\n    \"career_ta\": \"பதவி உயர்வு தேட அல்லது பெரிய பொறுப்புகளை ஏற்க இது ஒரு சிறந்த நேரம். கடமையின் மீதான உங்கள் அர்ப்பணிப்பு ஒப்பிட முடியாதது. நீடித்த தொழில்முறை உறவுகளை உருவாக்குவதில் கவனம் செலுத்துங்கள்.\",\n    \"finance_en\": \"Exercise caution with large purchases, but wise, long-term investments in assets like property or business infrastructure are favored.\",\n    \"finance_ta\": \"பெரிய கொள்முதல்களில் எச்சரிக்கையாக இருங்கள், ஆனால் சொத்து அல்லது வணிக உள்கட்டமைப்பு போன்ற உறுதியான நீண்ட கால முதலீடுகள் சாதகமானவை.\",\n    \"health_en\": \"Do not ignore signs of chronic stress or fatigue. Maintaining good bone and joint health should be a priority today.\",\n    \"health_ta\": \"நீண்ட கால மன அழுத்தம் அல்லது சோர்வுக்கான அறிகுறிகளை புறக்கணிக்காதீர்கள். நல்ல எலும்பு மற்றும் மூட்டு ஆரோக்கியத்தைப் பராமரிப்பது இன்று ஒரு முன்னுரிமையாக இருக்க வேண்டும்.\",\n    \"lucky_number\": \"8\",\n    \"lucky_color_en\": \"Charcoal Grey\",\n    \"lucky_color_ta\": \"சாம்பல் நிறம்\"\n  },\n  {\n    \"sign_en\": \"Aquarius\",\n    \"sign_ta\": \"கும்பம்\",\n    \"date\": \"2026-01-23\",\n    \"forecast_en\": \"Innovation and social connection dominate your day. Embrace new and unconventional approaches to old problems. Group activities bring unexpected pleasure and insight.\",\n    \"forecast_ta\": \"புதுமை மற்றும் சமூக தொடர்பு இன்று உங்கள் நாளில் ஆதிக்கம் செலுத்தும். பழைய சிக்கல்களுக்கு புதிய மற்றும் மரபுக்கு மாறான அணுகுமுறைகளைத் தழுவுங்கள். குழு நடவடிக்கைகள் எதிர்பாராத மகிழ்ச்சியையும் நுண்ணறிவையும் தருகின்றன.\",\n    \"career_en\": \"Teamwork is highly productive. If you have been working on a futuristic idea, now is the time to propose it to your peers. Collaboration leads to breakthrough solutions.\",\n    \"career_ta\": \"கூட்டுப்பணி மிகவும் பயனுள்ளதாக இருக்கும். நீங்கள் ஒரு எதிர்கால யோசனையில் வேலை செய்திருந்தால், அதை உங்கள் சகாக்களுக்கு முன்மொழிய இதுவே நேரம். ஒத்துழைப்பு முன்னேற்றத் தீர்வுகளுக்கு வழிவகுக்கும்.\",\n    \"finance_en\": \"Unexpected income may arrive through networking or freelance projects. Be cautious about lending money to casual acquaintances.\",\n    \"finance_ta\": \"வலைப்பின்னல் அல்லது சுயாதீனமான திட்டங்கள் மூலம் எதிர்பாராத வருமானம் வரலாம். சாதாரண அறிமுகமானவர்களுக்குப் பணத்தைக் கடன் கொடுப்பதில் கவனமாக இருங்கள்.\",\n    \"health_en\": \"Mental stimulation through social interaction is key. Avoid feeling isolated. Ensure good circulation by taking frequent movement breaks.\",\n    \"health_ta\": \"சமூகத் தொடர்பு மூலம் மனதிற்குத் தூண்டுதல் முக்கியமானது. தனிமையாக உணர்வதைத் தவிர்க்கவும். அடிக்கடி நகரும் இடைவெளிகளை எடுத்து நல்ல சுழற்சியை உறுதிப்படுத்திக் கொள்ளுங்கள்.\",\n    \"lucky_number\": \"4\",\n    \"lucky_color_en\": \"Sky Blue\",\n    \"lucky_color_ta\": \"வானநீலம்\"\n  },\n  {\n    \"sign_en\": \"Pisces\",\n    \"sign_ta\": \"மீனம்\",\n    \"date\": \"2026-01-23\",\n    \"forecast_en\": \"Your intuition is highly sensitized today. Prioritize quiet reflection and creative pursuits. This is a favorable day for dealing with matters that require compassion and imagination.\",\n    \"forecast_ta\": \"இன்று உங்கள் உள்ளுணர்வு மிகவும் உணர்திறன் மிக்கதாக இருக்கும். அமைதியான பிரதிபலிப்பு மற்றும் ஆக்கபூர்வமான முயற்சிகளுக்கு முன்னுரிமை கொடுங்கள். இரக்கமும் கற்பனையும் தேவைப்படும் விஷயங்களைக் கையாள இது ஒரு சாதகமான நாளாகும்.\",\n    \"career_en\": \"Behind-the-scenes work or tasks involving artistic expression will thrive. Trust your gut feeling over concrete facts when making tricky professional choices.\",\n    \"career_ta\": \"திரைக்குப் பின்னால் உள்ள வேலைகள் அல்லது கலை வெளிப்பாடு தொடர்பான பணிகள் செழிக்கும். தந்திரமான தொழில்முறை தேர்வுகளை எடுக்கும்போது உறுதியான உண்மைகளை விட உங்கள் உள்ளுணர்வை நம்புங்கள்.\",\n    \"finance_en\": \"Be cautious about speculative investments today; they are likely based more on hope than on reality. Trust your intuitive sense of value.\",\n    \"finance_ta\": \"ஊகமான முதலீடுகள் குறித்து இன்று எச்சரிக்கையாக இருங்கள்; அவை நிஜத்தை விட நம்பிக்கையை அடிப்படையாகக் கொண்டதாக இருக்கலாம். மதிப்பைப் பற்றிய உங்கள் உள்ளுணர்வு உணர்வை நம்புங்கள்.\",\n    \"health_en\": \"Meditation, yoga, or spending time near water will be restorative. Pay attention to your feet and ensure you are getting enough downtime.\",\n    \"health_ta\": \"தியானம், யோகா அல்லது நீரின் அருகில் நேரம் செலவிடுவது புத்துணர்ச்சி அளிக்கும். உங்கள் பாதங்களில் கவனம் செலுத்துங்கள் மற்றும் போதுமான ஓய்வு நேரத்தைப் பெறுவதை உறுதிப்படுத்திக் கொள்ளுங்கள்.\",\n    \"lucky_number\": \"7\",\n    \"lucky_color_en\": \"Sea Green\",\n    \"lucky_color_ta\": \"கடல் பச்சை\"\n  }\n]\n```"}],"role":"model"},"finishReason":"STOP","index":0}]