[{"content":{"parts":[{"text":"```json\n[\n  {\n    \"sign_en\": \"Aries\",\n    \"sign_ta\": \"மேஷம்\",\n    \"date\": \"2026-01-31\",\n    \"forecast_en\": \"Today is an energetic day. You will feel motivated to complete pending tasks and take charge of new initiatives. Use this burst of productivity wisely.\",\n    \"forecast_ta\": \"இன்று மிகவும் ஆற்றல் மிகுந்த நாளாக இருக்கும். முடிக்கப்படாமல் உள்ள பணிகளைச் செய்து முடிக்கவும், புதிய முயற்சிகளை மேற்கொள்ளவும் ஆர்வம் காண்பீர்கள். இந்த செயல்திறனைச் சரியாகப் பயன்படுத்துங்கள்.\",\n    \"career_en\": \"Leadership qualities will shine. You might receive appreciation for quick decision-making. Excellent day for presenting innovative ideas to management.\",\n    \"career_ta\": \"உங்கள் தலைமைப் பண்பு இன்று பிரகாசிக்கும். விரைவான முடிவெடுக்கும் திறனுக்காகப் பாராட்டு பெறுவீர்கள். நிர்வாகத்திடம் புதிய யோசனைகளை முன்வைக்கச் சிறந்த நாள்.\",\n    \"finance_en\": \"Your financial planning is sound. Consider minor, long-term investments. Avoid lending money to acquaintances today.\",\n    \"finance_ta\": \"உங்கள் நிதி மேலாண்மை பலமாக உள்ளது. சிறிய, நீண்ட கால முதலீடுகளைக் கருத்தில் கொள்ளலாம். இன்று தெரிந்தவர்களுக்குக் கடன் கொடுப்பதைத் தவிர்க்கவும்.\",\n    \"health_en\": \"Physical energy levels are high. Channel this via vigorous exercise. Be mindful of stress headaches due to overworking.\",\n    \"health_ta\": \"உடல் ஆற்றல் அதிகமாக இருக்கும். அதைச் சரியான உடற்பயிற்சியின் மூலம் பயன்படுத்துங்கள். அதிக வேலை காரணமாக வரும் மன அழுத்தத் தலைவலியில் கவனம் தேவை.\",\n    \"lucky_number\": \"9\",\n    \"lucky_color_en\": \"Red\",\n    \"lucky_color_ta\": \"சிவப்பு\"\n  },\n  {\n    \"sign_en\": \"Taurus\",\n    \"sign_ta\": \"ரிஷபம்\",\n    \"date\": \"2026-01-31\",\n    \"forecast_en\": \"Stability is your focus today. You will find comfort in routine and domestic affairs. Pay attention to details you might have previously overlooked.\",\n    \"forecast_ta\": \"இன்று நிலைத்தன்மை உங்கள் கவனத்தில் இருக்கும். வழக்கமான பணிகளிலும், வீட்டுக் கடமைகளிலும் மனநிறைவைக் காண்பீர்கள். முன்னர் நீங்கள் கவனிக்கத் தவறிய விவரங்களுக்கு முக்கியத்துவம் கொடுங்கள்.\",\n    \"career_en\": \"Progress will be steady, not rapid. Your patience and persistence will resolve complicated workplace issues. Maintain excellent professionalism.\",\n    \"career_ta\": \"முன்னேற்றம் நிலையாக இருக்கும், விரைவாக அல்ல. உங்கள் பொறுமையும் விடாமுயற்சியும் பணியிடத்தில் உள்ள சிக்கலான விவகாரங்களைத் தீர்க்க உதவும். சிறந்த பணி ஒழுக்கத்தைக் கடைப்பிடிக்கவும்.\",\n    \"finance_en\": \"A good day for reviewing assets and consolidating debts. Avoid making impulsive high-value purchases. Focus on savings.\",\n    \"finance_ta\": \"சொத்துக்களை மதிப்பாய்வு செய்வதற்கும், கடன்களை ஒருங்கிணைப்பதற்கும் இது ஒரு நல்ல நாள். தூண்டுதலின் பேரில் அதிக மதிப்புள்ள பொருட்களை வாங்குவதைத் தவிர்க்கவும். சேமிப்பில் கவனம் தேவை.\",\n    \"health_en\": \"Maintain a balanced diet and hydration. Relaxation techniques like meditation will greatly help manage underlying anxiety.\",\n    \"health_ta\": \"சமச்சீரான உணவு மற்றும் நீரேற்றத்தைப் பேணுங்கள். தியானம் போன்ற தளர்வு முறைகள் மன அழுத்தத்தை நிர்வகிக்கப் பெரிதும் உதவும்.\",\n    \"lucky_number\": \"6\",\n    \"lucky_color_en\": \"Pink\",\n    \"lucky_color_ta\": \"இளஞ்சிவப்பு\"\n  },\n  {\n    \"sign_en\": \"Gemini\",\n    \"sign_ta\": \"மிதுனம்\",\n    \"date\": \"2026-01-31\",\n    \"forecast_en\": \"Communication is highlighted today. It’s an ideal time for networking, learning new skills, or engaging in meaningful conversations. Your mental agility is sharp.\",\n    \"forecast_ta\": \"இன்று தொடர்புகளுக்கு அதிக முக்கியத்துவம் கிடைக்கும். புதிய உறவுகளை ஏற்படுத்திக் கொள்ளவும், புதிய திறன்களைக் கற்றுக்கொள்ளவும் அல்லது ஆழமான உரையாடல்களில் ஈடுபடவும் ஏற்ற நேரம். உங்கள் மனத் திறன் கூர்மையாக இருக்கும்.\",\n    \"career_en\": \"Negotiations will be favorable. If you are in sales or media, this is a highly productive day. Ensure all documentation is accurate before signing.\",\n    \"career_ta\": \"பேச்சுவார்த்தைகள் உங்களுக்குச் சாதகமாக அமையும். நீங்கள் விற்பனை அல்லது ஊடகத் துறையில் இருந்தால், இது மிகவும் பலனுள்ள நாள். கையெழுத்திடுவதற்கு முன் அனைத்து ஆவணங்களும் சரியாக உள்ளதா என உறுதிப்படுத்தவும்.\",\n    \"finance_en\": \"Income sources look promising, possibly through freelance or part-time work. Avoid investing based on unverified information or 'get rich quick' schemes.\",\n    \"finance_ta\": \"வருமான வழிகள் நம்பிக்கைக்குரியதாகத் தெரிகிறது, இது பகுதிநேர வேலை மூலம் கிடைக்கலாம். சரிபார்க்கப்படாத தகவல்கள் அல்லது உடனடி பணக்காரர் ஆகும் திட்டங்களின் அடிப்படையில் முதலீடு செய்வதைத் தவிர்க்கவும்.\",\n    \"health_en\": \"Mental fatigue is a risk due to overthinking. Take short breaks and engage in light-hearted activities to refresh your mind.\",\n    \"health_ta\": \"அதிகமாகச் சிந்திப்பதன் காரணமாக மனச்சோர்வு ஏற்பட வாய்ப்புள்ளது. உங்கள் மனதைப் புத்துணர்ச்சியடையச் செய்யச் சிறிய இடைவெளிகளை எடுத்துக் கொண்டு மகிழ்ச்சியான செயல்களில் ஈடுபடுங்கள்.\",\n    \"lucky_number\": \"5\",\n    \"lucky_color_en\": \"Green\",\n    \"lucky_color_ta\": \"பச்சை\"\n  },\n  {\n    \"sign_en\": \"Cancer\",\n    \"sign_ta\": \"கடகம்\",\n    \"date\": \"2026-01-31\",\n    \"forecast_en\": \"Emotional security and home life take precedence. You may need to address a sensitive family matter. Trust your strong intuition today.\",\n    \"forecast_ta\": \"உணர்ச்சிப் பாதுகாப்பு மற்றும் குடும்ப வாழ்க்கை இன்று முதலிடம் வகிக்கும். நீங்கள் ஒரு முக்கியமான குடும்பப் பிரச்சினையை அணுக வேண்டியிருக்கலாம். இன்று உங்கள் உள்ளுணர்வை நம்புங்கள்.\",\n    \"career_en\": \"Support from colleagues is strong. Focus on tasks that require nurturing and detailed follow-up. Avoid unnecessary workplace conflicts.\",\n    \"career_ta\": \"சக ஊழியர்களின் ஆதரவு வலுவாக இருக்கும். அக்கறை மற்றும் விரிவான தொடர் நடவடிக்கைகள் தேவைப்படும் பணிகளில் கவனம் செலுத்துங்கள். பணியிடத்தில் தேவையற்ற சண்டைகளைத் தவிர்க்கவும்.\",\n    \"finance_en\": \"A favorable day for real estate matters or home-related investments. While income is stable, ensure you track minor, recurrent expenses carefully.\",\n    \"finance_ta\": \"மனை தொடர்பான அல்லது வீட்டுக்குத் தேவையான முதலீடுகளுக்குச் சாதகமான நாள். வருமானம் நிலையாக இருந்தாலும், சிறிய, தொடர்ச்சியான செலவுகளைக் கவனமாகப் பதிவு செய்யுங்கள்.\",\n    \"health_en\": \"Emotional well-being affects physical health. Prioritize quality sleep and spend time in environments that bring you peace and comfort.\",\n    \"health_ta\": \"உணர்ச்சி சமநிலை உடல் நலத்தைப் பாதிக்கும். தரமான தூக்கத்திற்கு முக்கியத்துவம் கொடுத்து, உங்களுக்கு அமைதி மற்றும் ஆறுதல் தரும் சூழலில் நேரத்தைச் செலவிடுங்கள்.\",\n    \"lucky_number\": \"2\",\n    \"lucky_color_en\": \"Cream\",\n    \"lucky_color_ta\": \"வெண்மை\"\n  },\n  {\n    \"sign_en\": \"Leo\",\n    \"sign_ta\": \"சிம்மம்\",\n    \"date\": \"2026-01-31\",\n    \"forecast_en\": \"Your charisma and confidence are high. This is a powerful day for self-promotion and showcasing your talents. Do not hesitate to take the initiative.\",\n    \"forecast_ta\": \"உங்கள் வசீகரமும் தன்னம்பிக்கையும் இன்று உச்சத்தில் இருக்கும். சுய விளம்பரம் மற்றும் உங்கள் திறமைகளை வெளிப்படுத்த இது ஒரு சக்திவாய்ந்த நாள். முன்முயற்சி எடுக்கத் தயங்க வேண்டாம்.\",\n    \"career_en\": \"Recognition is likely for past efforts. A good day to pitch creative projects or take on a leadership role in an important team meeting.\",\n    \"career_ta\": \"கடந்த கால முயற்சிகளுக்குப் பாராட்டு கிடைக்க வாய்ப்புள்ளது. ஆக்கபூர்வமான திட்டங்களை முன்வைக்க அல்லது முக்கியமான குழு கூட்டத்தில் தலைமைப் பாத்திரத்தை ஏற்க இது ஒரு நல்ல நாள்.\",\n    \"finance_en\": \"Money flow is good, and you might receive a windfall. Be cautious against overspending on luxury items to maintain your image. Budget for fun.\",\n    \"finance_ta\": \"பணம் வரவு நன்றாக இருக்கும், எதிர்பாராத நிதி வரவு கிடைக்கலாம். உங்கள் தோற்றத்தைக் காட்டுவதற்காக ஆடம்பரப் பொருட்களுக்கு அதிகமாகச் செலவு செய்வதைத் தவிர்க்க எச்சரிக்கையாக இருங்கள். மகிழ்ச்சிக்காக வரவு செலவுத் திட்டம் வகுக்கவும்.\",\n    \"health_en\": \"Focus on heart health and maintaining high energy levels through proper exercise. Avoid burning the candle at both ends.\",\n    \"health_ta\": \"சரியான உடற்பயிற்சியின் மூலம் இதய ஆரோக்கியத்தைப் பராமரிப்பதிலும், அதிக ஆற்றல் மட்டங்களைத் தக்கவைப்பதிலும் கவனம் செலுத்துங்கள். ஓய்வின்றி உழைப்பதைத் தவிர்க்கவும்.\",\n    \"lucky_number\": \"1\",\n    \"lucky_color_en\": \"Gold\",\n    \"lucky_color_ta\": \"பொன்நிறம்\"\n  },\n  {\n    \"sign_en\": \"Virgo\",\n    \"sign_ta\": \"கன்னி\",\n    \"date\": \"2026-01-31\",\n    \"forecast_en\": \"Detail orientation is key. This is the perfect day for organization, analysis, and cleaning up messes—both physical and metaphorical. Efficiency is your mantra.\",\n    \"forecast_ta\": \"விவரங்களுக்கு முக்கியத்துவம் கொடுப்பது அவசியமாகும். ஒழுங்கமைப்பதற்கும், ஆய்வு செய்வதற்கும், மற்றும் நிலுவைகளைச் சரிசெய்வதற்கும் (உடல்ரீதியாகவும் குறியீட்டு ரீதியாகவும்) இது சரியான நாள். செயல்திறனே உங்களது மந்திரம்.\",\n    \"career_en\": \"Excellent day for data analysis, editing, or tasks requiring meticulous precision. Your ability to spot flaws will be valuable. Assist colleagues who seek your structured advice.\",\n    \"career_ta\": \"தரவு ஆய்வு, திருத்தம் அல்லது மிக நுணுக்கமான துல்லியம் தேவைப்படும் பணிகளுக்குச் சிறந்த நாள். குறைகளைக் கண்டறியும் உங்கள் திறன் மதிப்புமிக்கதாக இருக்கும். உங்கள் ஆலோசனை கேட்கும் சக ஊழியர்களுக்கு உதவுங்கள்.\",\n    \"finance_en\": \"Reviewing your expense reports can lead to significant savings. Avoid unnecessary large loans. Focus on quality over quantity in purchases.\",\n    \"finance_ta\": \"உங்கள் செலவுக் கணக்குகளை மதிப்பாய்வு செய்வது குறிப்பிடத்தக்க சேமிப்புக்கு வழிவகுக்கும். தேவையற்ற பெரிய கடன்களைத் தவிர்க்கவும். வாங்கும் பொருட்களில் அளவை விடத் தரத்தில் கவனம் செலுத்துங்கள்.\",\n    \"health_en\": \"Gut health requires attention. Stress directly impacts your digestion. Try gentle stretching and deep breathing exercises.\",\n    \"health_ta\": \"செரிமான ஆரோக்கியத்தில் கவனம் தேவை. மன அழுத்தம் உங்கள் செரிமானத்தை நேரடியாகப் பாதிக்கிறது. மென்மையான நீட்டல் மற்றும் ஆழ்ந்த சுவாசப் பயிற்சிகளை முயற்சிக்கவும்.\",\n    \"lucky_number\": \"3\",\n    \"lucky_color_en\": \"Blue\",\n    \"lucky_color_ta\": \"நீலம்\"\n  },\n  {\n    \"sign_en\": \"Libra\",\n    \"sign_ta\": \"துலாம்\",\n    \"date\": \"2026-01-31\",\n    \"forecast_en\": \"The focus is on partnership and balance. You may need to mediate a conflict or seek harmony in a close relationship. Diplomacy will be your greatest asset.\",\n    \"forecast_ta\": \"இன்று கூட்டுறவு மற்றும் சமநிலையில் கவனம் செலுத்துவீர்கள். நீங்கள் ஒரு மோதலைத் தீர்க்க வேண்டியிருக்கலாம் அல்லது நெருங்கிய உறவில் இணக்கத்தைத் தேடலாம். இராஜதந்திரம் உங்கள் மிகப்பெரிய பலமாக இருக்கும்.\",\n    \"career_en\": \"Highly favorable for legal matters, contracts, and joint ventures. Collaboration yields better results than working alone. Seek constructive criticism.\",\n    \"career_ta\": \"சட்ட விவகாரங்கள், ஒப்பந்தங்கள் மற்றும் கூட்டுக் கடமைகளுக்கு மிகவும் சாதகமானது. தனியாகச் செயல்படுவதை விட ஒத்துழைப்பு சிறந்த முடிவுகளைத் தரும். ஆக்கபூர்வமான விமர்சனத்தை நாடுங்கள்.\",\n    \"finance_en\": \"Be fair in financial dealings. If managing joint funds, ensure transparency. It’s a good day for seeking expert financial advice.\",\n    \"finance_ta\": \"நிதிப் பரிவர்த்தனைகளில் நேர்மையாக இருங்கள். கூட்டாக நிர்வகிக்கும்போது, ​​வெளிப்படைத்தன்மையை உறுதிப்படுத்தவும். நிபுணரின் நிதி ஆலோசனையைப் பெற இது ஒரு நல்ல நாள்.\",\n    \"health_en\": \"Seek mental peace. Imbalance in relationships can cause stress. Spend time with supportive people and ensure restful sleep.\",\n    \"health_ta\": \"மன அமைதியை நாடுங்கள். உறவுகளில் சமநிலையற்ற தன்மை மன அழுத்தத்தை ஏற்படுத்தும். ஆதரவளிக்கும் நபர்களுடன் நேரத்தைச் செலவிடுங்கள் மற்றும் நிம்மதியான உறக்கத்தை உறுதி செய்யுங்கள்.\",\n    \"lucky_number\": \"7\",\n    \"lucky_color_en\": \"Pastel Pink\",\n    \"lucky_color_ta\": \"மென் சிவப்பு\"\n  },\n  {\n    \"sign_en\": \"Scorpio\",\n    \"sign_ta\": \"விருச்சிகம்\",\n    \"date\": \"2026-01-31\",\n    \"forecast_en\": \"Intensity is high, prompting deep reflection and transformation. Focus on matters that require profound investigation or self-improvement. Avoid unnecessary power struggles.\",\n    \"forecast_ta\": \"தீவிரம் அதிகமாக இருக்கும், இது ஆழ்ந்த சிந்தனைக்கும் மாற்றத்திற்கும் வழிவகுக்கும். நுட்பமான ஆய்வு அல்லது சுய முன்னேற்றம் தேவைப்படும் விஷயங்களில் கவனம் செலுத்துங்கள். தேவையற்ற அதிகாரப் போட்டிகளைத் தவிர்க்கவும்.\",\n    \"career_en\": \"Excellent day for research, detective work, or handling confidential information. You possess the focus needed to solve complex mysteries. Trust your instincts.\",\n    \"career_ta\": \"ஆராய்ச்சி, புலனாய்வு வேலைகள் அல்லது இரகசியத் தகவல்களைக் கையாளுவதற்குச் சிறந்த நாள். சிக்கலான புதிர்களைத் தீர்க்கத் தேவையான கவனம் உங்களிடம் உள்ளது. உங்கள் உள்ளுணர்வை நம்புங்கள்.\",\n    \"finance_en\": \"Matters concerning shared assets, taxes, or inheritances may surface. A favorable time for renegotiating loans or large contracts.\",\n    \"finance_ta\": \"பகிரப்பட்ட சொத்துக்கள், வரிகள் அல்லது வாரிசுரிமை தொடர்பான விவகாரங்கள் வெளிப்படலாம். கடன்கள் அல்லது பெரிய ஒப்பந்தங்களை மறுபரிசீலனை செய்யச் சாதகமான நேரம்.\",\n    \"health_en\": \"Emotional detoxification is crucial. Releasing old resentments will positively impact your physical health. Ensure you stay hydrated.\",\n    \"health_ta\": \"உணர்ச்சி ரீதியான நச்சுக்களை வெளியேற்றுவது இன்றியமையாதது. பழைய மனக்கசப்புகளை விடுவிப்பது உங்கள் உடல் ஆரோக்கியத்தில் சாதகமான தாக்கத்தை ஏற்படுத்தும். போதுமான அளவு நீர் அருந்துவதை உறுதி செய்யவும்.\",\n    \"lucky_number\": \"8\",\n    \"lucky_color_en\": \"Maroon\",\n    \"lucky_color_ta\": \"செங்கல் சிவப்பு\"\n  },\n  {\n    \"sign_en\": \"Sagittarius\",\n    \"sign_ta\": \"தனுசு\",\n    \"date\": \"2026-01-31\",\n    \"forecast_en\": \"Optimism prevails, and you feel ready to expand your horizons. Focus on education, long-distance plans, or philosophical discussions. Seek truth and knowledge.\",\n    \"forecast_ta\": \"நம்பிக்கை மேலோங்கும், உங்கள் எல்லைகளை விரிவுபடுத்தத் தயாராக உணருவீர்கள். கல்வி, தொலைதூரத் திட்டங்கள் அல்லது தத்துவ விவாதங்களில் கவனம் செலுத்துங்கள். உண்மையும் அறிவும் தேடுங்கள்.\",\n    \"career_en\": \"Opportunities related to foreign connections or travel may arise. Good for teaching, publishing, or mentoring. Ensure goals are practical, not just aspirational.\",\n    \"career_ta\": \"வெளிநாட்டுத் தொடர்புகள் அல்லது பயணம் தொடர்பான வாய்ப்புகள் உருவாகலாம். கற்பித்தல், வெளியிடுதல் அல்லது வழிகாட்டுதல் பணிகளுக்கு நல்லது. குறிக்கோள்கள் வெறும் இலட்சியமாக இல்லாமல் நடைமுறைக்கு உகந்ததாக இருக்க வேண்டும்.\",\n    \"finance_en\": \"You may spend money on experiences like travel or education. While generally good, avoid overestimating future financial gains.\",\n    \"finance_ta\": \"பயணம் அல்லது கல்வி போன்ற அனுபவங்களுக்காகப் பணத்தைச் செலவழிக்கலாம். பொதுவாக நல்லது என்றாலும், எதிர்கால நிதி ஆதாயங்களை அதிகமாக மதிப்பிடுவதைத் தவிர்க்கவும்.\",\n    \"health_en\": \"Outdoor activities are highly beneficial for your spirit. Be mindful of minor strains on the hips or thighs during exercise.\",\n    \"health_ta\": \"வெளிப்புறச் செயல்பாடுகள் உங்கள் மனதிற்கு மிகவும் நன்மை பயக்கும். உடற்பயிற்சியின் போது இடுப்பு அல்லது தொடையின் தசையில் ஏற்படும் சிறிய இறுக்கங்களில் கவனமாக இருங்கள்.\",\n    \"lucky_number\": \"4\",\n    \"lucky_color_en\": \"Yellow\",\n    \"lucky_color_ta\": \"மஞ்சள்\"\n  },\n  {\n    \"sign_en\": \"Capricorn\",\n    \"sign_ta\": \"மகரம்\",\n    \"date\": \"2026-01-31\",\n    \"forecast_en\": \"Discipline and structure bring success. It’s a day for achieving tangible goals and gaining respect from authority figures. Responsibility rests heavily, but you are ready.\",\n    \"forecast_ta\": \"கட்டுப்பாடும் கட்டமைப்பும் வெற்றியைத் தரும். இது உறுதியான இலக்குகளை அடைவதற்கும், அதிகார மையங்களிடமிருந்து மரியாதையைப் பெறுவதற்கும் உரிய நாள். பொறுப்புகள் அதிகமாக இருந்தாலும், நீங்கள் தயாராக இருக்கிறீர்கள்.\",\n    \"career_en\": \"This is a peak day for professional ambition. You might be offered a promotion or a project that solidifies your standing. Dedication will be rewarded.\",\n    \"career_ta\": \"தொழில் இலக்குகளை அடைவதற்கான உச்சகட்ட நாள் இது. உங்கள் நிலையை உறுதிப்படுத்தும் பதவி உயர்வு அல்லது திட்டம் உங்களுக்கு வழங்கப்படலாம். அர்ப்பணிப்புக்கு வெகுமதி கிடைக்கும்.\",\n    \"finance_en\": \"Financial stability is high. Excellent time for long-term savings plans, securing property, or making wise, calculated investments.\",\n    \"finance_ta\": \"நிதி நிலைத்தன்மை அதிகமாக இருக்கும். நீண்ட கால சேமிப்புத் திட்டங்கள், சொத்துக்களைப் பாதுகாத்தல் அல்லது புத்திசாலித்தனமான, கணக்கிடப்பட்ட முதலீடுகளைச் செய்வதற்குச் சிறந்த நேரம்.\",\n    \"health_en\": \"Focus on the knees and bones. Avoid overexertion, especially if lifting heavy objects. Maintaining routine is key to mental health.\",\n    \"health_ta\": \"முழங்கால்கள் மற்றும் எலும்புகளில் கவனம் செலுத்துங்கள். குறிப்பாகப் பாரமான பொருட்களைத் தூக்கும்போது அதிகப்படியான வேலைகளைத் தவிர்க்கவும். வழக்கத்தைப் பராமரிப்பது மன ஆரோக்கியத்திற்கு முக்கியம்.\",\n    \"lucky_number\": \"5\",\n    \"lucky_color_en\": \"Brown\",\n    \"lucky_color_ta\": \"பழுப்பு\"\n  },\n  {\n    \"sign_en\": \"Aquarius\",\n    \"sign_ta\": \"கும்பம்\",\n    \"date\": \"2026-01-31\",\n    \"forecast_en\": \"Innovation and humanitarian efforts are highlighted. You feel drawn to your community or social circle. Embrace new technology and unconventional approaches.\",\n    \"forecast_ta\": \"புதுமைகளும் சமூக நல முயற்சிகளும் இன்று முக்கியத்துவம் பெறும். உங்கள் சமூகம் அல்லது நட்பு வட்டாரத்தின்பால் ஈர்க்கப்படுவீர்கள். புதிய தொழில்நுட்பம் மற்றும் மரபுசாரா அணுகுமுறைகளை ஏற்றுக்கொள்ளுங்கள்.\",\n    \"career_en\": \"Group projects and team dynamics flourish. Your unique ideas will be highly valued. Seek input from diverse sources to improve overall effectiveness.\",\n    \"career_ta\": \"குழுத் திட்டங்கள் மற்றும் குழு இயக்கவியல் செழிக்கும். உங்கள் தனித்துவமான கருத்துக்களுக்கு அதிக மதிப்பு இருக்கும். ஒட்டுமொத்த செயல்திறனை மேம்படுத்தப் பலதரப்பட்ட ஆதாரங்களிலிருந்து உள்ளீடுகளைப் பெறுங்கள்.\",\n    \"finance_en\": \"Unexpected expenses related to technology or social gatherings may arise. Review your budget to allocate funds for networking and educational purposes.\",\n    \"finance_ta\": \"தொழில்நுட்பம் அல்லது சமூகக் கூட்டங்கள் தொடர்பான எதிர்பாராத செலவுகள் ஏற்படலாம். உறவுகளை வளர்க்கவும், கல்வி நோக்கங்களுக்காகவும் நிதியை ஒதுக்க உங்கள் வரவு செலவுத் திட்டத்தை மதிப்பாய்வு செய்யவும்.\",\n    \"health_en\": \"Avoid restless energy. Engage in activities that stimulate your mind, like puzzles or debates. Ensure proper circulation in your legs and ankles.\",\n    \"health_ta\": \"ஓய்வில்லாத ஆற்றலைத் தவிர்க்கவும். புதிர்கள் அல்லது விவாதங்கள் போன்ற உங்கள் மனதைத் தூண்டும் செயல்களில் ஈடுபடுங்கள். உங்கள் கால்கள் மற்றும் கணுக்கால்களில் சரியான இரத்த ஓட்டத்தை உறுதிப்படுத்தவும்.\",\n    \"lucky_number\": \"11\",\n    \"lucky_color_en\": \"Electric Blue\",\n    \"lucky_color_ta\": \"வான நீலம்\"\n  },\n  {\n    \"sign_en\": \"Pisces\",\n    \"sign_ta\": \"மீனம்\",\n    \"date\": \"2026-01-31\",\n    \"forecast_en\": \"Intuition is extremely strong. This is a day for creativity, artistic endeavors, and quiet contemplation. Use your empathy to understand others, but guard your emotional boundaries.\",\n    \"forecast_ta\": \"உள்ளுணர்வு மிக மிகத் தெளிவாக இருக்கும். படைப்பாற்றல், கலை முயற்சிகள் மற்றும் அமைதியான சிந்தனைக்கு இது ஒரு நாள். மற்றவர்களைப் புரிந்து கொள்ள உங்கள் பச்சாதாபத்தைப் பயன்படுத்துங்கள், ஆனால் உங்கள் உணர்ச்சி எல்லைகளைக் காத்துக் கொள்ளுங்கள்.\",\n    \"career_en\": \"Work behind the scenes yields great results. Avoid high-pressure sales roles today. Excellent for charity work or any role requiring compassion and imagination.\",\n    \"career_ta\": \"திரைக்குப் பின்னால் செய்யும் வேலைகள் சிறந்த பலனைத் தரும். இன்று அதிக அழுத்தம் உள்ள விற்பனைப் பணிகளைத் தவிர்க்கவும். தொண்டுப் பணிகள் அல்லது இரக்கமும் கற்பனையும் தேவைப்படும் எந்தப் பணிக்கும் சிறந்தது.\",\n    \"finance_en\": \"Be cautious in money matters. Avoid lending large amounts without clear terms. Trust your gut feeling when dealing with new financial proposals.\",\n    \"finance_ta\": \"பண விவகாரங்களில் கவனமாக இருங்கள். தெளிவான விதிமுறைகள் இல்லாமல் பெரிய தொகையைக் கடனாகக் கொடுப்பதைத் தவிர்க்கவும். புதிய நிதி முன்மொழிவுகளைக் கையாளும் போது உங்கள் உள்ளுணர்வை நம்புங்கள்.\",\n    \"health_en\": \"Water-based activities, like swimming or a relaxing bath, will soothe your nerves. Prioritize mental solitude to recharge your spiritual battery.\",\n    \"health_ta\": \"நீச்சல் அல்லது ஓய்வெடுக்கும் குளியல் போன்ற நீர் சார்ந்த செயல்பாடுகள் உங்கள் நரம்புகளை அமைதிப்படுத்தும். உங்கள் ஆன்மீக ஆற்றலை நிரப்ப மன அமைதிக்கு முன்னுரிமை கொடுங்கள்.\",\n    \"lucky_number\": \"3\",\n    \"lucky_color_en\": \"Sea Green\",\n    \"lucky_color_ta\": \"கடல் பச்சை\"\n  }\n]\n```"}],"role":"model"},"finishReason":"STOP","index":0}]