[
  {
    "sign_ta": "மேஷம்",
    "sign_en": "Aries",
    "date": "13-02-2026",
    "prediction_ta": "இன்று மேஷ ராசிக்காரர்களுக்கு ஒரு அற்புதமான நாளாக அமையும். சுக்கிரனின் ஆதிக்கத்தால் உங்கள் உறவுகளில் தெளிவும், அன்பும் பெருக்கெடுக்கும். குறிப்பாக, தனிப்பட்ட உறவுகளில் புதியதொரு பரிமாணம் ஏற்படும். நீண்டகாலமாக இருந்த சிறிய மனக்கசப்புகள் மெல்ல நீங்கி, இதயப்பூர்வமான இணைப்புக்கு வழிவகுக்கும். வீட்டில் அமைதியும், மகிழ்ச்சியும் நிறைந்திருக்கும். உங்கள் துணையுடன் நீங்கள் செலவிடும் நேரம் இனிமையாகவும், அர்த்தமுள்ளதாகவும் இருக்கும். கலை மற்றும் அழகியல் சார்ந்த விஷயங்களில் உங்கள் ஆர்வம் அதிகரிக்கும். ஒரு புதிய பொழுதுபோக்கைத் தொடங்குவதற்கோ அல்லது ஏற்கனவே இருக்கும் திறமைகளை மெருகேற்றுவதற்கோ இது ஒரு சிறந்த நாளாகும். உங்கள் சமூக வட்டம் விரிவடையும். புதிய நபர்களைச் சந்திப்பதற்கான வாய்ப்புகள் உண்டு, அவர்கள் உங்கள் வாழ்க்கைக்கு நல்ல பங்களிப்பை வழங்குவார்கள். நண்பர்களுடன் இணைந்து புதிய திட்டங்களைத் தொடங்குவது அல்லது சமூக நிகழ்வுகளில் பங்கேற்பது மனதிற்கு மகிழ்ச்சியளிக்கும். உங்கள் பேச்சுத்திறன் கூர்மையடைந்து, உங்களைச் சுற்றியுள்ளவர்களை நீங்கள் எளிதாகக் கவர முடியும். நேர்மையான மற்றும் திறந்த மனதுடன் பேசுவது பல உறவுகளை மேம்படுத்தும். இன்றைய நாள் பயணங்களுக்கு உகந்ததல்ல என்று தோன்றினாலும், குடும்பத்துடன் மேற்கொள்ளும் சிறிய சுற்றுப்பயணங்கள் அல்லது அருகிலுள்ள இடங்களுக்குச் சென்று வருவது புத்துணர்ச்சியை அளிக்கும். ஆன்மீக நாட்டம் கொண்டவர்கள், தங்கள் உள்ளத்தில் அமைதியையும், தெளிவையும் பெறுவார்கள். தியானம் அல்லது இறைவழிபாடு போன்ற செயல்களில் ஈடுபடுவது மனதை ஒருமுகப்படுத்த உதவும். உங்கள் மனதில் புதிய நம்பிக்கையும், உத்வேகமும் பிறக்கும். கடந்தகால நிகழ்வுகளைப் பற்றிய எண்ணங்கள் நீங்கி, நிகழ்காலத்தை முழுமையாக வாழும் மனநிலையைப் பெறுவீர்கள். எதிர்காலத்திற்கான திட்டங்களை வகுக்கும்போது, உங்கள் குடும்பத்தினரின் ஆலோசனைகளையும், கருத்துக்களையும் கேட்பது நல்ல முடிவுகளை எடுக்க உதவும். உங்கள் உடலையும், மனதையும் சீராக வைத்துக்கொள்ள நீங்கள் மேற்கொள்ளும் முயற்சிகள் நல்ல பலனை அளிக்கும். சரியான உணவு முறை மற்றும் மிதமான உடற்பயிற்சி உங்கள் ஆற்றல் மட்டங்களை உயர்ந்த நிலையில் வைத்திருக்கும். இன்று நீங்கள் சற்று மென்மையாகவும், அனுசரித்துப் போகும் மனநிலையுடனும் காணப்படுவீர்கள். இது உங்கள் சுபாவத்திற்கு முற்றிலும் மாறாக இருந்தாலும், இந்த மாற்றம் உங்களைச் சுற்றியுள்ளவர்களால் பாராட்டப்படும். குறிப்பாக, உங்கள் தலைமைப் பண்புகளில் மென்மை குணம் சேர்வது உங்கள் குழுவினருக்கு ஊக்கமளிக்கும். அன்றாட பணிகளில் திட்டமிடுதல் மற்றும் செயலாக்குதலில் தெளிவு ஏற்படும். சிறு சிறு சிக்கல்களையும் புன்னகையுடன் அணுகுவீர்கள். இதன் மூலம், பெரிய பிரச்சனைகள் உருவாவதைத் தவிர்க்கலாம். குடும்பத்தில் மூத்தவர்களுடன் நீங்கள் நடத்தும் உரையாடல்கள், பல பயனுள்ள தகவல்களையும், அனுபவங்களையும் கற்றுத்தரும். அவர்களின் ஆசீர்வாதங்கள் உங்கள் முன்னேற்றத்திற்கு துணை நிற்கும். இன்றைய நாள் எதிர்பாராத விருந்தினர்களை வரவேற்கும் வாய்ப்பையும், அவர்களுடன் மகிழ்ச்சியான தருணங்களை பகிர்ந்து கொள்ளும் வாய்ப்பையும் தரலாம். இது உங்கள் இல்லத்தில் மேலும் சுபச் சூழலை உருவாக்கும். உங்கள் கலை ஆர்வத்தை வெளிப்படுத்தும் விதமாக, வீடு அல்லது பணியிடத்தில் சில அழகியல் மாற்றங்களைச் செய்ய திட்டமிடலாம். இது உங்கள் மனதிற்கு மகிழ்ச்சியையும், சுற்றியுள்ள இடத்திற்கு புத்துணர்வையும் அளிக்கும். ஒட்டுமொத்தமாக, இன்று நீங்கள் அனுபவிக்கும் அனைத்து விஷயங்களும் நல்லிணக்கம், அன்பு, மற்றும் வளர்ச்சி ஆகியவற்றை மையமாகக் கொண்டதாக இருக்கும்.",
    "prediction_en": "Today will be a wonderful day for Aries natives. Due to the influence of Venus, clarity and love will overflow in your relationships. Specifically, a new dimension will emerge in personal relationships. Small misunderstandings that have lingered for a long time will gradually disappear, paving the way for heartfelt connections. Peace and happiness will prevail at home. The time you spend with your partner will be sweet and meaningful. Your interest in arts and aesthetics will increase. This is an excellent day to start a new hobby or to refine existing talents. Your social circle will expand. There will be opportunities to meet new people who will contribute positively to your life. Starting new projects with friends or participating in social events will bring joy to your mind. Your communication skills will sharpen, and you will be able to easily captivate those around you. Speaking with honesty and an open mind will improve many relationships. Although today may not seem ideal for extensive travel, short trips or visiting nearby places with family will provide rejuvenation. Those with spiritual inclinations will find peace and clarity within themselves. Engaging in practices like meditation or prayer will help focus the mind. New hope and inspiration will emerge in your mind. Thoughts about past events will dissipate, and you will gain a mindset to fully live in the present. When planning for the future, seeking the advice and opinions of your family members will help you make good decisions. Your efforts to maintain your physical and mental well-being will yield positive results. A proper diet and moderate exercise will keep your energy levels high. Today, you will appear somewhat gentle and accommodating. Although this may be contrary to your usual nature, this change will be appreciated by those around you. Especially, the addition of gentleness to your leadership qualities will motivate your team members. Clarity will emerge in the planning and execution of daily tasks. You will approach even minor issues with a smile. Through this, you can avoid the emergence of major problems. Your conversations with elders in the family will teach you many useful insights and experiences. Their blessings will support your progress. Today may also bring opportunities to welcome unexpected guests and share joyful moments with them. This will create a more auspicious atmosphere in your home. As an expression of your artistic interest, you may plan some aesthetic changes at home or in your workplace. This will bring joy to your mind and freshness to your surroundings. Overall, everything you experience today will be centered around harmony, love, and growth.",
    "career_ta": "தொழில் மற்றும் பணியிடத்தில் இன்று நீங்கள் நல்லுறவைப் பேணுவதன் மூலம் பெரும் வெற்றிகளைப் பெற முடியும். உங்கள் சக ஊழியர்களுடன் இணக்கமான சூழ்நிலையை உருவாக்குவது, திட்டங்களை வெற்றிகரமாக முடிக்க உதவும். கூட்டாண்மை சார்ந்த திட்டங்களில் உங்கள் பங்களிப்பு பாராட்டப்படும். தலைமைப் பண்பில் மென்மையும், புரிதலும் இணைவது உங்கள் குழுவின் செயல்திறனை அதிகரிக்கும். கலை அல்லது வடிவமைப்புத் துறைகளில் உள்ளவர்களுக்கு இன்று புதிய வாய்ப்புகள் உருவாகலாம்.",
    "career_en": "In your career and workplace, you can achieve great success today by maintaining good relationships. Creating a harmonious environment with your colleagues will help you successfully complete projects. Your contributions in partnership-based projects will be appreciated. The combination of gentleness and understanding in your leadership will enhance your team's performance. Those in artistic or design fields may find new opportunities today.",
    "finance_ta": "நிதிநிலையில் இன்று ஒரு சீரான நிலை காணப்படும். தேவையற்ற செலவுகளைக் குறைத்து, நீண்டகால முதலீடுகளைப் பற்றி சிந்திக்க இது ஒரு சிறந்த நாளாகும். உங்கள் குடும்பத்தினருடன் நிதி திட்டங்களைப் பற்றி கலந்தாலோசிப்பது, சிறந்த முடிவுகளை எடுக்க உதவும். அழகியல் பொருட்கள் வாங்குவதில் அல்லது கலைப்படைப்புகளில் முதலீடு செய்வதில் ஆர்வம் ஏற்படலாம், ஆனால் திட்டமிட்டுச் செயல்படவும்.",
    "finance_en": "Financially, today will be stable. It's an excellent day to reduce unnecessary expenses and consider long-term investments. Discussing financial plans with your family members will help you make better decisions. You may feel an interest in purchasing aesthetic items or investing in artwork, but proceed with planning.",
    "health_ta": "உங்கள் உடல்நலம் இன்று சீராகவும், உற்சாகமாகவும் இருக்கும். மன அமைதிக்கு முக்கியத்துவம் கொடுப்பதன் மூலம், உங்கள் உடல் ஆரோக்கியம் மேம்படும். யோகா, தியானம் போன்ற மனதை அமைதிப்படுத்தும் பயிற்சிகளில் ஈடுபடுவது உங்களுக்கு மிகவும் நன்மை பயக்கும். ஆரோக்கியமான உணவுப் பழக்கவழக்கங்கள் மற்றும் போதுமான ஓய்வு உங்கள் ஆற்றல் மட்டங்களை உயர்ந்த நிலையில் வைத்திருக்கும்.",
    "health_en": "Your health will be steady and energetic today. By prioritizing mental peace, your physical health will improve. Engaging in calming practices like yoga and meditation will be highly beneficial for you. Healthy eating habits and sufficient rest will keep your energy levels high.",
    "lucky_number": "9",
    "lucky_color_ta": "இளஞ்சிவப்பு",
    "lucky_color_en": "Pink"
  },
  {
    "sign_ta": "ரிஷபம்",
    "sign_en": "Taurus",
    "date": "13-02-2026",
    "prediction_ta": "ரிஷப ராசிக்காரர்களுக்கு இன்று சுக்கிரனின் ஆதிக்கத்தால் ஒரு விசேஷமான நாளாக அமையும். உங்கள் ஆளும் கிரகத்தின் அருளால், நீங்கள் இயல்பாகவே அமைதியையும், இணக்கத்தையும் உணர்வீர்கள். உங்கள் வாழ்க்கையின் அனைத்து துறைகளிலும் அழகு, கலை, மற்றும் ஆடம்பரத்திற்கான உங்கள் விருப்பம் இன்று அதிகரிக்கும். குடும்ப உறுப்பினர்களுடன் நீங்கள் செலவிடும் நேரம் மிகவும் இனிமையாகவும், நேசத்துடனும் இருக்கும். வீட்டில் புதிய பொருட்களை வாங்குவதற்கு அல்லது வீட்டை அழகுபடுத்துவதற்கு இது ஒரு சிறந்த நாளாகும். உங்கள் உள் மனதின் அமைதியை இன்று நீங்கள் முழுமையாக அனுபவிப்பீர்கள். மனம் நிறைந்த மகிழ்ச்சியும், திருப்தியும் உங்களைச் சூழ்ந்திருக்கும். நீண்டகாலமாக நிலுவையில் இருந்த குடும்பப் பிரச்சனைகளுக்கு சுமூகமான தீர்வுகள் இன்று காணப்படும். உறவுகளில் அன்பு, அர்ப்பணிப்பு, மற்றும் நம்பிக்கை ஆகியவை வலுப்பெறும். உங்கள் துணையுடன் ஒரு浪漫மான பயணம் அல்லது மாலை உணவு ஏற்பாடு செய்வது உங்கள் பிணைப்பை மேலும் வலுப்படுத்தும். கலை மற்றும் இசைத் துறைகளில் ஈடுபட்டுள்ளவர்களுக்கு இன்று புதிய உத்வேகமும், படைப்பாற்றலும் பெருகும். உங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்புகள் கிடைக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் தொடர்புகளை விரிவுபடுத்தும், மேலும் உங்கள் கவர்ச்சியான ஆளுமையால் புதிய நண்பர்களைப் பெறுவீர்கள். பேச்சுவார்த்தைகள் மற்றும் ஒப்பந்தங்களில், உங்கள் இணக்கமான அணுகுமுறை நல்ல பலனைத் தரும். யாரையும் புண்படுத்தாமல் உங்கள் கருத்துக்களைத் தெளிவாக வெளிப்படுத்த முடியும். உங்கள் உணர்வுப்பூர்வமான தேவைகளை நீங்கள் சிறப்பாகப் புரிந்துகொண்டு அவற்றை பூர்த்தி செய்ய முற்படுவீர்கள். நிதி திட்டமிடுதல் அல்லது சேமிப்பு தொடர்பான விஷயங்களில், இன்று தெளிவான முடிவுகளை எடுக்க முடியும். உங்கள் உடலையும், உள்ளத்தையும் சமநிலையில் வைத்துக்கொள்ள முயற்சிப்பது மிக முக்கியம். இயற்கையோடு இணைந்து நேரம் செலவிடுவது அல்லது தோட்டக்கலை போன்ற செயல்களில் ஈடுபடுவது உங்களுக்கு மிகவும் ஆறுதலையும், மனநிறைவையும் அளிக்கும். இன்று நீங்கள் சுவையான உணவுகளை ரசிப்பீர்கள், ஆனால் அளவோடு எடுத்துக்கொள்வது நல்லது. ஆடம்பரமான பொருட்கள் மீதான உங்கள் நாட்டம் சற்று அதிகமாக இருக்கலாம், ஆனால் உங்கள் தேவைகளைப் பகுத்தறிந்து செலவு செய்வது நல்லது. புதிய ஆடைகள் அல்லது அணிகலன்கள் வாங்குவதற்கு இது ஒரு உகந்த நாளாகும், ஏனெனில் இவை உங்கள் நம்பிக்கையை அதிகரிக்கும். உங்கள் தோற்றத்தைப் பற்றி இன்று நீங்கள் அதிகம் அக்கறை கொள்வீர்கள். உங்கள் அழகை மெருகூட்ட நீங்கள் மேற்கொள்ளும் சிறிய முயற்சிகள் நல்ல பலனை அளிக்கும். ஒட்டுமொத்தமாக, இன்று நீங்கள் அனுபவிக்கும் அனைத்தும் அமைதி, அன்பு, மற்றும் அழகு ஆகியவற்றை மையமாகக் கொண்டதாக இருக்கும்.",
    "prediction_en": "For Taurus natives, today will be a special day due to the influence of Venus. With the blessings of your ruling planet, you will naturally feel peace and harmony. Your desire for beauty, art, and luxury will increase in all areas of your life today. The time you spend with family members will be very sweet and affectionate. This is an excellent day to purchase new items for the home or to decorate your living space. You will fully experience inner peace today. Heartfelt joy and satisfaction will surround you. Smooth solutions for long-standing family issues will be found today. Love, dedication, and trust in relationships will strengthen. Arranging a romantic outing or dinner with your partner will further solidify your bond. Those involved in arts and music fields will experience new inspiration and creativity today. Good opportunities will arise to showcase your talents. Participating in social events will expand your contacts, and you will gain new friends through your charming personality. In negotiations and agreements, your harmonious approach will yield good results. You will be able to clearly express your opinions without hurting anyone. You will better understand your emotional needs and strive to fulfill them. In matters related to financial planning or savings, today clear decisions can be made. It is very important to try and keep your body and mind balanced. Spending time with nature or engaging in activities like gardening will bring you great comfort and contentment. Today you will enjoy delicious foods, but it is good to consume them in moderation. Your inclination towards luxurious items might be a bit high, but it is wise to analyze your needs and spend accordingly. This is an auspicious day to buy new clothes or accessories, as they will boost your confidence. You will care a lot about your appearance today. Small efforts you make to enhance your beauty will yield good results. Overall, everything you experience today will be centered around peace, love, and beauty.",
    "career_ta": "தொழில்ரீதியாக, இன்று உங்கள் படைப்புத் திறன்கள் சிறப்பாக வெளிப்படும். அழகுசாதனப் பொருட்கள், கலைப்பொருட்கள், உணவு அல்லது விருந்தோம்பல் தொடர்பான துறைகளில் உள்ளவர்களுக்கு இன்று சிறப்பான வளர்ச்சி இருக்கும். உங்கள் இணக்கமான அணுகுமுறை கூட்டாளிகளுடன் அல்லது வாடிக்கையாளர்களுடன் சிறந்த உறவுகளை வளர்க்க உதவும். புதிய வணிக ஒப்பந்தங்கள் அல்லது கூட்டாண்மைகளில் கையெழுத்திட இது ஒரு நல்ல நாளாகும்.",
    "career_en": "Professionally, your creative skills will shine today. Those in fields related to cosmetics, art, food, or hospitality will experience significant growth today. Your harmonious approach will help foster excellent relationships with partners or clients. This is a good day to sign new business agreements or partnerships.",
    "finance_ta": "நிதிநிலை இன்று மிகவும் சாதகமாக இருக்கும். எதிர்பாராத வகையில் சில ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது. ஆடம்பரப் பொருட்கள் அல்லது வீட்டிற்குத் தேவையான அழகியல் பொருட்களை வாங்குவதற்கு இது ஒரு சிறந்த நேரம். நீண்டகால முதலீடுகளை மறுபரிசீலனை செய்ய அல்லது புதிய சேமிப்பு திட்டங்களைத் தொடங்க உங்களுக்கு நல்ல வாய்ப்புகள் கிடைக்கும். நிதானமான மற்றும் திட்டமிட்ட அணுகுமுறை நிதி வளர்ச்சியை உறுதி செய்யும்.",
    "finance_en": "Financially, today will be very favorable. There is a possibility of unexpected gains. This is an excellent time to purchase luxury items or aesthetic items for your home. You will have good opportunities to review long-term investments or start new savings plans. A calm and planned approach will ensure financial growth.",
    "health_ta": "உங்கள் உடல்நலம் இன்று சீராக இருக்கும். இனிமையான இசை கேட்பது, மென்மையான உடற்பயிற்சிகளை மேற்கொள்வது மற்றும் இயற்கையுடன் நேரம் செலவிடுவது உங்கள் மனதிற்கும் உடலிற்கும் புத்துணர்வை அளிக்கும். சுவையான மற்றும் சத்தான உணவுகளை மிதமாக எடுத்துக்கொள்வதன் மூலம் உங்கள் செரிமான அமைப்பு வலுப்பெறும். மன அழுத்தத்தைக் குறைக்கும் தளர்வு நுட்பங்களில் கவனம் செலுத்துவது உங்களுக்கு நன்மை பயக்கும்.",
    "health_en": "Your health will be stable today. Listening to pleasant music, engaging in gentle exercises, and spending time with nature will rejuvenate your mind and body. Consuming delicious and nutritious foods in moderation will strengthen your digestive system. Focusing on relaxation techniques to reduce stress will be beneficial for you.",
    "lucky_number": "6",
    "lucky_color_ta": "வெள்ளை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "மிதுனம்",
    "sign_en": "Gemini",
    "date": "13-02-2026",
    "prediction_ta": "மிதுன ராசிக்காரர்களுக்கு இன்று சுக்கிரனின் செல்வாக்கினால், சமூக தொடர்புகளிலும், தகவல் பரிமாற்றங்களிலும் இனிமை மேலோங்கும். உங்கள் பேச்சுத்திறன் கூர்மையடைந்து, உங்களைச் சுற்றியுள்ளவர்களை நீங்கள் எளிதாகக் கவர முடியும். புதிய நண்பர்களை உருவாக்குவதற்கும், ஏற்கனவே இருக்கும் உறவுகளை வலுப்படுத்துவதற்கும் இது ஒரு சிறந்த நாளாகும். உங்கள் கருத்துக்களை வெளிப்படையாகவும், அன்பாகவும் பகிர்வதன் மூலம் பலரின் ஆதரவைப் பெறுவீர்கள். நீண்டகாலமாக பேசப்படாத விஷயங்கள் இன்று இனிமையான முறையில் பேசப்பட்டு, தீர்வுகள் காணப்படும். குறிப்பாக, உங்கள் சகோதர சகோதரிகளுடன் அல்லது நெருங்கிய உறவினர்களுடன் உறவுகள் மேம்படும். அவர்களிடம் இருந்து நல்ல செய்திகளும், உதவிகளும் கிடைக்க வாய்ப்புள்ளது. கல்வி மற்றும் அறிவுசார் விஷயங்களில் உங்கள் ஆர்வம் அதிகரிக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவைப் பகிர்ந்து கொள்வதற்கும் இது ஒரு உகந்த நேரம். புத்தகங்களைப் படிப்பதன் மூலம் அல்லது புதிய படிப்புகளைத் தொடங்குவதன் மூலம் உங்கள் மனதுக்கு புத்துணர்ச்சி கிடைக்கும். சிறு பயணங்களை மேற்கொள்வதற்கு இன்று மிகவும் ஏற்ற நாளாகும். இவை புதிய அனுபவங்களையும், மகிழ்ச்சியையும் கொண்டு வரும். கலை, இசை, இலக்கியம் போன்ற படைப்பாற்றல் துறைகளில் ஈடுபட்டுள்ளவர்கள் இன்று புதிய உத்வேகத்தைப் பெறுவார்கள். உங்கள் திறமைகளை வெளிப்படுத்தவும், உங்கள் கலைப்படைப்புகளைப் பகிர்ந்து கொள்ளவும் நல்ல வாய்ப்புகள் கிடைக்கும். உங்கள் சமூக வலைத்தள தொடர்புகள் இன்று வலுப்பெறும், மேலும் பலரின் பாராட்டுக்களைப் பெறுவீர்கள். புதிய திட்டங்களைத் தொடங்குவதற்கு அல்லது ஏற்கனவே உள்ள திட்டங்களை மேம்படுத்துவதற்கு இது ஒரு நல்ல நாளாகும். உங்கள் சிந்தனைகளில் தெளிவும், ஆக்கப்பூர்வமான யோசனைகளும் தோன்றும். குழுப்பணிகளில் நீங்கள் திறம்பட செயல்படுவீர்கள். உங்கள் இணக்கமான அணுகுமுறை மற்றவர்களுடன் ஒத்துழைப்பை எளிதாக்கும். அன்பும், நல்லிணக்கமும் நிறைந்த சூழலை உருவாக்குவதில் நீங்கள் முன்னோடியாக இருப்பீர்கள். எந்த ஒரு சிக்கலையும் அணுகும்போது, உங்கள் நகைச்சுவை உணர்வு மற்றும் நேர்மறை எண்ணங்கள் நல்ல தீர்வுகளைக் கண்டறிய உதவும். உங்கள் உடல் மற்றும் மன ஆரோக்கியத்தைப் பேணுவதற்கு, மிதமான உடற்பயிற்சி மற்றும் மனதை அமைதிப்படுத்தும் செயல்களில் ஈடுபடுவது நல்லது. குடும்பத்தினருடன் இனிமையான தருணங்களை செலவிடுவது மனதிற்கு மகிழ்ச்சியையும், புத்துணர்வையும் அளிக்கும். உங்கள் இல்லத்தில் சுப நிகழ்வுகளைப் பற்றிய பேச்சுவார்த்தைகள் இன்று தொடங்கலாம். இன்று நீங்கள் அதிக தன்னம்பிக்கையுடனும், உற்சாகத்துடனும் செயல்படுவீர்கள். இது உங்கள் அன்றாட பணிகளை திறம்பட முடிக்க உதவும். உங்கள் தனிப்பட்ட அழகையும், கவர்ச்சியையும் மேம்படுத்த நீங்கள் மேற்கொள்ளும் முயற்சிகள் நல்ல பலனை அளிக்கும்.",
    "prediction_en": "For Gemini natives, due to the influence of Venus today, sweetness will prevail in social interactions and communications. Your communication skills will sharpen, and you will be able to easily captivate those around you. This is an excellent day to make new friends and strengthen existing relationships. By sharing your thoughts openly and lovingly, you will gain the support of many. Long-unspoken issues will be discussed amicably today, and solutions will be found. Specifically, relationships with your siblings or close relatives will improve. There is a possibility of receiving good news and help from them. Your interest in education and intellectual matters will increase. This is an opportune time to learn new things and share your knowledge. Your mind will feel refreshed by reading books or starting new courses. Today is very suitable for undertaking short trips. These will bring new experiences and joy. Those involved in creative fields like art, music, and literature will receive new inspiration today. Good opportunities will arise to showcase your talents and share your artworks. Your social media connections will strengthen today, and you will receive much appreciation. This is a good day to start new projects or improve existing ones. Clarity in your thoughts and creative ideas will emerge. You will work effectively in team projects. Your harmonious approach will facilitate cooperation with others. You will be a pioneer in creating an environment full of love and harmony. When approaching any issue, your sense of humor and positive thoughts will help find good solutions. To maintain your physical and mental health, it is good to engage in moderate exercise and calming activities. Spending sweet moments with family will bring joy and rejuvenation to your mind. Discussions about auspicious events in your home may begin today. Today you will act with increased self-confidence and enthusiasm. This will help you efficiently complete your daily tasks. Your efforts to enhance your personal beauty and charm will yield good results.",
    "career_ta": "தொழில்ரீதியாக, இன்று உங்கள் பேச்சுத்திறன் மற்றும் இணக்கமான அணுகுமுறை பெரும் அனுகூலங்களை அளிக்கும். கூட்டாண்மைகள் அல்லது குழுப்பணிகளில் சிறந்த முடிவுகளைப் பெறுவீர்கள். ஊடக, மக்கள் தொடர்பு, அல்லது விற்பனைத் துறைகளில் உள்ளவர்களுக்கு இன்று சிறப்பான வளர்ச்சி இருக்கும். உங்கள் கருத்துக்களைத் தெளிவாகவும், கவரும் விதமாகவும் முன்வைக்க இது ஒரு நல்ல நாளாகும். புதிய திட்டங்களுக்கு ஆதரவு பெறுவீர்கள்.",
    "career_en": "Professionally, today your communication skills and harmonious approach will bring significant advantages. You will achieve excellent results in partnerships or team projects. Those in media, public relations, or sales sectors will experience significant growth today. This is a good day to present your ideas clearly and appealingly. You will gain support for new projects.",
    "finance_ta": "நிதிநிலையில் இன்று ஒரு ஆரோக்கியமான சூழ்நிலை நிலவும். சமூக தொடர்புகள் மூலம் சில புதிய நிதி வாய்ப்புகள் உருவாகலாம். தேவையற்ற செலவுகளைக் கட்டுப்படுத்தி, நீண்டகால திட்டமிடுதலில் கவனம் செலுத்துவது நல்லது. கலைப் பொருட்கள் அல்லது கல்வி சார்ந்த முதலீடுகளில் ஆர்வம் ஏற்படலாம். உங்கள் துணையுடன் இணைந்து நிதி முடிவுகளை எடுப்பது நல்ல பலனைத் தரும்.",
    "finance_en": "Financially, a healthy situation will prevail today. Some new financial opportunities may arise through social contacts. It is advisable to control unnecessary expenses and focus on long-term planning. You may develop an interest in art-related investments or educational ventures. Making financial decisions jointly with your partner will yield good results.",
    "health_ta": "உங்கள் உடல்நலம் இன்று நன்றாக இருக்கும். மனதை அமைதியாகவும், மகிழ்ச்சியாகவும் வைத்துக்கொள்வதன் மூலம் உங்கள் உடல்நலம் மேலும் மேம்படும். சமூக நிகழ்வுகளில் பங்கேற்பது மற்றும் நண்பர்களுடன் உரையாடுவது மனதிற்கு புத்துணர்வை அளிக்கும். சுவாசப் பயிற்சிகள் மற்றும் லேசான உடற்பயிற்சிகளை மேற்கொள்வது உங்களுக்கு நன்மை பயக்கும். இனிமையான இசையைக் கேட்பது மன அமைதியை மேம்படுத்தும்.",
    "health_en": "Your health will be good today. By keeping your mind calm and happy, your health will further improve. Participating in social events and conversing with friends will rejuvenate your mind. Practicing breathing exercises and light physical activity will be beneficial for you. Listening to pleasant music will enhance mental peace.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "13-02-2026",
    "prediction_ta": "கடக ராசிக்காரர்களுக்கு இன்று சுக்கிரனின் செல்வாக்கினால், குடும்ப உறவுகளிலும், தனிப்பட்ட நிதி விஷயங்களிலும் நல்லிணக்கம் மேலோங்கும். உங்கள் வீட்டில் அமைதியும், மகிழ்ச்சியும் நிறைந்திருக்கும். குடும்ப உறுப்பினர்களுடன் நீங்கள் இனிமையான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். நீண்டகாலமாக தீர்க்கப்படாமல் இருந்த குடும்ப பிரச்சனைகளுக்கு சுமூகமான தீர்வுகள் காணப்படும். குறிப்பாக, தாயார் அல்லது தாய்வழி உறவுகளுடன் உங்கள் பிணைப்பு வலுப்பெறும். அவர்களிடமிருந்து ஆசீர்வாதங்களையும், ஆதரவையும் பெறுவீர்கள். நிதி நிலையில் இன்று ஒரு சாதகமான சூழ்நிலை உருவாகும். உங்கள் வருமானம் உயரும் வாய்ப்புகள் உண்டு. புதிய முதலீடுகளைப் பற்றி சிந்திக்க இது ஒரு சிறந்த நாளாகும், ஆனால் அனுபவமுள்ளவர்களின் ஆலோசனையைப் பெறுவது நல்லது. வீட்டிற்குத் தேவையான ஆடம்பரப் பொருட்கள் அல்லது அழகியல் பொருட்களை வாங்குவதற்கு இன்று நீங்கள் திட்டமிடலாம். இது உங்கள் இல்லத்திற்கு மேலும் அழகையும், வசதியையும் சேர்க்கும். கலை, இசை, மற்றும் கைவினைப் பொருட்கள் போன்ற படைப்பாற்றல் துறைகளில் உங்கள் ஆர்வம் அதிகரிக்கும். உங்கள் உள்ளுணர்வு கூர்மையடையும், மேலும் உங்கள் படைப்புத் திறன்களை வெளிப்படுத்த நல்ல வாய்ப்புகள் கிடைக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் தொடர்புகளை விரிவுபடுத்தும், ஆனால் நீங்கள் வீட்டிலேயே நேரம் செலவிடுவதை இன்று அதிகம் விரும்புவீர்கள். உங்கள் வீட்டிற்கு விருந்தினர்கள் வர வாய்ப்புள்ளது, அவர்களுடன் நீங்கள் மகிழ்ச்சியான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். வீட்டு அலங்காரம் அல்லது தோட்டக்கலை போன்ற செயல்களில் ஈடுபடுவது உங்களுக்கு மிகவும் மனநிறைவை அளிக்கும். உங்கள் உணர்ச்சிபூர்வமான தேவைகளை நீங்கள் சிறப்பாகப் புரிந்துகொண்டு அவற்றை பூர்த்தி செய்ய முற்படுவீர்கள். மன அமைதியையும், உள்ளுணர்வையும் மேம்படுத்துவதற்கு தியானம் அல்லது ஆன்மீகப் பயிற்சிகளில் ஈடுபடுவது உங்களுக்கு நன்மை பயக்கும். உங்கள் துணையுடன் நீங்கள் செலவிடும் நேரம் இனிமையாகவும், நேசத்துடனும் இருக்கும். உங்களுக்கிடையே உள்ள அன்பு மற்றும் புரிதல் வலுப்பெறும். திருமணமாகாதவர்களுக்கு இன்று புதிய உறவுகள் உருவாக வாய்ப்புள்ளது, அல்லது ஏற்கனவே உள்ள உறவுகள் அடுத்த கட்டத்திற்குச் செல்லலாம். உங்கள் உடல்நலம் இன்று சீராகவும், உற்சாகமாகவும் இருக்கும். சத்தான உணவுகளை எடுத்துக்கொள்வதும், மிதமான உடற்பயிற்சிகளை மேற்கொள்வதும் உங்கள் ஆற்றல் மட்டங்களை உயர்ந்த நிலையில் வைத்திருக்கும். மன அழுத்தத்தைக் குறைக்கும் தளர்வு நுட்பங்களில் கவனம் செலுத்துவது மிகவும் அவசியம். உங்கள் மனதில் புதிய நம்பிக்கையும், உத்வேகமும் பிறக்கும். கடந்தகால நிகழ்வுகளைப் பற்றிய எண்ணங்கள் நீங்கி, நிகழ்காலத்தை முழுமையாக வாழும் மனநிலையைப் பெறுவீர்கள். ஒட்டுமொத்தமாக, இன்று நீங்கள் அனுபவிக்கும் அனைத்து விஷயங்களும் அன்பு, பாதுகாப்பு, மற்றும் வளர்ச்சி ஆகியவற்றை மையமாகக் கொண்டதாக இருக்கும்.",
    "prediction_en": "For Cancer natives, due to the influence of Venus today, harmony will prevail in family relationships and personal financial matters. Your home will be filled with peace and happiness. You will share sweet moments with family members. Smooth solutions will be found for long-standing family issues. Specifically, your bond with your mother or maternal relatives will strengthen. You will receive blessings and support from them. A favorable situation will arise financially today. There are opportunities for your income to increase. This is an excellent day to consider new investments, but it is good to seek advice from experienced individuals. You may plan to purchase luxury items or aesthetic items for your home today. This will add more beauty and comfort to your abode. Your interest in creative fields such as art, music, and handicrafts will increase. Your intuition will sharpen, and you will have good opportunities to express your creative talents. Participating in social events will expand your contacts, but you will prefer spending more time at home today. Guests may visit your home, and you will share joyful moments with them. Engaging in activities like home decorating or gardening will bring you great satisfaction. You will better understand your emotional needs and strive to fulfill them. Engaging in meditation or spiritual practices will be beneficial for you to enhance mental peace and intuition. The time you spend with your partner will be sweet and affectionate. The love and understanding between you will strengthen. For those who are unmarried, new relationships may form today, or existing relationships may move to the next level. Your health will be steady and energetic today. Consuming nutritious foods and engaging in moderate exercise will keep your energy levels high. Focusing on relaxation techniques to reduce stress is very important. New hope and inspiration will emerge in your mind. Thoughts about past events will dissipate, and you will gain a mindset to fully live in the present. Overall, everything you experience today will be centered around love, security, and growth.",
    "career_ta": "தொழில்ரீதியாக, இன்று உங்கள் பணிச்சூழல் மிகவும் இணக்கமாகவும், ஒத்துழைப்புடனும் காணப்படும். சக ஊழியர்களுடனும், உயரதிகாரிகளுடனும் நல்லுறவைப் பேணுவதன் மூலம் உங்கள் திட்டங்களை வெற்றிகரமாக முடிக்க முடியும். கலை, வடிவமைப்பு, அல்லது வீட்டு அலங்காரம் போன்ற படைப்பாற்றல் சார்ந்த துறைகளில் உள்ளவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் கிடைக்கும். உங்கள் உள்ளுணர்வு சார்ந்த முடிவுகள் நல்ல பலனை அளிக்கும்.",
    "career_en": "Professionally, your work environment will be very harmonious and cooperative today. By maintaining good relationships with colleagues and superiors, you will be able to successfully complete your projects. Those in creative fields such as art, design, or home decor will find excellent opportunities today. Your intuitive decisions will yield good results.",
    "finance_ta": "நிதிநிலையில் இன்று ஒரு ஸ்திரமான மற்றும் சாதகமான வளர்ச்சி காணப்படும். குடும்ப உறுப்பினர்களின் ஆதரவால் புதிய நிதி ஆதாரங்கள் உருவாகலாம். வீட்டிற்குத் தேவையான மதிப்புமிக்க பொருட்களை வாங்குவதற்கு அல்லது அசையா சொத்துக்களில் முதலீடு செய்வதற்கு இது ஒரு நல்ல நாளாகும். உங்கள் நிதி மேலாண்மை திறன்கள் இன்று மேம்படும், மேலும் திட்டமிட்ட செலவுகள் நல்ல பலனைத் தரும்.",
    "finance_en": "Financially, a stable and favorable growth will be seen today. New financial resources may emerge with the support of family members. This is a good day to purchase valuable items for the home or to invest in real estate. Your financial management skills will improve today, and planned expenses will yield good results.",
    "health_ta": "உங்கள் உடல்நலம் இன்று மிகவும் சிறப்பாக இருக்கும். மன அமைதிக்கு முக்கியத்துவம் கொடுப்பதன் மூலம், உங்கள் உடல் ஆரோக்கியம் மேம்படும். வீட்டில் ஓய்வெடுப்பது, குடும்பத்துடன் நேரம் செலவிடுவது, மற்றும் சத்தான வீட்டு உணவுகளை உண்பது உங்களுக்கு மிகவும் நன்மை பயக்கும். நீரேற்றமாக இருப்பதையும், போதுமான தூக்கத்தையும் உறுதிப்படுத்துங்கள். மன அழுத்தத்தைக் குறைக்கும் தளர்வு நுட்பங்களில் கவனம் செலுத்துங்கள்.",
    "health_en": "Your health will be very good today. By prioritizing mental peace, your physical health will improve. Resting at home, spending time with family, and eating nutritious home-cooked meals will be highly beneficial for you. Ensure you stay hydrated and get enough sleep. Focus on relaxation techniques to reduce stress.",
    "lucky_number": "2",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "சிம்மம்",
    "sign_en": "Leo",
    "date": "13-02-2026",
    "prediction_ta": "சிம்ம ராசிக்காரர்களுக்கு இன்று சுக்கிரனின் ஆதிக்கத்தால், தனிப்பட்ட உறவுகளிலும், சமூக தொடர்புகளிலும் புத்துணர்வும், மகிழ்ச்சியும் பெருகும். உங்கள் இயல்பான கவர்ச்சியும், தலைமைப் பண்பும் இன்று மேலும் மெருகேறும். புதிய நபர்களைச் சந்திப்பதற்கும், உங்கள் சமூக வட்டத்தில் புதியவர்களை வரவேற்பதற்கும் இது ஒரு சிறந்த நாளாகும். நீங்கள் பங்கேற்கும் சமூக நிகழ்வுகளில் அனைவரையும் கவரும் மையமாக இருப்பீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் நீங்கள் செலவிடும் நேரம் இனிமையாகவும், அர்த்தமுள்ளதாகவும் இருக்கும். நீண்டகாலமாக நிலுவையில் இருந்த உறவுப் பிரச்சனைகளுக்கு சுமூகமான தீர்வுகள் காணப்படும். உங்கள் துணையுடன் நீங்கள் ஒரு மறக்க முடியாத நாளைப் பகிர்ந்து கொள்வீர்கள். ரொமான்டிக் பயணங்கள் அல்லது எதிர்பாராத பரிசுகள் மூலம் உங்கள் அன்பு வெளிப்படும். திருமணமானவர்களுக்கு அன்பு மேலும் வலுப்பெறும். தனிமையில் இருப்பவர்கள் புதிய உறவுகளைத் தொடங்குவதற்கான வாய்ப்புகள் இன்று உருவாகலாம். கலை, நாடகம், இசை, மற்றும் பொழுதுபோக்குத் துறைகளில் ஈடுபட்டுள்ளவர்களுக்கு இன்று சிறப்பான வளர்ச்சி இருக்கும். உங்கள் படைப்புத் திறன்கள் உச்சத்தை எட்டும், மேலும் உங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்புகள் கிடைக்கும். விருதுகள் அல்லது அங்கீகாரங்கள் கூட உங்களைத் தேடி வரலாம். உங்கள் தன்னம்பிக்கை உயரும், மேலும் உங்கள் இலக்குகளை அடைய நீங்கள் புதிய உத்வேகத்தைப் பெறுவீர்கள். புதிய திட்டங்களைத் தொடங்குவதற்கு அல்லது ஏற்கனவே உள்ள திட்டங்களை மேம்படுத்துவதற்கு இது ஒரு நல்ல நாளாகும். உங்கள் தலைமைப் பண்புகள் பாராட்டப்படும், மேலும் உங்கள் குழுவினருக்கு நீங்கள் ஊக்கமளிப்பீர்கள். நிதி நிலையில் இன்று ஒரு சாதகமான சூழ்நிலை உருவாகும். கலைப் பொருட்கள், பொழுதுபோக்கு அல்லது ஆடம்பரப் பொருட்களில் முதலீடு செய்ய ஆர்வம் ஏற்படலாம். ஆனால், திட்டமிட்டுச் செயல்படுவது அவசியம். உங்கள் உடலையும், உள்ளத்தையும் சமநிலையில் வைத்துக்கொள்ள முயற்சிப்பது மிக முக்கியம். உடற்பயிற்சிகளை மேற்கொள்வதும், சத்தான உணவுகளை எடுத்துக்கொள்வதும் உங்கள் ஆற்றல் மட்டங்களை உயர்ந்த நிலையில் வைத்திருக்கும். மன அழுத்தத்தைக் குறைக்கும் தளர்வு நுட்பங்களில் கவனம் செலுத்துவது உங்களுக்கு நன்மை பயக்கும். இன்று நீங்கள் அதிக தன்னம்பிக்கையுடனும், உற்சாகத்துடனும் செயல்படுவீர்கள். இது உங்கள் அன்றாட பணிகளை திறம்பட முடிக்க உதவும். உங்கள் தனிப்பட்ட அழகையும், கவர்ச்சியையும் மேம்படுத்த நீங்கள் மேற்கொள்ளும் முயற்சிகள் நல்ல பலனை அளிக்கும். உங்கள் நண்பர்களுடன் அல்லது குடும்பத்தினருடன் ஒரு சிறிய பயணம் மேற்கொள்வது புத்துணர்ச்சியை அளிக்கும். மற்றவர்களுக்கு நீங்கள் வழிகாட்டும் நிலையில் இருப்பீர்கள், மேலும் உங்கள் ஆலோசனைகள் பலருக்குப் பயனளிக்கும். இன்று நீங்கள் அனுபவிக்கும் அனைத்தும் அன்பு, மகிழ்ச்சி, மற்றும் புகழ் ஆகியவற்றை மையமாகக் கொண்டதாக இருக்கும்.",
    "prediction_en": "For Leo natives, due to the influence of Venus today, rejuvenation and joy will overflow in personal relationships and social connections. Your natural charm and leadership qualities will further enhance today. This is an excellent day to meet new people and welcome newcomers into your social circle. You will be the captivating center of attention at any social events you participate in. The time you spend with friends and relatives will be sweet and meaningful. Smooth solutions will be found for long-standing relationship issues. You will share an unforgettable day with your partner. Your love will be expressed through romantic gestures or unexpected gifts. For married couples, love will further strengthen. Those who are single may find opportunities to start new relationships today. Those involved in art, drama, music, and entertainment industries will experience significant growth today. Your creative talents will reach their peak, and you will have good opportunities to showcase your skills. Awards or recognitions may even come your way. Your self-confidence will rise, and you will gain new inspiration to achieve your goals. This is a good day to start new projects or improve existing ones. Your leadership qualities will be appreciated, and you will inspire your team members. A favorable financial situation will arise today. You may develop an interest in investing in art, entertainment, or luxury items. However, it is essential to proceed with planning. It is very important to try and keep your body and mind balanced. Engaging in exercises and consuming nutritious foods will keep your energy levels high. Focusing on relaxation techniques to reduce stress will be beneficial for you. Today you will act with increased self-confidence and enthusiasm. This will help you efficiently complete your daily tasks. Your efforts to enhance your personal beauty and charm will yield good results. Taking a short trip with your friends or family will provide rejuvenation. You will be in a position to guide others, and your advice will benefit many. Overall, everything you experience today will be centered around love, joy, and recognition.",
    "career_ta": "தொழில்ரீதியாக, இன்று உங்கள் படைப்பாற்றல் மற்றும் தலைமைப் பண்புகள் வெளிப்படும். கலை, பொழுதுபோக்கு, அல்லது மக்கள் தொடர்புத் துறைகளில் உள்ளவர்களுக்கு இன்று சிறப்பான வளர்ச்சி இருக்கும். உங்கள் இணக்கமான அணுகுமுறை குழுப்பணிகளில் நல்ல பலனைத் தரும். புதிய திட்டங்களுக்குத் தலைமை தாங்க அல்லது உங்கள் யோசனைகளை முன்வைக்க இது ஒரு நல்ல நாளாகும். சக ஊழியர்களுடனான உறவுகள் மேம்படும்.",
    "career_en": "Professionally, your creativity and leadership qualities will shine today. Those in art, entertainment, or public relations sectors will experience significant growth today. Your harmonious approach will yield good results in team projects. This is a good day to lead new projects or present your ideas. Relationships with colleagues will improve.",
    "finance_ta": "நிதிநிலையில் இன்று ஒரு சாதகமான சூழ்நிலை நிலவும். பொழுதுபோக்கு, ஆடம்பரம் அல்லது கலை சார்ந்த முதலீடுகளில் ஆர்வம் ஏற்படலாம். திடீர் ஆதாயங்கள் அல்லது எதிர்பாராத வருமான வாய்ப்புகள் ஏற்படலாம். உங்கள் பணத்தை புத்திசாலித்தனமாக நிர்வகிப்பதன் மூலம் எதிர்காலத்திற்கான பாதுகாப்பை உறுதிப்படுத்த முடியும். குடும்பத்துடன் நிதி திட்டங்களைப் பற்றி கலந்தாலோசிப்பது நன்மை பயக்கும்.",
    "finance_en": "Financially, a favorable situation will prevail today. You may develop an interest in entertainment, luxury, or art-related investments. Sudden gains or unexpected income opportunities may arise. By wisely managing your money, you can ensure future security. Discussing financial plans with family will be beneficial.",
    "health_ta": "உங்கள் உடல்நலம் இன்று சீராகவும், உற்சாகமாகவும் இருக்கும். விளையாட்டு அல்லது பொழுதுபோக்கு சார்ந்த உடற்பயிற்சிகளில் ஈடுபடுவது உங்களுக்கு மிகவும் நன்மை பயக்கும். மன அழுத்தத்தைக் குறைக்கும் செயல்களில் ஈடுபடுவது மற்றும் போதுமான ஓய்வு எடுப்பது உங்கள் ஆற்றலை அதிகரிக்கும். சுவையான மற்றும் ஆரோக்கியமான உணவுகளை மிதமாக எடுத்துக்கொள்வதன் மூலம் உங்கள் உடல்நலம் மேம்படும்.",
    "health_en": "Your health will be steady and energetic today. Engaging in sports or entertainment-related exercises will be highly beneficial for you. Engaging in stress-reducing activities and getting sufficient rest will boost your energy. Consuming delicious and healthy foods in moderation will improve your health.",
    "lucky_number": "1",
    "lucky_color_ta": "பொன்நிறம்",
    "lucky_color_en": "Gold"
  },
  {
    "sign_ta": "கன்னி",
    "sign_en": "Virgo",
    "date": "13-02-2026",
    "prediction_ta": "கன்னி ராசிக்காரர்களுக்கு இன்று சுக்கிரனின் ஆதிக்கத்தால், அன்றாட வாழ்க்கையில் அழகு, ஒழுங்கு, மற்றும் இணக்கம் மேலோங்கும். உங்கள் பணிச்சூழலிலும், தனிப்பட்ட உறவுகளிலும் ஒரு புதிய வெளிச்சம் பிறக்கும். சிறிய விவரங்களிலும் நீங்கள் இன்று மகிழ்ச்சியைக் காண்பீர்கள். உங்கள் பகுப்பாய்வுத் திறன் மெருகேறி, எந்த ஒரு சிக்கலையும் திறம்பட அணுகுவீர்கள். உங்கள் பணியிடத்தில் நீங்கள் மேற்கொள்ளும் சீர்திருத்தங்கள் பாராட்டப்படும். சக ஊழியர்களுடனும், உயரதிகாரிகளுடனும் நல்லுறவைப் பேணுவதன் மூலம் உங்கள் திட்டங்களை வெற்றிகரமாக முடிக்க முடியும். தனிப்பட்ட உறவுகளில் இன்று அன்பு, புரிதல், மற்றும் அர்ப்பணிப்பு ஆகியவை வலுப்பெறும். உங்கள் துணையுடன் நீங்கள் செலவிடும் நேரம் இனிமையாகவும், அர்த்தமுள்ளதாகவும் இருக்கும். நீண்டகாலமாக இருந்த சிறிய மனக்கசப்புகள் மெல்ல நீங்கி, இதயப்பூர்வமான இணைப்புக்கு வழிவகுக்கும். குடும்பத்தில் அமைதியும், மகிழ்ச்சியும் நிறைந்திருக்கும். கலை மற்றும் அழகியல் சார்ந்த விஷயங்களில் உங்கள் ஆர்வம் அதிகரிக்கும். ஒரு புதிய பொழுதுபோக்கைத் தொடங்குவதற்கோ அல்லது ஏற்கனவே இருக்கும் திறமைகளை மெருகேற்றுவதற்கோ இது ஒரு சிறந்த நாளாகும். குறிப்பாக, கைவினைப் பொருட்கள், வடிவமைப்பு, அல்லது எழுத்துத் துறைகளில் ஈடுபட்டுள்ளவர்களுக்கு இன்று புதிய உத்வேகமும், படைப்பாற்றலும் பெருகும். உங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்புகள் கிடைக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் தொடர்புகளை விரிவுபடுத்தும், மேலும் உங்கள் கவர்ச்சியான ஆளுமையால் புதிய நண்பர்களைப் பெறுவீர்கள். உங்கள் பேச்சுத்திறன் கூர்மையடைந்து, உங்களைச் சுற்றியுள்ளவர்களை நீங்கள் எளிதாகக் கவர முடியும். நேர்மையான மற்றும் திறந்த மனதுடன் பேசுவது பல உறவுகளை மேம்படுத்தும். இன்றைய நாள் பயணங்களுக்கு உகந்ததல்ல என்று தோன்றினாலும், குடும்பத்துடன் மேற்கொள்ளும் சிறிய சுற்றுப்பயணங்கள் அல்லது அருகிலுள்ள இடங்களுக்குச் சென்று வருவது புத்துணர்ச்சியை அளிக்கும். ஆன்மீக நாட்டம் கொண்டவர்கள், தங்கள் உள்ளத்தில் அமைதியையும், தெளிவையும் பெறுவார்கள். தியானம் அல்லது இறைவழிபாடு போன்ற செயல்களில் ஈடுபடுவது மனதை ஒருமுகப்படுத்த உதவும். உங்கள் மனதில் புதிய நம்பிக்கையும், உத்வேகமும் பிறக்கும். கடந்தகால நிகழ்வுகளைப் பற்றிய எண்ணங்கள் நீங்கி, நிகழ்காலத்தை முழுமையாக வாழும் மனநிலையைப் பெறுவீர்கள். எதிர்காலத்திற்கான திட்டங்களை வகுக்கும்போது, உங்கள் குடும்பத்தினரின் ஆலோசனைகளையும், கருத்துக்களையும் கேட்பது நல்ல முடிவுகளை எடுக்க உதவும். உங்கள் உடலையும், மனதையும் சீராக வைத்துக்கொள்ள நீங்கள் மேற்கொள்ளும் முயற்சிகள் நல்ல பலனை அளிக்கும். சரியான உணவு முறை மற்றும் மிதமான உடற்பயிற்சி உங்கள் ஆற்றல் மட்டங்களை உயர்ந்த நிலையில் வைத்திருக்கும். ஒட்டுமொத்தமாக, இன்று நீங்கள் அனுபவிக்கும் அனைத்து விஷயங்களும் நல்லிணக்கம், அன்பு, மற்றும் வளர்ச்சி ஆகியவற்றை மையமாகக் கொண்டதாக இருக்கும்.",
    "prediction_en": "For Virgo natives, due to the influence of Venus today, beauty, order, and harmony will prevail in daily life. A new light will emerge in your work environment and personal relationships. You will find joy in small details today. Your analytical skills will sharpen, and you will approach any issue effectively. Reforms you undertake in your workplace will be appreciated. By maintaining good relationships with colleagues and superiors, you will be able to successfully complete your projects. In personal relationships, love, understanding, and dedication will strengthen today. The time you spend with your partner will be sweet and meaningful. Small misunderstandings that have lingered for a long time will gradually disappear, paving the way for heartfelt connections. Peace and happiness will prevail in the family. Your interest in arts and aesthetics will increase. This is an excellent day to start a new hobby or to refine existing talents. Specifically, those involved in handicrafts, design, or writing will experience new inspiration and creativity today. Good opportunities will arise to showcase your talents. Participating in social events will expand your contacts, and you will gain new friends through your charming personality. Your communication skills will sharpen, and you will be able to easily captivate those around you. Speaking with honesty and an open mind will improve many relationships. Although today may not seem ideal for extensive travel, short trips or visiting nearby places with family will provide rejuvenation. Those with spiritual inclinations will find peace and clarity within themselves. Engaging in practices like meditation or prayer will help focus the mind. New hope and inspiration will emerge in your mind. Thoughts about past events will dissipate, and you will gain a mindset to fully live in the present. When planning for the future, seeking the advice and opinions of your family members will help you make good decisions. Your efforts to maintain your physical and mental well-being will yield positive results. A proper diet and moderate exercise will keep your energy levels high. Overall, everything you experience today will be centered around harmony, love, and growth.",
    "career_ta": "தொழில்ரீதியாக, இன்று உங்கள் திறமை மற்றும் உழைப்புக்கு அங்கீகாரம் கிடைக்கும். பணிச்சூழலில் அழகு, ஒழுங்கு, மற்றும் இணக்கம் மேலோங்கும். சகாக்களுடன் நல்லுறவைப் பேணுவதன் மூலம் உங்கள் உற்பத்தித்திறன் அதிகரிக்கும். திட்டங்களைச் செம்மைப்படுத்துவதிலும், விவரங்களில் கவனம் செலுத்துவதிலும் உங்கள் திறமை பாராட்டப்படும். கலை, வடிவமைப்பு, அல்லது சேவைத் துறைகளில் உள்ளவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் உருவாகும்.",
    "career_en": "Professionally, your talent and hard work will be recognized today. Beauty, order, and harmony will prevail in the workplace. Maintaining good relationships with colleagues will increase your productivity. Your ability to refine projects and pay attention to details will be appreciated. Excellent opportunities will arise for those in art, design, or service industries today.",
    "finance_ta": "நிதிநிலையில் இன்று ஒரு சீரான நிலை காணப்படும். திட்டமிட்ட செலவுகள் மற்றும் சேமிப்பு முயற்சிகள் நல்ல பலனைத் தரும். வீட்டிற்குத் தேவையான அழகியல் பொருட்கள் அல்லது பயன்பாட்டு மதிப்புள்ள பொருட்களை வாங்குவதற்கு இது ஒரு நல்ல நாளாகும். நீண்டகால நிதி பாதுகாப்பை உறுதிப்படுத்த புதிய திட்டங்களை வகுக்கலாம். உங்கள் நிதியை புத்திசாலித்தனமாக நிர்வகிப்பதன் மூலம் நல்ல முன்னேற்றத்தைக் காண்பீர்கள்.",
    "finance_en": "Financially, a stable situation will prevail today. Planned expenses and savings efforts will yield good results. This is a good day to purchase aesthetic items for the home or items of practical value. You can formulate new plans to ensure long-term financial security. By wisely managing your finances, you will see good progress.",
    "health_ta": "உங்கள் உடல்நலம் இன்று சீராகவும், உற்சாகமாகவும் இருக்கும். ஆரோக்கியமான உணவுப் பழக்கவழக்கங்கள் மற்றும் மிதமான உடற்பயிற்சி உங்கள் ஆற்றல் மட்டங்களை உயர்ந்த நிலையில் வைத்திருக்கும். மன அமைதிக்கு முக்கியத்துவம் கொடுப்பதன் மூலம், உங்கள் உடல் ஆரோக்கியம் மேம்படும். இயற்கை வைத்தியங்கள் அல்லது தளர்வு நுட்பங்களில் கவனம் செலுத்துவது உங்களுக்கு நன்மை பயக்கும்.",
    "health_en": "Your health will be steady and energetic today. Healthy eating habits and moderate exercise will keep your energy levels high. By prioritizing mental peace, your physical health will improve. Focusing on natural remedies or relaxation techniques will be beneficial for you.",
    "lucky_number": "5",
    "lucky_color_ta": "வெள்ளி நிறம்",
    "lucky_color_en": "Silver"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "13-02-2026",
    "prediction_ta": "துலாம் ராசிக்காரர்களுக்கு இன்று உங்கள் ஆளும் கிரகமான சுக்கிரனின் ஆதிக்கத்தால், அன்பு, நல்லிணக்கம், மற்றும் சமூக உறவுகளில் ஒரு புதிய பொலிவு ஏற்படும். உங்கள் தனிப்பட்ட உறவுகளிலும், தொழில்ரீதியான கூட்டாண்மைகளிலும் சமநிலையும், அழகும் மேலோங்கும். நீண்டகாலமாக நிலுவையில் இருந்த உறவுப் பிரச்சனைகளுக்கு சுமூகமான தீர்வுகள் இன்று காணப்படும். உங்கள் துணையுடன் நீங்கள் ஒரு மறக்க முடியாத நாளைப் பகிர்ந்து கொள்வீர்கள். ரொமான்டிக் பயணங்கள் அல்லது எதிர்பாராத பரிசுகள் மூலம் உங்கள் அன்பு வெளிப்படும். திருமணமானவர்களுக்கு அன்பு மேலும் வலுப்பெறும். தனிமையில் இருப்பவர்கள் புதிய உறவுகளைத் தொடங்குவதற்கான வாய்ப்புகள் இன்று உருவாகலாம். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் தொடர்புகளை விரிவுபடுத்தும், மேலும் உங்கள் கவர்ச்சியான ஆளுமையால் புதிய நண்பர்களைப் பெறுவீர்கள். கலை, இசை, இலக்கியம் போன்ற படைப்பாற்றல் துறைகளில் ஈடுபட்டுள்ளவர்களுக்கு இன்று புதிய உத்வேகமும், படைப்பாற்றலும் பெருகும். உங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்புகள் கிடைக்கும். உங்கள் பேச்சுத்திறன் கூர்மையடைந்து, உங்களைச் சுற்றியுள்ளவர்களை நீங்கள் எளிதாகக் கவர முடியும். நேர்மையான மற்றும் திறந்த மனதுடன் பேசுவது பல உறவுகளை மேம்படுத்தும். நீதி, சமத்துவம், மற்றும் இணக்கம் ஆகியவற்றுக்கான உங்கள் நாட்டம் இன்று அதிகரிக்கும். மற்றவர்களுக்கு நீங்கள் வழிகாட்டும் நிலையில் இருப்பீர்கள், மேலும் உங்கள் ஆலோசனைகள் பலருக்குப் பயனளிக்கும். புதிய திட்டங்களைத் தொடங்குவதற்கு அல்லது ஏற்கனவே உள்ள திட்டங்களை மேம்படுத்துவதற்கு இது ஒரு நல்ல நாளாகும். உங்கள் தன்னம்பிக்கை உயரும், மேலும் உங்கள் இலக்குகளை அடைய நீங்கள் புதிய உத்வேகத்தைப் பெறுவீர்கள். நிதி நிலையில் இன்று ஒரு சாதகமான சூழ்நிலை உருவாகும். கலைப் பொருட்கள், பொழுதுபோக்கு அல்லது ஆடம்பரப் பொருட்களில் முதலீடு செய்ய ஆர்வம் ஏற்படலாம். ஆனால், திட்டமிட்டுச் செயல்படுவது அவசியம். உங்கள் உடலையும், உள்ளத்தையும் சமநிலையில் வைத்துக்கொள்ள முயற்சிப்பது மிக முக்கியம். உடற்பயிற்சிகளை மேற்கொள்வதும், சத்தான உணவுகளை எடுத்துக்கொள்வதும் உங்கள் ஆற்றல் மட்டங்களை உயர்ந்த நிலையில் வைத்திருக்கும். மன அழுத்தத்தைக் குறைக்கும் தளர்வு நுட்பங்களில் கவனம் செலுத்துவது உங்களுக்கு நன்மை பயக்கும். இன்று நீங்கள் அதிக தன்னம்பிக்கையுடனும், உற்சாகத்துடனும் செயல்படுவீர்கள். இது உங்கள் அன்றாட பணிகளை திறம்பட முடிக்க உதவும். உங்கள் தனிப்பட்ட அழகையும், கவர்ச்சியையும் மேம்படுத்த நீங்கள் மேற்கொள்ளும் முயற்சிகள் நல்ல பலனை அளிக்கும். உங்கள் நண்பர்களுடன் அல்லது குடும்பத்தினருடன் ஒரு சிறிய பயணம் மேற்கொள்வது புத்துணர்ச்சியை அளிக்கும். சுவையான உணவுகளை ரசிப்பீர்கள், ஆனால் அளவோடு எடுத்துக்கொள்வது நல்லது. ஆடம்பரமான பொருட்கள் மீதான உங்கள் நாட்டம் சற்று அதிகமாக இருக்கலாம், ஆனால் உங்கள் தேவைகளைப் பகுத்தறிந்து செலவு செய்வது நல்லது. ஒட்டுமொத்தமாக, இன்று நீங்கள் அனுபவிக்கும் அனைத்தும் அன்பு, மகிழ்ச்சி, மற்றும் சமநிலை ஆகியவற்றை மையமாகக் கொண்டதாக இருக்கும்.",
    "prediction_en": "For Libra natives, due to the influence of Venus, your ruling planet, a new luster will emerge in love, harmony, and social relationships today. Balance and beauty will prevail in your personal relationships and professional partnerships. Smooth solutions will be found today for long-standing relationship issues. You will share an unforgettable day with your partner. Your love will be expressed through romantic gestures or unexpected gifts. For married couples, love will further strengthen. Those who are single may find opportunities to start new relationships today. Participating in social events will expand your contacts, and you will gain new friends through your charming personality. Those involved in creative fields like art, music, and literature will receive new inspiration and creativity today. Good opportunities will arise to showcase your talents. Your communication skills will sharpen, and you will be able to easily captivate those around you. Speaking with honesty and an open mind will improve many relationships. Your inclination towards justice, equality, and harmony will increase today. You will be in a position to guide others, and your advice will benefit many. This is a good day to start new projects or improve existing ones. Your self-confidence will rise, and you will gain new inspiration to achieve your goals. A favorable financial situation will arise today. You may develop an interest in investing in art, entertainment, or luxury items. However, it is essential to proceed with planning. It is very important to try and keep your body and mind balanced. Engaging in exercises and consuming nutritious foods will keep your energy levels high. Focusing on relaxation techniques to reduce stress will be beneficial for you. Today you will act with increased self-confidence and enthusiasm. This will help you efficiently complete your daily tasks. Your efforts to enhance your personal beauty and charm will yield good results. Taking a short trip with your friends or family will provide rejuvenation. You will enjoy delicious foods, but it is good to consume them in moderation. Your inclination towards luxurious items might be a bit high, but it is wise to analyze your needs and spend accordingly. Overall, everything you experience today will be centered around love, joy, and balance.",
    "career_ta": "தொழில்ரீதியாக, இன்று உங்கள் இராஜதந்திர அணுகுமுறை மற்றும் இணக்கமான செயல்பாடுகள் பெரும் வெற்றிகளைப் பெற்றுத்தரும். கூட்டாண்மை சார்ந்த திட்டங்களில் உங்கள் பங்களிப்பு பாராட்டப்படும். கலை, வடிவமைப்பு, சட்டம் அல்லது மக்கள் தொடர்புத் துறைகளில் உள்ளவர்களுக்கு இன்று சிறப்பான வளர்ச்சி இருக்கும். புதிய ஒப்பந்தங்கள் அல்லது கூட்டாண்மைகளில் கையெழுத்திட இது ஒரு நல்ல நாளாகும். உங்கள் பணிச்சூழல் இனிமையாகவும், ஒத்துழைப்புடனும் காணப்படும்.",
    "career_en": "Professionally, today your diplomatic approach and harmonious operations will bring great success. Your contributions in partnership-based projects will be appreciated. Those in art, design, law, or public relations sectors will experience significant growth today. This is a good day to sign new agreements or partnerships. Your work environment will be pleasant and cooperative.",
    "finance_ta": "நிதிநிலையில் இன்று ஒரு சாதகமான சூழ்நிலை நிலவும். கூட்டாண்மைகள் அல்லது சமூக தொடர்புகள் மூலம் சில புதிய நிதி வாய்ப்புகள் உருவாகலாம். கலைப் பொருட்கள், அழகுசாதனப் பொருட்கள் அல்லது ஆடம்பரப் பொருட்களில் முதலீடு செய்ய ஆர்வம் ஏற்படலாம். நிதி மேலாண்மையில் சமநிலையான அணுகுமுறையைக் கடைப்பிடிப்பதன் மூலம் நீண்டகால வளர்ச்சியை உறுதிப்படுத்தலாம். உங்கள் நிதி திட்டங்களை மறுசீரமைக்க இது ஒரு நல்ல நாளாகும்.",
    "finance_en": "Financially, a favorable situation will prevail today. Some new financial opportunities may arise through partnerships or social connections. You may develop an interest in investing in art items, cosmetics, or luxury goods. By adopting a balanced approach to financial management, you can ensure long-term growth. This is a good day to restructure your financial plans.",
    "health_ta": "உங்கள் உடல்நலம் இன்று சீராகவும், உற்சாகமாகவும் இருக்கும். மன அமைதிக்கு முக்கியத்துவம் கொடுப்பதன் மூலம், உங்கள் உடல் ஆரோக்கியம் மேம்படும். அழகு மற்றும் ஆரோக்கியப் பராமரிப்பில் கவனம் செலுத்துவது உங்களுக்கு நன்மை பயக்கும். யோகா, தியானம் போன்ற மனதை அமைதிப்படுத்தும் பயிற்சிகளில் ஈடுபடுவது உங்களுக்கு மிகவும் ஆறுதலை அளிக்கும். நல்ல உணவு மற்றும் போதுமான ஓய்வு மிகவும் அவசியம்.",
    "health_en": "Your health will be steady and energetic today. By prioritizing mental peace, your physical health will improve. Focusing on beauty and wellness care will be beneficial for you. Engaging in calming practices like yoga and meditation will bring you great comfort. Good food and sufficient rest are very important.",
    "lucky_number": "6",
    "lucky_color_ta": "இளஞ்சிவப்பு",
    "lucky_color_en": "Pink"
  },
  {
    "sign_ta": "விருச்சிகம்",
    "sign_en": "Scorpio",
    "date": "13-02-2026",
    "prediction_ta": "விருச்சிக ராசிக்காரர்களுக்கு இன்று சுக்கிரனின் செல்வாக்கினால், ஆழமான உறவுகளிலும், மறைந்திருக்கும் அழகிலும் புதிய பரிமாணங்கள் தோன்றும். உங்கள் தனிப்பட்ட உறவுகளில் அன்பு, நம்பிக்கை, மற்றும் அர்ப்பணிப்பு ஆகியவை வலுப்பெறும். உங்கள் துணையுடன் நீங்கள் ஆழமான மற்றும் அர்த்தமுள்ள உரையாடல்களில் ஈடுபடுவீர்கள். நீண்டகாலமாக நிலுவையில் இருந்த உறவுப் பிரச்சனைகளுக்கு சுமூகமான, ஆழமான தீர்வுகள் இன்று காணப்படும். தனிமையில் இருப்பவர்கள் புதிய, தீவிரமான உறவுகளைத் தொடங்குவதற்கான வாய்ப்புகள் இன்று உருவாகலாம். உங்கள் உள்ளுணர்வு கூர்மையடையும், மேலும் உங்களைச் சுற்றியுள்ளவர்களின் உண்மையான நோக்கங்களை நீங்கள் எளிதாகப் புரிந்துகொள்வீர்கள். மறைந்திருக்கும் திறமைகளை வெளிக்கொணர்வதற்கும், உங்கள் ஆளுமையின் ஆழமான அம்சங்களை ஆராய்வதற்கும் இது ஒரு சிறந்த நாளாகும். கலை, உளவியல், அல்லது ஆராய்ச்சித் துறைகளில் ஈடுபட்டுள்ளவர்களுக்கு இன்று புதிய உத்வேகமும், படைப்பாற்றலும் பெருகும். உங்கள் படைப்புத் திறன்களை வெளிப்படுத்த நல்ல வாய்ப்புகள் கிடைக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் தொடர்புகளை விரிவுபடுத்தும், ஆனால் நீங்கள் ஆழ்ந்த மற்றும் அர்த்தமுள்ள உறவுகளுக்கே முக்கியத்துவம் கொடுப்பீர்கள். உங்கள் பேச்சுத்திறன் கூர்மையடைந்து, உங்களைச் சுற்றியுள்ளவர்களை நீங்கள் எளிதாகக் கவர முடியும். நேர்மையான மற்றும் திறந்த மனதுடன் பேசுவது பல உறவுகளை மேம்படுத்தும். இன்றைய நாள் சில முக்கியமான முடிவுகளை எடுப்பதற்கு ஏற்ற நாளாகும், குறிப்பாக கூட்டாண்மை சார்ந்த விஷயங்களில். நிதி நிலையில் இன்று ஒரு சாதகமான சூழ்நிலை உருவாகும். இரகசிய வருமான வழிகள் அல்லது எதிர்பாராத ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது. நீண்டகால முதலீடுகளைப் பற்றி சிந்திக்க இது ஒரு சிறந்த நாளாகும், ஆனால் அனுபவமுள்ளவர்களின் ஆலோசனையைப் பெறுவது நல்லது. உங்கள் உடலையும், உள்ளத்தையும் சமநிலையில் வைத்துக்கொள்ள முயற்சிப்பது மிக முக்கியம். உடற்பயிற்சிகளை மேற்கொள்வதும், சத்தான உணவுகளை எடுத்துக்கொள்வதும் உங்கள் ஆற்றல் மட்டங்களை உயர்ந்த நிலையில் வைத்திருக்கும். மன அழுத்தத்தைக் குறைக்கும் தளர்வு நுட்பங்களில் கவனம் செலுத்துவது உங்களுக்கு நன்மை பயக்கும். இன்று நீங்கள் அதிக தன்னம்பிக்கையுடனும், உற்சாகத்துடனும் செயல்படுவீர்கள். இது உங்கள் அன்றாட பணிகளை திறம்பட முடிக்க உதவும். உங்கள் தனிப்பட்ட அழகையும், கவர்ச்சியையும் மேம்படுத்த நீங்கள் மேற்கொள்ளும் முயற்சிகள் நல்ல பலனை அளிக்கும். உங்கள் நண்பர்களுடன் அல்லது குடும்பத்தினருடன் ஒரு சிறிய பயணம் மேற்கொள்வது புத்துணர்ச்சியை அளிக்கும். மற்றவர்களுக்கு நீங்கள் வழிகாட்டும் நிலையில் இருப்பீர்கள், மேலும் உங்கள் ஆலோசனைகள் பலருக்குப் பயனளிக்கும். உங்கள் உள்ளுணர்வு வழிகாட்டுதலைப் பின்பற்றுவது இன்று மிகவும் முக்கியம். ஒட்டுமொத்தமாக, இன்று நீங்கள் அனுபவிக்கும் அனைத்தும் அன்பு, வளர்ச்சி, மற்றும் ஆழமான புரிதல் ஆகியவற்றை மையமாகக் கொண்டதாக இருக்கும்.",
    "prediction_en": "For Scorpio natives, due to the influence of Venus today, new dimensions will emerge in deep relationships and hidden beauty. Love, trust, and dedication will strengthen in your personal relationships. You will engage in deep and meaningful conversations with your partner. Smooth and profound solutions will be found today for long-standing relationship issues. Those who are single may find opportunities to start new, intense relationships today. Your intuition will sharpen, and you will easily understand the true intentions of those around you. This is an excellent day to unearth hidden talents and explore the deeper aspects of your personality. Those involved in art, psychology, or research fields will experience new inspiration and creativity today. Good opportunities will arise to showcase your talents. Participating in social events will expand your contacts, but you will prioritize deep and meaningful relationships. Your communication skills will sharpen, and you will be able to easily captivating those around you. Speaking with honesty and an open mind will improve many relationships. Today is a suitable day to make some important decisions, especially concerning partnerships. A favorable financial situation will arise today. There is a possibility of secret income channels or unexpected gains. This is an excellent day to consider long-term investments, but it is good to seek advice from experienced individuals. It is very important to try and keep your body and mind balanced. Engaging in exercises and consuming nutritious foods will keep your energy levels high. Focusing on relaxation techniques to reduce stress will be beneficial for you. Today you will act with increased self-confidence and enthusiasm. This will help you efficiently complete your daily tasks. Your efforts to enhance your personal beauty and charm will yield good results. Taking a short trip with your friends or family will provide rejuvenation. You will be in a position to guide others, and your advice will benefit many. Following your intuitive guidance is very important today. Overall, everything you experience today will be centered around love, growth, and deep understanding.",
    "career_ta": "தொழில்ரீதியாக, இன்று உங்கள் ஆழ்ந்த பார்வை மற்றும் அர்ப்பணிப்பு பெரும் வெற்றிகளைப் பெற்றுத்தரும். கூட்டாண்மை சார்ந்த திட்டங்களில் உங்கள் பங்களிப்பு பாராட்டப்படும். ஆராய்ச்சி, உளவியல், அல்லது ரகசியத் துறைகளில் உள்ளவர்களுக்கு இன்று சிறப்பான வளர்ச்சி இருக்கும். உங்கள் உள்ளுணர்வு சார்ந்த முடிவுகள் நல்ல பலனை அளிக்கும். சக ஊழியர்களுடன் இணக்கமான சூழலைப் பேணுவது நன்மை பயக்கும்.",
    "career_en": "Professionally, today your deep insight and dedication will bring great success. Your contributions in partnership-based projects will be appreciated. Those in research, psychology, or confidential sectors will experience significant growth today. Your intuitive decisions will yield good results. Maintaining a harmonious environment with colleagues will be beneficial.",
    "finance_ta": "நிதிநிலையில் இன்று ஒரு சாதகமான சூழ்நிலை நிலவும். இரகசிய ஆதாயங்கள், கூட்டாண்மைகள் அல்லது மரபுரிமை மூலம் நிதி கிடைக்க வாய்ப்புள்ளது. நீண்டகால முதலீடுகளில் கவனம் செலுத்துவது நல்லது. உங்கள் நிதியை புத்திசாலித்தனமாக நிர்வகிப்பதன் மூலம் எதிர்காலத்திற்கான பாதுகாப்பை உறுதிப்படுத்த முடியும். ஆடம்பரப் பொருட்கள் அல்லது மதிப்புமிக்க சேவைகளில் முதலீடு செய்ய ஆர்வம் ஏற்படலாம்.",
    "finance_en": "Financially, a favorable situation will prevail today. There is a possibility of financial gains through secret sources, partnerships, or inheritance. It is good to focus on long-term investments. By wisely managing your money, you can ensure future security. You may develop an interest in investing in luxury items or valuable services.",
    "health_ta": "உங்கள் உடல்நலம் இன்று சீராகவும், உற்சாகமாகவும் இருக்கும். மன அமைதிக்கு முக்கியத்துவம் கொடுப்பதன் மூலம், உங்கள் உடல் ஆரோக்கியம் மேம்படும். தியானம், யோகா போன்ற மனதை ஒருமுகப்படுத்தும் பயிற்சிகள் உங்களுக்கு மிகவும் நன்மை பயக்கும். ஆழமான சுவாசம் மற்றும் போதுமான ஓய்வு உங்கள் ஆற்றல் மட்டங்களை உயர்ந்த நிலையில் வைத்திருக்கும். மன அழுத்தத்தைக் குறைக்கும் தளர்வு நுட்பங்களில் கவனம் செலுத்துங்கள்.",
    "health_en": "Your health will be steady and energetic today. By prioritizing mental peace, your physical health will improve. Practices like meditation and yoga, which focus the mind, will be highly beneficial for you. Deep breathing and sufficient rest will keep your energy levels high. Focus on relaxation techniques to reduce stress.",
    "lucky_number": "8",
    "lucky_color_ta": "செம்மஞ்சள்",
    "lucky_color_en": "Orange"
  },
  {
    "sign_ta": "தனுசு",
    "sign_en": "Sagittarius",
    "date": "13-02-2026",
    "prediction_ta": "தனுசு ராசிக்காரர்களுக்கு இன்று சுக்கிரனின் ஆதிக்கத்தால், சமூக தொடர்புகளிலும், புதிய அனுபவங்களைத் தேடுவதிலும் இனிமை மேலோங்கும். உங்கள் இயல்பான உற்சாகமும், சாகச உணர்வும் இன்று மேலும் அதிகரிக்கும். புதிய நபர்களைச் சந்திப்பதற்கும், உங்கள் சமூக வட்டத்தில் புதியவர்களை வரவேற்பதற்கும் இது ஒரு சிறந்த நாளாகும். நீங்கள் பங்கேற்கும் சமூக நிகழ்வுகளில் அனைவரையும் கவரும் மையமாக இருப்பீர்கள். நண்பர்களுடனும், உறவினர்களுடனும் நீங்கள் செலவிடும் நேரம் இனிமையாகவும், அர்த்தமுள்ளதாகவும் இருக்கும். நீண்டகாலமாக நிலுவையில் இருந்த உறவுப் பிரச்சனைகளுக்கு சுமூகமான தீர்வுகள் காணப்படும். உங்கள் துணையுடன் நீங்கள் ஒரு மறக்க முடியாத நாளைப் பகிர்ந்து கொள்வீர்கள். ரொமான்டிக் பயணங்கள் அல்லது எதிர்பாராத பரிசுகள் மூலம் உங்கள் அன்பு வெளிப்படும். திருமணமானவர்களுக்கு அன்பு மேலும் வலுப்பெறும். தனிமையில் இருப்பவர்கள் புதிய உறவுகளைத் தொடங்குவதற்கான வாய்ப்புகள் இன்று உருவாகலாம். கல்வி, தத்துவம், மற்றும் ஆன்மீகம் சார்ந்த துறைகளில் உங்கள் ஆர்வம் அதிகரிக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதற்கும், உங்கள் அறிவைப் பகிர்ந்து கொள்வதற்கும் இது ஒரு உகந்த நேரம். வெளிநாட்டுக் கலாச்சாரங்கள் அல்லது புதிய மொழிகளைப் பற்றி அறிந்துகொள்வது உங்களுக்கு மிகவும் மகிழ்ச்சியை அளிக்கும். பயணங்களை மேற்கொள்வதற்கு இன்று மிகவும் ஏற்ற நாளாகும். இவை புதிய அனுபவங்களையும், மகிழ்ச்சியையும் கொண்டு வரும். உங்கள் சமூக வலைத்தள தொடர்புகள் இன்று வலுப்பெறும், மேலும் பலரின் பாராட்டுக்களைப் பெறுவீர்கள். புதிய திட்டங்களைத் தொடங்குவதற்கு அல்லது ஏற்கனவே உள்ள திட்டங்களை மேம்படுத்துவதற்கு இது ஒரு நல்ல நாளாகும். உங்கள் தலைமைப் பண்புகள் பாராட்டப்படும், மேலும் உங்கள் குழுவினருக்கு நீங்கள் ஊக்கமளிப்பீர்கள். நிதி நிலையில் இன்று ஒரு சாதகமான சூழ்நிலை உருவாகும். கலைப் பொருட்கள், பொழுதுபோக்கு அல்லது பயணங்கள் தொடர்பான முதலீடுகளில் ஆர்வம் ஏற்படலாம். ஆனால், திட்டமிட்டுச் செயல்படுவது அவசியம். உங்கள் உடலையும், உள்ளத்தையும் சமநிலையில் வைத்துக்கொள்ள முயற்சிப்பது மிக முக்கியம். உடற்பயிற்சிகளை மேற்கொள்வதும், சத்தான உணவுகளை எடுத்துக்கொள்வதும் உங்கள் ஆற்றல் மட்டங்களை உயர்ந்த நிலையில் வைத்திருக்கும். மன அழுத்தத்தைக் குறைக்கும் தளர்வு நுட்பங்களில் கவனம் செலுத்துவது உங்களுக்கு நன்மை பயக்கும். இன்று நீங்கள் அதிக தன்னம்பிக்கையுடனும், உற்சாகத்துடனும் செயல்படுவீர்கள். இது உங்கள் அன்றாட பணிகளை திறம்பட முடிக்க உதவும். உங்கள் தனிப்பட்ட அழகையும், கவர்ச்சியையும் மேம்படுத்த நீங்கள் மேற்கொள்ளும் முயற்சிகள் நல்ல பலனை அளிக்கும். மற்றவர்களுக்கு நீங்கள் வழிகாட்டும் நிலையில் இருப்பீர்கள், மேலும் உங்கள் ஆலோசனைகள் பலருக்குப் பயனளிக்கும். ஒட்டுமொத்தமாக, இன்று நீங்கள் அனுபவிக்கும் அனைத்தும் அன்பு, மகிழ்ச்சி, மற்றும் சுதந்திரம் ஆகியவற்றை மையமாகக் கொண்டதாக இருக்கும்.",
    "prediction_en": "For Sagittarius natives, due to the influence of Venus today, sweetness will prevail in social interactions and the pursuit of new experiences. Your natural enthusiasm and adventurous spirit will further increase today. This is an excellent day to meet new people and welcome newcomers into your social circle. You will be the captivating center of attention at any social events you participate in. The time you spend with friends and relatives will be sweet and meaningful. Smooth solutions will be found for long-standing relationship issues. You will share an unforgettable day with your partner. Your love will be expressed through romantic gestures or unexpected gifts. For married couples, love will further strengthen. Those who are single may find opportunities to start new relationships today. Your interest in education, philosophy, and spirituality will increase. This is an opportune time to learn new things and share your knowledge. Learning about foreign cultures or new languages will bring you great joy. Today is very suitable for undertaking journeys. These will bring new experiences and joy. Your social media connections will strengthen today, and you will receive much appreciation. This is a good day to start new projects or improve existing ones. Your leadership qualities will be appreciated, and you will inspire your team members. A favorable financial situation will arise today. You may develop an interest in investments related to art, entertainment, or travel. However, it is essential to proceed with planning. It is very important to try and keep your body and mind balanced. Engaging in exercises and consuming nutritious foods will keep your energy levels high. Focusing on relaxation techniques to reduce stress will be beneficial for you. Today you will act with increased self-confidence and enthusiasm. This will help you efficiently complete your daily tasks. Your efforts to enhance your personal beauty and charm will yield good results. You will be in a position to guide others, and your advice will benefit many. Overall, everything you experience today will be centered around love, joy, and freedom.",
    "career_ta": "தொழில்ரீதியாக, இன்று உங்கள் தொலைநோக்குப் பார்வையும், நேர்மறை அணுகுமுறையும் பெரும் வெற்றிகளைப் பெற்றுத்தரும். வெளிநாட்டுத் தொடர்புகள் அல்லது கல்வி சார்ந்த திட்டங்களில் சிறப்பான வளர்ச்சி இருக்கும். உங்கள் இணக்கமான அணுகுமுறை சக ஊழியர்களுடனும், சர்வதேச கூட்டாளிகளுடனும் நல்லுறவை வளர்க்க உதவும். புதிய ஆய்வு அல்லது வெளியீட்டு முயற்சிகளுக்கு இது ஒரு நல்ல நாளாகும்.",
    "career_en": "Professionally, today your foresight and positive approach will bring great success. There will be significant growth in international contacts or education-related projects. Your harmonious approach will help foster good relationships with colleagues and international partners. This is a good day for new research or publication endeavors.",
    "finance_ta": "நிதிநிலையில் இன்று ஒரு சாதகமான சூழ்நிலை நிலவும். பயணங்கள், கல்வி அல்லது பொழுதுபோக்கு சார்ந்த முதலீடுகளில் ஆர்வம் ஏற்படலாம். எதிர்பாராத ஆதாயங்கள் அல்லது வெளிநாட்டு வருமான வாய்ப்புகள் ஏற்படலாம். உங்கள் பணத்தை புத்திசாலித்தனமாக நிர்வகிப்பதன் மூலம் எதிர்காலத்திற்கான பாதுகாப்பை உறுதிப்படுத்த முடியும். தாராள மனப்பான்மையுடன் ஆனால் திட்டமிட்டு செலவு செய்வது நல்லது.",
    "finance_en": "Financially, a favorable situation will prevail today. You may develop an interest in investments related to travel, education, or entertainment. Unexpected gains or international income opportunities may arise. By wisely managing your money, you can ensure future security. It is good to spend generously but with planning.",
    "health_ta": "உங்கள் உடல்நலம் இன்று சீராகவும், உற்சாகமாகவும் இருக்கும். வெளிப்புற விளையாட்டுகள் அல்லது சாகசப் பயணங்களில் ஈடுபடுவது உங்களுக்கு மிகவும் நன்மை பயக்கும். மன அழுத்தத்தைக் குறைக்கும் செயல்களில் ஈடுபடுவது மற்றும் போதுமான ஓய்வு எடுப்பது உங்கள் ஆற்றலை அதிகரிக்கும். சத்தான மற்றும் பன்முகத்தன்மை கொண்ட உணவுகளை மிதமாக எடுத்துக்கொள்வதன் மூலம் உங்கள் உடல்நலம் மேம்படும்.",
    "health_en": "Your health will be steady and energetic today. Engaging in outdoor sports or adventurous trips will be highly beneficial for you. Engaging in stress-reducing activities and getting sufficient rest will boost your energy. Consuming nutritious and varied foods in moderation will improve your health.",
    "lucky_number": "3",
    "lucky_color_ta": "ஊதா",
    "lucky_color_en": "Violet"
  },
  {
    "sign_ta": "மகரம்",
    "sign_en": "Capricorn",
    "date": "13-02-2026",
    "prediction_ta": "மகர ராசிக்காரர்களுக்கு இன்று சுக்கிரனின் ஆதிக்கத்தால், தொழில்முறையான உறவுகளிலும், சமூக மரியாதையிலும் இனிமை மேலோங்கும். உங்கள் கடின உழைப்பு மற்றும் அர்ப்பணிப்புக்கு இன்று அங்கீகாரம் கிடைக்கும். உங்கள் தலைமைப் பண்புகள் பாராட்டப்படும், மேலும் உங்கள் இலக்குகளை அடைய நீங்கள் புதிய உத்வேகத்தைப் பெறுவீர்கள். தொழில்ரீதியான கூட்டாண்மைகளில் அன்பு, நம்பிக்கை, மற்றும் அர்ப்பணிப்பு ஆகியவை வலுப்பெறும். புதிய திட்டங்களைத் தொடங்குவதற்கு அல்லது ஏற்கனவே உள்ள திட்டங்களை மேம்படுத்துவதற்கு இது ஒரு நல்ல நாளாகும். உங்கள் பணிச்சூழல் இனிமையாகவும், ஒத்துழைப்புடனும் காணப்படும். சக ஊழியர்களுடனும், உயரதிகாரிகளுடனும் நல்லுறவைப் பேணுவதன் மூலம் உங்கள் திட்டங்களை வெற்றிகரமாக முடிக்க முடியும். தனிப்பட்ட உறவுகளில் இன்று அன்பு, புரிதல், மற்றும் அர்ப்பணிப்பு ஆகியவை வலுப்பெறும். உங்கள் துணையுடன் நீங்கள் செலவிடும் நேரம் இனிமையாகவும், அர்த்தமுள்ளதாகவும் இருக்கும். நீண்டகாலமாக இருந்த சிறிய மனக்கசப்புகள் மெல்ல நீங்கி, இதயப்பூர்வமான இணைப்புக்கு வழிவகுக்கும். குடும்பத்தில் அமைதியும், மகிழ்ச்சியும் நிறைந்திருக்கும். கலை மற்றும் அழகியல் சார்ந்த விஷயங்களில் உங்கள் ஆர்வம் அதிகரிக்கும். ஒரு புதிய பொழுதுபோக்கைத் தொடங்குவதற்கோ அல்லது ஏற்கனவே இருக்கும் திறமைகளை மெருகேற்றுவதற்கோ இது ஒரு சிறந்த நாளாகும். குறிப்பாக, வடிவமைப்பு, கட்டிடக்கலை, அல்லது கலை சார்ந்த நிர்வாகத் துறைகளில் ஈடுபட்டுள்ளவர்களுக்கு இன்று புதிய உத்வேகமும், படைப்பாற்றலும் பெருகும். உங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்புகள் கிடைக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் தொடர்புகளை விரிவுபடுத்தும், மேலும் உங்கள் கவர்ச்சியான ஆளுமையால் புதிய நண்பர்களைப் பெறுவீர்கள். உங்கள் பேச்சுத்திறன் கூர்மையடைந்து, உங்களைச் சுற்றியுள்ளவர்களை நீங்கள் எளிதாகக் கவர முடியும். நேர்மையான மற்றும் திறந்த மனதுடன் பேசுவது பல உறவுகளை மேம்படுத்தும். இன்றைய நாள் பயணங்களுக்கு உகந்ததல்ல என்று தோன்றினாலும், குடும்பத்துடன் மேற்கொள்ளும் சிறிய சுற்றுப்பயணங்கள் அல்லது அருகிலுள்ள இடங்களுக்குச் சென்று வருவது புத்துணர்ச்சியை அளிக்கும். ஆன்மீக நாட்டம் கொண்டவர்கள், தங்கள் உள்ளத்தில் அமைதியையும், தெளிவையும் பெறுவார்கள். தியானம் அல்லது இறைவழிபாடு போன்ற செயல்களில் ஈடுபடுவது மனதை ஒருமுகப்படுத்த உதவும். உங்கள் மனதில் புதிய நம்பிக்கையும், உத்வேகமும் பிறக்கும். கடந்தகால நிகழ்வுகளைப் பற்றிய எண்ணங்கள் நீங்கி, நிகழ்காலத்தை முழுமையாக வாழும் மனநிலையைப் பெறுவீர்கள். எதிர்காலத்திற்கான திட்டங்களை வகுக்கும்போது, உங்கள் குடும்பத்தினரின் ஆலோசனைகளையும், கருத்துக்களையும் கேட்பது நல்ல முடிவுகளை எடுக்க உதவும். உங்கள் உடலையும், மனதையும் சீராக வைத்துக்கொள்ள நீங்கள் மேற்கொள்ளும் முயற்சிகள் நல்ல பலனை அளிக்கும். சரியான உணவு முறை மற்றும் மிதமான உடற்பயிற்சி உங்கள் ஆற்றல் மட்டங்களை உயர்ந்த நிலையில் வைத்திருக்கும். ஒட்டுமொத்தமாக, இன்று நீங்கள் அனுபவிக்கும் அனைத்தும் நல்லிணக்கம், அன்பு, மற்றும் வளர்ச்சி ஆகியவற்றை மையமாகக் கொண்டதாக இருக்கும்.",
    "prediction_en": "For Capricorn natives, due to the influence of Venus today, sweetness will prevail in professional relationships and social respect. Your hard work and dedication will be recognized today. Your leadership qualities will be appreciated, and you will gain new inspiration to achieve your goals. Love, trust, and dedication will strengthen in professional partnerships. This is a good day to start new projects or improve existing ones. Your work environment will be pleasant and cooperative. By maintaining good relationships with colleagues and superiors, you will be able to successfully complete your projects. In personal relationships, love, understanding, and dedication will strengthen today. The time you spend with your partner will be sweet and meaningful. Small misunderstandings that have lingered for a long time will gradually disappear, paving the way for heartfelt connections. Peace and happiness will prevail in the family. Your interest in arts and aesthetics will increase. This is an excellent day to start a new hobby or to refine existing talents. Specifically, those involved in design, architecture, or art administration fields will experience new inspiration and creativity today. Good opportunities will arise to showcase your talents. Participating in social events will expand your contacts, and you will gain new friends through your charming personality. Your communication skills will sharpen, and you will be able to easily captivating those around you. Speaking with honesty and an open mind will improve many relationships. Although today may not seem ideal for extensive travel, short trips or visiting nearby places with family will provide rejuvenation. Those with spiritual inclinations will find peace and clarity within themselves. Engaging in practices like meditation or prayer will help focus the mind. New hope and inspiration will emerge in your mind. Thoughts about past events will dissipate, and you will gain a mindset to fully live in the present. When planning for the future, seeking the advice and opinions of your family members will help you make good decisions. Your efforts to maintain your physical and mental well-being will yield positive results. A proper diet and moderate exercise will keep your energy levels high. Overall, everything you experience today will be centered around harmony, love, and growth.",
    "career_ta": "தொழில்ரீதியாக, இன்று உங்கள் விடாமுயற்சி மற்றும் பொறுமைக்கு அங்கீகாரம் கிடைக்கும். தொழில்முறை உறவுகளில் இணக்கமும், ஒத்துழைப்பும் மேலோங்கும். நீண்டகால திட்டங்களுக்கு இன்று வலுவான அடித்தளம் இடப்படும். கட்டிடக்கலை, வடிவமைப்பு, அல்லது அரசு சார்ந்த துறைகளில் உள்ளவர்களுக்கு இன்று சிறப்பான வாய்ப்புகள் உருவாகும். புதிய பொறுப்புகள் அல்லது பதவிகள் கிடைக்க வாய்ப்புள்ளது.",
    "career_en": "Professionally, your perseverance and patience will be recognized today. Harmony and cooperation will prevail in professional relationships. A strong foundation will be laid for long-term projects today. Excellent opportunities will arise for those in architecture, design, or government-related sectors. There is a possibility of new responsibilities or positions.",
    "finance_ta": "நிதிநிலையில் இன்று ஒரு ஸ்திரமான மற்றும் சாதகமான வளர்ச்சி காணப்படும். திட்டமிட்ட முதலீடுகள் மற்றும் சேமிப்பு முயற்சிகள் நல்ல பலனைத் தரும். ஆடம்பரப் பொருட்கள் அல்லது தரமான சேவைகளில் முதலீடு செய்ய ஆர்வம் ஏற்படலாம். உங்கள் நிதியை புத்திசாலித்தனமாக நிர்வகிப்பதன் மூலம் எதிர்காலத்திற்கான பாதுகாப்பை உறுதிப்படுத்த முடியும். குடும்பத்துடன் நிதி திட்டங்களைப் பற்றி கலந்தாலோசிப்பது நன்மை பயக்கும்.",
    "finance_en": "Financially, a stable and favorable growth will be seen today. Planned investments and savings efforts will yield good results. You may develop an interest in investing in luxury items or quality services. By wisely managing your money, you can ensure future security. Discussing financial plans with family will be beneficial.",
    "health_ta": "உங்கள் உடல்நலம் இன்று சீராகவும், உற்சாகமாகவும் இருக்கும். எலும்புகள் மற்றும் மூட்டுகளின் ஆரோக்கியத்தில் கவனம் செலுத்துவது நல்லது. சீரான உடற்பயிற்சி மற்றும் சத்தான உணவு உங்கள் ஆற்றலை அதிகரிக்கும். மன அமைதிக்கு முக்கியத்துவம் கொடுப்பதன் மூலம், உங்கள் உடல் ஆரோக்கியம் மேம்படும். இயற்கை சூழலில் நேரம் செலவிடுவது உங்களுக்கு புத்துணர்வை அளிக்கும்.",
    "health_en": "Your health will be steady and energetic today. It is good to focus on bone and joint health. Regular exercise and nutritious food will boost your energy. By prioritizing mental peace, your physical health will improve. Spending time in natural surroundings will rejuvenate you.",
    "lucky_number": "8",
    "lucky_color_ta": "பழுப்பு",
    "lucky_color_en": "Brown"
  },
  {
    "sign_ta": "கும்பம்",
    "sign_en": "Aquarius",
    "date": "13-02-2026",
    "prediction_ta": "கும்ப ராசிக்காரர்களுக்கு இன்று சுக்கிரனின் செல்வாக்கினால், சமூக தொடர்புகளிலும், புதுமையான யோசனைகளிலும் இனிமை மேலோங்கும். உங்கள் நண்பர்களுடனும், சமூகக் குழுக்களுடனும் நீங்கள் இனிமையான தருணங்களைப் பகிர்ந்து கொள்வீர்கள். புதிய நபர்களைச் சந்திப்பதற்கும், உங்கள் சமூக வட்டத்தில் புதியவர்களை வரவேற்பதற்கும் இது ஒரு சிறந்த நாளாகும். நீங்கள் பங்கேற்கும் சமூக நிகழ்வுகளில் உங்களது தனித்துவமான அணுகுமுறை பாராட்டப்படும். நீண்டகாலமாக நிலுவையில் இருந்த உறவுப் பிரச்சனைகளுக்கு சுமூகமான தீர்வுகள் காணப்படும். உங்கள் துணையுடன் நீங்கள் ஒரு மறக்க முடியாத நாளைப் பகிர்ந்து கொள்வீர்கள். ரொமான்டிக் பயணங்கள் அல்லது எதிர்பாராத பரிசுகள் மூலம் உங்கள் அன்பு வெளிப்படும். திருமணமானவர்களுக்கு அன்பு மேலும் வலுப்பெறும். தனிமையில் இருப்பவர்கள் புதிய, தனித்துவமான உறவுகளைத் தொடங்குவதற்கான வாய்ப்புகள் இன்று உருவாகலாம். சமூக மாற்றங்கள், மனிதநேயம், மற்றும் புதுமையான யோசனைகளில் உங்கள் ஆர்வம் அதிகரிக்கும். புதிய திட்டங்களைத் தொடங்குவதற்கு அல்லது ஏற்கனவே உள்ள திட்டங்களை மேம்படுத்துவதற்கு இது ஒரு நல்ல நாளாகும். உங்கள் படைப்புத் திறன்கள் உச்சத்தை எட்டும், மேலும் உங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்புகள் கிடைக்கும். சமூக வலைத்தள தொடர்புகள் இன்று வலுப்பெறும், மேலும் பலரின் பாராட்டுக்களைப் பெறுவீர்கள். உங்கள் பேச்சுத்திறன் கூர்மையடைந்து, உங்களைச் சுற்றியுள்ளவர்களை நீங்கள் எளிதாகக் கவர முடியும். நேர்மையான மற்றும் திறந்த மனதுடன் பேசுவது பல உறவுகளை மேம்படுத்தும். இன்றைய நாள் பயணங்களுக்கு உகந்ததல்ல என்று தோன்றினாலும், நண்பர்களுடன் மேற்கொள்ளும் சிறிய சுற்றுப்பயணங்கள் அல்லது அருகிலுள்ள இடங்களுக்குச் சென்று வருவது புத்துணர்ச்சியை அளிக்கும். ஆன்மீக நாட்டம் கொண்டவர்கள், தங்கள் உள்ளத்தில் அமைதியையும், தெளிவையும் பெறுவார்கள். தியானம் அல்லது இறைவழிபாடு போன்ற செயல்களில் ஈடுபடுவது மனதை ஒருமுகப்படுத்த உதவும். உங்கள் மனதில் புதிய நம்பிக்கையும், உத்வேகமும் பிறக்கும். கடந்தகால நிகழ்வுகளைப் பற்றிய எண்ணங்கள் நீங்கி, நிகழ்காலத்தை முழுமையாக வாழும் மனநிலையைப் பெறுவீர்கள். எதிர்காலத்திற்கான திட்டங்களை வகுக்கும்போது, உங்கள் நண்பர்களின் ஆலோசனைகளையும், கருத்துக்களையும் கேட்பது நல்ல முடிவுகளை எடுக்க உதவும். உங்கள் உடலையும், மனதையும் சீராக வைத்துக்கொள்ள நீங்கள் மேற்கொள்ளும் முயற்சிகள் நல்ல பலனை அளிக்கும். சரியான உணவு முறை மற்றும் மிதமான உடற்பயிற்சி உங்கள் ஆற்றல் மட்டங்களை உயர்ந்த நிலையில் வைத்திருக்கும். ஒட்டுமொத்தமாக, இன்று நீங்கள் அனுபவிக்கும் அனைத்தும் அன்பு, சுதந்திரம், மற்றும் வளர்ச்சி ஆகியவற்றை மையமாகக் கொண்டதாக இருக்கும்.",
    "prediction_en": "For Aquarius natives, due to the influence of Venus today, sweetness will prevail in social connections and innovative ideas. You will share sweet moments with your friends and social groups. This is an excellent day to meet new people and welcome newcomers into your social circle. Your unique approach will be appreciated at any social events you participate in. Smooth solutions will be found today for long-standing relationship issues. You will share an unforgettable day with your partner. Your love will be expressed through romantic gestures or unexpected gifts. For married couples, love will further strengthen. Those who are single may find opportunities to start new, unique relationships today. Your interest in social change, humanitarianism, and innovative ideas will increase. This is a good day to start new projects or improve existing ones. Your creative talents will reach their peak, and you will have good opportunities to showcase your skills. Social media connections will strengthen today, and you will receive much appreciation. Your communication skills will sharpen, and you will be able to easily captivating those around you. Speaking with honesty and an open mind will improve many relationships. Although today may not seem ideal for extensive travel, short trips or visiting nearby places with friends will provide rejuvenation. Those with spiritual inclinations will find peace and clarity within themselves. Engaging in practices like meditation or prayer will help focus the mind. New hope and inspiration will emerge in your mind. Thoughts about past events will dissipate, and you will gain a mindset to fully live in the present. When planning for the future, seeking the advice and opinions of your friends will help you make good decisions. Your efforts to maintain your physical and mental well-being will yield positive results. A proper diet and moderate exercise will keep your energy levels high. Overall, everything you experience today will be centered around love, freedom, and growth.",
    "career_ta": "தொழில்ரீதியாக, இன்று உங்கள் புதுமையான யோசனைகள் மற்றும் சமூக அணுகுமுறை பெரும் வெற்றிகளைப் பெற்றுத்தரும். குழுப்பணிகளில் உங்கள் பங்களிப்பு பாராட்டப்படும். தொழில்நுட்பம், சமூக ஊடகம், அல்லது மனிதநேயம் சார்ந்த துறைகளில் உள்ளவர்களுக்கு இன்று சிறப்பான வளர்ச்சி இருக்கும். புதிய திட்டங்களுக்கு ஆதரவு பெறுவீர்கள். சக ஊழியர்களுடன் இணக்கமான சூழலைப் பேணுவது நன்மை பயக்கும்.",
    "career_en": "Professionally, today your innovative ideas and social approach will bring great success. Your contributions in team projects will be appreciated. Those in technology, social media, or humanitarian fields will experience significant growth today. You will gain support for new projects. Maintaining a harmonious environment with colleagues will be beneficial.",
    "finance_ta": "நிதிநிலையில் இன்று ஒரு சாதகமான சூழ்நிலை நிலவும். சமூக தொடர்புகள் அல்லது புதிய கண்டுபிடிப்புகள் மூலம் சில புதிய நிதி வாய்ப்புகள் உருவாகலாம். கலைப் பொருட்கள், புதுமையான தொழில்நுட்பங்கள் அல்லது சமூக முதலீடுகளில் ஆர்வம் ஏற்படலாம். தேவையற்ற செலவுகளைக் கட்டுப்படுத்தி, நீண்டகால திட்டமிடுதலில் கவனம் செலுத்துவது நல்லது. உங்கள் நண்பர்களுடன் நிதி திட்டங்களைப் பற்றி கலந்தாலோசிப்பது நன்மை பயக்கும்.",
    "finance_en": "Financially, a favorable situation will prevail today. Some new financial opportunities may arise through social contacts or new innovations. You may develop an interest in art items, innovative technologies, or social investments. It is advisable to control unnecessary expenses and focus on long-term planning. Discussing financial plans with your friends will be beneficial.",
    "health_ta": "உங்கள் உடல்நலம் இன்று சீராகவும், உற்சாகமாகவும் இருக்கும். மன அமைதிக்கு முக்கியத்துவம் கொடுப்பதன் மூலம், உங்கள் உடல் ஆரோக்கியம் மேம்படும். யோகா, தியானம் போன்ற மனதை அமைதிப்படுத்தும் பயிற்சிகளில் ஈடுபடுவது உங்களுக்கு மிகவும் நன்மை பயக்கும். குழு சார்ந்த விளையாட்டுகள் அல்லது வெளிப்புற உடற்பயிற்சிகளை மேற்கொள்வது உங்களுக்கு புத்துணர்வை அளிக்கும். போதுமான ஓய்வு மிகவும் அவசியம்.",
    "health_en": "Your health will be steady and energetic today. By prioritizing mental peace, your physical health will improve. Engaging in calming practices like yoga and meditation will be highly beneficial for you. Group sports or outdoor exercises will rejuvenate you. Sufficient rest is very important.",
    "lucky_number": "4",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "13-02-2026",
    "prediction_ta": "மீன ராசிக்காரர்களுக்கு இன்று சுக்கிரனின் ஆதிக்கத்தால், உள்ளுணர்வு, கருணை, மற்றும் ஆன்மீக அன்பு மேலோங்கும். உங்கள் தனிப்பட்ட உறவுகளிலும், ஆன்மீகத் தேடல்களிலும் புதிய பரிமாணங்கள் தோன்றும். உங்கள் கருணையும், புரிதலும் உங்களைச் சுற்றியுள்ளவர்களைக் கவரும். நீண்டகாலமாக நிலுவையில் இருந்த உறவுப் பிரச்சனைகளுக்கு சுமூகமான தீர்வுகள் இன்று காணப்படும். உங்கள் துணையுடன் நீங்கள் ஆழமான மற்றும் அர்த்தமுள்ள உரையாடல்களில் ஈடுபடுவீர்கள். திருமணமானவர்களுக்கு அன்பு மேலும் வலுப்பெறும். தனிமையில் இருப்பவர்கள் புதிய, ஆன்மீக ரீதியான உறவுகளைத் தொடங்குவதற்கான வாய்ப்புகள் இன்று உருவாகலாம். உங்கள் உள்ளுணர்வு கூர்மையடையும், மேலும் உங்களைச் சுற்றியுள்ளவர்களின் உணர்ச்சிகளை நீங்கள் எளிதாகப் புரிந்துகொள்வீர்கள். கலை, இசை, கவிதை, மற்றும் ஆன்மீகத் துறைகளில் ஈடுபட்டுள்ளவர்களுக்கு இன்று புதிய உத்வேகமும், படைப்பாற்றலும் பெருகும். உங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்புகள் கிடைக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் தொடர்புகளை விரிவுபடுத்தும், ஆனால் நீங்கள் ஆழ்ந்த மற்றும் அர்த்தமுள்ள உறவுகளுக்கே முக்கியத்துவம் கொடுப்பீர்கள். உங்கள் பேச்சுத்திறன் கூர்மையடைந்து, உங்களைச் சுற்றியுள்ளவர்களை நீங்கள் எளிதாகக் கவர முடியும். நேர்மையான மற்றும் திறந்த மனதுடன் பேசுவது பல உறவுகளை மேம்படுத்தும். இன்றைய நாள் சில முக்கியமான முடிவுகளை எடுப்பதற்கு ஏற்ற நாளாகும், குறிப்பாக உங்கள் உள்ளுணர்வு வழிகாட்டுதலைப் பின்பற்றுவதன் மூலம் நல்ல பலன் கிடைக்கும். நிதி நிலையில் இன்று ஒரு சாதகமான சூழ்நிலை உருவாகும். இரகசிய வருமான வழிகள் அல்லது எதிர்பாராத ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது. நீண்டகால முதலீடுகளைப் பற்றி சிந்திக்க இது ஒரு சிறந்த நாளாகும், ஆனால் அனுபவமுள்ளவர்களின் ஆலோசனையைப் பெறுவது நல்லது. உங்கள் உடலையும், உள்ளத்தையும் சமநிலையில் வைத்துக்கொள்ள முயற்சிப்பது மிக முக்கியம். உடற்பயிற்சிகளை மேற்கொள்வதும், சத்தான உணவுகளை எடுத்துக்கொள்வதும் உங்கள் ஆற்றல் மட்டங்களை உயர்ந்த நிலையில் வைத்திருக்கும். மன அழுத்தத்தைக் குறைக்கும் தளர்வு நுட்பங்களில் கவனம் செலுத்துவது உங்களுக்கு நன்மை பயக்கும். இன்று நீங்கள் அதிக தன்னம்பிக்கையுடனும், உற்சாகத்துடனும் செயல்படுவீர்கள். இது உங்கள் அன்றாட பணிகளை திறம்பட முடிக்க உதவும். உங்கள் தனிப்பட்ட அழகையும், கவர்ச்சியையும் மேம்படுத்த நீங்கள் மேற்கொள்ளும் முயற்சிகள் நல்ல பலனை அளிக்கும். உங்கள் நண்பர்களுடன் அல்லது குடும்பத்தினருடன் ஒரு சிறிய பயணம் மேற்கொள்வது புத்துணர்ச்சியை அளிக்கும். மற்றவர்களுக்கு நீங்கள் வழிகாட்டும் நிலையில் இருப்பீர்கள், மேலும் உங்கள் ஆலோசனைகள் பலருக்குப் பயனளிக்கும். உங்கள் கனவுகள் மற்றும் உள்ளுணர்வு வழிகாட்டுதலைப் பின்பற்றுவது இன்று மிகவும் முக்கியம். ஒட்டுமொத்தமாக, இன்று நீங்கள் அனுபவிக்கும் அனைத்தும் அன்பு, கருணை, மற்றும் ஆன்மீக வளர்ச்சி ஆகியவற்றை மையமாகக் கொண்டதாக இருக்கும்.",
    "prediction_en": "For Pisces natives, due to the influence of Venus today, intuition, compassion, and spiritual love will prevail. New dimensions will emerge in your personal relationships and spiritual quests. Your compassion and understanding will attract those around you. Smooth solutions will be found today for long-standing relationship issues. You will engage in deep and meaningful conversations with your partner. For married couples, love will further strengthen. Those who are single may find opportunities to start new, spiritually inclined relationships today. Your intuition will sharpen, and you will easily understand the emotions of those around you. Those involved in art, music, poetry, and spiritual fields will experience new inspiration and creativity today. Good opportunities will arise to showcase your talents. Participating in social events will expand your contacts, but you will prioritize deep and meaningful relationships. Your communication skills will sharpen, and you will be able to easily captivating those around you. Speaking with honesty and an open mind will improve many relationships. Today is a suitable day to make some important decisions, especially by following your intuitive guidance, which will yield good results. A favorable financial situation will arise today. There is a possibility of secret income channels or unexpected gains. This is an excellent day to consider long-term investments, but it is good to seek advice from experienced individuals. It is very important to try and keep your body and mind balanced. Engaging in exercises and consuming nutritious foods will keep your energy levels high. Focusing on relaxation techniques to reduce stress will be beneficial for you. Today you will act with increased self-confidence and enthusiasm. This will help you efficiently complete your daily tasks. Your efforts to enhance your personal beauty and charm will yield good results. Taking a short trip with your friends or family will provide rejuvenation. You will be in a position to guide others, and your advice will benefit many. Following your dreams and intuitive guidance is very important today. Overall, everything you experience today will be centered around love, compassion, and spiritual growth.",
    "career_ta": "தொழில்ரீதியாக, இன்று உங்கள் உள்ளுணர்வு மற்றும் படைப்பாற்றல் பெரும் வெற்றிகளைப் பெற்றுத்தரும். கலை, இசை, மருத்துவம், அல்லது சேவைத் துறைகளில் உள்ளவர்களுக்கு இன்று சிறப்பான வளர்ச்சி இருக்கும். உங்கள் இணக்கமான அணுகுமுறை சக ஊழியர்களுடனும், வாடிக்கையாளர்களுடனும் நல்லுறவை வளர்க்க உதவும். புதிய திட்டங்களுக்கு ஆதரவு பெறுவீர்கள். உங்கள் கனவுகளைப் பின்பற்றுவது நன்மை பயக்கும்.",
    "career_en": "Professionally, today your intuition and creativity will bring great success. Those in art, music, medicine, or service sectors will experience significant growth today. Your harmonious approach will help foster good relationships with colleagues and clients. You will gain support for new projects. Following your dreams will be beneficial.",
    "finance_ta": "நிதிநிலையில் இன்று ஒரு சாதகமான சூழ்நிலை நிலவும். இரகசிய வருமான வழிகள் அல்லது எதிர்பாராத ஆதாயங்கள் கிடைக்க வாய்ப்புள்ளது. கலைப் பொருட்கள், ஆன்மீகத் திட்டங்கள் அல்லது தொண்டு நிறுவனங்களில் முதலீடு செய்ய ஆர்வம் ஏற்படலாம். உங்கள் நிதியை புத்திசாலித்தனமாக நிர்வகிப்பதன் மூலம் எதிர்காலத்திற்கான பாதுகாப்பை உறுதிப்படுத்த முடியும். தாராள மனப்பான்மையுடன் ஆனால் திட்டமிட்டு செலவு செய்வது நல்லது.",
    "finance_en": "Financially, a favorable situation will prevail today. There is a possibility of secret income channels or unexpected gains. You may develop an interest in investing in art items, spiritual projects, or charitable organizations. By wisely managing your money, you can ensure future security. It is good to spend generously but with planning.",
    "health_ta": "உங்கள் உடல்நலம் இன்று சீராகவும், உற்சாகமாகவும் இருக்கும். மன அமைதிக்கு முக்கியத்துவம் கொடுப்பதன் மூலம், உங்கள் உடல் ஆரோக்கியம் மேம்படும். தியானம், யோகா போன்ற மனதை அமைதிப்படுத்தும் பயிற்சிகள் உங்களுக்கு மிகவும் நன்மை பயக்கும். போதுமான தூக்கம் மற்றும் தளர்வு நுட்பங்களில் கவனம் செலுத்துவது உங்கள் ஆற்றலை அதிகரிக்கும். நீரேற்றமாக இருப்பதும் மிகவும் அவசியம்.",
    "health_en": "Your health will be steady and energetic today. By prioritizing mental peace, your physical health will improve. Practices like meditation and yoga, which calm the mind, will be highly beneficial for you. Sufficient sleep and focusing on relaxation techniques will boost your energy. Staying hydrated is also very important.",
    "lucky_number": "7",
    "lucky_color_ta": "கடல் நீலம்",
    "lucky_color_en": "Sea Blue"
  }
]
