[{"content":{"parts":[{"text":"```json\n[\n  {\n    \"sign_en\": \"Aries\",\n    \"sign_ta\": \"மேஷம்\",\n    \"date\": \"2026-02-04\",\n    \"forecast_en\": \"Today brings high energy and motivation. Focus on initiating new projects; your pioneering spirit will lead to immediate gains. Be mindful of others' feelings while moving forward.\",\n    \"forecast_ta\": \"இன்று உங்களுக்கு அதிக ஆற்றலையும் உந்துதலையும் தரும். புதிய திட்டங்களைத் தொடங்க கவனம் செலுத்துங்கள்; உங்களின் முயற்சி உடனடி ஆதாயங்களை ஈட்டித்தரும். நீங்கள் முன்னேறும்போது மற்றவர்களின் உணர்வுகளிலும் கவனம் தேவை.\",\n    \"career_en\": \"Leadership opportunities arise. Your communication skills are sharp, making presentations or negotiations successful. Team members will look to you for direction.\",\n    \"career_ta\": \"தலைமைப் பண்பிற்கான வாய்ப்புகள் இன்று கூடும். உங்கள் பேச்சுத் திறன் கூர்மையாக இருப்பதால், முக்கியமான பேச்சுவார்த்தைகள் மற்றும் விளக்கங்கள் வெற்றிகரமாக அமையும். சக பணியாளர்கள் உங்களின் வழிகாட்டுதலை நாடுவார்கள்.\",\n    \"finance_en\": \"A good day for reviewing long-term financial plans. Unexpected expenses may crop up, so keep a buffer ready. Avoid speculative investments.\",\n    \"finance_ta\": \"நீண்ட கால நிதித் திட்டங்களைப் பற்றி ஆய்வு செய்ய உகந்த நாள். எதிர்பாராத செலவுகள் எழக்கூடும் என்பதால், கையிருப்பு நிதியைத் தயாராக வைத்திருங்கள். ஊக வணிகத்தைத் தவிர்க்கவும்.\",\n    \"health_en\": \"Energy levels are excellent. Channel excess vitality into physical exercise. Watch out for stress-related headaches due to overworking.\",\n    \"health_ta\": \"ஆற்றல் நிலைகள் சிறப்பாக உள்ளன. அதிகப்படியான சக்தியை உடற்பயிற்சியில் செலுத்துங்கள். அதிக வேலைப்பளுவால் ஏற்படும் மன அழுத்தத்தால் வரும் தலைவலியில் கவனம் தேவை.\",\n    \"lucky_number\": \"9\",\n    \"lucky_color_en\": \"Scarlet Red\",\n    \"lucky_color_ta\": \"செந்நீலம்\"\n  },\n  {\n    \"sign_en\": \"Taurus\",\n    \"sign_ta\": \"ரிஷபம்\",\n    \"date\": \"2026-02-04\",\n    \"forecast_en\": \"Stability and comfort are key themes today. Focus on domestic matters or improving your immediate environment. Emotional security is highly important.\",\n    \"forecast_ta\": \"இன்றைய முக்கிய நோக்கம் நிலைத்தன்மை மற்றும் அமைதியாகும். குடும்ப விஷயங்களில் அல்லது உங்கள் சூழலை மேம்படுத்துவதில் கவனம் செலுத்துங்கள். மனரீதியான பாதுகாப்பு இன்று மிக முக்கியம்.\",\n    \"career_en\": \"You may feel the need for practical application rather than theoretical planning. Focus on tasks that require meticulous attention to detail. Cooperation with colleagues yields positive results.\",\n    \"career_ta\": \"கோட்பாட்டுத் திட்டமிடலை விட நடைமுறைச் செயல்பாட்டின் தேவை இன்று உணரப்படும். விவரங்களில் அதிக கவனம் தேவைப்படும் பணிகளில் ஈடுபடுங்கள். சக ஊழியர்களுடன் ஒத்துழைப்பது நேர்மறையான முடிவுகளைத் தரும்.\",\n    \"finance_en\": \"Financial stability improves, potentially through home-related matters or property gains. A good day to budget for necessities rather than luxuries.\",\n    \"finance_ta\": \"நிதி நிலைத்தன்மை மேம்படும், குறிப்பாக வீடு அல்லது சொத்து சம்பந்தமான ஆதாயங்கள் மூலம் இது நிகழலாம். ஆடம்பரச் செலவுகளைத் தவிர்த்து, அத்தியாவசியத் தேவைகளுக்கு நிதி ஒதுக்க சிறப்பான நாள்.\",\n    \"health_en\": \"Prioritize relaxation. Consider activities like gardening or cooking to de-stress. Ensure consistent sleep patterns to maintain well-being.\",\n    \"health_ta\": \"தளர்வுக்கு முன்னுரிமை கொடுங்கள். மன அழுத்தத்தைக் குறைக்க தோட்டம் அமைத்தல் அல்லது சமையல் போன்ற செயல்களைக் கருத்தில் கொள்ளுங்கள். நல்ல தூக்கத்தை உறுதிசெய்வது நலத்தைப் பேண உதவும்.\",\n    \"lucky_number\": \"6\",\n    \"lucky_color_en\": \"Emerald Green\",\n    \"lucky_color_ta\": \"மரகதப் பச்சை\"\n  },\n  {\n    \"sign_en\": \"Gemini\",\n    \"sign_ta\": \"மிதுனம்\",\n    \"date\": \"2026-02-04\",\n    \"forecast_en\": \"Communication flows freely today, making it ideal for networking and information gathering. You might find yourself juggling several tasks, requiring quick adaptation.\",\n    \"forecast_ta\": \"இன்று தகவல் தொடர்பு தடையின்றிப் பாயும், இது உறவுகளை வளர்க்கவும் தகவல்களைச் சேகரிக்கவும் ஏற்ற நாளாகும். நீங்கள் ஒரே நேரத்தில் பல பணிகளைச் சமாளிக்க நேரிடும், இதற்கு விரைவான தகவமைப்பு தேவை.\",\n    \"career_en\": \"Excellent day for meetings, interviews, or closing deals. Your ability to articulate complex ideas simply is your strongest asset. Avoid making commitments you cannot easily keep.\",\n    \"career_ta\": \"சந்திப்புகள், நேர்காணல்கள் அல்லது ஒப்பந்தங்களை முடிக்கச் சிறந்த நாள். சிக்கலான கருத்துக்களை எளிமையாக வெளிப்படுத்தும் திறன் உங்களின் வலிமையான சொத்தாகும். எளிதில் நிறைவேற்ற முடியாத உறுதிமொழிகளைத் தவிர்க்கவும்.\",\n    \"finance_en\": \"Minor gains through short-term activities or side projects are possible. Be cautious about lending money to casual acquaintances. Maintain clear records.\",\n    \"finance_ta\": \"குறுகிய காலச் செயல்பாடுகள் அல்லது சிறு திட்டங்கள் மூலம் சிறிய ஆதாயங்கள் வரக்கூடும். அறிமுகமானவர்களுக்குப் பணம் கடன் கொடுப்பதில் எச்சரிக்கை தேவை. தெளிவான பதிவுகளைப் பராமரிக்கவும்.\",\n    \"health_en\": \"Mental activity is high; ensure you balance it with physical rest. Take short breaks throughout the day to prevent mental fatigue.\",\n    \"health_ta\": \"மனதின் செயல்பாடு இன்று அதிகமாக இருக்கும்; அதற்கு சமமாக உடல் ஓய்வையும் உறுதிசெய்யுங்கள். மன சோர்வைத் தடுக்க நாள் முழுவதும் சிறு இடைவெளிகளை எடுத்துக் கொள்ளுங்கள்.\",\n    \"lucky_number\": \"5\",\n    \"lucky_color_en\": \"Yellow\",\n    \"lucky_color_ta\": \"மஞ்சள்\"\n  },\n  {\n    \"sign_en\": \"Cancer\",\n    \"sign_ta\": \"கடகம்\",\n    \"date\": \"2026-02-04\",\n    \"forecast_en\": \"Emotional security is paramount. You might feel drawn to review past decisions concerning personal values and resources. Focus on strengthening your foundation.\",\n    \"forecast_ta\": \"மனரீதியான பாதுகாப்பு இன்று மிக முக்கியமானது. தனிப்பட்ட விழுமியங்கள் மற்றும் வளங்கள் தொடர்பான கடந்தகால முடிவுகளை மறுபரிசீலனை செய்ய நீங்கள் உந்தப்படுவீர்கள். உங்கள் அடித்தளத்தை வலுப்படுத்துவதில் கவனம் செலுத்துங்கள்.\",\n    \"career_en\": \"A stable work environment is favored. Tasks related to administration or resource management will go smoothly. Avoid confrontations with superiors today.\",\n    \"career_ta\": \"நிலையான பணிச்சூழல் இன்று சாதகமாக இருக்கும். நிர்வாகம் அல்லது வள மேலாண்மை தொடர்பான பணிகள் சீராக நடக்கும். இன்று உயர் அதிகாரிகளுடன் மோதல்களைத் தவிர்க்கவும்.\",\n    \"finance_en\": \"Money matters look positive, especially regarding earned income. This is a good time to save rather than splurge. Look for opportunities to increase your earning capacity.\",\n    \"finance_ta\": \"பணம் தொடர்பான விஷயங்கள், குறிப்பாக உழைத்துச் சம்பாதித்த வருமானம், சாதகமாகத் தெரிகிறது. இது ஆடம்பரமாகச் செலவழிப்பதை விட சேமிக்க நல்ல நேரம். உங்கள் வருமானத் திறனை அதிகரிக்க வாய்ப்புகளைத் தேடுங்கள்.\",\n    \"health_en\": \"Focus on diet and nutrition. Comfort food might be tempting, but prioritize healthy, home-cooked meals. Emotional well-being directly impacts physical health today.\",\n    \"health_ta\": \"உணவு மற்றும் ஊட்டச்சத்தில் கவனம் செலுத்துங்கள். சுவையான உணவுகள் ஆசையைத் தூண்டினாலும், ஆரோக்கியமான, வீட்டிலேயே சமைத்த உணவுகளுக்கு முன்னுரிமை கொடுங்கள். இன்று மன நலமே உடல் நலத்தைப் பாதிக்கும்.\",\n    \"lucky_number\": \"2\",\n    \"lucky_color_en\": \"Silver\",\n    \"lucky_color_ta\": \"வெள்ளி\"\n  },\n  {\n    \"sign_en\": \"Leo\",\n    \"sign_ta\": \"சிம்மம்\",\n    \"date\": \"2026-02-04\",\n    \"forecast_en\": \"Your personal charisma is highlighted today. It is a powerful time for self-expression and pursuing creative passions. Ensure that enthusiasm doesn't lead to arrogance.\",\n    \"forecast_ta\": \"உங்கள் தனிப்பட்ட கவர்ச்சி இன்று வெளிப்படும். இது சுய வெளிப்பாடு மற்றும் படைப்பு ஆர்வங்களைத் தொடர ஒரு வலிமையான காலம். உற்சாகம் திமிராக மாறாமல் பார்த்துக் கொள்ளுங்கள்.\",\n    \"career_en\": \"Take the spotlight. Presentations, leadership roles, or public facing tasks are highly favored. Seek recognition for past efforts, but be sure to acknowledge your team's contributions.\",\n    \"career_ta\": \"கவன ஈர்ப்பு மையமாக இருங்கள். விளக்கங்கள், தலைமைப் பொறுப்புகள் அல்லது பொதுமக்களைச் சந்திக்கும் பணிகள் மிகவும் சாதகமாக இருக்கும். கடந்தகால முயற்சிகளுக்கு அங்கீகாரத்தைத் தேடுங்கள், ஆனால் உங்கள் குழுவின் பங்களிப்பை அங்கீகரிக்கத் தவறாதீர்கள்.\",\n    \"finance_en\": \"Investments linked to artistic pursuits or entertainment may show potential. While confident about gains, maintain a responsible approach to spending.\",\n    \"finance_ta\": \"கலைத் துறைகள் அல்லது பொழுதுபோக்கு தொடர்பான முதலீடுகள் இன்று சாத்தியமான வளர்ச்சியைத் தரும். ஆதாயங்கள் குறித்து நம்பிக்கை கொண்டிருந்தாலும், செலவினங்களில் பொறுப்புடன் இருங்கள்.\",\n    \"health_en\": \"The heart area needs attention; manage stress effectively. Physical activities that involve fun and play will boost your mood and vitality.\",\n    \"health_ta\": \"இதயப் பகுதிக்குக் கவனம் தேவை; மன அழுத்தத்தைச் சிறப்பாக நிர்வகிக்கவும். வேடிக்கை மற்றும் விளையாட்டு சார்ந்த உடல் செயல்பாடுகள் உங்கள் மனநிலையையும் உற்சாகத்தையும் அதிகரிக்கும்.\",\n    \"lucky_number\": \"1\",\n    \"lucky_color_en\": \"Gold\",\n    \"lucky_color_ta\": \"தங்கம்\"\n  },\n  {\n    \"sign_en\": \"Virgo\",\n    \"sign_ta\": \"கன்னி\",\n    \"date\": \"2026-02-04\",\n    \"forecast_en\": \"A day for quiet reflection and internal organization. You might need to withdraw slightly from the hustle to focus on detailed work or health routines. Service to others brings contentment.\",\n    \"forecast_ta\": \"அமைதியான சிந்தனை மற்றும் உள் அமைப்பிற்கான நாள் இது. விரிவான பணிகள் அல்லது உடல்நலப் பழக்கவழக்கங்களில் கவனம் செலுத்த, நீங்கள் பரபரப்பில் இருந்து சற்று விலகி இருக்க வேண்டும். மற்றவர்களுக்குச் சேவை செய்வது மனநிறைவைத் தரும்.\",\n    \"career_en\": \"Focus on clearing pending administrative tasks and organizing your workspace. Your analytical skills are crucial for spotting errors. Avoid volunteering for too many extra responsibilities.\",\n    \"career_ta\": \"நிலுவையில் உள்ள நிர்வாகப் பணிகளை முடிப்பதிலும், உங்கள் பணி இடத்தை ஒழுங்கமைப்பதிலும் கவனம் செலுத்துங்கள். பிழைகளைக் கண்டறிவதில் உங்கள் பகுப்பாய்வுத் திறன்கள் இன்றியமையாதவை. அதிகப்படியான கூடுதல் பொறுப்புகளுக்கு நீங்களாகவே முன்வருவதைத் தவிர்க்கவும்.\",\n    \"finance_en\": \"Be practical with expenditures. It's a good time to budget for upcoming needs and settle minor debts. Avoid large, impulsive purchases related to technology.\",\n    \"finance_ta\": \"செலவினங்களில் நடைமுறை அணுகுமுறையைக் கடைப்பிடிக்கவும். வரவிருக்கும் தேவைகளுக்குப் பட்ஜெட் போடவும் சிறிய கடன்களைத் தீர்க்கவும் இது நல்ல நேரம். தொழில்நுட்பம் தொடர்பான பெரிய, திடீர் கொள்முதல்களைத் தவிர்க்கவும்.\",\n    \"health_en\": \"Pay attention to your digestive system. Establishing a healthy routine, especially around meal times, will benefit you greatly. Mindful eating is advised.\",\n    \"health_ta\": \"உங்கள் செரிமான அமைப்பில் கவனம் செலுத்துங்கள். ஆரோக்கியமான வழக்கத்தை, குறிப்பாக உணவு நேரங்களில், அமைப்பது உங்களுக்கு மிகவும் பயனளிக்கும். உணர்வுபூர்வமான உணவுமுறை அறிவுறுத்தப்படுகிறது.\",\n    \"lucky_number\": \"3\",\n    \"lucky_color_en\": \"Navy Blue\",\n    \"lucky_color_ta\": \"கருநீலம்\"\n  },\n  {\n    \"sign_en\": \"Libra\",\n    \"sign_ta\": \"துலாம்\",\n    \"date\": \"2026-02-04\",\n    \"forecast_en\": \"Social life and teamwork are emphasized. This is a great day to connect with friends or engage in community activities. Seek balance in relationships, prioritizing fairness.\",\n    \"forecast_ta\": \"சமூக வாழ்க்கை மற்றும் குழுப்பணிக்கு இன்று முக்கியத்துவம் அளிக்கப்படும். நண்பர்களுடன் பழகுவதற்கும் அல்லது சமூக நடவடிக்கைகளில் ஈடுபடுவதற்கும் இது ஒரு சிறந்த நாள். உறவுகளில் சமநிலையைத் தேடுங்கள், நீதியை நிலைநாட்டுங்கள்.\",\n    \"career_en\": \"Group projects or collaborations flourish. Your diplomatic skills help resolve workplace conflicts smoothly. Networking today can open doors for future success.\",\n    \"career_ta\": \"குழுத் திட்டங்கள் அல்லது கூட்டுப் பணிகள் இன்று செழிக்கும். உங்கள் இராஜதந்திரத் திறன்கள் பணியிட மோதல்களைச் சீராகத் தீர்க்க உதவுகின்றன. இன்று நீங்கள் உருவாக்கும் உறவுகள் எதிர்கால வெற்றிக்கு வழியைத் திறக்கும்.\",\n    \"finance_en\": \"Financial success may come through partnerships or joint ventures. Be cautious that generosity towards friends does not impact your budget significantly. Seek mutual benefit in financial dealings.\",\n    \"finance_ta\": \"கூட்டாண்மை அல்லது கூட்டு முயற்சிகள் மூலம் நிதி வெற்றி வரலாம். நண்பர்கள் மீதான பெருந்தன்மை உங்கள் பட்ஜெட்டைப் பாதிக்காதவாறு எச்சரிக்கையாக இருங்கள். நிதிப் பரிவர்த்தனைகளில் பரஸ்பர நன்மையை நாடுங்கள்.\",\n    \"health_en\": \"Stress from relationship imbalances might affect your kidneys or lower back. Gentle exercises like yoga or stretching are highly beneficial.\",\n    \"health_ta\": \"உறவுகளில் உள்ள சமநிலையற்ற நிலையால் ஏற்படும் மன அழுத்தம் சிறுநீரகம் அல்லது கீழ் முதுகைப் பாதிக்கலாம். யோகா அல்லது நீட்சிப் பயிற்சிகள் போன்ற மென்மையான உடற்பயிற்சிகள் மிகவும் பயனுள்ளதாக இருக்கும்.\",\n    \"lucky_number\": \"7\",\n    \"lucky_color_en\": \"Pastel Pink\",\n    \"lucky_color_ta\": \"இளஞ்சிவப்பு\"\n  },\n  {\n    \"sign_en\": \"Scorpio\",\n    \"sign_ta\": \"விருச்சிகம்\",\n    \"date\": \"2026-02-04\",\n    \"forecast_en\": \"Your ambition is strong, pushing you toward professional milestones. Focus intensely on achieving your public goals. Hidden dynamics may come to light, requiring deep insight.\",\n    \"forecast_ta\": \"உங்கள் லட்சியம் வலிமையாக உள்ளது, இது உங்களைத் தொழில் மைல்கற்களை நோக்கித் தள்ளும். உங்கள் பொதுவான இலக்குகளை அடைவதில் தீவிரமாகக் கவனம் செலுத்துங்கள். மறைந்திருக்கும் காரணிகள் வெளிவரலாம், இதற்கு ஆழ்ந்த நுண்ணறிவு தேவை.\",\n    \"career_en\": \"The focus is on career advancement and reputation. A boss or authority figure may notice your hard work. Be prepared to take on greater responsibility and showcase your expertise.\",\n    \"career_ta\": \"தொழில் முன்னேற்றம் மற்றும் நற்பெயரில் இன்று கவனம் இருக்கும். ஒரு மேலதிகாரி அல்லது அதிகாரம் கொண்ட நபர் உங்கள் கடின உழைப்பைக் கவனிக்கலாம். பெரிய பொறுப்பை ஏற்கவும், உங்கள் திறமைகளை வெளிப்படுத்தவும் தயாராக இருங்கள்.\",\n    \"finance_en\": \"Power struggles or shared resources might complicate financial matters. Ensure clear agreements regarding debts or joint investments. Unexpected inheritance or payout is possible.\",\n    \"finance_ta\": \"அதிகாரப் போராட்டங்கள் அல்லது பகிரப்பட்ட வளங்கள் நிதி விஷயங்களைச் சிக்கலாக்கலாம். கடன்கள் அல்லது கூட்டாகச் செய்த முதலீடுகள் குறித்துத் தெளிவான ஒப்பந்தங்களை உறுதி செய்யுங்கள். எதிர்பாராத மரபுரிமை அல்லது செலுத்துதலுக்கு வாய்ப்புள்ளது.\",\n    \"health_en\": \"Emotional intensity can be draining. Find healthy outlets for pent-up energy, such as high-intensity workouts. Prioritize deep rest.\",\n    \"health_ta\": \"உணர்ச்சிவசப்படுதல் சோர்வடையச் செய்யலாம். தீவிர உடற்பயிற்சிகள் போன்ற தேங்கிக் கிடக்கும் சக்திக்கு ஆரோக்கியமான வழிகளைக் கண்டறியவும். ஆழ்ந்த ஓய்வுக்கு முன்னுரிமை கொடுங்கள்.\",\n    \"lucky_number\": \"4\",\n    \"lucky_color_en\": \"Black\",\n    \"lucky_color_ta\": \"கறுப்பு\"\n  },\n  {\n    \"sign_en\": \"Sagittarius\",\n    \"sign_ta\": \"தனுசு\",\n    \"date\": \"2026-02-04\",\n    \"forecast_en\": \"Expansion and learning are favored today. Look beyond routine tasks; travel, philosophy, or higher education may occupy your thoughts. Seek diverse perspectives.\",\n    \"forecast_ta\": \"விரிவாக்கமும் கற்றலும் இன்று சாதகமாக உள்ளன. வழக்கமான பணிகளுக்கு அப்பால் பாருங்கள்; பயணம், தத்துவம் அல்லது உயர்கல்வி ஆகியவை உங்கள் எண்ணங்களை ஆக்கிரமிக்கலாம். பல்வேறு கோணங்களை நாடிப் பெறுங்கள்.\",\n    \"career_en\": \"Excellent day for interacting with foreign clients or international business. Legal or publishing matters move forward swiftly. Use your optimism to motivate those around you.\",\n    \"career_ta\": \"வெளிநாட்டு வாடிக்கையாளர்கள் அல்லது சர்வதேச வணிகத்துடன் தொடர்புகொள்வதற்குச் சிறந்த நாள். சட்ட அல்லது வெளியீட்டு விஷயங்கள் விரைவாக முன்னேறும். உங்களைச் சுற்றியுள்ளவர்களை ஊக்குவிக்க உங்கள் நம்பிக்கையைப் பயன்படுத்துங்கள்.\",\n    \"finance_en\": \"Investment in education or skills training proves worthwhile. Long-distance financial dealings may be profitable. Be cautious about overly risky ventures based on hearsay.\",\n    \"finance_ta\": \"கல்வி அல்லது திறமைப் பயிற்சியில் முதலீடு செய்வது பயனுள்ளதாக இருக்கும். நீண்ட தூர நிதிப் பரிவர்த்தனைகள் இலாபகரமாக இருக்கலாம். வதந்திகளை அடிப்படையாகக் கொண்ட அதிகப்படியான ஆபத்தான முயற்சிகளைத் தவிர்க்கவும்.\",\n    \"health_en\": \"The hips and thighs need stretching. Outdoor activities and fresh air will invigorate you. Maintain an optimistic outlook, as positive thinking boosts your immune system.\",\n    \"health_ta\": \"இடுப்பு மற்றும் தொடை பகுதிகளுக்கு நீட்சிப் பயிற்சிகள் தேவை. வெளிப்புறச் செயல்பாடுகளும் புதிய காற்றும் உங்களுக்கு உற்சாகம் அளிக்கும். நேர்மறையான சிந்தனை உங்கள் நோய் எதிர்ப்பு சக்தியை அதிகரிப்பதால், நம்பிக்கையான கண்ணோட்டத்தைப் பேணுங்கள்.\",\n    \"lucky_number\": \"8\",\n    \"lucky_color_en\": \"Violet\",\n    \"lucky_color_ta\": \"ஊதா\"\n  },\n  {\n    \"sign_en\": \"Capricorn\",\n    \"sign_ta\": \"மகரம்\",\n    \"date\": \"2026-02-04\",\n    \"forecast_en\": \"Today focuses on deep transformation and resource management. You may face complex emotional or financial situations that require honesty and meticulous planning. Rely on your practical nature.\",\n    \"forecast_ta\": \"இன்று ஆழமான மாற்றங்கள் மற்றும் வள மேலாண்மையில் கவனம் செலுத்தும். நேர்மை மற்றும் நுணுக்கமான திட்டமிடல் தேவைப்படும் சிக்கலான உணர்ச்சிபூர்வமான அல்லது நிதிச் சூழ்நிலைகளை நீங்கள் சந்திக்க நேரிடலாம். உங்கள் நடைமுறை அணுகுமுறையை நம்புங்கள்.\",\n    \"career_en\": \"Excellent for tackling intricate financial projects, audits, or high-stakes negotiations. Your perseverance will pay off, especially in long-term goals. Maintain confidentiality.\",\n    \"career_ta\": \"சிக்கலான நிதித் திட்டங்கள், தணிக்கைகள் அல்லது அதிக அபாயகரமான பேச்சுவார்த்தைகளைக் கையாள சிறந்தது. உங்கள் விடாமுயற்சி வெற்றி பெறும், குறிப்பாக நீண்ட கால இலக்குகளில். இரகசியத்தைப் பேணுங்கள்.\",\n    \"finance_en\": \"Focus on clearing shared debts, loans, or tax matters. Unexpected funds may arrive through settlements or investments made by others. Avoid hasty decisions regarding large assets.\",\n    \"finance_ta\": \"கூட்டுப் கடன்கள், வங்கிக் கடன்கள் அல்லது வரி விஷயங்களைத் தீர்ப்பதில் கவனம் செலுத்துங்கள். மற்றவர்கள் செய்த ஒப்பந்தங்கள் அல்லது முதலீடுகள் மூலம் எதிர்பாராத நிதி வரக்கூடும். பெரிய சொத்துக்கள் தொடர்பான அவசர முடிவுகளைத் தவிர்க்கவும்.\",\n    \"health_en\": \"Stress management is critical, as emotional weight can manifest physically. Ensure adequate intake of calcium and pay attention to your bone health.\",\n    \"health_ta\": \"உணர்ச்சிபூர்வமான சுமை உடலை பாதிக்கக்கூடும் என்பதால், மன அழுத்த மேலாண்மை மிக முக்கியம். போதுமான அளவு கால்சியம் உட்கொள்வதை உறுதிசெய்து, உங்கள் எலும்பு ஆரோக்கியத்தில் கவனம் செலுத்துங்கள்.\",\n    \"lucky_number\": \"10\",\n    \"lucky_color_en\": \"Dark Grey\",\n    \"lucky_color_ta\": \"அடர் சாம்பல்\"\n  },\n  {\n    \"sign_en\": \"Aquarius\",\n    \"sign_ta\": \"கும்பம்\",\n    \"date\": \"2026-02-04\",\n    \"forecast_en\": \"Relationships, both personal and professional, take center stage. Today calls for compromise and partnership. Seek harmony and ensure mutual goals are addressed.\",\n    \"forecast_ta\": \"தனிப்பட்ட மற்றும் தொழில் ரீதியான உறவுகள் இன்று மையத்தில் உள்ளன. இன்று சமரசம் மற்றும் கூட்டாண்மைக்கு அழைப்பு விடுக்கப்படுகிறது. நல்லிணக்கத்தைத் தேடுங்கள் மற்றும் பரஸ்பர இலக்குகள் கவனிக்கப்படுவதை உறுதிசெய்யுங்கள்.\",\n    \"career_en\": \"Ideal day for one-on-one meetings or forming strategic alliances. Avoid being overly detached in group settings; listen to opposing viewpoints carefully. Legal contracts are favored.\",\n    \"career_ta\": \"ஒருவருக்கொருவர் சந்திப்புகள் அல்லது மூலோபாயக் கூட்டணிகளை உருவாக்க உகந்த நாள். குழு அமைப்புகளில் அதிகப்படியான பற்றின்மையைத் தவிர்க்கவும்; எதிர்ப்புக் கருத்துக்களைக் கவனமாகக் கேளுங்கள். சட்ட ஒப்பந்தங்கள் இன்று சாதகமாக இருக்கும்.\",\n    \"finance_en\": \"Consult a partner or financial advisor before making major decisions. Financial stability relies on shared efforts. Avoid signing documents without thorough review.\",\n    \"finance_ta\": \"முக்கிய முடிவுகளை எடுப்பதற்கு முன் ஒரு பங்குதாரர் அல்லது நிதி ஆலோசகருடன் கலந்தாலோசிக்கவும். நிதி நிலைத்தன்மை பகிரப்பட்ட முயற்சிகளைச் சார்ந்துள்ளது. முழுமையான ஆய்வு இல்லாமல் ஆவணங்களில் கையெழுத்திடுவதைத் தவிர்க்கவும்.\",\n    \"health_en\": \"Focus on the circulatory system. Light cardio exercise is beneficial. Shared activities, like a partner workout, can improve both mental and physical health.\",\n    \"health_ta\": \"இரத்த ஓட்ட அமைப்பில் கவனம் செலுத்துங்கள். மிதமான இருதய உடற்பயிற்சி பயனுள்ளதாக இருக்கும். ஒரு கூட்டாளருடன் உடற்பயிற்சி செய்வது போன்ற பகிரப்பட்ட நடவடிக்கைகள், மன மற்றும் உடல் ஆரோக்கியத்தை மேம்படுத்தும்.\",\n    \"lucky_number\": \"11\",\n    \"lucky_color_en\": \"Electric Blue\",\n    \"lucky_color_ta\": \"மின்னில நீலம்\"\n  },\n  {\n    \"sign_en\": \"Pisces\",\n    \"sign_ta\": \"மீனம்\",\n    \"date\": \"2026-02-04\",\n    \"forecast_en\": \"Focus on daily routine, work efficiency, and prioritizing health matters. Service to others and attention to detail will bring satisfaction. Avoid unnecessary distractions to maximize productivity.\",\n    \"forecast_ta\": \"தினசரி வழக்கப்பணிகள், பணித்திறன் மற்றும் உடல்நல விஷயங்களுக்கு முன்னுரிமை அளிப்பதில் கவனம் செலுத்துங்கள். மற்றவர்களுக்குச் சேவை செய்வதும், விவரங்களில் கவனம் செலுத்துவதும் மனநிறைவைத் தரும். உற்பத்தித் திறனை அதிகரிக்க தேவையற்ற கவனச்சிதறல்களைத் தவிர்க்கவும்.\",\n    \"career_en\": \"An excellent day for completing ongoing projects and managing daily tasks efficiently. Attention to small print and schedules prevents later complications. Focus on clear, methodical work.\",\n    \"career_ta\": \"தொடர்ந்து நடந்து வரும் திட்டங்களை முடிப்பதற்கும், தினசரி பணிகளைத் திறமையாக நிர்வகிப்பதற்கும் இது ஒரு சிறந்த நாள். சிறிய அச்சு மற்றும் அட்டவணைகளில் கவனம் செலுத்துவது பிந்தைய சிக்கல்களைத் தவிர்க்கும். தெளிவான, முறையான வேலையில் கவனம் செலுத்துங்கள்.\",\n    \"finance_en\": \"Small, consistent savings habits will yield results. You might spend money on health supplements or pet care. Be careful not to lose track of minor receipts or bills.\",\n    \"finance_ta\": \"சிறிய, நிலையான சேமிப்புப் பழக்கங்கள் பலனைத் தரும். நீங்கள் ஆரோக்கியத்துக்கான துணைப் பொருட்கள் அல்லது செல்லப்பிராணிகள் பராமரிப்புக்காகச் செலவு செய்ய நேரலாம். சிறிய ரசீதுகள் அல்லது பில்களைக் கவனிக்காமல் இழக்காமல் கவனமாக இருங்கள்.\",\n    \"health_en\": \"Pay close attention to your feet and immune system. Hydration and nutrient-rich foods are essential. Avoid procrastination regarding necessary medical appointments.\",\n    \"health_ta\": \"உங்கள் பாதங்கள் மற்றும் நோய் எதிர்ப்பு சக்தியில் அதிக கவனம் செலுத்துங்கள். நீரேற்றம் மற்றும் சத்தான உணவுகள் அவசியம். தேவையான மருத்துவ சந்திப்புகள் குறித்துத் தாமதிப்பதைத் தவிர்க்கவும்.\",\n    \"lucky_number\": \"12\",\n    \"lucky_color_en\": \"Sea Green\",\n    \"lucky_color_ta\": \"கடல் பச்சை\"\n  }\n]\n```"}],"role":"model"},"finishReason":"STOP","index":0}]