[
  {
    "sign_ta": "மேஷம்",
    "sign_en": "Aries",
    "date": "22-02-2026",
    "prediction_ta": "இந்த சுபயோக ஞாயிற்றுக்கிழமை, மேஷ ராசிக்காரர்களே, சூரிய பகவானின் பேரொளி உங்கள் வாழ்வில் தன்னம்பிக்கையையும், தலைமைப் பண்புகளையும், அசாத்தியமான ஆற்றலையும் அள்ளித் தரும் அருமையான நாளாகும். உங்கள் உள்ளார்ந்த சக்தியை உணர்ந்து, எந்த ஒரு சவாலையும் துணிச்சலுடன் எதிர்கொள்ளும் மனோதிடம் மேலோங்கும். இன்று நீங்கள் மேற்கொள்ளும் காரியங்களில் ஒருவித வீரியமும், வேகமும் வெளிப்படும். நீண்டகாலமாக நிலுவையிலிருந்த ஒரு முக்கியமான திட்டத்திற்கு புதிய உத்வேகத்துடன் புத்துயிர் அளிப்பீர்கள். உங்கள் தலைமைத்துவப் பண்புகள் மிளிர்வதால், சமூகத்தில் நீங்கள் ஒரு முக்கியப் பொறுப்பை ஏற்கவோ, அல்லது ஒரு குழுவிற்கு வழிகாட்டவோ வாய்ப்புகள் உருவாகும். பெரியோர்களின் ஆசிகளும், குறிப்பாக தந்தையின் வழிகாட்டுதலும் உங்கள் முன்னேற்றத்திற்கு துணை நிற்கும். தன்னம்பிக்கையுடன் செயல்பட்டால், அசாத்தியமான இலக்குகளையும் எளிதாக எட்டிவிட முடியும் என்பது உறுதி. இன்று நீங்கள் எடுத்து வைக்கும் ஒவ்வொரு அடியிலும், வெற்றியின் அலைகள் உங்களைச் சூழ்ந்து நிற்கும். உங்கள் எண்ணங்களை தெளிவாக வெளிப்படுத்தி, மற்றவர்களை ஈர்க்கும் திறன் அதிகரிக்கும்.\n\nஉறவுகளின் மத்தியில் உங்கள் அன்பும், அரவணைப்பும் மேலும் வலுப்பெறும். குடும்ப உறுப்பினர்களுடன் இணக்கமான சூழ்நிலை நிலவும். குறிப்பாக, பெற்றோர்களுடனான உறவில் ஒருவித நெருக்கம் அதிகரிக்கும், அவர்களின் அனுபவபூர்வமான ஆலோசனைகள் உங்களுக்கு மிகவும் பயனுள்ளதாக அமையும். குழந்தைகளின் கல்வி மற்றும் எதிர்காலம் குறித்த திட்டங்களில் நீங்கள் அதிக கவனம் செலுத்துவீர்கள், அவர்களுக்குத் தேவையான ஆதரவை வழங்குவதில் சிறிதும் பின்வாங்க மாட்டீர்கள். நண்பர்களுடனான சந்திப்புகள் மகிழ்ச்சியையும், புதிய சிந்தனைகளையும் பரிமாறிக் கொள்ளும் வாய்ப்பையும் உருவாக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் வட்டாரத்தை விரிவுபடுத்தி, புதிய தொடர்புகளை ஏற்படுத்த உதவும். சமூகத்தில் உங்கள் மதிப்புகளும், மரியாதையும் உயரும் நாள் இது. பலரும் உங்கள் வழிகாட்டுதலை நாடி வருவார்கள், அவர்களுக்கு நீங்கள் சரியான பாதையைக் காட்டுவீர்கள். தொண்டு நிறுவனப் பணிகளில் ஈடுபடுபவர்களுக்கு பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும்.\n\nஉங்களின் மன உறுதி இந்த நாளை மேலும் சிறப்பாக்கும். எண்ணிய காரியங்களை நேர்த்தியாகவும், திட்டமிட்டபடியும் செய்து முடிக்க அதிக வாய்ப்புகள் உள்ளன. ஆன்மீக நாட்டம் கொண்டவர்களுக்கு, தியானம் மற்றும் யோகா போன்ற பயிற்சிகளில் ஈடுபடுவது மன அமைதியையும், தெளிவையும் அளிக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். கலை மற்றும் இலக்கியத் துறைகளில் ஈடுபாடு கொண்டவர்களுக்கு, புதிய படைப்புகளை உருவாக்குவதற்கான தூண்டுதல் கிடைக்கும். உங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்புகள் அமையும். உங்கள் உள்ளுணர்வு சக்தி அதிகரிக்கும், இது சரியான முடிவுகளை எடுக்க உதவும். எதிர்காலத்திற்கான திட்டமிடல்களை மேற்கொள்வதற்கு இது உகந்த நாள். தீர்க்கமான முடிவுகளை எடுப்பதில் எந்த தயக்கமும் இருக்காது. புதிய முயற்சிகளைத் தொடங்குவதற்குத் தேவையான தைரியமும், மன வலிமையும் உங்களிடம் மேலோங்கும். பொதுவாக, இது ஒரு தன்னம்பிக்கை நிறைந்த, ஆற்றல் மிக்க, தலைமைத்துவப் பண்புகள் வெளிப்படும் தினமாக அமையும். உங்கள் முயற்சிகள் அனைத்திலும் வெற்றி பெறுவதற்கான வாய்ப்புகள் பிரகாசமாக உள்ளன. உங்கள் மனதிலும், செயலிலும் ஒருவித புதுப்பொலிவும், புத்துணர்ச்சியும் நிறைந்திருக்கும். இன்றைய நாள் உங்கள் வாழ்வின் ஒரு புதிய அத்தியாயத்தைத் தொடங்க வழிவகுக்கும். உங்கள் முயற்சிகளுக்கு நல்ல பலன் கிடைக்கும்.",
    "prediction_en": "On this auspicious Sunday, Aries natives, the radiant light of the Sun God will bestow upon your life immense confidence, leadership qualities, and extraordinary energy. You will realize your inner strength, and the mental fortitude to face any challenge with courage will prevail. A certain vigor and speed will be evident in the tasks you undertake today. You will revive a long-pending important project with new enthusiasm. As your leadership qualities shine, opportunities may arise for you to take on a significant responsibility in society or to guide a team. The blessings of elders, especially the guidance of your father, will support your progress. It is certain that by acting with self-confidence, you can easily achieve even extraordinary goals. With every step you take today, waves of success will surround you. Your ability to express your thoughts clearly and attract others will increase.\n\nAmong relationships, your love and affection will further strengthen. A harmonious atmosphere will prevail among family members. Particularly, a certain closeness will increase in your relationship with parents, and their experienced advice will be very beneficial to you. You will pay more attention to the education and future plans of children, and you will not hesitate to provide them with the necessary support. Meetings with friends will bring joy and opportunities to exchange new ideas. Participating in social events will help expand your circle and establish new connections. Your values and respect in society will rise today. Many will seek your guidance, and you will show them the right path. Those involved in social service will receive praise and recognition.\n\nYour mental determination will make this day even more special. There are high chances of completing intended tasks neatly and as planned. For those with spiritual inclination, engaging in practices like meditation and yoga will bring mental peace and clarity. You will show interest in learning new things. For those involved in arts and literature, there will be an inspiration to create new works. Good opportunities will arise to showcase your talents. Your intuition will increase, helping you make the right decisions. This is an opportune day for undertaking future planning. There will be no hesitation in making decisive decisions. The courage and mental strength needed to start new ventures will prevail within you. Generally, this will be a day filled with confidence, energy, and the manifestation of leadership qualities. The chances of success in all your endeavors are bright. Your mind and actions will be filled with a new radiance and refreshment. Today will pave the way for starting a new chapter in your life. Your efforts will yield good results.",
    "career_ta": "பணியிடத்தில் உங்கள் தலைமைத்துவப் பண்புகள் வெளிப்படும். முக்கியமான திட்டங்களுக்குத் தலைமை தாங்கி வழிநடத்தும் வாய்ப்புகள் கிடைக்கும். உங்கள் தன்னம்பிக்கையும், துணிச்சலான அணுகுமுறையும் சக ஊழியர்களிடையே ஒரு புதிய உத்வேகத்தை உருவாக்கும். மேலதிகாரிகள் உங்கள் திறமைகளை அங்கீகரித்து, புதிய பொறுப்புகளை வழங்கலாம். உங்கள் முடிவெடுக்கும் திறன் பாராட்டுப் பெறும். சக பணியாளர்களுடன் இணக்கமாகச் செயல்பட்டு, கூட்டுப்பணிகளில் வெற்றியைப் பெறுவீர்கள். புதிய தொழில் வாய்ப்புகள் அல்லது பதவி உயர்வுகளுக்கான அறிகுறிகள் தென்படலாம்.",
    "career_en": "Your leadership qualities will shine in the workplace. Opportunities will arise to lead and guide important projects. Your self-confidence and courageous approach will create new enthusiasm among colleagues. Superiors may recognize your abilities and assign new responsibilities. Your decision-making skills will be appreciated. You will work harmoniously with co-workers and achieve success in collaborative tasks. Signs of new career opportunities or promotions may appear.",
    "finance_ta": "நிதி நிலைமையில் நல்ல முன்னேற்றம் காணப்படும். திட்டமிட்ட முதலீடுகள் மூலம் லாபம் ஈட்ட வாய்ப்புகள் உள்ளன. புதிய வருமான வழிகள் உருவாகலாம். சேமிப்பை அதிகரிப்பதற்கான சிறந்த நாள் இது. வீண் செலவுகளைத் தவிர்த்து, எதிர்காலத்திற்காக சேமிப்பதில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதிச் சூழ்நிலையை மேம்படுத்த முக்கிய முடிவுகளை எடுப்பீர்கள். நீண்டகால நிதித் திட்டங்களில் ஈடுபடுவதற்கு உகந்த நேரம். தந்தையின் வழிகாட்டுதலுடன் நிதி முடிவுகளை எடுக்கலாம்.",
    "finance_en": "Good progress will be seen in financial matters. There are opportunities to earn profits through planned investments. New sources of income may emerge. This is an excellent day to increase savings. You will avoid unnecessary expenses and focus on saving for the future. You will make important decisions to improve the family's financial situation. It is an opportune time to engage in long-term financial planning. You may make financial decisions with your father's guidance.",
    "health_ta": "ஆரோக்கியத்தில் நல்ல மேம்பாடு காணப்படும். உடல் மற்றும் மனதில் ஒரு புதிய புத்துணர்ச்சி நிறைந்திருக்கும். சீரான உணவு முறையையும், உடற்பயிற்சிகளையும் பின்பற்றுவதன் மூலம் உடல் ஆரோக்கியத்தைப் பேணிக்காப்பீர்கள். மனதை அமைதியாக வைத்திருக்க தியானம் அல்லது யோகா செய்வது பயனுள்ளதாக இருக்கும். குடும்ப உறுப்பினர்களின் ஆரோக்கியத்திலும் நல்ல முன்னேற்றம் தெரியும். உங்கள் தன்னம்பிக்கை ஆரோக்கியத்தை மேலும் அதிகரிக்கும். தந்தைவழி உறவுகளின் ஆரோக்கியம் மேம்படும்.",
    "health_en": "Good improvement will be seen in health. A new freshness will fill your body and mind. You will maintain good physical health by following a balanced diet and regular exercises. Practicing meditation or yoga will be beneficial to keep your mind calm. Good progress will also be seen in the health of family members. Your self-confidence will further boost your health. The health of paternal relatives will improve.",
    "lucky_number": "9",
    "lucky_color_ta": "சிகப்பு",
    "lucky_color_en": "Red"
  },
  {
    "sign_ta": "ரிஷபம்",
    "sign_en": "Taurus",
    "date": "22-02-2026",
    "prediction_ta": "இந்த சுபயோக ஞாயிற்றுக்கிழமை, ரிஷப ராசிக்காரர்களே, சூரியனின் ஒளிக்கீற்று உங்கள் வாழ்வில் நிலையான முன்னேற்றத்தையும், ஆழ்ந்த சிந்தனையையும், பொறுமையுடன் செயல்படும் திறனையும் வலுப்படுத்தும். இன்று நீங்கள் தன்னம்பிக்கையுடன் செயல்படுவீர்கள். எந்த ஒரு சூழ்நிலையையும் நிதானமாக அணுகி, சரியான முடிவுகளை எடுப்பதில் சிறப்புத் திறமையுடன் விளங்குவீர்கள். உங்களின் உறுதியான குணம் இந்த நாளில் பலருக்கு வழிகாட்டும். நீண்டகாலமாக நீங்கள் திட்டமிட்டிருந்த ஒரு முக்கியமான காரியத்திற்கு இன்று ஒரு புதிய வடிவம் கொடுக்கலாம். உங்கள் உள்ளுணர்வு சொல்வதை நம்பி செயல்பட்டால், அனுகூலமான பலன்களைப் பெறுவீர்கள். தந்தையின் ஆலோசனைகளும், பெரியோர்களின் வழிகாட்டுதலும் உங்களுக்கு மிகுந்த பலத்தை அளிக்கும். இன்று நீங்கள் மேற்கொள்ளும் முயற்சிகள் எதிர்காலத்திற்கான வலுவான அஸ்திவாரத்தை அமைக்கும் என்பதில் ஐயமில்லை. உங்கள் உழைப்பிற்கு ஏற்ற அங்கீகாரம் கிடைக்கும் நாள் இது.\n\nகுடும்ப உறவுகளில் ஒருவித இணக்கமும், புரிதலும் மேம்படும். குடும்ப உறுப்பினர்களுடன் அதிக நேரம் செலவழித்து, அவர்களின் தேவைகளைப் பூர்த்தி செய்வீர்கள். குறிப்பாக, தந்தைவழி உறவுகளுடன் நல்லுறவு மேலோங்கும், அவர்களின் ஆதரவு உங்களுக்கு மன பலத்தை அளிக்கும். குழந்தைகளின் கல்வி மற்றும் அவர்களது தனிப்பட்ட வளர்ச்சி குறித்து அதிக கவனம் செலுத்துவீர்கள், அவர்களுக்குத் தேவையான வழிகாட்டுதலை வழங்குவீர்கள். நண்பர்களுடனான சந்திப்புகள் மகிழ்ச்சியையும், புதிய அனுபவங்களையும் கொண்டு வரும். சமூகத்தில் நீங்கள் ஒரு பொறுப்பான நபராகப் பார்க்கப்படுவீர்கள். உங்கள் பொறுமைக்கும், நேர்மைக்கும் நல்ல பாராட்டு கிடைக்கும். மற்றவர்களுக்கு உதவி செய்வதில் ஒருவித மனநிறைவை அடைவீர்கள். சமூகப் பணிகளில் ஈடுபடுபவர்களுக்கு பாராட்டுகளும், புதிய பொறுப்புகளும் தேடி வரும்.\n\nஉங்களின் கலைத்திறன்கள் இந்த நாளில் வெளிப்படும். இசை, ஓவியம், எழுத்து போன்ற துறைகளில் ஈடுபாடு கொண்டவர்களுக்கு புதிய உத்வேகம் கிடைக்கும். உங்கள் ரசனையும், அழகியல் உணர்வும் பலரையும் கவரும். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள், இது உங்கள் அறிவை மேலும் வளர்க்க உதவும். ஆன்மீக நாட்டம் கொண்டவர்களுக்கு, தியானம் மற்றும் யோகா போன்ற பயிற்சிகளில் ஈடுபடுவது மன அமைதியையும், உள்ளுணர்வையும் மேம்படுத்தும். எதிர்காலத்திற்கான நிதித் திட்டமிடல்கள் மற்றும் முதலீடுகளை மேற்கொள்வதற்கு இது உகந்த நாள். திட்டமிட்ட காரியங்களை நிறைவேற்றுவதற்குத் தேவையான மன வலிமையும், பொறுமையும் உங்களிடம் நிறைந்திருக்கும். பொதுவாக, இது ஒரு தன்னம்பிக்கை நிறைந்த, ஸ்திரமான முன்னேற்றத்தை அள்ளித் தரும் தினமாக அமையும். உங்கள் கடின உழைப்பிற்கு ஏற்ற பலன் கிடைக்கும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றிப் பாதையை நோக்கிச் செல்லும். நேர்மறையான எண்ணங்களுடன் செயல்பட்டு, இந்த நாளைச் சிறப்பாக மாற்றுவீர்கள். வாழ்வில் ஒரு புதிய படிநிலையை அடைய தேவையான அடித்தளத்தை இடுவீர்கள்.",
    "prediction_en": "On this auspicious Sunday, Taurus natives, the rays of the Sun will strengthen steady progress, deep thought, and the ability to act with patience in your life. Today you will act with self-confidence. You will approach every situation calmly and excel in making the right decisions with special skill. Your firm character will guide many on this day. You can give a new form to an important task you have been planning for a long time. If you act trusting your intuition, you will receive favorable results. Your father's advice and the guidance of elders will give you great strength. There is no doubt that the efforts you undertake today will lay a strong foundation for the future. This is a day when your hard work will receive due recognition.\n\nIn family relationships, a certain harmony and understanding will improve. You will spend more time with family members and fulfill their needs. Particularly, good relations with paternal relatives will prevail, and their support will give you mental strength. You will pay more attention to the education of children and their individual growth, providing them with necessary guidance. Meetings with friends will bring joy and new experiences. You will be seen as a responsible person in society. Your patience and honesty will receive good praise. You will achieve a certain satisfaction by helping others. Those involved in social service will receive praise and new responsibilities.\n\nYour artistic talents will be revealed on this day. Those involved in fields like music, painting, and writing will find new inspiration. Your taste and aesthetic sense will attract many. You will show interest in learning new things, which will help further develop your knowledge. For those with spiritual inclination, engaging in practices like meditation and yoga will improve mental peace and intuition. This is an opportune day for undertaking financial planning and investments for the future. You will be filled with the mental strength and patience needed to accomplish planned tasks. Generally, this will be a day filled with confidence, bringing stable progress. You will receive due reward for your hard work. All your endeavors will proceed towards success. By acting with positive thoughts, you will make this day special. You will lay the necessary foundation to achieve a new stage in life.",
    "career_ta": "பணியிடத்தில் உங்களின் பொறுமையும், விடாமுயற்சியும் பாராட்டப்படும். கடினமான பணிகளையும் உறுதியுடன் செய்து முடித்து, மேலதிகாரிகளின் நம்பிக்கையைப் பெறுவீர்கள். புதிய பொறுப்புகளை ஏற்க வாய்ப்புகள் உருவாகும். குழுவாகச் செயல்படும்போது உங்கள் கருத்துக்கள் முக்கியத்துவம் பெறும். புதிய திட்டங்களை ஆரம்பிப்பதற்கு இது உகந்த நாள். உங்கள் உழைப்பிற்கு ஏற்ற அங்கீகாரமும், மரியாதையும் கிடைக்கும். தலைமைப் பண்புகள் வெளிப்படும்.",
    "career_en": "Your patience and perseverance will be appreciated in the workplace. You will complete difficult tasks with determination, earning the trust of your superiors. Opportunities to take on new responsibilities will arise. Your opinions will gain importance when working in a team. This is an opportune day to start new projects. You will receive due recognition and respect for your hard work. Leadership qualities will emerge.",
    "finance_ta": "நிதி நிலைமை சிறப்பாக இருக்கும். திட்டமிட்ட சேமிப்புகள் மூலம் நல்ல லாபம் ஈட்டலாம். புதிய முதலீடுகளை மேற்கொள்வதற்கு இது உகந்த நேரம். குடும்பத்தின் நிதிச் சூழ்நிலையை மேம்படுத்துவதற்கான புதிய வழிகளைக் கண்டுபிடிப்பீர்கள். தந்தையின் நிதி ஆலோசனைகள் உங்களுக்குப் பயனுள்ளதாக அமையும். நீண்டகால நிதித் திட்டங்களில் கவனம் செலுத்துவீர்கள். தேவையில்லாத செலவுகளைத் தவிர்த்து, சேமிப்பை அதிகரிப்பதில் கவனம் செலுத்துவீர்கள்.",
    "finance_en": "The financial situation will be excellent. You can earn good profits through planned savings. This is an opportune time to make new investments. You will discover new ways to improve the family's financial situation. Your father's financial advice will be beneficial to you. You will focus on long-term financial plans. You will avoid unnecessary expenses and focus on increasing savings.",
    "health_ta": "ஆரோக்கியத்தில் நல்ல முன்னேற்றம் காணப்படும். சீரான உணவு முறையையும், தினசரி உடற்பயிற்சிகளையும் பின்பற்றுவதன் மூலம் உடல் ஆரோக்கியத்தைப் பேணிக்காப்பீர்கள். மனதை அமைதியாக வைத்திருக்க தியானம் மற்றும் யோகா செய்வது பயனுள்ளதாக இருக்கும். குடும்ப உறுப்பினர்களின் ஆரோக்கியத்திலும் நல்ல மேம்பாடு தெரியும். புத்துணர்ச்சியுடன் இருப்பீர்கள். சூரிய ஒளியில் சில நேரம் செலவிடுவது எலும்புகளுக்கு நல்லது.",
    "health_en": "Good improvement will be seen in health. You will maintain good physical health by following a balanced diet and daily exercises. Practicing meditation and yoga will be beneficial to keep your mind calm. Good progress will also be seen in the health of family members. You will feel refreshed. Spending some time in sunlight is good for bones.",
    "lucky_number": "6",
    "lucky_color_ta": "இளஞ்சிவப்பு",
    "lucky_color_en": "Pink"
  },
  {
    "sign_ta": "மிதுனம்",
    "sign_en": "Gemini",
    "date": "22-02-2026",
    "prediction_ta": "இந்த சுபயோக ஞாயிற்றுக்கிழமை, மிதுன ராசிக்காரர்களே, சூரியனின் ஆற்றல் உங்கள் வாழ்வில் புத்துணர்ச்சியையும், புதிய சிந்தனைகளையும், விரைவான முன்னேற்றத்தையும் கொண்டு வரும். இன்று உங்கள் மனதில் ஒருவித தெளிவும், ஆற்றலும் மேலோங்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதிலும், தகவல்களைப் பரிமாறிக் கொள்வதிலும் ஆர்வம் காட்டுவீர்கள். உங்கள் துறுதுறுப்பான மனதும், புதுமையான யோசனைகளும் மற்றவர்களைக் கவரும். இன்று நீங்கள் மேற்கொள்ளும் காரியங்களில் ஒருவித உற்சாகமும், ஆர்வமும் வெளிப்படும். நீண்டகாலமாக நீங்கள் யோசித்து வந்த ஒரு திட்டத்திற்கு இன்று ஒரு சரியான தீர்வு கிடைக்கும். உங்கள் உள்ளுணர்வு வழிகாட்டுதலை ஏற்று செயல்பட்டால், அனுகூலமான பலன்களைப் பெறுவீர்கள். தந்தையின் ஆலோசனைகளும், பெரியோர்களின் வழிகாட்டுதலும் உங்கள் பாதைக்கு வெளிச்சம் காட்டும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு கடினமான செயலையும் எளிதாக நிறைவேற்ற முடியும். உங்கள் தகவல் தொடர்புத் திறன் உச்சத்தில் இருக்கும் நாள் இது.\n\nஉறவுகளின் மத்தியில் உங்கள் இயல்பான நகைச்சுவை உணர்வும், அன்பான பேச்சும் மகிழ்ச்சியை உருவாக்கும். குடும்ப உறுப்பினர்களுடன் இணக்கமான சூழ்நிலை நிலவும். குறிப்பாக, தந்தைவழி உறவுகளுடன் நல்லுறவு மேலும் வலுப்பெறும். குழந்தைகளின் கல்வி மற்றும் அவர்களது படைப்புத் திறனை வளர்ப்பதில் நீங்கள் அதிக கவனம் செலுத்துவீர்கள். அவர்களுக்குத் தேவையான ஊக்குவிப்பைக் கொடுப்பதில் சிறிதும் பின்வாங்க மாட்டீர்கள். நண்பர்களுடனான சந்திப்புகள் மகிழ்ச்சியையும், புதிய சிந்தனைகளையும் பரிமாறிக் கொள்ளும் வாய்ப்பையும் உருவாக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் வட்டாரத்தை விரிவுபடுத்தி, புதிய தொடர்புகளை ஏற்படுத்த உதவும். சமூகத்தில் உங்கள் கருத்துக்களுக்கு மதிப்புக் கிடைக்கும். புதிய நண்பர்களைச் சந்திப்பதற்கான வாய்ப்புகள் பிரகாசமாக உள்ளன. தொண்டு நிறுவனப் பணிகளில் ஈடுபடுபவர்களுக்கு பாராட்டுகளும், புதிய பொறுப்புகளும் கிடைக்கும்.\n\nஉங்களின் பல்துறை திறன்கள் இந்த நாளில் வெளிப்படும். ஒரே நேரத்தில் பல காரியங்களைச் சமாளிக்கும் திறமை உங்களிடம் அதிகரிக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள், இது உங்கள் அறிவை மேலும் வளர்க்க உதவும். கலை மற்றும் இலக்கியத் துறைகளில் ஈடுபாடு கொண்டவர்களுக்கு, புதிய படைப்புகளை உருவாக்குவதற்கான தூண்டுதல் கிடைக்கும். உங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்புகள் அமையும். ஆன்மீக நாட்டம் கொண்டவர்களுக்கு, தியானம் மற்றும் யோகா போன்ற பயிற்சிகளில் ஈடுபடுவது மன அமைதியையும், உள்ளுணர்வையும் மேம்படுத்தும். எதிர்காலத்திற்கான திட்டமிடல்கள் மற்றும் முதலீடுகளை மேற்கொள்வதற்கு இது உகந்த நாள். திட்டமிட்ட காரியங்களை நிறைவேற்றுவதற்குத் தேவையான மன வலிமையும், கூர்மையான அறிவும் உங்களிடம் நிறைந்திருக்கும். பொதுவாக, இது ஒரு தன்னம்பிக்கை நிறைந்த, அறிவுசார்ந்த, விரைவான முன்னேற்றத்தை அள்ளித் தரும் தினமாக அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றிப் பாதையை நோக்கிச் செல்லும். புதிய வாய்ப்புகளைப் பயன்படுத்திக் கொண்டு முன்னேறுவீர்கள். உங்கள் நேர்மறையான அணுகுமுறை சூழ்நிலைகளை உங்களுக்குச் சாதகமாக மாற்றும். இன்று நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலும் வெற்றியை நோக்கிய ஒரு படியாகும்.",
    "prediction_en": "On this auspicious Sunday, Gemini natives, the Sun's energy will bring freshness, new ideas, and rapid progress into your life. Today, a certain clarity and energy will prevail in your mind. You will show interest in learning new things and exchanging information. Your vibrant mind and innovative ideas will attract others. A certain enthusiasm and interest will be evident in the tasks you undertake today. A long-contemplated project will find a proper solution today. If you act by accepting your intuition's guidance, you will receive favorable results. Your father's advice and elders' guidance will illuminate your path. By acting with self-confidence, you can easily accomplish any difficult task. This is a day when your communication skills will be at their peak.\n\nAmong relationships, your natural sense of humor and affectionate speech will create joy. A harmonious atmosphere will prevail among family members. Particularly, good relations with paternal relatives will further strengthen. You will pay more attention to the education of children and developing their creative abilities. You will not hesitate to provide them with the necessary encouragement. Meetings with friends will bring joy and opportunities to exchange new ideas. Participating in social events will help expand your circle and establish new connections. Your opinions will be valued in society. Opportunities to meet new friends are bright. Those involved in social service will receive praise and new responsibilities.\n\nYour multifaceted talents will be revealed on this day. Your ability to handle multiple tasks simultaneously will increase. You will show interest in learning new things, which will help further develop your knowledge. For those involved in arts and literature, there will be an inspiration to create new works. Good opportunities will arise to showcase your talents. For those with spiritual inclination, engaging in practices like meditation and yoga will improve mental peace and intuition. This is an opportune day for undertaking future planning and investments. You will be filled with the mental strength and sharp intellect needed to accomplish planned tasks. Generally, this will be a day filled with confidence, intellect, bringing rapid progress. All your endeavors will proceed towards success. You will progress by utilizing new opportunities. Your positive approach will turn situations in your favor. Every action you undertake today is a step towards success.",
    "career_ta": "பணியிடத்தில் உங்கள் தகவல் தொடர்புத் திறன்கள் உச்சத்தில் இருக்கும். புதிய திட்டங்கள் குறித்து தெளிவான விளக்கங்களை அளித்து, சக ஊழியர்களை ஊக்குவிப்பீர்கள். மேலதிகாரிகள் உங்கள் புதுமையான யோசனைகளை அங்கீகரிப்பார்கள். குழுத் தலைவராகவோ அல்லது ஒரு வழிகாட்டியாகவோ செயல்படும் வாய்ப்புகள் உருவாகும். புதிய தொழில் வாய்ப்புகள் அல்லது பதவி உயர்வுகளுக்கான அறிகுறிகள் தென்படலாம். தலைமைப் பண்புகள் வெளிப்படும்.",
    "career_en": "Your communication skills will be at their peak in the workplace. You will provide clear explanations about new projects and motivate colleagues. Superiors will recognize your innovative ideas. Opportunities may arise to act as a team leader or a mentor. Signs of new career opportunities or promotions may appear. Leadership qualities will emerge.",
    "finance_ta": "நிதி நிலைமையில் நல்ல முன்னேற்றம் காணப்படும். புதிய வருமான வழிகள் உருவாகலாம். திட்டமிட்ட முதலீடுகள் மூலம் லாபம் ஈட்ட வாய்ப்புகள் உள்ளன. வீண் செலவுகளைத் தவிர்த்து, எதிர்காலத்திற்காக சேமிப்பதில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதிச் சூழ்நிலையை மேம்படுத்த முக்கிய முடிவுகளை எடுப்பீர்கள். தந்தையின் நிதி ஆலோசனைகள் உங்களுக்குப் பெரிதும் உதவும். நிதித் திட்டமிடல்களில் கூர்மையான புத்திசாலித்தனம் வெளிப்படும்.",
    "finance_en": "Good progress will be seen in financial matters. New sources of income may emerge. There are opportunities to earn profits through planned investments. You will avoid unnecessary expenses and focus on saving for the future. You will make important decisions to improve the family's financial situation. Your father's financial advice will be very helpful to you. Sharp intellect will be evident in financial planning.",
    "health_ta": "ஆரோக்கியத்தில் நல்ல மேம்பாடு காணப்படும். உடல் மற்றும் மனதில் ஒரு புதிய புத்துணர்ச்சி நிறைந்திருக்கும். சீரான உணவு முறையையும், உடற்பயிற்சிகளையும் பின்பற்றுவதன் மூலம் உடல் ஆரோக்கியத்தைப் பேணிக்காப்பீர்கள். மனதை அமைதியாக வைத்திருக்க தியானம் அல்லது யோகா செய்வது பயனுள்ளதாக இருக்கும். குடும்ப உறுப்பினர்களின் ஆரோக்கியத்திலும் நல்ல முன்னேற்றம் தெரியும். நேர்மறை எண்ணங்கள் ஆரோக்கியத்தை மேம்படுத்தும்.",
    "health_en": "Good improvement will be seen in health. A new freshness will fill your body and mind. You will maintain good physical health by following a balanced diet and regular exercises. Practicing meditation or yoga will be beneficial to keep your mind calm. Good progress will also be seen in the health of family members. Positive thoughts will enhance health.",
    "lucky_number": "5",
    "lucky_color_ta": "பச்சை",
    "lucky_color_en": "Green"
  },
  {
    "sign_ta": "கடகம்",
    "sign_en": "Cancer",
    "date": "22-02-2026",
    "prediction_ta": "இந்த சுபயோக ஞாயிற்றுக்கிழமை, கடக ராசிக்காரர்களே, சூரியனின் சக்தி உங்கள் வாழ்வில் பாதுகாப்பையும், தன்னம்பிக்கையையும், குடும்பத்தின் மீது அதீத அக்கறையையும் மேம்படுத்தும் நாளாகும். இன்று உங்கள் உணர்ச்சிகள் சீராக இருக்கும், இது உங்களுக்கு மன அமைதியை அளிக்கும். உங்கள் உள்ளுணர்வு சக்தி அதிகரிக்கும், இது சரியான முடிவுகளை எடுக்க உதவும். குடும்பத்தின் தேவைகளைப் பூர்த்தி செய்வதிலும், உறவுகளைப் பேணுவதிலும் அதிக கவனம் செலுத்துவீர்கள். நீண்டகாலமாக நீங்கள் யோசித்து வந்த ஒரு குடும்பக் காரியத்திற்கு இன்று ஒரு சரியான தீர்வு கிடைக்கும். உங்கள் தன்னம்பிக்கையான அணுகுமுறை பல குடும்பப் பிரச்சினைகளுக்கு எளிதாகத் தீர்வு காண உதவும். தந்தையின் ஆலோசனைகளும், பெரியோர்களின் வழிகாட்டுதலும் உங்கள் முன்னேற்றத்திற்கு துணை நிற்கும். இன்று நீங்கள் மேற்கொள்ளும் காரியங்களில் ஒருவித ஸ்திரத்தன்மையும், நேர்மறையான அணுகுமுறையும் வெளிப்படும். உங்கள் இரக்க குணமும், தலைமைப் பண்புகளும் பாராட்டப்படும்.\n\nஉறவுகளின் மத்தியில் உங்கள் அன்பும், அரவணைப்பும் மேலும் வலுப்பெறும். குடும்ப உறுப்பினர்களுடன் இணக்கமான சூழ்நிலை நிலவும். குறிப்பாக, தந்தைவழி உறவுகளுடன் நல்லுறவு மேலோங்கும், அவர்களின் ஆதரவு உங்களுக்கு மன பலத்தை அளிக்கும். குழந்தைகளின் கல்வி மற்றும் அவர்களது எதிர்காலம் குறித்த திட்டங்களில் நீங்கள் அதிக கவனம் செலுத்துவீர்கள், அவர்களுக்குத் தேவையான ஆதரவை வழங்குவதில் சிறிதும் பின்வாங்க மாட்டீர்கள். நண்பர்களுடனான சந்திப்புகள் மகிழ்ச்சியையும், புதிய சிந்தனைகளையும் பரிமாறிக் கொள்ளும் வாய்ப்பையும் உருவாக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் வட்டாரத்தை விரிவுபடுத்தி, புதிய தொடர்புகளை ஏற்படுத்த உதவும். சமூகத்தில் நீங்கள் ஒரு பொறுப்பான நபராகப் பார்க்கப்படுவீர்கள். உங்கள் கருணை மற்றும் புரிதலுக்கு நல்ல பாராட்டு கிடைக்கும். மற்றவர்களுக்கு உதவி செய்வதில் ஒருவித மனநிறைவை அடைவீர்கள். தொண்டு நிறுவனப் பணிகளில் ஈடுபடுபவர்களுக்கு பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும்.\n\nஉங்களின் படைப்புத் திறன்கள் இந்த நாளில் வெளிப்படும். வீடு மற்றும் குடும்பம் சார்ந்த விஷயங்களில் புதிய மாற்றங்களைச் செய்வதற்கு ஆர்வம் காட்டுவீர்கள். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள், இது உங்கள் அறிவை மேலும் வளர்க்க உதவும். கலை மற்றும் இலக்கியத் துறைகளில் ஈடுபாடு கொண்டவர்களுக்கு, புதிய படைப்புகளை உருவாக்குவதற்கான தூண்டுதல் கிடைக்கும். உங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்புகள் அமையும். ஆன்மீக நாட்டம் கொண்டவர்களுக்கு, தியானம் மற்றும் யோகா போன்ற பயிற்சிகளில் ஈடுபடுவது மன அமைதியையும், உள்ளுணர்வையும் மேம்படுத்தும். எதிர்காலத்திற்கான நிதித் திட்டமிடல்கள் மற்றும் முதலீடுகளை மேற்கொள்வதற்கு இது உகந்த நாள். திட்டமிட்ட காரியங்களை நிறைவேற்றுவதற்குத் தேவையான மன வலிமையும், பொறுமையும் உங்களிடம் நிறைந்திருக்கும். பொதுவாக, இது ஒரு தன்னம்பிக்கை நிறைந்த, பாதுகாப்பு உணர்வை அதிகரிக்கும், குடும்ப உறவுகளை வலுப்படுத்தும் தினமாக அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றிப் பாதையை நோக்கிச் செல்லும். புதிய வாய்ப்புகளைப் பயன்படுத்திக் கொண்டு முன்னேறுவீர்கள். உங்கள் நேர்மறையான அணுகுமுறை சூழ்நிலைகளை உங்களுக்குச் சாதகமாக மாற்றும். இன்று நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலும் வெற்றியை நோக்கிய ஒரு படியாகும். நல்ல எதிர்காலத்திற்கான அடித்தளத்தை அமைப்பீர்கள்.",
    "prediction_en": "On this auspicious Sunday, Cancer natives, the Sun's energy will enhance security, self-confidence, and immense care for family in your life. Today, your emotions will be stable, bringing you mental peace. Your intuition will increase, helping you make the right decisions. You will pay more attention to fulfilling family needs and maintaining relationships. A proper solution for a long-contemplated family matter will be found today. Your confident approach will help easily resolve many family issues. Your father's advice and elders' guidance will support your progress. A certain stability and positive approach will be evident in the tasks you undertake today. Your compassion and leadership qualities will be appreciated.\n\nAmong relationships, your love and affection will further strengthen. A harmonious atmosphere will prevail among family members. Particularly, good relations with paternal relatives will prevail, and their support will give you mental strength. You will pay more attention to the education of children and their future plans, and you will not hesitate to provide them with the necessary support. Meetings with friends will bring joy and opportunities to exchange new ideas. Participating in social events will help expand your circle and establish new connections. You will be seen as a responsible person in society. Your kindness and understanding will receive good praise. You will achieve a certain satisfaction by helping others. Those involved in social service will receive praise and recognition.\n\nYour creative talents will be revealed on this day. You will show interest in making new changes in home and family-related matters. You will show interest in learning new things, which will help further develop your knowledge. For those involved in arts and literature, there will be an inspiration to create new works. Good opportunities will arise to showcase your talents. For those with spiritual inclination, engaging in practices like meditation and yoga will improve mental peace and intuition. This is an opportune day for undertaking future planning and investments. You will be filled with the mental strength and patience needed to accomplish planned tasks. Generally, this will be a day filled with confidence, increasing the sense of security, and strengthening family relationships. All your endeavors will proceed towards success. You will progress by utilizing new opportunities. Your positive approach will turn situations in your favor. Every action you undertake today is a step towards success. You will lay the foundation for a good future.",
    "career_ta": "பணியிடத்தில் உங்கள் தலைமைத்துவப் பண்புகள் வெளிப்படும். பாதுகாப்பு மற்றும் உறுதியான முடிவுகள் எடுப்பதில் உங்கள் திறமை பாராட்டப்படும். மேலதிகாரிகள் உங்கள் திறமைகளை அங்கீகரித்து, புதிய பொறுப்புகளை வழங்கலாம். குழுவாகச் செயல்படும்போது உங்கள் கருத்துக்கள் முக்கியத்துவம் பெறும். புதிய திட்டங்களை ஆரம்பிப்பதற்கு இது உகந்த நாள். உங்கள் உழைப்பிற்கு ஏற்ற அங்கீகாரமும், மரியாதையும் கிடைக்கும். குடும்பத் தொழில்களில் முன்னேற்றம் காணப்படும்.",
    "career_en": "Your leadership qualities will shine in the workplace. Your ability to make secure and firm decisions will be appreciated. Superiors may recognize your abilities and assign new responsibilities. Your opinions will gain importance when working in a team. This is an opportune day to start new projects. You will receive due recognition and respect for your hard work. Progress will be seen in family businesses.",
    "finance_ta": "நிதி நிலைமையில் நல்ல முன்னேற்றம் காணப்படும். திட்டமிட்ட முதலீடுகள் மூலம் லாபம் ஈட்ட வாய்ப்புகள் உள்ளன. குடும்பத்தின் நிதிச் சூழ்நிலையை மேம்படுத்துவதற்கான புதிய வழிகளைக் கண்டுபிடிப்பீர்கள். தந்தையின் நிதி ஆலோசனைகள் உங்களுக்குப் பயனுள்ளதாக அமையும். நீண்டகால நிதித் திட்டங்களில் கவனம் செலுத்துவீர்கள். தேவையில்லாத செலவுகளைத் தவிர்த்து, சேமிப்பை அதிகரிப்பதில் கவனம் செலுத்துவீர்கள். நிலம் சார்ந்த முதலீடுகள் நன்மை தரும்.",
    "finance_en": "Good progress will be seen in financial matters. There are opportunities to earn profits through planned investments. You will discover new ways to improve the family's financial situation. Your father's financial advice will be beneficial to you. You will focus on long-term financial plans. You will avoid unnecessary expenses and focus on increasing savings. Land-related investments will be beneficial.",
    "health_ta": "ஆரோக்கியத்தில் நல்ல மேம்பாடு காணப்படும். உடல் மற்றும் மனதில் ஒரு புதிய புத்துணர்ச்சி நிறைந்திருக்கும். சீரான உணவு முறையையும், உடற்பயிற்சிகளையும் பின்பற்றுவதன் மூலம் உடல் ஆரோக்கியத்தைப் பேணிக்காப்பீர்கள். மனதை அமைதியாக வைத்திருக்க தியானம் அல்லது யோகா செய்வது பயனுள்ளதாக இருக்கும். குடும்ப உறுப்பினர்களின் ஆரோக்கியத்திலும் நல்ல முன்னேற்றம் தெரியும். நேர்மறை எண்ணங்கள் ஆரோக்கியத்தை மேம்படுத்தும். சத்தான உணவுகள் எடுத்துக்கொள்வது முக்கியம்.",
    "health_en": "Good improvement will be seen in health. A new freshness will fill your body and mind. You will maintain good physical health by following a balanced diet and regular exercises. Practicing meditation or yoga will be beneficial to keep your mind calm. Good progress will also be seen in the health of family members. Positive thoughts will enhance health. It is important to consume nutritious foods.",
    "lucky_number": "2",
    "lucky_color_ta": "வெள்ளை",
    "lucky_color_en": "White"
  },
  {
    "sign_ta": "சிம்மம்",
    "sign_en": "Leo",
    "date": "22-02-2026",
    "prediction_ta": "இந்த சுபயோக ஞாயிற்றுக்கிழமை, சிம்ம ராசிக்காரர்களே, சூரிய பகவானின் ஆதிக்கம் உங்கள் ராசிநாதனின் ஆதிக்கத்துடன் இணைந்து உங்களுக்கு அபரிமிதமான தன்னம்பிக்கையையும், தலைமைப் பண்புகளையும், ஒருவித அரசாளும் கம்பீரத்தையும் அள்ளித் தரும் அருமையான நாளாகும். உங்கள் உள்ளார்ந்த சக்தியை உணர்ந்து, எந்த ஒரு சவாலையும் துணிச்சலுடன் எதிர்கொள்ளும் மனோதிடம் மேலோங்கும். இன்று நீங்கள் மேற்கொள்ளும் காரியங்களில் ஒருவித வீரியமும், வேகமும், வெற்றியும் வெளிப்படும். நீண்டகாலமாக நிலுவையிலிருந்த ஒரு முக்கியமான திட்டத்திற்கு புதிய உத்வேகத்துடன் புத்துயிர் அளிப்பீர்கள். உங்கள் தலைமைத்துவப் பண்புகள் மிளிர்வதால், சமூகத்தில் நீங்கள் ஒரு முக்கியப் பொறுப்பை ஏற்கவோ, அல்லது ஒரு குழுவிற்கு வழிகாட்டவோ வாய்ப்புகள் உருவாகும். பெரியோர்களின் ஆசிகளும், குறிப்பாக தந்தையின் வழிகாட்டுதலும் உங்கள் முன்னேற்றத்திற்கு துணை நிற்கும். தன்னம்பிக்கையுடன் செயல்பட்டால், அசாத்தியமான இலக்குகளையும் எளிதாக எட்டிவிட முடியும் என்பது உறுதி. இன்று நீங்கள் எடுத்து வைக்கும் ஒவ்வொரு அடியிலும், வெற்றியின் அலைகள் உங்களைச் சூழ்ந்து நிற்கும். உங்கள் எண்ணங்களை தெளிவாக வெளிப்படுத்தி, மற்றவர்களை ஈர்க்கும் திறன் அதிகரிக்கும். உங்கள் தனிப்பட்ட ஆளுமை மிகவும் மிளிரும் நாளாக இது அமையும்.\n\nஉறவுகளின் மத்தியில் உங்கள் அன்பும், அரவணைப்பும் மேலும் வலுப்பெறும். குடும்ப உறுப்பினர்களுடன் இணக்கமான சூழ்நிலை நிலவும். குறிப்பாக, பெற்றோர்களுடனான உறவில் ஒருவித நெருக்கம் அதிகரிக்கும், அவர்களின் அனுபவபூர்வமான ஆலோசனைகள் உங்களுக்கு மிகவும் பயனுள்ளதாக அமையும். குழந்தைகளின் கல்வி மற்றும் எதிர்காலம் குறித்த திட்டங்களில் நீங்கள் அதிக கவனம் செலுத்துவீர்கள், அவர்களுக்குத் தேவையான ஆதரவை வழங்குவதில் சிறிதும் பின்வாங்க மாட்டீர்கள். நண்பர்களுடனான சந்திப்புகள் மகிழ்ச்சியையும், புதிய சிந்தனைகளையும் பரிமாறிக் கொள்ளும் வாய்ப்பையும் உருவாக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் வட்டாரத்தை விரிவுபடுத்தி, புதிய தொடர்புகளை ஏற்படுத்த உதவும். சமூகத்தில் உங்கள் மதிப்புகளும், மரியாதையும் உயரும் நாள் இது. பலரும் உங்கள் வழிகாட்டுதலை நாடி வருவார்கள், அவர்களுக்கு நீங்கள் சரியான பாதையைக் காட்டுவீர்கள். தொண்டு நிறுவனப் பணிகளில் ஈடுபடுபவர்களுக்கு பாராட்டுகளும், அங்கீகாரமும் கிடைக்கும். உங்கள் புகழ் பரவும் நாளாக அமையும்.\n\nஉங்களின் மன உறுதி இந்த நாளை மேலும் சிறப்பாக்கும். எண்ணிய காரியங்களை நேர்த்தியாகவும், திட்டமிட்டபடியும் செய்து முடிக்க அதிக வாய்ப்புகள் உள்ளன. ஆன்மீக நாட்டம் கொண்டவர்களுக்கு, தியானம் மற்றும் யோகா போன்ற பயிற்சிகளில் ஈடுபடுவது மன அமைதியையும், தெளிவையும் அளிக்கும். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள். கலை மற்றும் இலக்கியத் துறைகளில் ஈடுபாடு கொண்டவர்களுக்கு, புதிய படைப்புகளை உருவாக்குவதற்கான தூண்டுதல் கிடைக்கும். உங்கள் திறமைகளை வெளிப்படுத்த நல்ல வாய்ப்புகள் அமையும். உங்கள் உள்ளுணர்வு சக்தி அதிகரிக்கும், இது சரியான முடிவுகளை எடுக்க உதவும். எதிர்காலத்திற்கான திட்டமிடல்களை மேற்கொள்வதற்கு இது உகந்த நாள். தீர்க்கமான முடிவுகளை எடுப்பதில் எந்த தயக்கமும் இருக்காது. புதிய முயற்சிகளைத் தொடங்குவதற்குத் தேவையான தைரியமும், மன வலிமையும் உங்களிடம் மேலோங்கும். பொதுவாக, இது ஒரு தன்னம்பிக்கை நிறைந்த, ஆற்றல் மிக்க, தலைமைத்துவப் பண்புகள் வெளிப்படும் தினமாக அமையும். உங்கள் முயற்சிகள் அனைத்திலும் வெற்றி பெறுவதற்கான வாய்ப்புகள் பிரகாசமாக உள்ளன. உங்கள் மனதிலும், செயலிலும் ஒருவித புதுப்பொலிவும், புத்துணர்ச்சியும் நிறைந்திருக்கும். இன்றைய நாள் உங்கள் வாழ்வின் ஒரு புதிய அத்தியாயத்தைத் தொடங்க வழிவகுக்கும். உங்கள் முயற்சிகளுக்கு நல்ல பலன் கிடைக்கும். உங்கள் செல்வாக்கு அதிகரிக்கும்.",
    "prediction_en": "On this auspicious Sunday, Leo natives, the dominance of the Sun God, combined with the dominance of your zodiac lord, will bring you immense self-confidence, leadership qualities, and a certain regal stature. You will realize your inner strength, and the mental fortitude to face any challenge with courage will prevail. A certain vigor, speed, and success will be evident in the tasks you undertake today. You will revive a long-pending important project with new enthusiasm. As your leadership qualities shine, opportunities may arise for you to take on a significant responsibility in society or to guide a team. The blessings of elders, especially the guidance of your father, will support your progress. It is certain that by acting with self-confidence, you can easily achieve even extraordinary goals. With every step you take today, waves of success will surround you. Your ability to express your thoughts clearly and attract others will increase. This will be a day when your personal charisma shines brightly.\n\nAmong relationships, your love and affection will further strengthen. A harmonious atmosphere will prevail among family members. Particularly, a certain closeness will increase in your relationship with parents, and their experienced advice will be very beneficial to you. You will pay more attention to the education and future plans of children, and you will not hesitate to provide them with the necessary support. Meetings with friends will bring joy and opportunities to exchange new ideas. Participating in social events will help expand your circle and establish new connections. Your values and respect in society will rise today. Many will seek your guidance, and you will show them the right path. Those involved in social service will receive praise and recognition. This will be a day when your fame spreads.\n\nYour mental determination will make this day even more special. There are high chances of completing intended tasks neatly and as planned. For those with spiritual inclination, engaging in practices like meditation and yoga will bring mental peace and clarity. You will show interest in learning new things. For those involved in arts and literature, there will be an inspiration to create new works. Good opportunities will arise to showcase your talents. Your intuition will increase, helping you make the right decisions. This is an opportune day for undertaking future planning. There will be no hesitation in making decisive decisions. The courage and mental strength needed to start new ventures will prevail within you. Generally, this will be a day filled with confidence, energy, and the manifestation of leadership qualities. The chances of success in all your endeavors are bright. Your mind and actions will be filled with a new radiance and refreshment. Today will pave the way for starting a new chapter in your life. Your efforts will yield good results. Your influence will increase.",
    "career_ta": "பணியிடத்தில் உங்கள் தலைமைத்துவப் பண்புகள் மிளிரும். புதிய திட்டங்களுக்குத் தலைமை தாங்கி, வெற்றிகரமாக முடிப்பீர்கள். உங்கள் துணிச்சலான முடிவுகளும், ஆக்கப்பூர்வமான யோசனைகளும் மேலதிகாரிகளால் பாராட்டப்படும். புதிய பொறுப்புகள் உங்களைத் தேடி வரும். சக ஊழியர்களுக்கு வழிகாட்டியாகச் செயல்படுவீர்கள். பதவி உயர்வுக்கான வாய்ப்புகள் பிரகாசமாக உள்ளன. உங்கள் செல்வாக்கு அதிகரிக்கும்.",
    "career_en": "Your leadership qualities will shine in the workplace. You will lead new projects and complete them successfully. Your courageous decisions and creative ideas will be appreciated by superiors. New responsibilities will come your way. You will act as a guide to colleagues. Opportunities for promotion are bright. Your influence will increase.",
    "finance_ta": "நிதி நிலைமையில் நல்ல முன்னேற்றம் காணப்படும். புதிய முதலீடுகள் மூலம் லாபம் ஈட்ட வாய்ப்புகள் உள்ளன. குடும்பத்தின் நிதிச் சூழ்நிலையை மேம்படுத்துவதற்கான புதிய வழிகளைக் கண்டுபிடிப்பீர்கள். தந்தையின் வழிகாட்டுதலுடன் நிதி முடிவுகளை எடுப்பீர்கள். சேமிப்பை அதிகரிப்பதற்கான சிறந்த நாள் இது. வீண் செலவுகளைத் தவிர்த்து, எதிர்காலத்திற்காக சேமிப்பதில் கவனம் செலுத்துவீர்கள். திடீர் பணவரவுக்கு வாய்ப்பு உண்டு.",
    "finance_en": "Good progress will be seen in financial matters. There are opportunities to earn profits through new investments. You will discover new ways to improve the family's financial situation. You will make financial decisions with your father's guidance. This is an excellent day to increase savings. You will avoid unnecessary expenses and focus on saving for the future. There is a possibility of sudden financial gain.",
    "health_ta": "ஆரோக்கியத்தில் நல்ல மேம்பாடு காணப்படும். உடல் மற்றும் மனதில் ஒரு புதிய புத்துணர்ச்சி நிறைந்திருக்கும். சீரான உணவு முறையையும், உடற்பயிற்சிகளையும் பின்பற்றுவதன் மூலம் உடல் ஆரோக்கியத்தைப் பேணிக்காப்பீர்கள். மனதை அமைதியாக வைத்திருக்க தியானம் அல்லது யோகா செய்வது பயனுள்ளதாக இருக்கும். குடும்ப உறுப்பினர்களின் ஆரோக்கியத்திலும் நல்ல முன்னேற்றம் தெரியும். உங்கள் தன்னம்பிக்கை ஆரோக்கியத்தை மேலும் அதிகரிக்கும். நேர்மறை ஆற்றல் பெருகும்.",
    "health_en": "Good improvement will be seen in health. A new freshness will fill your body and mind. You will maintain good physical health by following a balanced diet and regular exercises. Practicing meditation or yoga will be beneficial to keep your mind calm. Good progress will also be seen in the health of family members. Your self-confidence will further boost your health. Positive energy will increase.",
    "lucky_number": "1",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "கன்னி",
    "sign_en": "Virgo",
    "date": "22-02-2026",
    "prediction_ta": "இந்த சுபயோக ஞாயிற்றுக்கிழமை, கன்னி ராசிக்காரர்களே, சூரியனின் ஆற்றல் உங்கள் வாழ்வில் பகுப்பாய்வு திறனையும், தன்னம்பிக்கையையும், சேவை மனப்பான்மையையும் மேம்படுத்தும் நாளாகும். இன்று நீங்கள் எந்த ஒரு செயலையும் நேர்த்தியாகவும், திட்டமிட்டபடியும் செய்து முடிப்பதில் ஆர்வம் காட்டுவீர்கள். உங்களின் துல்லியமான திட்டமிடல் திறன் பலருக்கும் வழிகாட்டும். நீண்டகாலமாக நீங்கள் யோசித்து வந்த ஒரு முக்கியமான காரியத்திற்கு இன்று ஒரு சரியான தீர்வு கிடைக்கும். உங்கள் உள்ளுணர்வு வழிகாட்டுதலை ஏற்று செயல்பட்டால், அனுகூலமான பலன்களைப் பெறுவீர்கள். தந்தையின் ஆலோசனைகளும், பெரியோர்களின் வழிகாட்டுதலும் உங்களுக்கு மிகுந்த பலத்தை அளிக்கும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு கடினமான செயலையும் எளிதாக நிறைவேற்ற முடியும். உங்கள் தகவல் தொடர்புத் திறன் உச்சத்தில் இருக்கும் நாள் இது. தலைமைப் பண்புகள் வெளிப்படும்.\n\nஉறவுகளின் மத்தியில் உங்கள் அன்பும், அரவணைப்பும் மேலும் வலுப்பெறும். குடும்ப உறுப்பினர்களுடன் இணக்கமான சூழ்நிலை நிலவும். குறிப்பாக, தந்தைவழி உறவுகளுடன் நல்லுறவு மேலோங்கும், அவர்களின் ஆதரவு உங்களுக்கு மன பலத்தை அளிக்கும். குழந்தைகளின் கல்வி மற்றும் அவர்களது தனிப்பட்ட வளர்ச்சி குறித்து அதிக கவனம் செலுத்துவீர்கள், அவர்களுக்குத் தேவையான வழிகாட்டுதலை வழங்குவீர்கள். நண்பர்களுடனான சந்திப்புகள் மகிழ்ச்சியையும், புதிய சிந்தனைகளையும் பரிமாறிக் கொள்ளும் வாய்ப்பையும் உருவாக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் வட்டாரத்தை விரிவுபடுத்தி, புதிய தொடர்புகளை ஏற்படுத்த உதவும். சமூகத்தில் நீங்கள் ஒரு பொறுப்பான நபராகப் பார்க்கப்படுவீர்கள். உங்கள் பொறுமைக்கும், நேர்மைக்கும் நல்ல பாராட்டு கிடைக்கும். மற்றவர்களுக்கு உதவி செய்வதில் ஒருவித மனநிறைவை அடைவீர்கள். தொண்டு நிறுவனப் பணிகளில் ஈடுபடுபவர்களுக்கு பாராட்டுகளும், புதிய பொறுப்புகளும் தேடி வரும். உங்கள் ஒழுக்கம் பாராட்டப்படும்.\n\nஉங்களின் அறிவுசார்ந்த திறன்கள் இந்த நாளில் வெளிப்படும். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள், இது உங்கள் அறிவை மேலும் வளர்க்க உதவும். ஆய்வு மற்றும் ஆராய்ச்சிப் பணிகளில் ஈடுபடுபவர்களுக்கு நல்ல முன்னேற்றம் காணப்படும். உங்கள் திட்டமிடல் திறனும், பகுப்பாய்வு திறனும் சிறப்பாகச் செயல்படும். ஆன்மீக நாட்டம் கொண்டவர்களுக்கு, தியானம் மற்றும் யோகா போன்ற பயிற்சிகளில் ஈடுபடுவது மன அமைதியையும், உள்ளுணர்வையும் மேம்படுத்தும். எதிர்காலத்திற்கான நிதித் திட்டமிடல்கள் மற்றும் முதலீடுகளை மேற்கொள்வதற்கு இது உகந்த நாள். திட்டமிட்ட காரியங்களை நிறைவேற்றுவதற்குத் தேவையான மன வலிமையும், கூர்மையான அறிவும் உங்களிடம் நிறைந்திருக்கும். பொதுவாக, இது ஒரு தன்னம்பிக்கை நிறைந்த, அறிவுசார்ந்த, நேர்த்தியான முன்னேற்றத்தை அள்ளித் தரும் தினமாக அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றிப் பாதையை நோக்கிச் செல்லும். புதிய வாய்ப்புகளைப் பயன்படுத்திக் கொண்டு முன்னேறுவீர்கள். உங்கள் நேர்மறையான அணுகுமுறை சூழ்நிலைகளை உங்களுக்குச் சாதகமாக மாற்றும். இன்று நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலும் வெற்றியை நோக்கிய ஒரு படியாகும். உங்கள் செயல்திறன் அதிகரிக்கும்.",
    "prediction_en": "On this auspicious Sunday, Virgo natives, the Sun's energy will enhance your analytical skills, self-confidence, and service-oriented nature. Today, you will show interest in completing any task neatly and as planned. Your precise planning ability will guide many. A proper solution for an important matter you have been contemplating for a long time will be found today. If you act by accepting your intuition's guidance, you will receive favorable results. Your father's advice and elders' guidance will give you great strength. By acting with self-confidence, you can easily accomplish any difficult task. This is a day when your communication skills will be at their peak. Leadership qualities will emerge.\n\nAmong relationships, your love and affection will further strengthen. A harmonious atmosphere will prevail among family members. Particularly, good relations with paternal relatives will prevail, and their support will give you mental strength. You will pay more attention to the education of children and their individual growth, providing them with necessary guidance. Meetings with friends will bring joy and new experiences. Participating in social events will help expand your circle and establish new connections. You will be seen as a responsible person in society. Your patience and honesty will receive good praise. You will achieve a certain satisfaction by helping others. Those involved in social service will receive praise and new responsibilities. Your discipline will be appreciated.\n\nYour intellectual talents will be revealed on this day. You will show interest in learning new things, which will help further develop your knowledge. Good progress will be seen for those involved in research and analytical work. Your planning and analytical skills will perform excellently. For those with spiritual inclination, engaging in practices like meditation and yoga will improve mental peace and intuition. This is an opportune day for undertaking future financial planning and investments. You will be filled with the mental strength and sharp intellect needed to accomplish planned tasks. Generally, this will be a day filled with confidence, intellect, bringing precise progress. All your endeavors will proceed towards success. You will progress by utilizing new opportunities. Your positive approach will turn situations in your favor. Every action you undertake today is a step towards success. Your efficiency will increase.",
    "career_ta": "பணியிடத்தில் உங்கள் பகுப்பாய்வுத் திறனும், நேர்த்தியும் பாராட்டப்படும். கடினமான திட்டங்களை நுட்பமாக அணுகி, சரியான தீர்வுகளை வழங்குவீர்கள். மேலதிகாரிகள் உங்கள் திறமைகளை அங்கீகரித்து, புதிய பொறுப்புகளை வழங்கலாம். குழுப்பணிகளில் உங்கள் பங்களிப்பு முக்கியமானதாக இருக்கும். புதிய தொழில் வாய்ப்புகள் அல்லது பதவி உயர்வுகளுக்கான அறிகுறிகள் தென்படலாம். உங்கள் தலைமைப் பண்புகள் மேலோங்கும்.",
    "career_en": "Your analytical skills and precision will be appreciated in the workplace. You will approach difficult projects with subtlety and provide accurate solutions. Superiors may recognize your abilities and assign new responsibilities. Your contribution will be important in team tasks. Signs of new career opportunities or promotions may appear. Your leadership qualities will prevail.",
    "finance_ta": "நிதி நிலைமையில் நல்ல முன்னேற்றம் காணப்படும். திட்டமிட்ட முதலீடுகள் மூலம் லாபம் ஈட்ட வாய்ப்புகள் உள்ளன. புதிய வருமான வழிகள் உருவாகலாம். சேமிப்பை அதிகரிப்பதற்கான சிறந்த நாள் இது. வீண் செலவுகளைத் தவிர்த்து, எதிர்காலத்திற்காக சேமிப்பதில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதிச் சூழ்நிலையை மேம்படுத்த முக்கிய முடிவுகளை எடுப்பீர்கள். தந்தையின் நிதி ஆலோசனைகள் உங்களுக்குப் பயனுள்ளதாக அமையும். உங்கள் நிதி திட்டமிடல் சிறப்பாக இருக்கும்.",
    "finance_en": "Good progress will be seen in financial matters. There are opportunities to earn profits through planned investments. New sources of income may emerge. This is an excellent day to increase savings. You will avoid unnecessary expenses and focus on saving for the future. You will make important decisions to improve the family's financial situation. Your father's financial advice will be beneficial to you. Your financial planning will be excellent.",
    "health_ta": "ஆரோக்கியத்தில் நல்ல மேம்பாடு காணப்படும். உடல் மற்றும் மனதில் ஒரு புதிய புத்துணர்ச்சி நிறைந்திருக்கும். சீரான உணவு முறையையும், உடற்பயிற்சிகளையும் பின்பற்றுவதன் மூலம் உடல் ஆரோக்கியத்தைப் பேணிக்காப்பீர்கள். மனதை அமைதியாக வைத்திருக்க தியானம் அல்லது யோகா செய்வது பயனுள்ளதாக இருக்கும். குடும்ப உறுப்பினர்களின் ஆரோக்கியத்திலும் நல்ல முன்னேற்றம் தெரியும். உங்கள் தன்னம்பிக்கை ஆரோக்கியத்தை மேலும் அதிகரிக்கும். புதிய ஆரோக்கிய பழக்கங்களை மேற்கொள்வீர்கள்.",
    "health_en": "Good improvement will be seen in health. A new freshness will fill your body and mind. You will maintain good physical health by following a balanced diet and regular exercises. Practicing meditation or yoga will be beneficial to keep your mind calm. Good progress will also be seen in the health of family members. Your self-confidence will further boost your health. You will adopt new healthy habits.",
    "lucky_number": "5",
    "lucky_color_ta": "சாம்பல்",
    "lucky_color_en": "Grey"
  },
  {
    "sign_ta": "துலாம்",
    "sign_en": "Libra",
    "date": "22-02-2026",
    "prediction_ta": "இந்த சுபயோக ஞாயிற்றுக்கிழமை, துலாம் ராசிக்காரர்களே, சூரியனின் ஆற்றல் உங்கள் வாழ்வில் சமநிலையையும், இணக்கத்தையும், புதிய உறவுகளையும், தன்னம்பிக்கையையும் மேம்படுத்தும் நாளாகும். இன்று நீங்கள் எந்த ஒரு சூழ்நிலையையும் சமாதானமாக அணுகி, நீதியான முடிவுகளை எடுப்பதில் சிறப்புத் திறமையுடன் விளங்குவீர்கள். உங்களின் இணக்கமான அணுகுமுறை பலருக்கும் வழிகாட்டும். நீண்டகாலமாக நீங்கள் யோசித்து வந்த ஒரு முக்கியமான உறவு சார்ந்த காரியத்திற்கு இன்று ஒரு சரியான தீர்வு கிடைக்கும். உங்கள் உள்ளுணர்வு வழிகாட்டுதலை ஏற்று செயல்பட்டால், அனுகூலமான பலன்களைப் பெறுவீர்கள். தந்தையின் ஆலோசனைகளும், பெரியோர்களின் வழிகாட்டுதலும் உங்களுக்கு மிகுந்த பலத்தை அளிக்கும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு கடினமான செயலையும் எளிதாக நிறைவேற்ற முடியும். உங்கள் சமூகத் திறன்கள் உச்சத்தில் இருக்கும் நாள் இது. தலைமைப் பண்புகள் வெளிப்படும்.\n\nஉறவுகளின் மத்தியில் உங்கள் அன்பும், அரவணைப்பும் மேலும் வலுப்பெறும். குடும்ப உறுப்பினர்களுடன் இணக்கமான சூழ்நிலை நிலவும். குறிப்பாக, தந்தைவழி உறவுகளுடன் நல்லுறவு மேலோங்கும், அவர்களின் ஆதரவு உங்களுக்கு மன பலத்தை அளிக்கும். குழந்தைகளின் கல்வி மற்றும் அவர்களது தனிப்பட்ட வளர்ச்சி குறித்து அதிக கவனம் செலுத்துவீர்கள், அவர்களுக்குத் தேவையான வழிகாட்டுதலை வழங்குவீர்கள். நண்பர்களுடனான சந்திப்புகள் மகிழ்ச்சியையும், புதிய சிந்தனைகளையும் பரிமாறிக் கொள்ளும் வாய்ப்பையும் உருவாக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் வட்டாரத்தை விரிவுபடுத்தி, புதிய தொடர்புகளை ஏற்படுத்த உதவும். சமூகத்தில் நீங்கள் ஒரு பொறுப்பான நபராகப் பார்க்கப்படுவீர்கள். உங்கள் சமாதான மனப்பான்மைக்கும், நேர்மைக்கும் நல்ல பாராட்டு கிடைக்கும். மற்றவர்களுக்கு உதவி செய்வதில் ஒருவித மனநிறைவை அடைவீர்கள். தொண்டு நிறுவனப் பணிகளில் ஈடுபடுபவர்களுக்கு பாராட்டுகளும், புதிய பொறுப்புகளும் தேடி வரும். உங்கள் நீதித்திறன் பாராட்டப்படும்.\n\nஉங்களின் கலைத்திறன்கள் இந்த நாளில் வெளிப்படும். இசை, ஓவியம், எழுத்து போன்ற துறைகளில் ஈடுபாடு கொண்டவர்களுக்கு புதிய உத்வேகம் கிடைக்கும். உங்கள் ரசனையும், அழகியல் உணர்வும் பலரையும் கவரும். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள், இது உங்கள் அறிவை மேலும் வளர்க்க உதவும். ஆன்மீக நாட்டம் கொண்டவர்களுக்கு, தியானம் மற்றும் யோகா போன்ற பயிற்சிகளில் ஈடுபடுவது மன அமைதியையும், உள்ளுணர்வையும் மேம்படுத்தும். எதிர்காலத்திற்கான நிதித் திட்டமிடல்கள் மற்றும் முதலீடுகளை மேற்கொள்வதற்கு இது உகந்த நாள். திட்டமிட்ட காரியங்களை நிறைவேற்றுவதற்குத் தேவையான மன வலிமையும், பொறுமையும் உங்களிடம் நிறைந்திருக்கும். பொதுவாக, இது ஒரு தன்னம்பிக்கை நிறைந்த, இணக்கமான, நேர்த்தியான முன்னேற்றத்தை அள்ளித் தரும் தினமாக அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றிப் பாதையை நோக்கிச் செல்லும். புதிய வாய்ப்புகளைப் பயன்படுத்திக் கொண்டு முன்னேறுவீர்கள். உங்கள் நேர்மறையான அணுகுமுறை சூழ்நிலைகளை உங்களுக்குச் சாதகமாக மாற்றும். இன்று நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலும் வெற்றியை நோக்கிய ஒரு படியாகும். சமூகத்தில் உங்கள் நிலை உயரும்.",
    "prediction_en": "On this auspicious Sunday, Libra natives, the Sun's energy will enhance balance, harmony, new relationships, and self-confidence in your life. Today, you will approach every situation peacefully and excel in making just decisions with special skill. Your harmonious approach will guide many. A proper solution for an important relationship-related matter you have been contemplating for a long time will be found today. If you act by accepting your intuition's guidance, you will receive favorable results. Your father's advice and elders' guidance will give you great strength. By acting with self-confidence, you can easily accomplish any difficult task. This is a day when your social skills will be at their peak. Leadership qualities will emerge.\n\nAmong relationships, your love and affection will further strengthen. A harmonious atmosphere will prevail among family members. Particularly, good relations with paternal relatives will prevail, and their support will give you mental strength. You will pay more attention to the education of children and their individual growth, providing them with necessary guidance. Meetings with friends will bring joy and new experiences. Participating in social events will help expand your circle and establish new connections. You will be seen as a responsible person in society. Your peaceful disposition and honesty will receive good praise. You will achieve a certain satisfaction by helping others. Those involved in social service will receive praise and new responsibilities. Your sense of justice will be appreciated.\n\nYour artistic talents will be revealed on this day. Those involved in fields like music, painting, and writing will find new inspiration. Your taste and aesthetic sense will attract many. You will show interest in learning new things, which will help further develop your knowledge. For those with spiritual inclination, engaging in practices like meditation and yoga will improve mental peace and intuition. This is an opportune day for undertaking future financial planning and investments. You will be filled with the mental strength and patience needed to accomplish planned tasks. Generally, this will be a day filled with confidence, harmony, bringing precise progress. All your endeavors will proceed towards success. You will progress by utilizing new opportunities. Your positive approach will turn situations in your favor. Every action you undertake today is a step towards success. Your status in society will rise.",
    "career_ta": "பணியிடத்தில் உங்கள் சமரசப் பேச்சும், இணக்கமான அணுகுமுறையும் பாராட்டப்படும். குழுவாகச் செயல்படும்போது உங்கள் கருத்துக்கள் முக்கியத்துவம் பெறும். மேலதிகாரிகள் உங்கள் திறமைகளை அங்கீகரித்து, புதிய பொறுப்புகளை வழங்கலாம். புதிய திட்டங்களை ஆரம்பிப்பதற்கு இது உகந்த நாள். உங்கள் உழைப்பிற்கு ஏற்ற அங்கீகாரமும், மரியாதையும் கிடைக்கும். தலைமைப் பண்புகள் வெளிப்படும். வியாபாரத்தில் புதிய ஒப்பந்தங்கள் உருவாகும்.",
    "career_en": "Your conciliatory speech and harmonious approach will be appreciated in the workplace. Your opinions will gain importance when working in a team. Superiors may recognize your abilities and assign new responsibilities. This is an opportune day to start new projects. You will receive due recognition and respect for your hard work. Leadership qualities will emerge. New contracts will arise in business.",
    "finance_ta": "நிதி நிலைமை சிறப்பாக இருக்கும். திட்டமிட்ட சேமிப்புகள் மூலம் நல்ல லாபம் ஈட்டலாம். புதிய முதலீடுகளை மேற்கொள்வதற்கு இது உகந்த நேரம். குடும்பத்தின் நிதிச் சூழ்நிலையை மேம்படுத்துவதற்கான புதிய வழிகளைக் கண்டுபிடிப்பீர்கள். தந்தையின் நிதி ஆலோசனைகள் உங்களுக்குப் பயனுள்ளதாக அமையும். நீண்டகால நிதித் திட்டங்களில் கவனம் செலுத்துவீர்கள். தேவையில்லாத செலவுகளைத் தவிர்த்து, சேமிப்பை அதிகரிப்பதில் கவனம் செலுத்துவீர்கள். கூட்டு முதலீடுகள் நன்மை தரும்.",
    "finance_en": "The financial situation will be excellent. You can earn good profits through planned savings. This is an opportune time to make new investments. You will discover new ways to improve the family's financial situation. Your father's financial advice will be beneficial to you. You will focus on long-term financial plans. You will avoid unnecessary expenses and focus on increasing savings. Joint investments will be beneficial.",
    "health_ta": "ஆரோக்கியத்தில் நல்ல மேம்பாடு காணப்படும். சீரான உணவு முறையையும், தினசரி உடற்பயிற்சிகளையும் பின்பற்றுவதன் மூலம் உடல் ஆரோக்கியத்தைப் பேணிக்காப்பீர்கள். மனதை அமைதியாக வைத்திருக்க தியானம் மற்றும் யோகா செய்வது பயனுள்ளதாக இருக்கும். குடும்ப உறுப்பினர்களின் ஆரோக்கியத்திலும் நல்ல மேம்பாடு தெரியும். புத்துணர்ச்சியுடன் இருப்பீர்கள். மன அமைதி ஆரோக்கியத்திற்கு முக்கியம்.",
    "health_en": "Good improvement will be seen in health. You will maintain good physical health by following a balanced diet and daily exercises. Practicing meditation and yoga will be beneficial to keep your mind calm. Good progress will also be seen in the health of family members. You will feel refreshed. Mental peace is important for health.",
    "lucky_number": "6",
    "lucky_color_ta": "வெள்ளி",
    "lucky_color_en": "Silver"
  },
  {
    "sign_ta": "விருச்சிகம்",
    "sign_en": "Scorpio",
    "date": "22-02-2026",
    "prediction_ta": "இந்த சுபயோக ஞாயிற்றுக்கிழமை, விருச்சிக ராசிக்காரர்களே, சூரியனின் ஆற்றல் உங்கள் வாழ்வில் உறுதியையும், தன்னம்பிக்கையையும், இலக்குகளை நோக்கிய அசைக்க முடியாத உந்துதலையும் மேம்படுத்தும் நாளாகும். இன்று நீங்கள் எந்த ஒரு சவாலையும் தைரியமாக எதிர்கொண்டு, தீர்க்கமான முடிவுகளை எடுப்பதில் சிறப்புத் திறமையுடன் விளங்குவீர்கள். உங்களின் ஆழ்ந்த சிந்தனையும், விடாமுயற்சியும் பலருக்கு வழிகாட்டும். நீண்டகாலமாக நீங்கள் யோசித்து வந்த ஒரு முக்கியமான காரியத்திற்கு இன்று ஒரு சரியான தீர்வு கிடைக்கும். உங்கள் உள்ளுணர்வு வழிகாட்டுதலை ஏற்று செயல்பட்டால், அனுகூலமான பலன்களைப் பெறுவீர்கள். தந்தையின் ஆலோசனைகளும், பெரியோர்களின் வழிகாட்டுதலும் உங்களுக்கு மிகுந்த பலத்தை அளிக்கும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு கடினமான செயலையும் எளிதாக நிறைவேற்ற முடியும். உங்கள் தலைமைப் பண்புகள் உச்சத்தில் இருக்கும் நாள் இது. மறைமுகமான விஷயங்களில் கவனம் செலுத்துவீர்கள்.\n\nஉறவுகளின் மத்தியில் உங்கள் அன்பும், அரவணைப்பும் மேலும் வலுப்பெறும். குடும்ப உறுப்பினர்களுடன் இணக்கமான சூழ்நிலை நிலவும். குறிப்பாக, தந்தைவழி உறவுகளுடன் நல்லுறவு மேலோங்கும், அவர்களின் ஆதரவு உங்களுக்கு மன பலத்தை அளிக்கும். குழந்தைகளின் கல்வி மற்றும் அவர்களது தனிப்பட்ட வளர்ச்சி குறித்து அதிக கவனம் செலுத்துவீர்கள், அவர்களுக்குத் தேவையான வழிகாட்டுதலை வழங்குவீர்கள். நண்பர்களுடனான சந்திப்புகள் மகிழ்ச்சியையும், புதிய சிந்தனைகளையும் பரிமாறிக் கொள்ளும் வாய்ப்பையும் உருவாக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் வட்டாரத்தை விரிவுபடுத்தி, புதிய தொடர்புகளை ஏற்படுத்த உதவும். சமூகத்தில் நீங்கள் ஒரு பொறுப்பான நபராகப் பார்க்கப்படுவீர்கள். உங்கள் நேர்மைக்கும், உறுதியான மனப்பான்மைக்கும் நல்ல பாராட்டு கிடைக்கும். மற்றவர்களுக்கு உதவி செய்வதில் ஒருவித மனநிறைவை அடைவீர்கள். தொண்டு நிறுவனப் பணிகளில் ஈடுபடுபவர்களுக்கு பாராட்டுகளும், புதிய பொறுப்புகளும் தேடி வரும். உங்கள் துணிச்சல் பாராட்டப்படும்.\n\nஉங்களின் ஆய்வுத் திறன்கள் இந்த நாளில் வெளிப்படும். மறைந்திருக்கும் உண்மைகளைக் கண்டறிய ஆர்வம் காட்டுவீர்கள். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள், இது உங்கள் அறிவை மேலும் வளர்க்க உதவும். ஆய்வு மற்றும் ஆராய்ச்சிப் பணிகளில் ஈடுபடுபவர்களுக்கு நல்ல முன்னேற்றம் காணப்படும். உங்கள் திட்டமிடல் திறனும், பகுப்பாய்வு திறனும் சிறப்பாகச் செயல்படும். ஆன்மீக நாட்டம் கொண்டவர்களுக்கு, தியானம் மற்றும் யோகா போன்ற பயிற்சிகளில் ஈடுபடுவது மன அமைதியையும், உள்ளுணர்வையும் மேம்படுத்தும். எதிர்காலத்திற்கான நிதித் திட்டமிடல்கள் மற்றும் முதலீடுகளை மேற்கொள்வதற்கு இது உகந்த நாள். திட்டமிட்ட காரியங்களை நிறைவேற்றுவதற்குத் தேவையான மன வலிமையும், கூர்மையான அறிவும் உங்களிடம் நிறைந்திருக்கும். பொதுவாக, இது ஒரு தன்னம்பிக்கை நிறைந்த, உறுதியான, நேர்த்தியான முன்னேற்றத்தை அள்ளித் தரும் தினமாக அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றிப் பாதையை நோக்கிச் செல்லும். புதிய வாய்ப்புகளைப் பயன்படுத்திக் கொண்டு முன்னேறுவீர்கள். உங்கள் நேர்மறையான அணுகுமுறை சூழ்நிலைகளை உங்களுக்குச் சாதகமாக மாற்றும். இன்று நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலும் வெற்றியை நோக்கிய ஒரு படியாகும். உங்கள் மன வலிமை அதிகரிக்கும்.",
    "prediction_en": "On this auspicious Sunday, Scorpio natives, the Sun's energy will enhance determination, self-confidence, and an unshakeable drive towards goals in your life. Today, you will bravely face any challenge and excel in making decisive decisions with special skill. Your deep thought and perseverance will guide many. A proper solution for an important matter you have been contemplating for a long time will be found today. If you act by accepting your intuition's guidance, you will receive favorable results. Your father's advice and elders' guidance will give you great strength. By acting with self-confidence, you can easily accomplish any difficult task. This is a day when your leadership qualities will be at their peak. You will focus on hidden matters.\n\nAmong relationships, your love and affection will further strengthen. A harmonious atmosphere will prevail among family members. Particularly, good relations with paternal relatives will prevail, and their support will give you mental strength. You will pay more attention to the education of children and their individual growth, providing them with necessary guidance. Meetings with friends will bring joy and new experiences. Participating in social events will help expand your circle and establish new connections. You will be seen as a responsible person in society. Your honesty and firm disposition will receive good praise. You will achieve a certain satisfaction by helping others. Those involved in social service will receive praise and new responsibilities. Your courage will be appreciated.\n\nYour investigative skills will be revealed on this day. You will show interest in uncovering hidden truths. You will show interest in learning new things, which will help further develop your knowledge. Good progress will be seen for those involved in research and analytical work. Your planning and analytical skills will perform excellently. For those with spiritual inclination, engaging in practices like meditation and yoga will improve mental peace and intuition. This is an opportune day for undertaking future financial planning and investments. You will be filled with the mental strength and sharp intellect needed to accomplish planned tasks. Generally, this will be a day filled with confidence, determination, bringing precise progress. All your endeavors will proceed towards success. You will progress by utilizing new opportunities. Your positive approach will turn situations in your favor. Every action you undertake today is a step towards success. Your mental strength will increase.",
    "career_ta": "பணியிடத்தில் உங்களின் உறுதியான அணுகுமுறையும், நுட்பமான சிந்தனையும் பாராட்டப்படும். கடினமான சவால்களை வெற்றிகரமாக எதிர்கொள்வீர்கள். மேலதிகாரிகள் உங்கள் திறமைகளை அங்கீகரித்து, புதிய பொறுப்புகளை வழங்கலாம். தலைமைப் பண்புகள் வெளிப்படும். குழுப்பணிகளில் உங்கள் பங்களிப்பு முக்கியமானதாக இருக்கும். புதிய தொழில் வாய்ப்புகள் அல்லது பதவி உயர்வுகளுக்கான அறிகுறிகள் தென்படலாம். உங்கள் தலைமைப் பண்புகள் மேலோங்கும்.",
    "career_en": "Your determined approach and subtle thinking will be appreciated in the workplace. You will successfully overcome difficult challenges. Superiors may recognize your abilities and assign new responsibilities. Leadership qualities will emerge. Your contribution will be important in team tasks. Signs of new career opportunities or promotions may appear. Your leadership qualities will prevail.",
    "finance_ta": "நிதி நிலைமையில் நல்ல முன்னேற்றம் காணப்படும். திட்டமிட்ட முதலீடுகள் மூலம் லாபம் ஈட்ட வாய்ப்புகள் உள்ளன. புதிய வருமான வழிகள் உருவாகலாம். சேமிப்பை அதிகரிப்பதற்கான சிறந்த நாள் இது. வீண் செலவுகளைத் தவிர்த்து, எதிர்காலத்திற்காக சேமிப்பதில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதிச் சூழ்நிலையை மேம்படுத்த முக்கிய முடிவுகளை எடுப்பீர்கள். தந்தையின் நிதி ஆலோசனைகள் உங்களுக்குப் பயனுள்ளதாக அமையும். மறைமுக முதலீடுகள் நன்மை தரும்.",
    "finance_en": "Good progress will be seen in financial matters. There are opportunities to earn profits through planned investments. New sources of income may emerge. This is an excellent day to increase savings. You will avoid unnecessary expenses and focus on saving for the future. You will make important decisions to improve the family's financial situation. Your father's financial advice will be beneficial to you. Hidden investments will be beneficial.",
    "health_ta": "ஆரோக்கியத்தில் நல்ல மேம்பாடு காணப்படும். உடல் மற்றும் மனதில் ஒரு புதிய புத்துணர்ச்சி நிறைந்திருக்கும். சீரான உணவு முறையையும், உடற்பயிற்சிகளையும் பின்பற்றுவதன் மூலம் உடல் ஆரோக்கியத்தைப் பேணிக்காப்பீர்கள். மனதை அமைதியாக வைத்திருக்க தியானம் அல்லது யோகா செய்வது பயனுள்ளதாக இருக்கும். குடும்ப உறுப்பினர்களின் ஆரோக்கியத்திலும் நல்ல முன்னேற்றம் தெரியும். உங்கள் தன்னம்பிக்கை ஆரோக்கியத்தை மேலும் அதிகரிக்கும். உள் உறுப்புகளின் ஆரோக்கியத்தில் கவனம் செலுத்தவும்.",
    "health_en": "Good improvement will be seen in health. A new freshness will fill your body and mind. You will maintain good physical health by following a balanced diet and regular exercises. Practicing meditation or yoga will be beneficial to keep your mind calm. Good progress will also be seen in the health of family members. Your self-confidence will further boost your health. Pay attention to the health of internal organs.",
    "lucky_number": "9",
    "lucky_color_ta": "செம்மஞ்சள்",
    "lucky_color_en": "Orange"
  },
  {
    "sign_ta": "தனுசு",
    "sign_en": "Sagittarius",
    "date": "22-02-2026",
    "prediction_ta": "இந்த சுபயோக ஞாயிற்றுக்கிழமை, தனுசு ராசிக்காரர்களே, சூரியனின் ஆற்றல் உங்கள் வாழ்வில் நம்பிக்கையையும், ஞானத்தையும், விரிவாக்கத்திற்கான வாய்ப்புகளையும், தன்னம்பிக்கையையும் மேம்படுத்தும் நாளாகும். இன்று நீங்கள் எந்த ஒரு செயலையும் நேர்மறையாக அணுகி, புதிய விஷயங்களைக் கற்றுக்கொள்வதிலும், அறிவைப் பெருக்கிக் கொள்வதிலும் ஆர்வம் காட்டுவீர்கள். உங்களின் அறிவுசார்ந்த அணுகுமுறை பலருக்கு வழிகாட்டும். நீண்டகாலமாக நீங்கள் யோசித்து வந்த ஒரு முக்கியமான திட்டத்திற்கு இன்று ஒரு சரியான தீர்வு கிடைக்கும். உங்கள் உள்ளுணர்வு வழிகாட்டுதலை ஏற்று செயல்பட்டால், அனுகூலமான பலன்களைப் பெறுவீர்கள். தந்தையின் ஆலோசனைகளும், பெரியோர்களின் வழிகாட்டுதலும் உங்களுக்கு மிகுந்த பலத்தை அளிக்கும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு கடினமான செயலையும் எளிதாக நிறைவேற்ற முடியும். உங்கள் தலைமைப் பண்புகள் உச்சத்தில் இருக்கும் நாள் இது. வெளிநாட்டு வாய்ப்புகள் குறித்து சிந்திப்பீர்கள்.\n\nஉறவுகளின் மத்தியில் உங்கள் அன்பும், அரவணைப்பும் மேலும் வலுப்பெறும். குடும்ப உறுப்பினர்களுடன் இணக்கமான சூழ்நிலை நிலவும். குறிப்பாக, தந்தைவழி உறவுகளுடன் நல்லுறவு மேலோங்கும், அவர்களின் ஆதரவு உங்களுக்கு மன பலத்தை அளிக்கும். குழந்தைகளின் கல்வி மற்றும் அவர்களது தனிப்பட்ட வளர்ச்சி குறித்து அதிக கவனம் செலுத்துவீர்கள், அவர்களுக்குத் தேவையான வழிகாட்டுதலை வழங்குவீர்கள். நண்பர்களுடனான சந்திப்புகள் மகிழ்ச்சியையும், புதிய சிந்தனைகளையும் பரிமாறிக் கொள்ளும் வாய்ப்பையும் உருவாக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் வட்டாரத்தை விரிவுபடுத்தி, புதிய தொடர்புகளை ஏற்படுத்த உதவும். சமூகத்தில் நீங்கள் ஒரு பொறுப்பான நபராகப் பார்க்கப்படுவீர்கள். உங்கள் அறிவுக்கும், நேர்மைக்கும் நல்ல பாராட்டு கிடைக்கும். மற்றவர்களுக்கு உதவி செய்வதில் ஒருவித மனநிறைவை அடைவீர்கள். தொண்டு நிறுவனப் பணிகளில் ஈடுபடுபவர்களுக்கு பாராட்டுகளும், புதிய பொறுப்புகளும் தேடி வரும். உங்கள் தத்துவஞானம் பாராட்டப்படும்.\n\nஉங்களின் ஆய்வுத் திறன்கள் இந்த நாளில் வெளிப்படும். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள், இது உங்கள் அறிவை மேலும் வளர்க்க உதவும். ஆய்வு மற்றும் ஆராய்ச்சிப் பணிகளில் ஈடுபடுபவர்களுக்கு நல்ல முன்னேற்றம் காணப்படும். உங்கள் திட்டமிடல் திறனும், பகுப்பாய்வு திறனும் சிறப்பாகச் செயல்படும். ஆன்மீக நாட்டம் கொண்டவர்களுக்கு, தியானம் மற்றும் யோகா போன்ற பயிற்சிகளில் ஈடுபடுவது மன அமைதியையும், உள்ளுணர்வையும் மேம்படுத்தும். எதிர்காலத்திற்கான நிதித் திட்டமிடல்கள் மற்றும் முதலீடுகளை மேற்கொள்வதற்கு இது உகந்த நாள். திட்டமிட்ட காரியங்களை நிறைவேற்றுவதற்குத் தேவையான மன வலிமையும், கூர்மையான அறிவும் உங்களிடம் நிறைந்திருக்கும். பொதுவாக, இது ஒரு தன்னம்பிக்கை நிறைந்த, அறிவுசார்ந்த, நேர்த்தியான முன்னேற்றத்தை அள்ளித் தரும் தினமாக அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றிப் பாதையை நோக்கிச் செல்லும். புதிய வாய்ப்புகளைப் பயன்படுத்திக் கொண்டு முன்னேறுவீர்கள். உங்கள் நேர்மறையான அணுகுமுறை சூழ்நிலைகளை உங்களுக்குச் சாதகமாக மாற்றும். இன்று நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலும் வெற்றியை நோக்கிய ஒரு படியாகும். உங்கள் வெளிப்படைத்தன்மை பாராட்டப்படும்.",
    "prediction_en": "On this auspicious Sunday, Sagittarius natives, the Sun's energy will enhance optimism, wisdom, opportunities for expansion, and self-confidence in your life. Today, you will approach every task positively and show interest in learning new things and expanding your knowledge. Your intellectual approach will guide many. A proper solution for an important project you have been contemplating for a long time will be found today. If you act by accepting your intuition's guidance, you will receive favorable results. Your father's advice and elders' guidance will give you great strength. By acting with self-confidence, you can easily accomplish any difficult task. This is a day when your leadership qualities will be at their peak. You will contemplate foreign opportunities.\n\nAmong relationships, your love and affection will further strengthen. A harmonious atmosphere will prevail among family members. Particularly, good relations with paternal relatives will prevail, and their support will give you mental strength. You will pay more attention to the education of children and their individual growth, providing them with necessary guidance. Meetings with friends will bring joy and new experiences. Participating in social events will help expand your circle and establish new connections. You will be seen as a responsible person in society. Your knowledge and honesty will receive good praise. You will achieve a certain satisfaction by helping others. Those involved in social service will receive praise and new responsibilities. Your philosophy will be appreciated.\n\nYour research skills will be revealed on this day. You will show interest in learning new things, which will help further develop your knowledge. Good progress will be seen for those involved in research and analytical work. Your planning and analytical skills will perform excellently. For those with spiritual inclination, engaging in practices like meditation and yoga will improve mental peace and intuition. This is an opportune day for undertaking future financial planning and investments. You will be filled with the mental strength and sharp intellect needed to accomplish planned tasks. Generally, this will be a day filled with confidence, intellect, bringing precise progress. All your endeavors will proceed towards success. You will progress by utilizing new opportunities. Your positive approach will turn situations in your favor. Every action you undertake today is a step towards success. Your transparency will be appreciated.",
    "career_ta": "பணியிடத்தில் உங்களின் நேர்மறையான அணுகுமுறையும், அறிவுசார்ந்த வழிகாட்டுதலும் பாராட்டப்படும். புதிய திட்டங்களுக்குத் தலைமை தாங்கி, வெற்றிகரமாக முடிப்பீர்கள். மேலதிகாரிகள் உங்கள் திறமைகளை அங்கீகரித்து, புதிய பொறுப்புகளை வழங்கலாம். வெளிநாட்டு வாய்ப்புகள் குறித்து நல்ல செய்திகள் வரலாம். பதவி உயர்வுக்கான வாய்ப்புகள் பிரகாசமாக உள்ளன. உங்கள் தலைமைப் பண்புகள் மேலோங்கும். புதிய ஆய்வுகளில் ஆர்வம் காட்டுவீர்கள்.",
    "career_en": "Your positive approach and intellectual guidance will be appreciated in the workplace. You will lead new projects and complete them successfully. Superiors may recognize your abilities and assign new responsibilities. Good news regarding foreign opportunities may come. Opportunities for promotion are bright. Your leadership qualities will prevail. You will show interest in new research.",
    "finance_ta": "நிதி நிலைமையில் நல்ல முன்னேற்றம் காணப்படும். புதிய முதலீடுகள் மூலம் லாபம் ஈட்ட வாய்ப்புகள் உள்ளன. வெளிநாட்டுத் தொடர்புடைய முதலீடுகள் நன்மை தரும். சேமிப்பை அதிகரிப்பதற்கான சிறந்த நாள் இது. வீண் செலவுகளைத் தவிர்த்து, எதிர்காலத்திற்காக சேமிப்பதில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதிச் சூழ்நிலையை மேம்படுத்த முக்கிய முடிவுகளை எடுப்பீர்கள். தந்தையின் நிதி ஆலோசனைகள் உங்களுக்குப் பெரிதும் உதவும். எதிர்பாராத தனலாபம் உண்டு.",
    "finance_en": "Good progress will be seen in financial matters. There are opportunities to earn profits through new investments. Foreign-related investments will be beneficial. This is an excellent day to increase savings. You will avoid unnecessary expenses and focus on saving for the future. You will make important decisions to improve the family's financial situation. Your father's financial advice will be very helpful to you. Unexpected financial gain is possible.",
    "health_ta": "ஆரோக்கியத்தில் நல்ல மேம்பாடு காணப்படும். உடல் மற்றும் மனதில் ஒரு புதிய புத்துணர்ச்சி நிறைந்திருக்கும். சீரான உணவு முறையையும், உடற்பயிற்சிகளையும் பின்பற்றுவதன் மூலம் உடல் ஆரோக்கியத்தைப் பேணிக்காப்பீர்கள். மனதை அமைதியாக வைத்திருக்க தியானம் அல்லது யோகா செய்வது பயனுள்ளதாக இருக்கும். குடும்ப உறுப்பினர்களின் ஆரோக்கியத்திலும் நல்ல முன்னேற்றம் தெரியும். உங்கள் தன்னம்பிக்கை ஆரோக்கியத்தை மேலும் அதிகரிக்கும். நீண்ட தூர பயணங்கள் உத்வேகம் தரும்.",
    "health_en": "Good improvement will be seen in health. A new freshness will fill your body and mind. You will maintain good physical health by following a balanced diet and regular exercises. Practicing meditation or yoga will be beneficial to keep your mind calm. Good progress will also be seen in the health of family members. Your self-confidence will further boost your health. Long-distance travels will provide inspiration.",
    "lucky_number": "3",
    "lucky_color_ta": "மஞ்சள்",
    "lucky_color_en": "Yellow"
  },
  {
    "sign_ta": "மகரம்",
    "sign_en": "Capricorn",
    "date": "22-02-2026",
    "prediction_ta": "இந்த சுபயோக ஞாயிற்றுக்கிழமை, மகர ராசிக்காரர்களே, சூரியனின் ஆற்றல் உங்கள் வாழ்வில் பொறுமையையும், விடாமுயற்சியையும், கட்டமைக்கும் திறனையும், தன்னம்பிக்கையையும் மேம்படுத்தும் நாளாகும். இன்று நீங்கள் எந்த ஒரு செயலையும் திட்டமிட்டு, உறுதியுடன் செயல்பட்டு முடிப்பதில் ஆர்வம் காட்டுவீர்கள். உங்களின் நடைமுறை அணுகுமுறை பலருக்கும் வழிகாட்டும். நீண்டகாலமாக நீங்கள் யோசித்து வந்த ஒரு முக்கியமான திட்டத்திற்கு இன்று ஒரு சரியான தீர்வு கிடைக்கும். உங்கள் உள்ளுணர்வு வழிகாட்டுதலை ஏற்று செயல்பட்டால், அனுகூலமான பலன்களைப் பெறுவீர்கள். தந்தையின் ஆலோசனைகளும், பெரியோர்களின் வழிகாட்டுதலும் உங்களுக்கு மிகுந்த பலத்தை அளிக்கும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு கடினமான செயலையும் எளிதாக நிறைவேற்ற முடியும். உங்கள் தலைமைப் பண்புகள் உச்சத்தில் இருக்கும் நாள் இது. சமூகத்தில் உங்கள் நிலை உயரும்.\n\nஉறவுகளின் மத்தியில் உங்கள் அன்பும், அரவணைப்பும் மேலும் வலுப்பெறும். குடும்ப உறுப்பினர்களுடன் இணக்கமான சூழ்நிலை நிலவும். குறிப்பாக, தந்தைவழி உறவுகளுடன் நல்லுறவு மேலோங்கும், அவர்களின் ஆதரவு உங்களுக்கு மன பலத்தை அளிக்கும். குழந்தைகளின் கல்வி மற்றும் அவர்களது தனிப்பட்ட வளர்ச்சி குறித்து அதிக கவனம் செலுத்துவீர்கள், அவர்களுக்குத் தேவையான வழிகாட்டுதலை வழங்குவீர்கள். நண்பர்களுடனான சந்திப்புகள் மகிழ்ச்சியையும், புதிய சிந்தனைகளையும் பரிமாறிக் கொள்ளும் வாய்ப்பையும் உருவாக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் வட்டாரத்தை விரிவுபடுத்தி, புதிய தொடர்புகளை ஏற்படுத்த உதவும். சமூகத்தில் நீங்கள் ஒரு பொறுப்பான நபராகப் பார்க்கப்படுவீர்கள். உங்கள் பொறுமைக்கும், நேர்மைக்கும் நல்ல பாராட்டு கிடைக்கும். மற்றவர்களுக்கு உதவி செய்வதில் ஒருவித மனநிறைவை அடைவீர்கள். தொண்டு நிறுவனப் பணிகளில் ஈடுபடுபவர்களுக்கு பாராட்டுகளும், புதிய பொறுப்புகளும் தேடி வரும். உங்கள் தலைமைத்துவம் பாராட்டப்படும்.\n\nஉங்களின் நிர்வாகத் திறன்கள் இந்த நாளில் வெளிப்படும். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள், இது உங்கள் அறிவை மேலும் வளர்க்க உதவும். தொழில் மற்றும் வர்த்தகம் சார்ந்த பணிகளில் ஈடுபடுபவர்களுக்கு நல்ல முன்னேற்றம் காணப்படும். உங்கள் திட்டமிடல் திறனும், பகுப்பாய்வு திறனும் சிறப்பாகச் செயல்படும். ஆன்மீக நாட்டம் கொண்டவர்களுக்கு, தியானம் மற்றும் யோகா போன்ற பயிற்சிகளில் ஈடுபடுவது மன அமைதியையும், உள்ளுணர்வையும் மேம்படுத்தும். எதிர்காலத்திற்கான நிதித் திட்டமிடல்கள் மற்றும் முதலீடுகளை மேற்கொள்வதற்கு இது உகந்த நாள். திட்டமிட்ட காரியங்களை நிறைவேற்றுவதற்குத் தேவையான மன வலிமையும், கூர்மையான அறிவும் உங்களிடம் நிறைந்திருக்கும். பொதுவாக, இது ஒரு தன்னம்பிக்கை நிறைந்த, நடைமுறை சார்ந்த, உறுதியான முன்னேற்றத்தை அள்ளித் தரும் தினமாக அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றிப் பாதையை நோக்கிச் செல்லும். புதிய வாய்ப்புகளைப் பயன்படுத்திக் கொண்டு முன்னேறுவீர்கள். உங்கள் நேர்மறையான அணுகுமுறை சூழ்நிலைகளை உங்களுக்குச் சாதகமாக மாற்றும். இன்று நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலும் வெற்றியை நோக்கிய ஒரு படியாகும். உங்கள் முயற்சிக்கு நல்ல பலன் கிடைக்கும்.",
    "prediction_en": "On this auspicious Sunday, Capricorn natives, the Sun's energy will enhance patience, perseverance, structural ability, and self-confidence in your life. Today, you will show interest in planning and firmly completing any task. Your practical approach will guide many. A proper solution for an important project you have been contemplating for a long time will be found today. If you act by accepting your intuition's guidance, you will receive favorable results. Your father's advice and elders' guidance will give you great strength. By acting with self-confidence, you can easily accomplish any difficult task. This is a day when your leadership qualities will be at their peak. Your status in society will rise.\n\nAmong relationships, your love and affection will further strengthen. A harmonious atmosphere will prevail among family members. Particularly, good relations with paternal relatives will prevail, and their support will give you mental strength. You will pay more attention to the education of children and their individual growth, providing them with necessary guidance. Meetings with friends will bring joy and new experiences. Participating in social events will help expand your circle and establish new connections. You will be seen as a responsible person in society. Your patience and honesty will receive good praise. You will achieve a certain satisfaction by helping others. Those involved in social service will receive praise and new responsibilities. Your leadership will be appreciated.\n\nYour administrative skills will be revealed on this day. You will show interest in learning new things, which will help further develop your knowledge. Good progress will be seen for those involved in business and trade-related tasks. Your planning and analytical skills will perform excellently. For those with spiritual inclination, engaging in practices like meditation and yoga will improve mental peace and intuition. This is an opportune day for undertaking future financial planning and investments. You will be filled with the mental strength and sharp intellect needed to accomplish planned tasks. Generally, this will be a day filled with confidence, practicality, bringing steady progress. All your endeavors will proceed towards success. You will progress by utilizing new opportunities. Your positive approach will turn situations in your favor. Every action you undertake today is a step towards success. Your effort will yield good results.",
    "career_ta": "பணியிடத்தில் உங்களின் ஒழுக்கமும், கடின உழைப்பும் பாராட்டப்படும். புதிய திட்டங்களுக்குத் தலைமை தாங்கி, வெற்றிகரமாக முடிப்பீர்கள். மேலதிகாரிகள் உங்கள் திறமைகளை அங்கீகரித்து, புதிய பொறுப்புகளை வழங்கலாம். குழுப்பணிகளில் உங்கள் பங்களிப்பு முக்கியமானதாக இருக்கும். புதிய தொழில் வாய்ப்புகள் அல்லது பதவி உயர்வுகளுக்கான அறிகுறிகள் தென்படலாம். உங்கள் தலைமைப் பண்புகள் மேலோங்கும். உங்களின் நடைமுறை சார்ந்த அணுகுமுறை வெற்றியைத் தரும்.",
    "career_en": "Your discipline and hard work will be appreciated in the workplace. You will lead new projects and complete them successfully. Superiors may recognize your abilities and assign new responsibilities. Your contribution will be important in team tasks. Signs of new career opportunities or promotions may appear. Your leadership qualities will prevail. Your practical approach will bring success.",
    "finance_ta": "நிதி நிலைமையில் நல்ல முன்னேற்றம் காணப்படும். திட்டமிட்ட முதலீடுகள் மூலம் லாபம் ஈட்ட வாய்ப்புகள் உள்ளன. புதிய வருமான வழிகள் உருவாகலாம். சேமிப்பை அதிகரிப்பதற்கான சிறந்த நாள் இது. வீண் செலவுகளைத் தவிர்த்து, எதிர்காலத்திற்காக சேமிப்பதில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதிச் சூழ்நிலையை மேம்படுத்த முக்கிய முடிவுகளை எடுப்பீர்கள். தந்தையின் நிதி ஆலோசனைகள் உங்களுக்குப் பயனுள்ளதாக அமையும். நிலம், வீடு சார்ந்த முதலீடுகள் நன்மை தரும்.",
    "finance_en": "Good progress will be seen in financial matters. There are opportunities to earn profits through planned investments. New sources of income may emerge. This is an excellent day to increase savings. You will avoid unnecessary expenses and focus on saving for the future. You will make important decisions to improve the family's financial situation. Your father's financial advice will be beneficial to you. Land and house-related investments will be beneficial.",
    "health_ta": "ஆரோக்கியத்தில் நல்ல மேம்பாடு காணப்படும். உடல் மற்றும் மனதில் ஒரு புதிய புத்துணர்ச்சி நிறைந்திருக்கும். சீரான உணவு முறையையும், உடற்பயிற்சிகளையும் பின்பற்றுவதன் மூலம் உடல் ஆரோக்கியத்தைப் பேணிக்காப்பீர்கள். மனதை அமைதியாக வைத்திருக்க தியானம் அல்லது யோகா செய்வது பயனுள்ளதாக இருக்கும். குடும்ப உறுப்பினர்களின் ஆரோக்கியத்திலும் நல்ல முன்னேற்றம் தெரியும். உங்கள் தன்னம்பிக்கை ஆரோக்கியத்தை மேலும் அதிகரிக்கும். சீரான வாழ்க்கை முறை பயன் தரும்.",
    "health_en": "Good improvement will be seen in health. A new freshness will fill your body and mind. You will maintain good physical health by following a balanced diet and regular exercises. Practicing meditation or yoga will be beneficial to keep your mind calm. Good progress will also be seen in the health of family members. Your self-confidence will further boost your health. A balanced lifestyle will be beneficial.",
    "lucky_number": "8",
    "lucky_color_ta": "நீலம்",
    "lucky_color_en": "Blue"
  },
  {
    "sign_ta": "கும்பம்",
    "sign_en": "Aquarius",
    "date": "22-02-2026",
    "prediction_ta": "இந்த சுபயோக ஞாயிற்றுக்கிழமை, கும்ப ராசிக்காரர்களே, சூரியனின் ஆற்றல் உங்கள் வாழ்வில் புதுமையையும், சுதந்திரமான சிந்தனையையும், சமூக அக்கறையையும், தன்னம்பிக்கையையும் மேம்படுத்தும் நாளாகும். இன்று நீங்கள் எந்த ஒரு செயலையும் புதுமையான அணுகுமுறையுடன் அணுகி, தனித்துவமான தீர்வுகளை வழங்குவதில் ஆர்வம் காட்டுவீர்கள். உங்களின் தொலைநோக்குச் சிந்தனை பலருக்கும் வழிகாட்டும். நீண்டகாலமாக நீங்கள் யோசித்து வந்த ஒரு முக்கியமான சமூகக் காரியத்திற்கு இன்று ஒரு சரியான தீர்வு கிடைக்கும். உங்கள் உள்ளுணர்வு வழிகாட்டுதலை ஏற்று செயல்பட்டால், அனுகூலமான பலன்களைப் பெறுவீர்கள். தந்தையின் ஆலோசனைகளும், பெரியோர்களின் வழிகாட்டுதலும் உங்களுக்கு மிகுந்த பலத்தை அளிக்கும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு கடினமான செயலையும் எளிதாக நிறைவேற்ற முடியும். உங்கள் தலைமைப் பண்புகள் உச்சத்தில் இருக்கும் நாள் இது. புதிய கண்டுபிடிப்புகளில் ஆர்வம் காட்டுவீர்கள்.\n\nஉறவுகளின் மத்தியில் உங்கள் அன்பும், அரவணைப்பும் மேலும் வலுப்பெறும். குடும்ப உறுப்பினர்களுடன் இணக்கமான சூழ்நிலை நிலவும். குறிப்பாக, தந்தைவழி உறவுகளுடன் நல்லுறவு மேலோங்கும், அவர்களின் ஆதரவு உங்களுக்கு மன பலத்தை அளிக்கும். குழந்தைகளின் கல்வி மற்றும் அவர்களது தனிப்பட்ட வளர்ச்சி குறித்து அதிக கவனம் செலுத்துவீர்கள், அவர்களுக்குத் தேவையான வழிகாட்டுதலை வழங்குவீர்கள். நண்பர்களுடனான சந்திப்புகள் மகிழ்ச்சியையும், புதிய சிந்தனைகளையும் பரிமாறிக் கொள்ளும் வாய்ப்பையும் உருவாக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் வட்டாரத்தை விரிவுபடுத்தி, புதிய தொடர்புகளை ஏற்படுத்த உதவும். சமூகத்தில் நீங்கள் ஒரு பொறுப்பான நபராகப் பார்க்கப்படுவீர்கள். உங்கள் புதுமையான சிந்தனைக்கும், நேர்மைக்கும் நல்ல பாராட்டு கிடைக்கும். மற்றவர்களுக்கு உதவி செய்வதில் ஒருவித மனநிறைவை அடைவீர்கள். தொண்டு நிறுவனப் பணிகளில் ஈடுபடுபவர்களுக்கு பாராட்டுகளும், புதிய பொறுப்புகளும் தேடி வரும். உங்கள் தலைமைத்துவம் சமூக மாற்றத்திற்கு உதவும்.\n\nஉங்களின் ஆராய்ச்சித் திறன்கள் இந்த நாளில் வெளிப்படும். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள், இது உங்கள் அறிவை மேலும் வளர்க்க உதவும். அறிவியல் மற்றும் தொழில்நுட்பத் துறைகளில் ஈடுபடுபவர்களுக்கு நல்ல முன்னேற்றம் காணப்படும். உங்கள் திட்டமிடல் திறனும், பகுப்பாய்வு திறனும் சிறப்பாகச் செயல்படும். ஆன்மீக நாட்டம் கொண்டவர்களுக்கு, தியானம் மற்றும் யோகா போன்ற பயிற்சிகளில் ஈடுபடுவது மன அமைதியையும், உள்ளுணர்வையும் மேம்படுத்தும். எதிர்காலத்திற்கான நிதித் திட்டமிடல்கள் மற்றும் முதலீடுகளை மேற்கொள்வதற்கு இது உகந்த நாள். திட்டமிட்ட காரியங்களை நிறைவேற்றுவதற்குத் தேவையான மன வலிமையும், கூர்மையான அறிவும் உங்களிடம் நிறைந்திருக்கும். பொதுவாக, இது ஒரு தன்னம்பிக்கை நிறைந்த, அறிவுசார்ந்த, புதுமையான முன்னேற்றத்தை அள்ளித் தரும் தினமாக அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றிப் பாதையை நோக்கிச் செல்லும். புதிய வாய்ப்புகளைப் பயன்படுத்திக் கொண்டு முன்னேறுவீர்கள். உங்கள் நேர்மறையான அணுகுமுறை சூழ்நிலைகளை உங்களுக்குச் சாதகமாக மாற்றும். இன்று நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலும் வெற்றியை நோக்கிய ஒரு படியாகும். உங்கள் சமூகப் பங்களிப்பு அதிகரிக்கும்.",
    "prediction_en": "On this auspicious Sunday, Aquarius natives, the Sun's energy will enhance innovation, independent thinking, social concern, and self-confidence in your life. Today, you will approach any task with an innovative approach and show interest in providing unique solutions. Your foresight will guide many. A proper solution for an important social matter you have been contemplating for a long time will be found today. If you act by accepting your intuition's guidance, you will receive favorable results. Your father's advice and elders' guidance will give you great strength. By acting with self-confidence, you can easily accomplish any difficult task. This is a day when your leadership qualities will be at their peak. You will show interest in new discoveries.\n\nAmong relationships, your love and affection will further strengthen. A harmonious atmosphere will prevail among family members. Particularly, good relations with paternal relatives will prevail, and their support will give you mental strength. You will pay more attention to the education of children and their individual growth, providing them with necessary guidance. Meetings with friends will bring joy and new experiences. Participating in social events will help expand your circle and establish new connections. You will be seen as a responsible person in society. Your innovative thinking and honesty will receive good praise. You will achieve a certain satisfaction by helping others. Those involved in social service will receive praise and new responsibilities. Your leadership will help bring about social change.\n\nYour research skills will be revealed on this day. You will show interest in learning new things, which will help further develop your knowledge. Good progress will be seen for those involved in science and technology fields. Your planning and analytical skills will perform excellently. For those with spiritual inclination, engaging in practices like meditation and yoga will improve mental peace and intuition. This is an opportune day for undertaking future financial planning and investments. You will be filled with the mental strength and sharp intellect needed to accomplish planned tasks. Generally, this will be a day filled with confidence, intellect, bringing innovative progress. All your endeavors will proceed towards success. You will progress by utilizing new opportunities. Your positive approach will turn situations in your favor. Every action you undertake today is a step towards success. Your social contribution will increase.",
    "career_ta": "பணியிடத்தில் உங்களின் புதுமையான யோசனைகளும், சமூக அக்கறையும் பாராட்டப்படும். புதிய திட்டங்களுக்குத் தலைமை தாங்கி, வெற்றிகரமாக முடிப்பீர்கள். மேலதிகாரிகள் உங்கள் திறமைகளை அங்கீகரித்து, புதிய பொறுப்புகளை வழங்கலாம். குழுப்பணிகளில் உங்கள் பங்களிப்பு முக்கியமானதாக இருக்கும். புதிய தொழில் வாய்ப்புகள் அல்லது பதவி உயர்வுகளுக்கான அறிகுறிகள் தென்படலாம். உங்கள் தலைமைப் பண்புகள் மேலோங்கும். அறிவியல் மற்றும் தொழில்நுட்பத் துறைகளில் முன்னேற்றம் காணலாம்.",
    "career_en": "Your innovative ideas and social concern will be appreciated in the workplace. You will lead new projects and complete them successfully. Superiors may recognize your abilities and assign new responsibilities. Your contribution will be important in team tasks. Signs of new career opportunities or promotions may appear. Your leadership qualities will prevail. You may see progress in science and technology fields.",
    "finance_ta": "நிதி நிலைமையில் நல்ல முன்னேற்றம் காணப்படும். புதிய முதலீடுகள் மூலம் லாபம் ஈட்ட வாய்ப்புகள் உள்ளன. புதிய வருமான வழிகள் உருவாகலாம். சேமிப்பை அதிகரிப்பதற்கான சிறந்த நாள் இது. வீண் செலவுகளைத் தவிர்த்து, எதிர்காலத்திற்காக சேமிப்பதில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதிச் சூழ்நிலையை மேம்படுத்த முக்கிய முடிவுகளை எடுப்பீர்கள். தந்தையின் நிதி ஆலோசனைகள் உங்களுக்குப் பயனுள்ளதாக அமையும். சமூக நலன் சார்ந்த முதலீடுகள் நன்மை தரும்.",
    "finance_en": "Good progress will be seen in financial matters. There are opportunities to earn profits through planned investments. New sources of income may emerge. This is an excellent day to increase savings. You will avoid unnecessary expenses and focus on saving for the future. You will make important decisions to improve the family's financial situation. Your father's financial advice will be beneficial to you. Social welfare-related investments will be beneficial.",
    "health_ta": "ஆரோக்கியத்தில் நல்ல மேம்பாடு காணப்படும். உடல் மற்றும் மனதில் ஒரு புதிய புத்துணர்ச்சி நிறைந்திருக்கும். சீரான உணவு முறையையும், உடற்பயிற்சிகளையும் பின்பற்றுவதன் மூலம் உடல் ஆரோக்கியத்தைப் பேணிக்காப்பீர்கள். மனதை அமைதியாக வைத்திருக்க தியானம் அல்லது யோகா செய்வது பயனுள்ளதாக இருக்கும். குடும்ப உறுப்பினர்களின் ஆரோக்கியத்திலும் நல்ல முன்னேற்றம் தெரியும். உங்கள் தன்னம்பிக்கை ஆரோக்கியத்தை மேலும் அதிகரிக்கும். புதிய உடற்பயிற்சிகளை மேற்கொள்வீர்கள்.",
    "health_en": "Good improvement will be seen in health. A new freshness will fill your body and mind. You will maintain good physical health by following a balanced diet and regular exercises. Practicing meditation or yoga will be beneficial to keep your mind calm. Good progress will also be seen in the health of family members. Your self-confidence will further boost your health. You will adopt new exercises.",
    "lucky_number": "4",
    "lucky_color_ta": "ஊதா",
    "lucky_color_en": "Purple"
  },
  {
    "sign_ta": "மீனம்",
    "sign_en": "Pisces",
    "date": "22-02-2026",
    "prediction_ta": "இந்த சுபயோக ஞாயிற்றுக்கிழமை, மீன ராசிக்காரர்களே, சூரியனின் ஆற்றல் உங்கள் வாழ்வில் ஆன்மீக வளர்ச்சியையும், உள்ளுணர்வையும், கருணையையும், தன்னம்பிக்கையையும் மேம்படுத்தும் நாளாகும். இன்று நீங்கள் எந்த ஒரு செயலையும் நிதானமாக அணுகி, உள்ளுணர்வு வழிகாட்டுதலை ஏற்று செயல்படுவீர்கள். உங்களின் இரக்க குணமும், கலைத்திறனும் பலருக்கும் வழிகாட்டும். நீண்டகாலமாக நீங்கள் யோசித்து வந்த ஒரு முக்கியமான ஆன்மீகக் காரியத்திற்கு இன்று ஒரு சரியான தீர்வு கிடைக்கும். உங்கள் உள்ளுணர்வு வழிகாட்டுதலை ஏற்று செயல்பட்டால், அனுகூலமான பலன்களைப் பெறுவீர்கள். தந்தையின் ஆலோசனைகளும், பெரியோர்களின் வழிகாட்டுதலும் உங்களுக்கு மிகுந்த பலத்தை அளிக்கும். தன்னம்பிக்கையுடன் செயல்பட்டால், எந்த ஒரு கடினமான செயலையும் எளிதாக நிறைவேற்ற முடியும். உங்கள் தலைமைப் பண்புகள் உச்சத்தில் இருக்கும் நாள் இது. கலை மற்றும் ஆன்மீகத் துறைகளில் ஆர்வம் காட்டுவீர்கள்.\n\nஉறவுகளின் மத்தியில் உங்கள் அன்பும், அரவணைப்பும் மேலும் வலுப்பெறும். குடும்ப உறுப்பினர்களுடன் இணக்கமான சூழ்நிலை நிலவும். குறிப்பாக, தந்தைவழி உறவுகளுடன் நல்லுறவு மேலோங்கும், அவர்களின் ஆதரவு உங்களுக்கு மன பலத்தை அளிக்கும். குழந்தைகளின் கல்வி மற்றும் அவர்களது தனிப்பட்ட வளர்ச்சி குறித்து அதிக கவனம் செலுத்துவீர்கள், அவர்களுக்குத் தேவையான வழிகாட்டுதலை வழங்குவீர்கள். நண்பர்களுடனான சந்திப்புகள் மகிழ்ச்சியையும், புதிய சிந்தனைகளையும் பரிமாறிக் கொள்ளும் வாய்ப்பையும் உருவாக்கும். சமூக நிகழ்வுகளில் பங்கேற்பது உங்கள் வட்டாரத்தை விரிவுபடுத்தி, புதிய தொடர்புகளை ஏற்படுத்த உதவும். சமூகத்தில் நீங்கள் ஒரு பொறுப்பான நபராகப் பார்க்கப்படுவீர்கள். உங்கள் கருணைக்கும், உள்ளுணர்வுக்கும் நல்ல பாராட்டு கிடைக்கும். மற்றவர்களுக்கு உதவி செய்வதில் ஒருவித மனநிறைவை அடைவீர்கள். தொண்டு நிறுவனப் பணிகளில் ஈடுபடுபவர்களுக்கு பாராட்டுகளும், புதிய பொறுப்புகளும் தேடி வரும். உங்கள் தலைமைத்துவம் மன அமைதிக்கு வழிவகுக்கும்.\n\nஉங்களின் படைப்புத் திறன்கள் இந்த நாளில் வெளிப்படும். இசை, ஓவியம், எழுத்து போன்ற துறைகளில் ஈடுபாடு கொண்டவர்களுக்கு புதிய உத்வேகம் கிடைக்கும். உங்கள் ரசனையும், அழகியல் உணர்வும் பலரையும் கவரும். புதிய விஷயங்களைக் கற்றுக்கொள்வதில் ஆர்வம் காட்டுவீர்கள், இது உங்கள் அறிவை மேலும் வளர்க்க உதவும். ஆன்மீக நாட்டம் கொண்டவர்களுக்கு, தியானம் மற்றும் யோகா போன்ற பயிற்சிகளில் ஈடுபடுவது மன அமைதியையும், உள்ளுணர்வையும் மேம்படுத்தும். எதிர்காலத்திற்கான நிதித் திட்டமிடல்கள் மற்றும் முதலீடுகளை மேற்கொள்வதற்கு இது உகந்த நாள். திட்டமிட்ட காரியங்களை நிறைவேற்றுவதற்குத் தேவையான மன வலிமையும், பொறுமையும் உங்களிடம் நிறைந்திருக்கும். பொதுவாக, இது ஒரு தன்னம்பிக்கை நிறைந்த, உள்ளுணர்வு சார்ந்த, படைப்புத்திறன் மிக்க முன்னேற்றத்தை அள்ளித் தரும் தினமாக அமையும். உங்கள் முயற்சிகள் அனைத்தும் வெற்றிப் பாதையை நோக்கிச் செல்லும். புதிய வாய்ப்புகளைப் பயன்படுத்திக் கொண்டு முன்னேறுவீர்கள். உங்கள் நேர்மறையான அணுகுமுறை சூழ்நிலைகளை உங்களுக்குச் சாதகமாக மாற்றும். இன்று நீங்கள் மேற்கொள்ளும் ஒவ்வொரு செயலும் வெற்றியை நோக்கிய ஒரு படியாகும். உங்கள் மன அமைதி அதிகரிக்கும்.",
    "prediction_en": "On this auspicious Sunday, Pisces natives, the Sun's energy will enhance spiritual growth, intuition, compassion, and self-confidence in your life. Today, you will approach any task calmly and act by accepting your intuition's guidance. Your compassionate nature and artistic talents will guide many. A proper solution for an important spiritual matter you have been contemplating for a long time will be found today. If you act by accepting your intuition's guidance, you will receive favorable results. Your father's advice and elders' guidance will give you great strength. By acting with self-confidence, you can easily accomplish any difficult task. This is a day when your leadership qualities will be at their peak. You will show interest in arts and spiritual fields.\n\nAmong relationships, your love and affection will further strengthen. A harmonious atmosphere will prevail among family members. Particularly, good relations with paternal relatives will prevail, and their support will give you mental strength. You will pay more attention to the education of children and their individual growth, providing them with necessary guidance. Meetings with friends will bring joy and new experiences. Participating in social events will help expand your circle and establish new connections. You will be seen as a responsible person in society. Your compassion and intuition will receive good praise. You will achieve a certain satisfaction by helping others. Those involved in social service will receive praise and new responsibilities. Your leadership will lead to mental peace.\n\nYour creative talents will be revealed on this day. Those involved in fields like music, painting, and writing will find new inspiration. Your taste and aesthetic sense will attract many. You will show interest in learning new things, which will help further develop your knowledge. For those with spiritual inclination, engaging in practices like meditation and yoga will improve mental peace and intuition. This is an opportune day for undertaking future financial planning and investments. You will be filled with the mental strength and patience needed to accomplish planned tasks. Generally, this will be a day filled with confidence, intuition, bringing creative progress. All your endeavors will proceed towards success. You will progress by utilizing new opportunities. Your positive approach will turn situations in your favor. Every action you undertake today is a step towards success. Your mental peace will increase.",
    "career_ta": "பணியிடத்தில் உங்களின் படைப்புத் திறனும், உள்ளுணர்வும் பாராட்டப்படும். புதிய திட்டங்களுக்குத் தலைமை தாங்கி, வெற்றிகரமாக முடிப்பீர்கள். மேலதிகாரிகள் உங்கள் திறமைகளை அங்கீகரித்து, புதிய பொறுப்புகளை வழங்கலாம். குழுப்பணிகளில் உங்கள் பங்களிப்பு முக்கியமானதாக இருக்கும். புதிய தொழில் வாய்ப்புகள் அல்லது பதவி உயர்வுகளுக்கான அறிகுறிகள் தென்படலாம். உங்கள் தலைமைப் பண்புகள் மேலோங்கும். கலை சார்ந்த துறைகளில் முன்னேற்றம் காணலாம்.",
    "career_en": "Your creativity and intuition will be appreciated in the workplace. You will lead new projects and complete them successfully. Superiors may recognize your abilities and assign new responsibilities. Your contribution will be important in team tasks. Signs of new career opportunities or promotions may appear. Your leadership qualities will prevail. You may see progress in artistic fields.",
    "finance_ta": "நிதி நிலைமையில் நல்ல முன்னேற்றம் காணப்படும். புதிய முதலீடுகள் மூலம் லாபம் ஈட்ட வாய்ப்புகள் உள்ளன. புதிய வருமான வழிகள் உருவாகலாம். சேமிப்பை அதிகரிப்பதற்கான சிறந்த நாள் இது. வீண் செலவுகளைத் தவிர்த்து, எதிர்காலத்திற்காக சேமிப்பதில் கவனம் செலுத்துவீர்கள். குடும்பத்தின் நிதிச் சூழ்நிலையை மேம்படுத்த முக்கிய முடிவுகளை எடுப்பீர்கள். தந்தையின் நிதி ஆலோசனைகள் உங்களுக்குப் பயனுள்ளதாக அமையும். ஆன்மீக நிறுவனங்களுக்கு செய்யும் உதவிகள் நன்மை தரும்.",
    "finance_en": "Good progress will be seen in financial matters. There are opportunities to earn profits through planned investments. New sources of income may emerge. This is an excellent day to increase savings. You will avoid unnecessary expenses and focus on saving for the future. You will make important decisions to improve the family's financial situation. Your father's financial advice will be beneficial to you. Contributions to spiritual organizations will be beneficial.",
    "health_ta": "ஆரோக்கியத்தில் நல்ல மேம்பாடு காணப்படும். உடல் மற்றும் மனதில் ஒரு புதிய புத்துணர்ச்சி நிறைந்திருக்கும். சீரான உணவு முறையையும், உடற்பயிற்சிகளையும் பின்பற்றுவதன் மூலம் உடல் ஆரோக்கியத்தைப் பேணிக்காப்பீர்கள். மனதை அமைதியாக வைத்திருக்க தியானம் அல்லது யோகா செய்வது பயனுள்ளதாக இருக்கும். குடும்ப உறுப்பினர்களின் ஆரோக்கியத்திலும் நல்ல முன்னேற்றம் தெரியும். உங்கள் தன்னம்பிக்கை ஆரோக்கியத்தை மேலும் அதிகரிக்கும். ஆழ்ந்த உறக்கம் நன்மை தரும்.",
    "health_en": "Good improvement will be seen in health. A new freshness will fill your body and mind. You will maintain good physical health by following a balanced diet and regular exercises. Practicing meditation or yoga will be beneficial to keep your mind calm. Good progress will also be seen in the health of family members. Your self-confidence will further boost your health. Deep sleep will be beneficial.",
    "lucky_number": "7",
    "lucky_color_ta": "கடல்நீல நிறம்",
    "lucky_color_en": "Sea Blue"
  }
]
